{"cast": {"0565858": "Eddie McClintock", "1162399": "Joanne Kelly", "0007210": "Saul Rubinek", "1270095": "Allison Scagliotti", "1482647": "Genelle Williams", "0001309": "Anthony Michael Hall", "0000550": "Kate Mulgrew", "0003779": "Alessandra Torresani", "1501388": "Sasha Roiz", "0001634": "CCH Pounder", "0028650": "Emily Andrews", "3614680": "Harrison Smith", "1538339": "Troy Blundell", "1795259": "Ashton Doudelet", "4139964": "Spencer Paul", "0998943": "Darren Josephs", "0301693": "Chandra Galasso", "3219331": "Meghan Greeley", "4682465": "Llyandra Ariel Evans-Jones", "1223345": "Lok Archer", "1764315": "Alison Smiley", "3850000": "Paul Beer", "1687498": "Scott Edgecombe", "3231817": "R Austin Ball", "3080304": "Mark Ramsay", "4666051": "Brendan Shoreman", "2410544": "Cameron Bryson", "4664910": "Michelle Spira", "1350696": "Karen Ivany", "2574411": "Graham Hines", "4665854": "Slavash Khavarnfiad"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["As Pete and Jane travel down Memory Lane, Myka and Claudia find a young woman at the center of several flash disappearances, all beyond sight of any artifact.", "With a flash and a zap, numerous people begin to disappear, leaving only charcoal smudges behind. Warehouse agents discover these disappearances linked to people upsetting Megan Reese. High school classmate and former co-worker, Jeff, has been stalking Megan, and whenever she is confronted by someone, he gets rid of that person. How? Binoculars. By traveling through her memory, Pete and Jane uncover the reasons for the Regent murders: a young boy, Walter Sykes, stripped of the Collodi Bracelet. Set to destroy the Regents, how far will Sykes go to retain his precious bracelet once again?—Anonymous", "Claudia and Myka head to Portland, Oregon, where numerous people begin to flash out of existence, leaving only charcoal \"shadows\" behind. The agents connect the victims to Megan Reese, whom the victims have all upset, one way or another. How she can accomplish this without an artifact is a mystery. Meanwhile, Pete and Jane use an artifact to explore Jane's memories for leads on the identity of the one targeting Regents.—statmanjeff"], "genres": "N/A", "imdbID": "2004133", "rating": 7.6, "votes": 543, "number_of_episodes": 64}