{"cast": {"0604607": "Dermot Morgan", "0641192": "Ardal O'Hanlon", "0446392": "Frank Kelly", "0572965": "Pauline McLynn", "0574561": "Gerard McSorley", "0457062": "Dervla Kirwan", "0867017": "Stephen Tompkinson", "0346950": "Tony Guilfoyle", "0318384": "Anne Gildea", "2509867": "Caoilinn McCormack", "0614100": "Barry Murphy", "0057277": "Sean Barrett", "0189724": "Donncha Crowley", "0302982": "Colum Gallivan", "0565482": "Neil McCaul", "0571727": "Kevin McKidd", "1440093": "Joe Taylor", "0567124": "Andrew McCulloch", "0102195": "Billy Boyle", "1372889": "John O'Mahony", "0126170": "Ed Byrne", "0268383": "Tom Farrelly", "0737575": "Tony Rohr", "0216304": "John Delaney", "0218712": "Brendan Dempsey", "0640235": "Aine O'Connor", "0313869": "Clive Geraghty", "1794016": "Brendan Burke", "0230597": "Miche Doherty", "0448343": "Stephen Kennedy", "0611995": "Conor Mullen", "2507422": "Pat O'Mahony", "0878760": "Paul Tylak", "0703888": "John Quinn"}, "geners": ["Comedy"], "runtimes": ["55"],  "plot": ["Father Ted wins the \"Golden Cleric\", for saving a fellow group of priests from an embarrassing situation.", "In this Christmas special from 1996, Ted manages to avert a major catastrophe when he, Dougal and a group of other priests become lost in the lingerie section of a clothes store. Managing to get them out of the store and averting another scandal in the catholic church. Ted is awarded a Golden Cleric. Ted is undoubtedly pleased but things take an unexpected turn when a priest called Father Todd Unctious turns up who claims to be an old friend of Teds. Although Ted can't for the life of him remember who he is.—Robert McElwaine", "Having helped six other priests to escape when they get lost in the local department store's lingerie section Ted is awarded the Golden Cleric award which he somewhat gracelessly accepts. Returning home just before Christmas he finds that Father Todd Unctuous, who claims to be an old friend of his but whom he cannot remember, has come to stay but he turns out to be a burglar and is only prevented from stealing Ted's award when Dougal sneaks downstairs in the night to watch a scary film. On Christmas morning Ted gives Mrs Doyle a present of a tea- maker, which he hopes will prove to be a labour-saving device, unaware that making the tea herself is one of the joys of her existence.—don @ minifie-1"], "genres": "N/A", "imdbID": "0578500", "rating": 8.7, "votes": 975, "number_of_episodes": 25}