{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0039162": "Shawn Ashmore", "0277071": "Michael Filipowich", "0846834": "Jayne Taini", "3513898": "Zayne Emory", "9070920": "Jade Payton", "5263035": "Alain Ali Washnevsky", "3046066": "Maggie Parto", "1631845": "Ramses Jimenez", "3022685": "Johnny Rey Diaz", "0152282": "Andi Chapman", "5670328": "Ian Gregg", "3897694": "Michael J. Sielaff", "0496082": "Brian Leckner", "2932167": "George Tsai", "0770934": "Wendy Schenker", "8220546": "Vinny O'Brien", "0253639": "Paul Eliopoulos", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["41"],  "plot": ["Officer Nolan and Sgt. Grey are paired up for the day on patrol. Nolan's son Henry and Grey's Daughter visit the station.", "Captain Zoe Andersen feels officers should keep in touch with field work, so she and sergeant Wade Grey will each patrol that day with a rookie. That leaves Tim in charge of lower-ranking but headstrong Bishop, and the possibly break-in alert in a basement proves a skunk. Working with Grey, after learning their kids are visiting on college leave, Nolan is overeager to do it by the book, too nervous to pull that off and extremely unlucky, so they nearly get thrashed by a criminal crone and arrive damaged to son Henry Nolan and daughter Dominique Grey, who bond while worrying over their fathers' cop risks, with an extra demonstration when an fresh ex-con seeks to get locked up for life. Wes is rudely barked off when offering to help when the domestic alert at the divorced Dariush Ghorbani couple answered by Lopez and Chen turns fatal. Night school lawyer Wesley Evers finds Wes's TO rudely unhelpful, and after Wes convinces her the smart thing is help catch his briefcase thief Wes duly turns on her systematic violation of suspect rights, yet ends up dating her.—KGF Vissers", "Nolan welcomes his son Henry that arrived in LA to visit him. Meanwhile, Captain Zoe Andersen orders that Sgt. Grey and she should patrol the streets of LA with the rookies to have contact with the field work. She selects Lucy and Sgt. Grey chooses Nolan to go with him. Henry and Sgt. Grey daughter Dominique befriend each other while their fathers are working. Tim and Talia are joined in the patrol and their relationship is conflicting. Angela and West help the cocky and arrogant lawyer Wesley Evers and West feels a crush between Angela and Wesley.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "8856024", "rating": 8.1, "votes": 1712, "number_of_episodes": 144}