{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1597260": "Mircea Monroe", "2009006": "Demetrius Grosse", "0996735": "David DeSantos", "0004729": "Michael Beach", "0048336": "Christopher James Baker", "4320791": "Isaac Keys", "0082169": "Nicole Bilderback", "1294002": "Niko Nicotera", "1240415": "Andrew Friedman", "0563383": "Kathe Mazur", "4543350": "Sam Duffy", "3924692": "Steve Lenz", "1382237": "Elizabeth J. Carlisle", "0388105": "Stephanie Hodge", "0219938": "Jeremy Denzlinger", "4546009": "Nolan Freeman"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["41"],  "plot": ["Nolan's split decision during a robbery causes an investigation. Bradford's wife becomes an informant, and a meeting with a drug trafficker goes awry.", "Officer Nolan and Officer Bishop respond to a silent alarm call at a local convenience store where two men are attempting to rob the place. Officer Nolan pursues one of the suspects on foot and is forced to make a split-second decision that will affect both of their lives. Meanwhile, Officer Bishop helps coordinate a drug bust that hits a little too close to home for Officer Bradford.", "Nolan and his TO Bishop pursue a petty criminal into an escape room, which they must solve to get out, ultimately with his initially refused help. In pursuit, Nolan fatally shoots a robber in self defense, triggering the whole frustrating process of suspension during I.A. investigation. Bradford's estranged junkie ex-cop wife is returning, against his concerns turning undercover informer. While trying to get evidence against a major drug trafficker, the connection to her wire is lost and Bishop and Bradford find the camera and blood upon searching the apartment: she seems taken by the drug traffickers. Chen gives Nolan a ride home from the precinct and they sleep together. While Chen showers, the robber's brother attacks Nolan, shooting a gun on Nolan off camera.—KGF Vissers", "While attending the call of a robbery of a convenience store by two criminals, Talia arrest one of the men and Nolan pursues the other on foot. The thief breaks in a house and flees to a room. Nolan saves the family and when he enters the room, he is face to face to the criminal with a gun. He shoots the man in self-defense and his decision affects his life in the police department and the internal affairs. Meanwhile, detectives Wolfe and Vestri decide to use unstable Isabel to help them to capture a powerful drug-dealer and Talia and Tim are invited to join the rescue team.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "8855950", "rating": 8.6, "votes": 2059, "number_of_episodes": 144}