{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1083404": "Sarah Shahi", "0004729": "Michael Beach", "0039162": "Shawn Ashmore", "1260407": "Felicia Day", "1395858": "Valerie Cruz", "0397599": "Shawn Michael Howard", "2177398": "Brittany Belt", "3734217": "Ruy Iskandar", "2020675": "Jenn Liu", "5178914": "Phillip Garcia", "4235008": "Isiah Adams", "0569552": "Brian McGovern", "2396655": "Aaron D. Alexander", "1837657": "Scott Manuel Johnson", "4541464": "Gabriel F. Bellotti", "2097406": "Trenton Rostedt", "10124606": "Lashawn Williams", "6043089": "Alexander Aleynikov", "1712435": "Christian Bowman", "1728276": "Mimi Braasch", "1796104": "Jan M. Janssen", "10970008": "Richard Scott", "9378323": "Alfredo Tavares"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["As the rookies prepare for a big exam to see who moves on to the next stage of training, Nolan and Bishop are called to the scene of a murder and learn that the victim may be tied to a potential terrorist attack on the city of Los Angeles.", "As the rookies prepare for a big exam to see who moves on to the next stage of training, Officer Nolan and Officer Bishop are called to the scene of a murder and learn that the victim may be tied to a potential terrorist attack on the city of Los Angeles.", "Nolan and Talia attend a dispatch call in a bus station and find a dead body in the restroom. Soon they learn that the guy is a terrorist that intended to release a bio-weapon in LA. The Police Department is in standby investigating where might be the terrorists. When Tim and Chen arrive at a home, they realize that the owner has mistakenly swapped backpacks at the bus station and the weapon is inside his room. Tim immediately locks the door to protect Chen while the CDC starts the quarantine protocol.—Claudio Carvalho, Rio de Janeiro, Brazil", "The very day of the major rookie exam, Nolan and Bishop check on a corpse in a bus station restroom, found victim of a top secret lab-stolen canister which a terrorist cell plans to spread a 'weaponized' hemorrhagic virus with in LA, so everyone is mobilized to impose urgent lock-down. Successfully tracing the threat to a supposed fiend's home, Bradford locks himself up with him, as he seems to be infected, keeping Chen safely outside to call for CDC experts, who apply preventive lock-down. The virus is still out, as the bus passenger accidentally swapped backpacks. Jessica makes a questionable choice, shooting a surrendering terrorist in front of Nolan. Meanwhile, Lopez and West save people on a bus by apprehending a second terrorist, which allows West to make up with his father after their previous argument. Once the virus has been contained, Tim gets an experimental vaccine, but then passes out after leaving the house.—KGF Vissers"], "genres": "N/A", "imdbID": "9256664", "rating": 8.5, "votes": 1778, "number_of_episodes": 144}