{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0530249": "Mario Lopez", "0039162": "Shawn Ashmore", "2908492": "Grant Harvey", "0533268": "Andy Mackenzie", "5108838": "Lyndon Smith", "0178870": "Alicia Coppola", "1731347": "Romeo Brown", "9481314": "Wesley Kimmel", "4028452": "Lainey Lipson", "7121773": "Gavin K. Lee", "2060062": "Robert A. Johnson", "4261405": "Adam Zastrow", "4355757": "Dean Neistat", "2040746": "Owen Szabo", "10631272": "Will Fourth", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan gets a lesson in respect after his arrest of a gang member leads to a free-for-all on his life; officer Chen and Bradford pull over Mario Lopez, who thinks he can talk his way out of a traffic violation.", "Everyone walks on eggshells as I.A. is on annual campaign to test into the absurd all officers' integrity, setting traps. TO Tim is all but amused that Chen is tested by hiring hunky Hollywood star Mario Lopez for a speeding freebie, hence slams the books for any offense he can slap. Nolan thinks it's a ripoff cloths trap when the dress on the girl he arrests falls apart, yet jails her correctly, only to learn she's the spoiled girl of street gang baron Cole Midas, who listens only to his jailed father Leonard 'king' Midas. Nolan is offered protection at home while the gang is squeezed by drying their income, but Nolan refuses to hide and Cole takes aim higher up the LAPD food chain.—KGF Vissers", "On a day that the integrity of officers is tested on the field through traps, Nolan stops a woman from stabbing a restaurant valet and accidentally tears her dress. However, she is Astrid Heisserer, the mistress of the gang pin Cole Midas that feels disrespected and puts a hit on Nolan. The LAPD decides to arrest gangsters and close illegal business of the gang and Sgt, Grey goes to the prison to visit the father of Cole, Leonard \"King\" Midas, to propose to call off the hit. Meanwhile Nolan is on patrol Captain Zoe Andersen, when Grey informs that King Midas has called off the contract. But they do not know that Cole has not accepted his father's command.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "9256656", "rating": 9.0, "votes": 2755, "number_of_episodes": 144}