{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1313656": "Ryan Michelle Bathe", "0001572": "Danny Nucci", "2699047": "Brittany Ross", "2006513": "Joe Williamson", "5977545": "Ashleigh LaThrop", "1549602": "Julanne Chidi Hill", "0427358": "Wesley Jonathan", "0643665": "Myra Cris Ocenar", "0146360": "Todd Cattell", "0266631": "Debbie Fan", "2043941": "Justin Abarca", "8040684": "Raquel Dominguez", "0888654": "Kiff VandenHeuvel", "5025209": "Aaron V. Williamson", "0445022": "Dennis Keiffer", "7850170": "Miguel-Andres Garcia", "1796104": "Jan M. Janssen", "6694689": "Dang Tran"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Talia forces Nolan to confront his personal moral inclinations after he encounters a kidnapping victim; Lucy is temporarily placed with a new training officer who tests her patience; and Jackson confronts his short-comings.", "Talia forces Nolan to confront his personal moral instincts in order to be a good cop after he encounters a kidnapping victim. Meanwhile, Lucy is temporarily placed with a new training officer who tests her patience, and Jackson must confront his failures head-on if he wants to be an officer.", "Despite the sergeant openly disliking him and his TO being unable to formulate practical instructions timely, rookie Nolan does his best, e.g. preventing a suicidal stood-up bride from jumping, alas damage-prone as a fork lift junkie semi-wrecks his patrol car, and shames a pair of haughty LAPD detectives when stumbling upon the trail of a serial abductor. Toughest TO Tim Bradford takes over Lucy from her disabled mentor. Jackson must bravely deal with a stoned, stripping Hulk.—KGF Vissers", "Nolan and Talia pursue a red Jeep hitting in other cars, and when they succeed to stop the car, they learn that the driver is a bride left by her groom. She tries to commit suicide but Nolan uses his life experience to save her. When Nolan hits a drugged woman, they find that she was kidnapped and Talia trains Nolan to control his temper and moral values since he is a police officer. Meanwhile, the lazy Scott Wrigleyis assigned to replace Tim as Lucy's TO forcing her to take an attitude. West has to prove Angela Lopez that he will not let her down.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "8805084", "rating": 7.9, "votes": 2214, "number_of_episodes": 144}