{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0004729": "Michael Beach", "0039162": "Shawn Ashmore", "0001344": "Gregg Henry", "0680531": "Joseph C. Phillips", "6899488": "Caleb Castille", "2264199": "Robbie Kay", "0930570": "Evan Williams", "0732025": "Shelley Robertson", "1889973": "Charles Baker", "0750527": "Troy Ruptash", "1490478": "Nicole Steinwedell", "0038875": "John Asher", "0286849": "Theo Forsett", "4849690": "Ashton Amaba", "7839517": "Lee Coc", "0445556": "Victoria Kelleher", "4738115": "Zachary Mooren", "1915955": "Tim Doiron", "10592192": "Matt Baker", "1796104": "Jan M. Janssen", "4996083": "Gerard Sullivan"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["When one of their colleagues is arrested by Internal Affairs for lying on the witness stand, it leads to the release of three felons whose cases he worked on and the team being asked to check in on them now that they are free.", "When the Internal Affairs arrests one fellow detective for lying on the witness stand, his cases are investigated, and three criminals are immediately released from prison. West and Angela have to see the behavior of an innocent woman called Samantha after losing ten years of her life. Tim and Chen go to a paintball club and Nolan and Talia are assigned to check the behavior of a lowlife called Terry. He mentions the name of Dylan and that reference affects Talia. Then Nolan has to face a judge since he is being sued by a con artist but he does not trust in the young lawyer assigned by the police union to defend him.—Claudio Carvalho, Rio de Janeiro, Brazil", "After another painful pursuits over obstacles, Nolan is hurt on the head and subpoenaed by a regular police-charger who claims Nolan used excessive force and inflicted an injury. He is assigned as first court client to the youngest lawyer, Simon Parks Jr., son of legend Sr., who assures he can handle his case, even with a hostile judge, but finds it hard to control Nolan. Corrupt detective Brett Jenkins's arrest by Internal Affairs causes (at least) three criminals to be released from prison early as their trials are squashed, so must be checked in on. Lopez and West visit Samantha Bennett, who lost her family and resorts to blind violence requiring instant arrest. Bradford and Chen search for actually guilty Max Kegel, who hides in a paintball yard. Nolan and Bishop get violent Terry Wright, who recognizes Bishop, as his robber mate Dylan Scott is Bishop's former foster brother. Dylan and Wright later kidnap Bishop when she tries to arrest them, leading to Nolan rushing off from his court hearing early. Dylan shoots Wright as he aims to kill Bishop, who arrests him and admits to Grey that she lied about Dylan being her foster brother when applying to the academy, grounds for dishonorable dismissal. Jackson confronts father West about using illegal methods, which strains their relationship.—KGF Vissers"], "genres": "N/A", "imdbID": "9256660", "rating": 7.7, "votes": 1527, "number_of_episodes": 144}