{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1024264": "Julie Ann Emery", "0502097": "Kai Lennox", "1597260": "Mircea Monroe", "2896043": "John Nania", "0154215": "Michael Chaturantabut", "0016366": "Mary Albee", "0153610": "Lauro David Chartrand-Del Valle", "1601061": "Anthony Bonaventura", "2615178": "Eugene Shaw", "1141776": "Dorian Kingi", "2555065": "Kelly Connolly", "2875677": "Tessa James", "3681222": "Renes Rivera", "1150775": "Patrick Sabongui", "7995525": "Johnny D'Esposito", "10200022": "Dominic A. Iannitti", "4873493": "Paula Alvear", "4323231": "J. Francisco Rodriguez", "4822970": "Teya Patt", "1568589": "Luing Andrews", "2163396": "Tamiko Brownlee", "4626185": "Michael I. Goode", "5490654": "Gerren Hall", "1796104": "Jan M. Janssen", "11682789": "Reid Kawakami", "1905783": "Mariano 'Big Dawg' Mendoza", "2183298": "Vitta Quinn", "8658345": "Darrion Scoggins", "9137374": "Jamin Thompson"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Small town guy John Nolan pursues his dream of being a police officer after a life-altering incident. As the force's oldest rookie he's met with skepticism from some higher-ups who see him as a walking mid-life crisis.", "In Foxburg, Pennsylvania, the constructor John Nolan has just divorced his wife and former sweetheart. He goes to the bank and meets the manager Stacy to open his safe deposit box. Out of the blue, there is a heist and John protects Stacy that presses the alarm and summons the police. Nine months later, the forties Nolan leaves the academy and joins LAPD as a rookie with his colleagues Lucy Chen and Jackson West. Sergeant Wade Grey immediately does not like Nolan, believing that he is living a mid-life crisis. Talia Bishop, Tim Bradford and Angela Lopez are assigned as training officers of Nolan, Chen and West respectively that need to prove their value in the police department. But the life of a rookie is not easy in the LAPD.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nine months after foiling a bank robbery in his small town of Foxburg, Pennsylvania, divorced father and construction worker John Nolan moves to Los Angeles and enrolls in police academy, to become a cop. His assignment at age 45 to the Mid-Wiltshire Division of the LAPD is met with skepticism, particularly by watch commander sergeant Wade Grey, who fears he'll be a danger to his colleagues and the public. Assigned to tame but ambitious training officer (TO) Talia Bishop, Nolan's first few days on the job are marked by a domestic dispute that escalates into the murder by his bitch wife of a huge man too proud to admit he's the abused spouse, an unbalanced father who leaves his young son in a locked car on a hot day, and an escaped felon who quickly tests Nolan unexpectedly and embarrassingly. Joining with Nolan as rookie officers are Jackson West, son of a high-ranking LAPD officer, assigned to veteran TO Angela Lopez and eager to live up to the family legacy, but suffering from gunfire-phobia; and Lucy Chen, who became a cop against the wishes of her therapist parents, who benefits from the hard but priceless lessons and constant test from toughest TO Tim Bradford, who can handle anything, except facing his junkie wife Isabel after a year. Lucy hides her affair with Nolan despite the risk it poses to her career. Grey admits he plans to pester Nolan any way he can, and tries to have him expelled for 'leaving his partner alone', but the brass refuses that and Nolan tells Grey that he being a cop might be his calling. Grey responds in that case, nothing will deter him.—KGF Vissers"], "genres": "N/A", "imdbID": "7587918", "rating": 7.9, "votes": 2895, "number_of_episodes": 144}