{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0333982": "Currie Graham", "0821836": "Lauren Stamile", "3950210": "Bailey Noble", "1265899": "Chet Grissom", "0107470": "Eve Brenner", "0137488": "Amanda Carlin", "0061223": "Pooja Batra", "9099855": "Cameron J. Armstrong", "1974540": "Miriam A. Hyman", "2690109": "Lamar Stewart", "2278177": "Kevin Covais", "0296765": "Kevin Fry", "3149162": "Deep Singh", "4101139": "Adam J. Kang", "7309396": "Joaquin Huizar", "5879211": "Aliee Chan", "7970220": "Travis Quist", "0610267": "Caryn Mower", "3758525": "Vaia Zaganas", "1796104": "Jan M. Janssen", "0797329": "Gary Sievers"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["An unscheduled visit by the Vice President of the United States puts the station on high alert. The secret service tasks Officer Nolan and Officer Bishop with checking out a possible threat to the vice president while the rest of the team try to keep the streets clear and safe for his visit.", "When the Vice President of the United States comes to LA for an unscheduled visit, there is a high cost for the city. The secret service assigns the LAPD to give the support for the passage of the VP entourage, jamming the traffic on the streets. Lucy has an incident with a needle and has to go to the hospital with Tim. Meanwhile Talia and Nolan witness a robbery in progress and ask for assistance from the police force that is compromised with the safety of the Vice-President.—Claudio Carvalho, Rio de Janeiro, Brazil", "Tim duly predicts a day of infuriating citizens as all rookie and TO and rookie leaves are canceled stat: Vice President Redwood suddenly decided to visit Los Angeles, hence the presidential Secret Service commandeers LAPD manpower to assist guarding the motorcade and clearing the route. Nolan and Bishop get and do well on the only special mission; finding a man who is a plausible threat to the Vice President and arrest him, having found a flare gun in his underwear. Chen gets pricked by a used needle while trying to break up a fight between two homeless junkies on a road to clear and must anxiously await results in the hospital, where Tim gets her priority stat 'being armed'. Lopez and West break up protesters and must tell various people who have obscene banners to take them down from the route, in the process arresting a man who had to tie down his demented mother to go to work. Nolan and Bishop spot a probably escape car, and despite driver Freddy's collaboration must engage in a shootout with the actual robbers. When Lopez and West defy Special Service Agent Danvers' blindly motorcade-focused orders to go help Bishop and Nolan, Grey defends their obviously right call. Despite his initial hope to buy out his ex, Nolan agrees to sell his house in Pennsylvania, which gained greatly in value.—KGF Vissers"], "genres": "N/A", "imdbID": "8856026", "rating": 8.0, "votes": 1659, "number_of_episodes": 144}