{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1597260": "Mircea Monroe", "0333982": "Currie Graham", "0039162": "Shawn Ashmore", "0749081": "Sara Rue", "1683768": "Beau Garrett", "1720134": "Angel Parker", "0082517": "John Billingsley", "9099855": "Cameron J. Armstrong", "0066381": "Scott Beehner", "1645338": "Darrin Miller", "2167601": "Tony D. Czech", "0076328": "Michelle Bernard", "9425184": "Brittany Volcy", "2179873": "Stephen Bralver", "3420704": "Ernesto Silas Chaverri", "11311907": "Matthew Morley Daniel"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["The most dangerous day of the year, Valentine's Day, has the team on high alert, and Officer Nolan invites everyone over for a party now that he is single,", "The evening before Valentine's Day, Grey chases the rookies on a night out fro where he and his wife celebrate 'quietly', but Nolan still loudly deals with a man harassing a woman at the bar. On Valentine's Day, Bradford takes his first day off in years to meet up with his wife in rehab but they end up breaking off after Tim telling her he can never trust her again and that she can't move past her personality as an addict if they remain together. Arriving at a car crash, Nolan saves the female driver's life, who lost her husband a year ago and tries everything to get together with Nolan, even cozying up to Ben to get close to Nolan. Lopez and West interrogate alleged assault victim Kevin Scott, who claims dementia, but turns out a dangerous criminal. West hits it off with a male nurse. Lopez searches Evers' smartphone, wrongly assuming he cheated, and turns on him for defending dodgy victims of police brutality. Nolan hosts a party for his first Valentine's Day in a long time without company and is surprised when TO Bishop attends.—KGF Vissers"], "genres": "N/A", "imdbID": "8856034", "rating": 7.8, "votes": 1652, "number_of_episodes": 144}