{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0959242": "José Zúñiga", "3964231": "Kristian Nairn", "6836919": "Madison Horcher", "3045245": "Jay Ali", "2378772": "Cameron Gharaee", "0005514": "Kim Johnston Ulrich", "8341039": "Paxton Singleton", "0021247": "Steven Allerick", "6226104": "Harley Cunningham", "1732032": "Michael Masini", "4157232": "Daniel Nguyen", "1861558": "Christopher M. Campos", "4225820": "Raul Colon", "1966177": "Marco Morales", "3347922": "Andrei Runtso"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The rookies are temporarily paired with new training officers and Officer Nolan is paired with Officer Lopez. When Nolan and Lopez track down an escaped criminal, they discover a little kindness goes a long way. Meanwhile, Jackson is forced to face his fears when he is partnered with Officer Bradford, while Officer Chen and Nolan must face a hard truth.", "Sgt. Wade Grey switches the training officers of the rookies, and Nolan stays with Angela; Chen with Talia and West with Tim. Sgt. Grey asks the rookies to find a secret of their respective TO to improve their investigative skills. Angela asks Nolan to speak less and pay more attention to their Code Book and they hunt an escapee from the justice. They learn the importance of their kindness with the criminal. Talia advises Chen to break up with Nolan; otherwise she will be marked in the Police Department. Tim Bradford finds that West freezes in shootout and tries to fix the rookie.—Claudio Carvalho, Rio de Janeiro, Brazil", "Watch sergeant Grey reassigns the rookies for one day to each-other's TOs. They can earn a day off by learning some secret about their new TOs, but end up refusing so gratefully. Lopez takes Nolan to court, where he chases an escaped prisoner, leading to a potentially career-making bust for the pair as a Latino mobster, grateful to be allowed finishing his daughter's quinceanera, tips them off for a drug bust. Tim Bradford learns the worst way that West struggles when he freezes during a shootout and bitterly confronts Lopez, who claims they can't take on his brass father, so Tim takes West to meet grateful agoraphobic citizen Wallace, who counsels West on facing his fears. Chen defends, on patrol, her relationship with Nolan to Bishop, who threatens to expose them, prompting Nolan and Chen to have a talk about ending their relationship.—KGF Vissers"], "genres": "N/A", "imdbID": "8855928", "rating": 7.7, "votes": 1906, "number_of_episodes": 144}