{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1597260": "Mircea Monroe", "0004729": "Michael Beach", "2009006": "Demetrius Grosse", "0996735": "David DeSantos", "3551000": "Madalyn Horcher", "0048336": "Christopher James Baker", "0715295": "Alyson Reed", "0126021": "Eugene Byrd", "1294002": "Niko Nicotera", "0946002": "Jamison Yang", "0329537": "Randy J. Goodwin", "2660484": "Dana L. Wilson", "4543350": "Sam Duffy", "4320791": "Isaac Keys", "5648142": "Cristian Fagins", "0237421": "Scott Dreier", "2351732": "Carin Chea", "1172599": "Oakley Lehman", "1435830": "David Hutchison", "0596404": "Brandon Molale", "9137374": "Jamin Thompson"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officer Bradford's wife, Isabel, is found shot but alive and he vows to track down the man responsible. Meanwhile, Officer Nolan must protect his home and the truth after a home invasion attack.", "Lucy spends the night with Nolan and while she is having a shower, the brother of the criminal killed by Nolan invades his house and attacks Nolan that defends himself and subdues the man. Now he has to lie to Commander Percy West to protect Lucy. Meanwhile, Isabel is found in an alley with a shot in her head and Talia, Tim, Angela, Lucy and West are assigned to arrest the criminal Marcus Vance, who shot her, in the dangerous Bronson Building. Soon they learn that their radios and cellular are jammed by a system in the basement and they need to fight for their lives.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nolan manages to fight off his attacker, throws him through the window and calls for backup. Bradford, Lopez and Bishop find Isabel, shot in the head, but surviving. Nolan and Chen lie repeatedly, notably to investigating commander West, to cover up their affair by denying her of anyone else being in his home, where the fiend heard her. Nolan is assigned to desk duty pending the investigation, learning the tedious clerical rules and displaying his fathering skills on the son of a drunk father he gets to sleep it off in a cell, but informally. Bradford, Chen, West, Lopez, Bishop and detectives Wolfe and Vestri search an apartment building for drug dealer Vance, who shot Isabel and left her for dead, ending up in a shootout resulting in Vestri being killed and Wolfe seriously wounded. Chen must deliver Vance's girlfriend's baby while West turns off the power to a frequency jammer, so Bishop can call for backup. Vance and his men break into the apartment and fight with Bradford and Chen. Reinforcements, including Nolan, Commander West and the SWAT team arrive and arrest Vance's party. Nolan reports to Andersen and Commander West and the latter informs him that he has been cleared of all charges and can return to the police force immediately.—KGF Vissers"], "genres": "N/A", "imdbID": "8856022", "rating": 8.5, "votes": 1928, "number_of_episodes": 144}