{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "2009006": "Demetrius Grosse", "0725434": "Brett Rickaby", "0198620": "Bertila Damas", "2367213": "Holley Fain", "3047696": "Lucas Kerr", "0364227": "Adam J. Harrington", "0400194": "Brent Huff", "0836954": "Scott Subiono", "0661229": "Randi Cee", "4959807": "Rosslyn Luke", "0076328": "Michelle Bernard", "1538461": "Sarah Burkhardt", "0199405": "Mark Daneri", "8138963": "Kristian Lambert", "2340323": "Mike Estes", "9437423": "Malachi Mutakabbir", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The rookies undergo a field training day where their training officers wear plain clothing while riding with them.", "The rookies are really put to the test when their training officers accompany them out of uniform for Plain Clothes Day, which forces them to make all the decisions while on patrol. Meanwhile, Officer Nolan tries to prove he has been progressing faster than the other rookies to justify his desire of becoming a detective within five years.", "The rookies reach a critical test: on 'plain clothes day' (No. 100), they take all the decisions, their TOs may only observe. Nolan goes for smart arrest, is tricked by Bishop into losing an arrested fiend, has bad identity luck but pulls off a nearly perfect day and realizes he must not overcompensate his maturity but make best use of it. Tim finds cocky Chen neglectful, almost clueless and under IA investigation for threatening a citizen who is rude to his dog, yet Tim and the captain save her bacon for bravery after they stumbled upon a murder. West was dreaming of his father's arrest record, but gets stuck by car trouble leaving him the last rookie around stuck with endless filing, so all he can achieve is return a single erroneous piece of evidence as keepsake to a widow.—KGF Vissers", "On the 100th day in the police department, it is the Plain Clothes Day and Nolan, Lucy and West are assigned to work without the support of their TOs that are dressing Plain clothes. Nolan and Lucy commit mistakes in their decisions but they overcome and resolve the situations. West wants to beat the marks of his father, but he learns a lesson.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "9256652", "rating": 8.2, "votes": 1648, "number_of_episodes": 144}