{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1443238": "Will.i.am", "0333982": "Currie Graham", "2009006": "Demetrius Grosse", "1395858": "Valerie Cruz", "0210625": "Ramon De Ocampo", "1326844": "Presciliana Esparolini", "0002332": "Stephen Lang", "0749081": "Sara Rue", "9296687": "Niru Anya", "4570185": "Garrett Schweighauser", "5493540": "Branden Coles", "0579331": "Mauricio Mendoza", "3379333": "Adrian Anchondo", "1910485": "Lane Carlson", "0170594": "Jasper Cole", "4963210": "Danny Hamouie", "2322866": "Natasha Marc", "1746827": "Kathryn Taylor Smith", "1411619": "Craig Johnson", "4475648": "Kevyn Bashore", "1796104": "Jan M. Janssen", "10200023": "Bill Norcross"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Sergeant Gray informs the rookies that they must track down a specific set of crimes in a 48-hour period in order to qualify for their final exam. Meanwhile, Officer Nolan and Officer Bishop answer a silent alarm call at will.i.am's house.", "Chen and West are advised by Sgt, Grey that they need to complete their checklist of crimes on the next two days to be eligible to the final exams and Tim and Angela try to help them. Meanwhile Talia is under investigation of the Internal Affair and Ben was attacked and his Ferrari was robbed by a gang. When Nolan has the chance to participate in the investigation with Detective Kevin Wolfe, he does not hesitate to join the search for the gang of car thieves.—Claudio Carvalho, Rio de Janeiro, Brazil", "A few days before the rookies' exam to become full trainees under looser supervision, Bradford and Lopez reveal that Chen and West still have seven and four types of crime to witness, respectively, and Grey reports under stricter rules since the Jenkins PR disaster they must do all in the next 48 hours. Nolan has no gaps or outstanding crimes, so is assigned to desk duty while Talia must face Internal Affairs and he commissioner, but he asks to work with Wolfe instead on the theft of his beaten-up friendly landlord Ben's brand new Ferrari as the latest victim of a car theft ring. Nolan eagerly helps to catch the thieves, and against instructions plead Bishop's case informally. IA offered Bishop a way out: becoming a mole for IA. Cen would give up, but Tim goads her to fight till midnight, having secured overtime, suddenly with compiled luck but also an ethical dilemma. Nolan tells Ben about his own trauma after a bank robbery and how his new purpose got over it..—KGF Vissers"], "genres": "N/A", "imdbID": "9256662", "rating": 8.1, "votes": 1526, "number_of_episodes": 144}