{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1083404": "Sarah Shahi", "0873998": "Michael Trucco", "1941237": "Dominic Burgess", "9099855": "Cameron J. Armstrong", "0188614": "Greg Cromer", "1402837": "Rocky Marquette", "0490560": "Jim Lau", "0127988": "Kurt Caceres", "6330750": "Miya Horcher", "1581544": "Marisol Ramirez", "0510499": "Abraham Lim", "0570364": "Joel McHale", "5990747": "Dayne Catalano", "4763704": "Kaleb King", "5977103": "George Hayn", "4860562": "Shannon Corbeil", "9132405": "Vic Winters-Junco", "1737393": "Derek Graf", "7850170": "Miguel-Andres Garcia", "8340659": "Bella Cruz", "1796104": "Jan M. Janssen", "5906452": "Richard Lawrence"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["A massive earthquake rocks the city and throws everything into chaos; Russo recommends Officer Nolan for a protective detail of Brad Hayes, a man whose dealings have put a target on his head.", "Nolan is dating Jessica Russo that recommends him to the Assistant District Attorney Sean Delmonte to be part of the team that is protecting the dirty border officer Brad Hayes, who made a deal with the DA and now has a contract on him. Tim teams up with Nolan and they go to the safe-house where Brad is. When there is a major earthquake in LA, there is also a breakdown in their means of communication, and they need to flee from the killers.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nolan's prosecutor lover Jessica Russo arranges for him, supervised by Bradford as Bishop refuses the 'drudge', to be act as protective detail for former border patrol guard Brad Hayes, who became a human trafficker and is to testify, hence targeted by the coyote fiends. Grey struggles with absurd orders from captain Tom Weatherby. West unintentionally insults his hospital nurse lover Gino, who returned his service gun. After Chen and Bishop save a young man from a brutal exorcism performed by his crazy mother, Chen confronts her father, his therapist whose arm was broken by a patient but warns her arresting him, under the law, will undo his work, which she redeems by having the patient transferred. An earthquake leaves Grey to try to coordinate the city's response while Nolan and Bradford are attacked at the safe-house, and after they flee there even the lifeguard hut they believed untraceable, finding their human trafficker's GPS tracker led the cartel fiends, whom they overpower in a gunfight.—KGF Vissers"], "genres": "N/A", "imdbID": "9256658", "rating": 7.7, "votes": 1623, "number_of_episodes": 144}