{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "1597260": "Mircea Monroe", "0333982": "Currie Graham", "1446823": "Jonno Roberts", "3487329": "Christopher Meyer", "2009006": "Demetrius Grosse", "0996735": "David DeSantos", "0039162": "Shawn Ashmore", "3513898": "Zayne Emory", "0858109": "Sandra Thigpen", "3458540": "Catfish Jean", "0385032": "Rib Hillis", "5167667": "Chris Lamica", "5142423": "Oscar Peña", "6822854": "Eddie Yu", "5879446": "Aubrey Cleland", "5159170": "Ron J. Rock", "10336660": "Kaydence Patton", "6249399": "Atticus Batacan", "2481281": "Paul Edney", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Sergeant Grey informs Officer Nolan and Officer Bishop that they are going to have a movie director as a ride-along; Officer Bradford learns that his wife has been arrested for drug possession.", "Fan Nolan and Bishop get assigned Hollywood director Rupert Payne, for a VIP ride-along as research for his next police franchise film, with strict orders to keep away from danger. Ignoring their instructions to stay in the patrol car, Payne observes Nolan and Bishop deescalate a situation involving a mentally impaired young giant from a troubled neighborhood, which leads to his over-protective brother turning on Rupert, and real dangerous situation when Rupert tries to help the family returning alone. Tim Bradford is shattered, learning his wife Isabel is arrested in a drug bust, forcing Bradford him to decide whether to stick to his strict respect for the law or spare her a long sentence by removing a bag from her home before it's to be searched. After West tips off Lopez that she is eligible for detective exam, she attempts leveraging small drug dealers into giving up a 'big fish' in a gang which has its own lawyers, which backfires for all of them.—KGF Vissers"], "genres": "N/A", "imdbID": "8856000", "rating": 7.9, "votes": 1752, "number_of_episodes": 144}