{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0333982": "Currie Graham", "1504678": "Jose Pablo Cantillo", "0418544": "Antonio Jaramillo", "0188041": "Myndy Crist", "0743902": "Valeri Ross", "0566187": "Heather McComb", "0171096": "Kari Coleman", "3446620": "Sarah Oh", "1042758": "Mike Falkow", "1745585": "Brandi Cohen", "2908671": "E-Kan Soong", "5532931": "Jaime Barcelon", "1266915": "Sean A. Rosales", "0890684": "Jose Vasquez", "1015300": "Norman Mora", "5068652": "Arlene Barshinger", "9338519": "Matthew P Camacho"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["The rookies become the prime suspects after it is discovered a large sum of money used in a drug bust has gone missing.", "After a drug bust, the police apprehend one million dollars in cash. Nolan, Lucy and West are assigned to guard the money until the detective team arrive to count and transport the money to a safe place. Later, the detectives find that two hundred and fifty thousand dollars are missing, and Nolan, Lucy and West become the prime suspect.—Claudio Carvalho, Rio de Janeiro, Brazil", "*Despite Grey making Nolan do one role call to illustrate the danger of the gray area around perks, Lopez not only contradicts West's father's strict view on enforcing the law, even in emergencies, but drags him into enjoying the loot from a dubious method to pas over a restaurant theft by bill-flight. Nolan and Bishop find a car accident victim who was stabbed, but runs from the ambulance and flees, then turns up at the station, revealing he is Robert Ortiz, an undercover LAPD officer investigating a drug cartel, which plans to transfer one million dollars that night. The LAPD seizes it by raiding the home before the transfer. Rookies NOlan, West and Chen are put in charge of the scene until the money counters arrive, but they find $250,000 missing. The three are polygraph-cleared, but still suspended. Driving after work, Chen is surrounded by members of the cartel and flees on foot. Nolan and West, who were on the phone with Chen during the attack, notify the LAPD and rush to her aid. The cartel men catch up to Chen and demand to know where she hid the missing money - Chen realizes that the cartel boss must have hidden the money himself, recognizing the crocodile boots of the man she saw leaving the house before the raid with a large duffle bag. The boss shoots his men, but after a scuffle is subdued by Chen. Captain Andersen arrests Ortiz in hospital, as he alone could tip off he cartel. Nolan agrees to pay Ben what he can for his apartment on a monthly basis to ensure that he is not accepting goods or services for free, which would imperil his status as a police officer, unable to pay the real value.—KGF Vissers"], "genres": "N/A", "imdbID": "8856032", "rating": 7.8, "votes": 1596, "number_of_episodes": 144}