{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "1997689": "Mercedes Mason", "2047780": "Melissa O'Neil", "4182855": "Afton Williamson", "0935721": "Eric Winter", "0160085": "Shawn Christian", "0141710": "Joelle Carter", "0001572": "Danny Nucci", "1313656": "Ryan Michelle Bathe", "0817340": "Aaron D. Spears", "6622667": "Spence Moore II", "0157297": "Michael Chieffo", "6981261": "Tyler Sanders", "4685039": "Alex Denney", "5066165": "Michael Fitzgerald", "3106150": "Mike Ostroski", "0614887": "Christopher Murray", "2488539": "Shalin Agarwal", "6761518": "Tyler Beveridge", "0566176": "Tom McComas", "3347922": "Andrei Runtso"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team must help capture a cop and his former mentor from the academy after he becomes a fugitive following an assault; Officer Tim Bradford needs Officer Lucy Chen to learn to predict the moves of criminals in order to capture them.", "TO Tim Bradford teaches cocky Lucy Chen the hard way how to think like a criminal and discovers West's weak point, freezing under fire, but decides against expulsion, rather arranging a meeting with an agoraphobic junkie. Nolan regrets not having escorted home his former academy mentor Jeremy Hawke after somewhat excessive drinking, for he decided to take off with his doting teen son Logan as his estranged wife is expected to get full custody for mild abuse. So even Tim finds it daunting having to chase a model cop who can thinks ahead of every move.—KGF Vissers", "Nolan goes to a bar at night to drink with his Academy trainer and friend Jeremy Hawke, who tells that is divorcing his wife. Nolan invites him to sleep at his place, but Hawke tells that he had booked a hotel for a week. On the next morning, Talia and Nolan are assigned to attend a domestic violence case and they lean Hawke had assaulted the boyfriend of his ex-wife and soon he flees from the police with his son Logan in his truck. Meanwhile, West and Lopez are investigating a case in the hospital and they suspect the story told by the victim and his father is not the truth.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "8855932", "rating": 7.8, "votes": 1822, "number_of_episodes": 144}