{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1083404": "Sarah Shahi", "8567129": "Jasmine Mathews", "2222175": "Enver Gjokaj", "0322182": "Matthew Glave", "0651296": "Jim Ortlieb", "3835303": "Lizze Broadway", "1066970": "Rico E. Anderson", "0011747": "Dayo Ade", "0039162": "Shawn Ashmore", "4643289": "Jon Snow", "2159326": "Giovanni Bejarano", "2557334": "Michelle Castillo", "1437248": "Diane Reneé", "2385657": "Greg Bryan", "9069699": "Carsyn Rose", "3502799": "Crystal Coney", "0266631": "Debbie Fan", "10186829": "Tyler Quinlan Abbott", "5966873": "Lamar Usher", "1324929": "Patrick Hume", "11226184": "Jeffrey Moss Charles"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["An emergency alert of an impending missile attack sends Los Angeles into chaos and uncertainty, while the officers each try to keep the peace and deal with their own disasters.", "Nolan has to go to the court of Judge Stevens to testify about a car accident caused by a drugged driver and Jessica comes to the audience to give support to him. Out of the blue, there is an alert warning of missile attack in LA bringing immediate chaos to the city. Sgt. Grey sends his officers and rookies to the streets to help the population while Nolan and Jessica have to control the situation in the court. Meanwhile Nyla Harper brings her daughter to the police department and has to face another problem.—Claudio Carvalho, Rio de Janeiro, Brazil", "The LAPD must halt all normal activities to deal with an alert for impending missile attack in half an hour while nerves are already strung by a heatwave. Nolan was attending his first probationary court hearing as he witness, so he, Russo and Evers, has opponent as defense lawyer, try to calm everyone down during the threat, as there's no time to seek safety elsewhere. They all hide in a fallout shelter after Lopez reports the judge about there being none, and must subdue two prisoners' attempt to escape, but Evers is stabbed by one of them and needs hospital care. Bradford and Chen also help a store owner deal with looters and Lopez and West help save several people who are preparing to jump off of a building. Harper picks up her daughter from school, and has Rachel watch her at the station., but her ex-husband, who has sole custody, furiously wants her arrested as parental kidnapper, but Nolan convinces him that she switched her career to step up as mother.—KGF Vissers"], "genres": "N/A", "imdbID": "10525802", "rating": 8.0, "votes": 1517, "number_of_episodes": 144}