{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0876138": "Alan Tudyk", "0749081": "Sara Rue", "1821410": "Chloe Bridges", "0827307": "Bob Stephenson", "0123951": "Adam Busch", "3513898": "Zayne Emory", "2093400": "Rebecca Field", "0395914": "Bobby Hosea", "4009723": "Blue Kimble", "0005123": "Ali Larter", "7459984": "Erica Burns", "0272961": "Eddie J. Fernandez", "7661074": "Bruce M. Stockert"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Nolan spends his birthday guarding a crime scene in a law office. Bradford and West receive special commendation. Harper requests an early annual review.", "Officer Nolan kicks off his birthday by babysitting a crime scene at a law office. Meanwhile, Officer Bradford and Officer West are set to receive special awards, and Sgt. Grey rides patrol with Officer Harper after she requests an early annual evaluation.—ABC Press", "On Nolan's birthday, he is assigned to preserve a crime scene in a law firm until the place be released by the Homicide detectives. While waiting for them, the person responsible for cleaning the area called Ellroy Basso arrives and soon they befriend each other. Nyla Harper requests her evaluation to Sgt. Grey to present to the judge and he agrees, but she need to go to the field with him. Tim and West are anxious since they will receive a commendation. When Tim is driving with Chen, he hits the car rear of Sarah Murphy, and the woman goes to the ER for evaluation. Lopez and West arrest a driver for using cellphone while driving and West finds a bag of drug hidden behind the panel, that blows up. West breathes the powder and begins to act strange.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nolan has his day off on his birthday canceled to 'babysit' a murder crime scene at a law office, where he is fascinated to meet and befriends professional forensic cleaner Ellroy Basso, who tells him a lot about CSI, but while they reconstruct and find the missing security guard's corpse across the hall, they must fight off two fiends returning to the scene looking for a hidden stash of money. TO Tim Bradford is suspended for crashing his patrol car into a woman's rear end on his way to a police award ceremony, which seems also lost. On his way to the same award ceremony, West is also exposed to white powder which explodes while he searches a car during a traffic stop and seems hallucinating, so Lopez tries to hide him to stay out of trouble and fears PCB, which doesn't get purged, may end his career. Sergeant Grey rides patrol with Nyla Harper as she requests her annual evaluation 'early' to better her chances of getting custody of her daughter, and Grey observes her compassion in dealing with a near-drunk driver who was depressed after a cancer diagnosis. Searching her crashed car reveals the woman Bradford hit is intentionally scamming people to earn money by disconnecting the brake lights on her car, in collusion with a worse fraudster boyfriend, whose hitman plan Bradford and Chen thwart having tempted the woman 'to go for a deal. Nolan's hospital doc girlfriend finds West's exposure to the substance is not too serious , allowing him and Bradford to receive their special awards from the deputy chief.—KGF Vissers"], "genres": "N/A", "imdbID": "10525808", "rating": 8.4, "votes": 1586, "number_of_episodes": 144}