{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1083404": "Sarah Shahi", "0039162": "Shawn Ashmore", "0203221": "Amy Davidson", "0579227": "Zeus Mendoza", "1043126": "Skyler Stone", "1171860": "Mark Cuban", "0168143": "Chad Addison", "9473394": "Amos Blackmon", "2090998": "Collin Christopher", "3117364": "Eliza Shin", "0121846": "Robert Burke", "1273940": "Alina Andrei", "3301562": "Daniel Edlund", "1796104": "Jan M. Janssen", "0625351": "Elimu Nelson"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["The officers grapple with the aftermath of a plotted attack on the city of Los Angeles, leaving Bradford fighting for his life.", "Danger is ever-present as the officers of the Mid-Wilshire precinct grapple with the aftermath of a plotted attack on the city of Los Angeles, leaving Officer Bradford fighting for his life. Flash forward two weeks and the rookies receive the shocking results of their latest training exam, leaving one officer questioning what the future holds. Meanwhile, tension develops at home as Nolan and Lopez advance in their relationships with Jessica and Wesley.", "Tim is escorted in an ambulance by the police, but when they reach the hospital, there is a terrorist waiting for them. Talia leaves LAPD to join ATF and Nolan is renovating a house of his own. Sgt. Grey extends the training period of West since he had a low grade in the exam.—Claudio Carvalho, Rio de Janeiro, Brazil", "As Bradford is rushed to the hospital, a third virus terrorist attacks the ambulance, but Nolan and Bradford, who had only suffered an allergic reaction to medication he was given, shoot and arrest her. Two weeks later, tainted TO Talia Bishop has resigned from the LAPD to joined the ATF as a Special Agent while Nolan has moved into a new home, and the rookies are kept in suspense a whole patrol day about their midterm exams scores. Grey acts as Nolan's strict TO, and while picking up uniforms from dry cleaning, they catch a robber impersonating the clerk, hence discovering some elaborate plan involving fake police officers. Nolan and Grey find one of the robbers dead after his partners killed him and set his body on fire in a car. All rookies pass, but West is upset as his score of 81 is the very lowest near failing', while Nolan feared being lowest but hits highest: 97. Chen (who scored 91) witnesses a fake police officer stealing a radio, but fails to prevent his escape, and finds Tim keeps training her at least as hard, yet protest punishment for not reporting his suicidal remarks as hypocritical after she covered his Isabel crisis. After a clerk at the criminal court house is abducted, Nolan helps to save her life after subduing the fake officer that Chen had seen earlier. Bradford, Chen, Lopez and West arrest the other fake cops after a shootout as they attack the quarterly transport of evidence -including a fortune in drugs- to be destroyed at Lancaster. Demotivated West is demoted indefinitely by Grey, after giving a defeatist speech to a visiting troop of cadets earlier, back in long sleeves until Grey trusts him again.—KGF Vissers"], "genres": "N/A", "imdbID": "10360952", "rating": 8.0, "votes": 1609, "number_of_episodes": 144}