{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1083404": "Sarah Shahi", "0039162": "Shawn Ashmore", "0005030": "Jon Huertas", "0222336": "Seamus Dever", "0400194": "Brent Huff", "0198450": "Jane Daly", "8567129": "Jasmine Mathews", "4523248": "Cara Mitsuko", "0005123": "Ali Larter", "0076328": "Michelle Bernard", "5135523": "Ashley Erin Campbell", "5320755": "Brennan Keel Cook", "7118418": "Michael Anthony Perez", "7814518": "Gabrielle Lane", "1268453": "Mike Foy", "3023022": "Dana Salah", "3419526": "Jason Ko", "7939906": "Brock Brenner", "0000827": "Maxine Bahns", "7625481": "Johnny C"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan navigates his relationship with Jessica and a developing rapport with Grace while working a high-stakes criminal case involving an undercover homeland security agent; Officer Chen meddles with Officer Bradford's love life.", "Officer Nolan navigates building tension in his relationship with Jessica and a developing rapport with Grace while working a high-stakes criminal case involving an undercover homeland security agent. Meanwhile, Officer Chen meddles with Officer Bradford's love life, and Officer Lopez learns some surprising news about Wesley.", "After a wisecrack from a lazy senior, the sergeant teams him up with rule-stickler eager beaver Weston the annual day when known venues where criminals hang out are purposefully raided. Those two head for a diner where they can serially arrest parole-offenders simply for being together, but one runs off while the rest in frisked, apparently dumping his gun and maintaining he only carries bullets, which isn't illegal, while a matching gun is picked up by a boy, who playfully waves the loaded thing at his mother and the cops until it goes off in a vain attempt to disarm the kid. TO Tim wagers with snooty Lucy Chen she can't find him a single proper date, yet books his favorite restaurant and finds out she sent her study buddy, who has her own deal proposal. Nolan finds Alejandro Mejia, whom he arrested after jumping from a bridge, is an undercover drug agent, whom he must protect against professional killers. Pro-bono lawyer Wesley Evers lets Lopez push his buttons to meet his family, rich but embarrassing to him, yet to her taste, so he leaves alone.—KGF Vissers", "While patrolling the streets of LA with Angela, Nolan sees a man running on the street and they chase him. When they look for the man, he falls off a bridge on the top of a parked car. They take him to the hospital and Angela leaves Nolan since she has a dinner party with Wesley's family. Soon Jessica comes and discloses that the man is an undercover agent that has been investigating mobsters for a long time. Nolan is assigned to take care of the man that is under the care of Dr. Grace Sawyer. Meanwhile Chen bets with Tim that she will arrange a perfect date for him, and she summons her friend Rachel to date him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "10525794", "rating": 7.9, "votes": 1476, "number_of_episodes": 144}