{"cast": {"0277213": "Nathan Fillion", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0674782": "Harold Perrineau", "0629737": "Taylor Nichols", "0400194": "Brent Huff", "5992241": "Selena Anduze", "0683379": "Mitch Pileggi", "0005123": "Ali Larter", "0199996": "Keli Daniels", "3908674": "Barnaby Duke", "1637842": "Ryan Shapiro", "0062006": "Adele Baughn", "3502799": "Crystal Coney", "6548200": "Allen Quindiagan", "1229572": "Paul Hatter", "0775409": "Stephen W. Schriver", "0189479": "Joshua Croughwell", "10337775": "Miles Quincy Martin", "2294685": "Lenny Shelton", "10052455": "Cedric Stephens", "7661074": "Bruce M. Stockert"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Nolan teams up with new night detective Nick Armstrong for a murder investigation case that results in an unexpected reunion with a former love interest.", "Nolan teams up with new Night Detective Nick Armstrong for a murder investigation case that results in an unexpected reunion with a former love interest. Meanwhile, Officer Bradford reluctantly accepts help from Officer Chen as he prepares for his sergeant exam, and Officer West pursues an unconventional move after finding himself in need of a new home.", "Nolan is eager to be partner of Nick Armstrong, a real and unconventional detective, who doesn't look down on uniformed cops. Their first case is the brutal murder of a student in his father's home, where drugs are found, 'belonging' to fiends not ready to bow out, leading to a frustrating fatal finale. Admitted to the sergeant's exam, training officer Tim Bradford swallows some of his pride for help from book-smart rookie Lucy Chen with another compulsory read, as she realizes he physically struggles with reading. Jackson West must chose a new residence within a day after becoming homeless.—KGF Vissers"], "genres": "N/A", "imdbID": "10525792", "rating": 7.9, "votes": 1503, "number_of_episodes": 144}