{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "2361807": "Daniel Lissing", "1314042": "Karen David", "0003082": "Bailey Chase", "4168033": "Jeff Pierre", "2602672": "Eve Harlow", "4231435": "Devan Chandler Long", "0909665": "J.D. Walsh", "4609670": "Lou Ferrigno Jr.", "1671905": "Jennifer Kindhouse", "4580436": "Paul Chirico", "11924687": "Jaden Richards", "1815255": "Bo Barrett", "0102171": "Matthew Boylan", "8995282": "Brie Dyson", "0262719": "Donna Evans", "3206766": "Matthew Simmons", "2645503": "Jason Sweat", "9656586": "Enele Ma'afu Tauteoli", "11614717": "Duke Jones", "3052397": "Katie McCabe", "3626097": "Peter Stoia"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan's relationship with his first confidential informant is tested when he discovers her back on the street dealing drugs.", "Nolan and Harper encounter Nolan's former C.I. Bianca, who tells them that Ripper has returned with a large shipment of fentanyl. DEA Agent Michael Banks determines that Nolan and Harper must go in disguise to confront Ripper. They meet with Ripper, but when Bianca confronts Ripper she is abducted. Chen meets a firefighter during a call and is intrigued by him. Lopez also interrogates a bank teller after a woman is murdered, and clashes with Detective Calderon on how the case should be handled. Banks offers Harper a job with the DEA after they successfully rescue Bianca, but she respectfully declines his offer.—KGF Vissers", "While patrolling on the streets of LA, Nolan and Harper arrest Bianca, who is Nolan's former C.I., dealing drugs. She informs to the officers that Ripper has a large shipment of fentanyl to get rid of the prison. Sgt. Grey prepares a bust operation and when the team is ready to go, they are stopped by DEA Agent Michael Banks that explains that the shipment is hidden and the scheduled operation will be a failure. He proposes to use Bianca as C.I., but Nolan realizes that she is not ready to go. Further, he feels that Bianca has feelings on him and hurts her heart with hard words. The DEA decides to use Crystal and her old man again to lure Ripper and they prepare a new operation. But out of the blue, the brokenhearted Bianca arrives at Ripper's place. Meanwhile Lopez and West attend a dispatch call and find a murdered woman and her husband. Detective Calderon closes the investigation believing that the husband is the prime suspect, but Angela confronts her with new evidences.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "11326650", "rating": 7.8, "votes": 1267, "number_of_episodes": 144}