{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1418096": "Samantha Sloyan", "2222175": "Enver Gjokaj", "8567129": "Jasmine Mathews", "0067768": "Jordan Belfi", "6637502": "Margo Gignac", "2098473": "Ashley Argota Torres", "4531444": "Niko Pepaj", "4348179": "Seth Archuleta", "3884707": "Brock Pierce", "4123969": "Roshan Golconda", "6973330": "Sallieu Sesay", "2547632": "Jeffrey Markle", "2641501": "Heather Olt", "9906668": "River Drosche", "9069699": "Carsyn Rose", "1874027": "Panuvat Anthony Nanakornpanom", "7850170": "Miguel-Andres Garcia", "9789447": "Trevor Morgan", "7740995": "Steve 'Stevieweevie' Jones"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officer Nolan's first day with his new training officer gets off to a rocky start. Officer Bradford struggles to find a birthday gift for a new girlfriend. Officer Lopez has a case that triggers difficult memories.", "Officer Nolan gets off to a rocky start after being introduced to his new training officer, Nyla Harper, who has an unconventional approach to police work after her stint as an undercover detective. Meanwhile, Officer Bradford struggles to think of an appropriate birthday gift for Rachel, and Officer Lopez finds herself navigating a case that triggers a personal memory.", "Nolan has a problematic introduction to his new TO Nyla Harper, a former detective with golden ticket that had worked undercover for four years and now surprisingly returned to the LAPD as a training officer. However, she is arrogant, independent, does not trust anyone and has difficulties to follow orders and Nolan is afraid to be dragged with her to indiscipline in the police department. Meanwhile Angela and West save a homeless woman from the paintball attack of two selfish and cruel teenagers and soon they find what happened with the woman ten years ago. Chen and Tim discuss a birthday gift for Rachel.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nolan is introduced to a new training officer, Nyla Harper, a former undercover detective, who meets him as a rap in a bar, bragging she only cares for the 'warrior' type of cop and deems him a sissy 'protector'. He doubts her extreme police tactics, overseeing minor offenses by bypassing the book aiming at bigger fish, but she had a 'gold card' for exceptional merit, nobody knows why she picked to become TO. As they pull over a car without plate, all four occupants flee, one falling deep of a roof top. Harper puts forward her body cam, showing he jumped himself and she didn't push him. On patrol they spot Ross Teagan, a known drug dealer from Harper's past fighting cartels near the Mexican border. Commenced an operation to set up Teagan, Nolan spots another suspect, Osito, leaving the scene and when Nyla tells him she doesn't answer to him, Nolan agrees but warns her he won't roll over and take an antagonistic relationship. Tim Bradford, Nolan, Chen and Harper find and arrest Osito. Grey makes Harper apologize to Nolan. Tim struggles to find a birthday gift for recent date Rachel, reluctantly cued by Chen. West and Lopez apprehend two rascal knaves who bothered homeless Alice Sheldon, who turns out to be still wanted for a hit and run ten years ago that left the victim paralyzed and caused Alice's own life-wrecking breakdown. They track down her victim Karin Arnoux, who after objecting Lopez's defense of Sheldon, later pleads a second chance for Sheldon.—KGF Vissers"], "genres": "N/A", "imdbID": "10525796", "rating": 8.0, "votes": 1475, "number_of_episodes": 144}