{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0674782": "Harold Perrineau", "4168033": "Jeff Pierre", "2453033": "Hannah Kasulka", "6716392": "Chris O'Shea", "0784833": "Greg Serano", "1553955": "Hrach Titizian", "0400194": "Brent Huff", "0005123": "Ali Larter", "3502799": "Crystal Coney", "1161173": "Molly Baker", "4261693": "Ashlee Marie McLemore", "0933642": "John K. Wilson"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Their rookie year is coming to an end and officers Nolan, Chen and West are about to be squeezed harder than ever before as their training officers evaluate whether they are truly ready for the job. Meanwhile, after one of their rookie classmates is involved in a shooting, the team uncovers some unsettling evidence.—brahamdali", "The rookies are warned they'll be pushed to the limit as training is about to end. Fellow rookie Chris Rios is fatally shot in broad daylight by a member of the Derian crime family, the entire police department commences a manhunt where multiple complications arise. Raiding the gunman's house, Bradford and Chen learn that an L.A.P.D. officer is on the Armenian crime family's payroll. Nolan and Harper recover the murder weapon from the crime scene, but find out it is stolen after a raid on Ruben Derian's residence. West deals with the aftermath of Rios's death at the hospital, Lopez fails to find the mole. From the officers' body camera footage, Lopez learns that rookie officer Erin Cole's body camera function stayed off during her shift, with the Wilshire precinct conducting another manhunt on Cole. Nolan learns that guilt-ridden Cole was the actual target of the assassination attempt, with Rios being collateral damage. Despite Nolan successfully calming her down, Cole is fatally shot by Armstrong. During the aftermath and inspired by a recent conversation with Harper, Nolan reviews his body camera footage and deduces that Armstrong was the actual Derian mole.—KGF Vissers", "Sgt. Grey gathers his team and explains that in thirty days, the rookies will finish their training and asks the TOs to press their rookies. While patrolling, they hear a dispatch call of a police car chasing a Maserati and when the car is stopped, the rookie Chris Rios is shot and dies. The criminal leaves the car in a parking building and Nolan finds the gun and locks in the safe in the police car. Harper needs to go to the court for the dispute of her daughter and Nick Armstrong lends his car to her and goes with Nolan. Out of the blue, the dispatch call informs that the LAPD and the SWAT will bust the house of the murderer's brother looking for him and Nolan and Nick head to the spot. When Nolan arrives at the police station, he learns that the weapon is missing. Soon Sgt. Grey assigns Lopez to find a mole in the police department.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "11326656", "rating": 8.4, "votes": 1418, "number_of_episodes": 144}