{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0674782": "Harold Perrineau", "0039162": "Shawn Ashmore", "8567129": "Jasmine Mathews", "1314042": "Karen David", "2361807": "Daniel Lissing", "6089741": "Presilah Nunez", "1478589": "Lisa Marcos", "4231435": "Devan Chandler Long", "9241110": "Clark Furlong", "0729060": "Geoffrey Rivas", "1514499": "Evan Hart", "1922561": "Taylor Gerard Hart", "0005123": "Ali Larter", "9069699": "Carsyn Rose", "0887273": "Mariko Van Kampen", "4035204": "Reba Buhr", "2581087": "Stephen Brailo", "7661074": "Bruce M. Stockert"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officer Nolan's trust is tested. Meanwhile, Officer Harper has finally earned an overnight visit with her daughter that is put into jeopardy when her past undercover life resurfaces again.", "Officer Nolan's trust is tested when he tries to help the previous owner of his home reconnect with his family. Meanwhile, Officer Harper has finally earned an overnight visit with her daughter that is put into jeopardy when her past undercover life resurfaces again.", "Officer Nolan tries his best to help the previous owner of his home reconnect with his family, but later has to subdue and arrest him when the other man breaks into the house in the middle of the night. Bradford and Chen track down a murder after a lost dog is found covered with blood, resulting in a disturbing case where a woman was killed not by her ill-reputed ex-boyfriend by her pre-teen son Malcolm Tucker because she dumped his substitute father. Wesley is brought in as the kid's lawyer, but freaks after the boy brings up the knife due to PTSD from when he was stabbed. Lopez and West are assigned as set advisers to a TV police series to show proper LAPD procedure and so on after running into gay lead actor Sterling Freeman during an arrest, with West hitting it off with him while Lopez assists his co-star in dealing with a stalker, who was one of the production crew and nearly shoots West. Officer Harper has finally earned an overnight visit with her daughter that is put into jeopardy when her past undercover life resurfaces again in the person of a beaten drug harlot. Nolan also goes undercover to save Harper's life.—KGF Vissers"], "genres": "N/A", "imdbID": "10525812", "rating": 7.7, "votes": 1381, "number_of_episodes": 144}