{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0674782": "Harold Perrineau", "0866300": "Lauren Tom", "1836948": "Grace Van Dien", "0427963": "Dot-Marie Jones", "3513898": "Zayne Emory", "2828822": "Hina Abdullah", "3999574": "Madeleine Coghlan", "2602672": "Eve Harlow", "0009410": "Ray Abruzzo", "0420564": "Tobias Jelinek", "0006878": "Michael B. Silver", "0455058": "Matthew Yang King", "1013433": "Susan Santiago", "0553737": "Vanessa Martinez", "1775113": "Saul Huezo", "0005123": "Ali Larter", "1902165": "Julienne Irons", "7719290": "Zachariah Axel", "2409652": "Zacarias Salveron", "7661074": "Bruce M. Stockert"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The rookies are asked to develop their first confidential informants; Officer Chen's mother complicates her home life when she comes to stay with her.", "As part of their second phase of training, the rookies are asked to develop their first confidential informants. Officer Nolan soon discovers that no two informants are the same and struggles with his newest task. Meanwhile, Officer Chen's mother complicates her home life when she comes to stay with her.", "When Nolan is visited by his son Henry, he learns that he is engaged and meets his fiancée Abigail. He goes to his work worried about the situation of his son and Detective Nick Armstrong investigates the life of Abigail in the system and prints a copy to Nolan. Now he has a dilemma: shall he open the envelope with the information or not? Chen has the unexpected visit of her mother that intend to divorce her husband. Meanwhile Sgt. Grey assigns the rookies to achieve CI's of their own.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nolan struggles with surprising news that his son Henry is now engaged with his girlfriend, Abigail, whom detective Nick Armstrong checks and finds has an arson record, but he dreads intruding Henry's privacy. The rookies must recruit their first confidential informants. Nolan's first pick, a drug dealer, survives an operation but attempts to escape before it starts and overdoses afterwards. Armstrong helps Nolan by giving him a list of informant candidates. Nolan and Harper try their luck with a forger, who easily flips. Awaiting a major deal at Whiteman Airfield, the buyers turn out women on the run from a Mexican cartel. The cartel's right hand man arrives but escapes just as reinforcements arrive. Chen's bossy mother moves in uninvited after having an argument with Chen's father. Bradford and Chen deal with a young woman who sells her step mother's belongings to a pawn shop out of revenge, waves Chen's advice to mend her ways and buys a gun threatening her step mother and shooting at her bags. Lopez and West try to flip a known FBI informant, who actually lied about his ex-wife sleeping with a known car dealer. They use this to flip him completely the second time, leaving FBI handler Wyck Bird furious but impressing Grey, who finally ends West's probation in long sleeves. Grace reads Abigail's background check, and Nolan brings it up to Henry and her. Abigail explains about her arson, Nolan welcomes her.—KGF Vissers"], "genres": "N/A", "imdbID": "10525798", "rating": 7.8, "votes": 1413, "number_of_episodes": 144}