{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0674782": "Harold Perrineau", "1156709": "Annie Wersching", "8567129": "Jasmine Mathews", "2453033": "Hannah Kasulka", "1553955": "Hrach Titizian", "6183987": "Themo Melikidze", "2301438": "Max Adler", "0005123": "Ali Larter", "1336517": "Johnny Hoops", "0559427": "Naomi Matsuda", "4988665": "Lily Mae Harrington", "9719125": "Wakisha Malone", "6164233": "Destiny Jenkins", "11569762": "Deje Kelly", "6716392": "Chris O'Shea", "0784833": "Greg Serano"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["In part two of the season finale, Nolan's discovery goes much deeper than he expected and could put his life and career in jeopardy.", "Nolan reviews the footage of his camera and suspects that Nick Armstrong has killed Erin in cold blood. He discusses with Harper that tells that he shall have evidence of his suspicion; otherwise, he could lose his job. He decides to visit Rosalind Dyer that gives a clue to him. He breaks in Nick's house and soon he learns how naive he is. Meanwhile, Tim tries to say goodbye to Rachel, but they decide to see how their relationship will work with Rachel moving to New York.—Claudio Carvalho, Rio de Janeiro, Brazil", "Harper helps Nolan, having seen the body camera footage, tricking suspect detective Armstrong to an abandoned house to pick up his burner phone's signal so as to tap its records to uncover evidence of his crimes, but he already tossed it. Desperate, Nolan returns to Rosalind Dyer, who reveals in exchange for private info that after Armstrong broke into her house to secure evidence to arrest her, she retaliated and found guns, cash and files incriminating Armstrong in his home, so Nolan breaks in and locates it before escaping. Armstrong sees him leaving and alerts Serj Derian, who is just arrested after a raid on his house. Armstrong invites Nolan back home to explain he got in too deep with the Derians once the costs for his deceased wife's medical bills became too much for him to handle. He plans to incriminate Nolan as the mole before Nolan incapacitates Armstrong in a shootout, who reveals that he planted his stash in Nolan's house as Serj tells Grey that Nolan is the mole. Frantically demolishing, Nolan finds it hidden inside a wall in his bedroom, but stands in his bedroom as the police close in on him. Tim calls a marker to save arrested Rachel, despite her leaving for a New York job, a transfer would break his spotless career.—KGF Vissers"], "genres": "N/A", "imdbID": "11326678", "rating": 7.9, "votes": 1649, "number_of_episodes": 144}