{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0001293": "Seth Green", "8567129": "Jasmine Mathews", "0942875": "Tom Wright", "0400194": "Brent Huff", "2324137": "Chris Brochu", "1244536": "Michael Esparza", "0598569": "Steve Monroe", "0001111": "Jeremy Davies", "5587604": "Tor Brown", "3342583": "Monica Ruiz", "10967750": "Kaden Alejandro", "1086815": "Corie Vickers", "2948935": "Erika Bowman", "1019674": "Sala Baker", "3610660": "Marisa Chen Moller", "2569474": "Tarnue Massaquoi", "3370819": "Leslie A. Hughes"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officer Nolan is having a particularly bad day after learning his identity has been stolen. Meanwhile, Sgt. Grey must confront his past and testify at the parole hearing of the man who murdered his partner.", "To Nolan's horror, he's one of the victims of a hacker who steals identities and max out on their accounts and credit cards, amassing a fortune in luxury goods. Nolan's life savings, meant as his son Henry's college fund, are wiped out and the cyber crime expert says he'll be lucky if less then half is tracked down and claimed back in court over about four years, overseas accounts are probably lost forever. Nolan finds unrepentant cyber thief Jordan Neil and his stash, but also must rescue the rascal fiend from a criminal fellow victim, whose violent repertoire includes amputation, with a twisted reward. Jackson insists to treat a physically lost petty case, thus stumbling onto a murder, but also neglecting the annual regulation infractions to do list left by the sergeant, who faces a trauma with Lopez from her first patrol day, at the parole hearing of the man who killed her partner drunk but now seems reformed for his teen son.—KGF Vissers"], "genres": "N/A", "imdbID": "11326620", "rating": 7.8, "votes": 1293, "number_of_episodes": 144}