{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0780435": "Ryan Seacrest", "2953537": "Katy Perry", "2828504": "Luke Bryan", "0005360": "Lionel Richie", "0005123": "Ali Larter", "0039162": "Shawn Ashmore", "2222175": "Enver Gjokaj", "1177213": "Jai Rodriguez", "0153108": "Nancy Linehan Charles", "9069699": "Carsyn Rose", "1889098": "Lucius Baybak", "0761052": "Roselyn Sanchez", "1884460": "Megan McNulty", "6672481": "Adonijah", "0363031": "Jay Harik", "0426056": "Rhomeyn Johnson", "5461069": "Marissa Ford", "3368743": "Aaron Colom", "11426958": "Janice Blue", "3638603": "Bryant Boon", "11771250": "Sean Patrick Bryan", "10337775": "Miles Quincy Martin"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officers Chen and Bradford respond to a call at the Los Angeles auditions of \"American Idol\" and Officer Chen ends up facing Ryan Seacrest and the judges; Chen befriends a reporter whose motives are not clear", "Officers Chen and Bradford respond to a call at the Los Angeles auditions of \"American Idol,\" and Officer Chen ends up facing Ryan Seacrest and the judges (Katy Perry, Luke Bryan and Lionel Richie). Meanwhile, Chen befriends reporter (Roselyn Sanchez) whose motives are not clear.", "Nolan and Dr. Grace Sawyer sacrifice their dinner date to join Harper, who spends the night at ex Donovan's home to check on their pre-teen daughter's report of a ghostly woman on the street at night, which proves a crone looking for her missing lap dog, but the search puts Nolan in danger with a psychotic neighbor. A robber's venomous weapon turns on himself. Tim must save the day when trainee patrol partner Chen, who ignored his warning against trusting the press, let a newspaper reporter lure her into staking out a VIP expected to become the next victim of a robbers gang.—KGF Vissers"], "genres": "N/A", "imdbID": "11326632", "rating": 7.8, "votes": 1323, "number_of_episodes": 144}