{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1083404": "Sarah Shahi", "5804864": "Thomas E. Sullivan", "5705377": "Issac Ryan Brown", "0908800": "Nayo Wallace", "4950841": "Joss Glennie-Smith", "0199823": "Kevin Daniels", "0504183": "Sonya Leslie", "0005123": "Ali Larter", "3267573": "Eric Weddle", "5663326": "Robert Woods", "7615686": "Jasmine Stone", "3512523": "Sheldon White", "0928640": "Susan Wilder", "4274281": "Yarett Harper", "4428501": "Kieran Gallagher", "10261489": "Ray Bender", "3776763": "James Peyton"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["John and Jessica's relationship gets a lot more complicated after she delivers some surprising news; Officer Bradford and Officer West are assigned a community policing project helping out the Watts Rams as volunteer coaches.", "Rookies or duos are assigned to community bonds, mainly various liaison duties, like Nolan as guest speaker in his ex's pregnancy class while his own lover Jessica's false positive compromises their relationship, overpowering an intruding ex proves the easier bit. Bradford gets assigned with recovering West as volunteer coaches to his favorite team Watts Rams so he can spar with favorite star Eric Weddle, but also becomes the only refuge for an ex-con single mother and her boy, whom she mysteriously pulled from the promising junior team, which suddenly tie sin with a seemingly routine diamond deal guard duty. Lucy duly regrets ignoring the dragon detective's advise to dodge any neighborhood meeting complaint by referring to an imaginary task force, stuck in petty jobs, one of which proves an explosive nightmare by chance.—KGF Vissers", "Jessica believes she is pregnant and Nolan loses his focus thinking in the consequences. Sgt. Grey request community policing from his officers and rookies to improve the relationship with the local population. Nolan is assigned to go to the hospital to meet Dr. Grace in a lecture.Tim and West go to a football field to give support to youngsters. Chen and Nyla need to talk to members of the community and Nyla advises Chen how to proceed. Meanwhile Lopez is working as private security on her day off to raise some money.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "10525806", "rating": 7.8, "votes": 1394, "number_of_episodes": 144}