{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0004729": "Michael Beach", "1252685": "Toks Olagundoye", "0322182": "Matthew Glave", "0703939": "Molly C. Quinn", "0914223": "Myk Watford", "1269973": "Andy Ridings", "0400194": "Brent Huff", "0037970": "Lisa Arturo", "0160004": "Claudia Christian", "1781213": "Matty Cardarople", "3918199": "Chris Reed", "1223951": "Tamyra Gray", "1088531": "Antonio Jovani Leon", "6559685": "Will Westwater", "7386781": "Mona Shaikh", "7876129": "Rohan Chugani"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officer Nolan, Officer Harper and Detective Lopez are assigned to the kidnapping of the son of a criminal court judge who has a long list of enemies who could possibly be involved.", "When Nolan fails to take a test he asks the professor if he could take it. The professor tells him to answer an ethical question and if he can, she will let him. She gives him a day to think of the answer. Lopez is working the kidnapping of a judge's son. When DNA identifies the perp as being the daughter of Oscar Hutchinson she sends Nolan and Harper to talk to him. He says he doesn't know he has a daughter. When they ask for the women he's been with, he asks that they get him out so he can help them. Chen is reeling from a bad breakup. While on patrol someone spray paints their unit. Bradford recognizes it as being the work of someone who did the same thing to him ten years ago. West is being pressured by his father to consider joining internal affairs which he doesn't want to do. Grey decides to ride with West and talk to him about his career options and his advice differs from West's father's.—Rcs0411@yahoo.com", "When the son of Judge William Abassi is kidnapped, Lopez assumes the case and based on the available DNA, a daughter of Oscar Hutchinson may be the criminal. Nolan and Harper help her to interview the criminal and they make arrangement to meet every woman that might be the mother. Meanwhile, Bradford and Chen chase the tagger 3Eyez that has returned after ten years causing troubles to Bradford. Commander Percy West and Sgt. Grey are disputing the future career of Jackson West, dissatisfying him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "13433318", "rating": 7.5, "votes": 1427, "number_of_episodes": 144}