{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0746125": "Brandon Routh", "1720134": "Angel Parker", "0209850": "Kamar de los Reyes", "1828818": "Christian Keyes", "0400194": "Brent Huff", "2117181": "Sterling Sulieman", "2874472": "Joy Brunson", "1538583": "Gilbert Chayrez-Chavarria", "0015935": "Lori Alan", "0908024": "Matthew Walker", "7751235": "Nicolas Cantu", "3035058": "Josh Fingerhut", "0004920": "Frances Fisher", "8133340": "Kalon Atkins", "0477075": "Jennie Kwan", "0252114": "Jonathan Erickson Eisley", "1423866": "Josh Dean", "0936011": "Time Winters", "4571476": "Ryan W. Garcia", "2315274": "Curtis Lyons"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Jackson West's relationship with his new training officer, Stanton, has escalated and he begins to work with Sargent Grey to find a solution.", "Nolan's mother stays on longer than he thought, she decides to sell dubious products. She sells them at the station and tells everyone he uses it which Isnot true and When the ones who use it show side effects he tells his mother she needs to make restitution. But shes evasive forcing Nolan to make a hard decisions. Grey tells West if he wants to get rid of Stanton they need to have strong evidence. So West rides with him watching him as he mistreats people. Bradford and Chen are assigned to back him UP but they decide to see if they can get evidence against Stanton. Wesley wants Angela to see his mothers doctor but she prefers her own. When Wesley sees her at work to talk about it she worries That it might tip them off shes pregnant and worries That Shell be treated differently but When the lead detective assigned a case that should have gone to her. She thinks he knows.—Rcs0411@yahoo.com", "Grey, who finally hopes to advance diversity in the LAPD, and eager secret activist West look to shut down his 'de facto racist' TO Stanton, but he cleverly sets up Jackson by making it look like he was going to beat up a ghetto kid, instead writing West up for failing to stay with the evidence having run after the kid. Nolan is horrified by his ma Evelyn luring sergeant Grey's wife into pyramid sales scam that their family members put money into, but Luna insists to let the women take responsibility. Lopez is shocked when Wesley reveals his hereditary predisposition to Fragile X syndrome, a real risk that their child would suffer mental disabilities and seizures. Lopez confronts her detective supervisor, who she believes is not assigning her cases because of her pregnancy. Her supervisor was unaware that she was pregnant, and duly denies not the case, but he won't go easy on her as fragile newbie.—KGF Vissers", "The uninvited Evelyn does not leave Nolan's House and decides to sell a noxious product to the police station, including Sgt. Grey's wife Luna and soon Nolan has another problem to resolve. Sgt. Grey asks West to collect evidence that officer Doug Stanton mistreats poor and black people, and Tim and Chen are assigned to back him up since Doug is violent. Harper loses the application of her daughter Lila in the music class. Wesley asks Angela to go to his mother's obstetrician and discloses that he has a genetic problem.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "13433306", "rating": 6.7, "votes": 1914, "number_of_episodes": 144}