{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1252685": "Toks Olagundoye", "0342399": "Greg Grunberg", "0807351": "Arjay Smith", "7491262": "Dylan Conrique", "3513898": "Zayne Emory", "6884042": "Katy O'Brian", "3739133": "Bayardo De Murguia", "0198450": "Jane Daly", "3049542": "Rob Welsh", "3999574": "Madeleine Coghlan", "12342339": "Nik Sanchez", "6221375": "Brandon Jonathan Wong", "3776763": "James Peyton", "1624199": "Kevin Patrick Burke", "3144096": "Nick Epper", "3719730": "Chad Bennett", "10202743": "Jonathan Richard King"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Two new Boots start at the mid-Wilshire station - Lucy gets jealous of how her FTO Tim treats his new charge. John's professor comes to the Sergeant with an annoying issue that goes from minor to terrifying overnight.", "Most-feared TO Tim Bradford stuns his former well-tested rookie Lucy Chen, who looked forward to watching his hazing, by acting far more accommodating to new recruit Katie Barnes, a military veteran like him, whom he tries to help building up confidence and a non-combatant helping attitude, but she shies away and leaves the LAPD. John is proud when his son Henry visits, presenting his colleague at his cool new job, alas having left college, but worried-sick as the boy collapses. Professor Fiona Ryan rather rudely refuses Nolan's protection after reporting credible threats from right-extremist opponents of her civil rights action, only to end up grateful for his protection and confiding how it started with her family's fate in their home town Philadelphia.—KGF Vissers", "Sgt. Grey is introducing the new rookies Katie Barnes and Larry the Badger in a meeting with the other officers when the clumsy Larry accidentally shots the window and is immediately expelled from the police department. Bradford is assigned as the TO of the former military Katie Barnes and soon he identifies her greatest problem and expects to help her. Chen becomes jealous with the treatment of Tim towards Katie. Meanwhile Henry and Abigail arrive in LA and meet Nolan that is very happy. Professor Fiona Ryan comes to the station and exposes a harassment from a stranger. Nolan offers to protect her, but she refuses. But soon she learns how dangerous her opinions are, irritating the extreme right wing.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "13433328", "rating": 7.5, "votes": 1501, "number_of_episodes": 144}