{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0746125": "Brandon Routh", "1720134": "Angel Parker", "7491262": "Dylan Conrique", "0345477": "Camille Guaty", "1048128": "Dana Davis", "0400194": "Brent Huff", "1751224": "Tiffany C. Adams", "0281074": "Markus Flanagan", "1478697": "Paul Nakauchi", "3290102": "Wilzette Borno", "0004920": "Frances Fisher", "5672270": "Jamason Coles", "1631127": "Kelli Dawn Hancock", "6142006": "Neiko Neal", "1345689": "Hilda Boulware", "8482978": "Demetrius Hodges", "1408703": "Chris Rivaro", "2864800": "Anthony Keyvan", "2968060": "Angela Sprinkle", "1439191": "Masha Sapron", "2718708": "Jonathan D'Ambrosio", "4093086": "Lauren Gaw", "0384961": "Marshall Hilliard"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nolan's mother makes an unexpected visit after a broken engagement. Sgt. Grey wants to retire.", "Nolan's life is complicated further by his self-invited mother Evelyn, who claims his bed and dumps her umpteenth fiance, hence demands Nolan's support to illegally keep the ring. Distracted by an armed man in scuba gear, Nolan fails his firearms re-qualification exam, and later stumbles upon a plot to assassinate a businesswoman with shady connections when he returns to practice for the retake. West and his new TO continue to clash as Stanton opts to arrest an entire Black family who are not even connected to the crime committed by the suspect that they're looking for. West reports Stanton to Grey with Bradford's backing, but West is outraged when Grey says that Stanton will only be assigned to administrative duty. Grey, who plans early retirement, later admits his wife that he and West must solve the issue.—KGF Vissers", "Nolan is in a difficult moment in his department when out of the blue his mother Evelyn arrives at his home. During a firearm exam in a shooting range, Nolan pays attention on a man shooting wearing a scuba gear and fails the test. Chen gives her car to Tamara and soon she finds that the teenager has sold the car to buy clothes and other stuffs. West witnesses the racist Doug mistreating a black family and he decides to report to Sgt. Grey that intends to retire. Lopez finds the connection between the shooter in the scuba gear and the notorious La Fiera that is visiting a college in Los Angeles for her son.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "13433304", "rating": 6.2, "votes": 2274, "number_of_episodes": 144}