{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0674782": "Harold Perrineau", "0004729": "Michael Beach", "1156709": "Annie Wersching", "0001734": "Armin Shimerman", "1553955": "Hrach Titizian", "0400194": "Brent Huff", "1049386": "Kyle Davis", "4026997": "Jovana Lara", "3502799": "Crystal Coney", "1796104": "Jan M. Janssen", "3370819": "Leslie A. Hughes"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nearing the end of the training, Nolan faces his biggest challenge as a police officer yet when he must come to terms with the choices he made in search of the truth.", "Nolan finds the stashed fake evidence, Grey asks him to step out of his house but Nolan demands a warrant to enter first in order to buy time to hide the stash and calls Wesley as his defense attorney. Getting dressed to contest the warrant, Wesley accidentally finds a positive pregnancy test. Brought to the hospital, Armstrong implicates Harper as Nolan's accomplice, turning the tables when Harper explains Armstrong's corruption to Internal Affairs commander West and Lopez finds Armstrong's go bag off of a tip acquired from Rosalind Dyer. Nolan attempts to clear his name by going undercover to catch his Armenian mob paymaster Derian to implicate Armstrong, who escapes from the hospital and makes a deal with Derian, tipped off by Rosalind about the cops finding his go bag. As Armstrong prepares to execute Nolan, his gun proves empty and he is shot to death; Nolan can escape and arrest Derian. Nolan and Harper get letters of reprimand in their personnel files, virtually barring promotion, and Nolan is held in the training program for an additional month and faces a disciplinary exam. Lopez is promoted detective and opts to hold off on announcing her pregnancy for a clean start as a rookie detective.—KGF Vissers", "Nolan finds the evidence planted by Nick Armstrong in his house while the wounded dirty detective incriminates Harper and Nolan. Nolan hires Wesley to defend him and Harper tries to explain to Internal Affairs commander West that Nick is corrupt. Tim and Chen meet Rosalind Dyer that tells that Nick has a hidden bag full of money to flee. Lopez finds the bag buried near Rebecca's tomb. Nolan decides to go undercover to meet Derian to prove he is honest, but Nick flees from the hospital and Nolan has a surprise in the gathering with the mobster. Lopez is promoted to detective.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "12367704", "rating": 7.9, "votes": 1974, "number_of_episodes": 144}