{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0746125": "Brandon Routh", "0209850": "Kamar de los Reyes", "0807351": "Arjay Smith", "0657903": "Jorge-Luis Pallo", "7491262": "Dylan Conrique", "0400194": "Brent Huff", "0549826": "Sean Marquette", "4615210": "Dia Frampton", "1705317": "Will Harris", "2915788": "Amarr", "3871277": "Mark Sande", "2330321": "Dashiell Connery"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Nolan and Harper are assigned to a community policing center in an attempt to rebuild the station's reputation.", "Nolan and Harper are punished by being assigned to a community policing center. Lopez has a shaky first day as detective. Chen has her car stolen and tries to take care of the girl who did it. West is assigned a new TO, but this new guy is not exactly the perfect cop he seems to be.—Ollie Curtis", "Under punitive scrutiny after the Armstrong fiasco, Nolan and Harper are assigned to a community policing center to attempt rebuilding their station's reputation, countering hostile mistrust from the ghetto locals. While Nolan tries to make a positive impact, even repairing park lights in his spare time, Harper doubts this method. West gets off to a rocky start with his new training officer, Doug Stanton, whose deep mistrust from experience with street gangs conflicts with West's naively consistent advantage of the doubt for citizens who mostly are gang-compromised. Tim goes in most critical mode during Chen's last rookie month, while she tries to find her stolen rust-bucket car, and later tries to help the teen thief upon learning of her situation. Lopez's first case as a detective seems pointless: someone broke in to use a furnace to cremate a body, leaving no actual evidence even to report a case, yet discovers that the body is one of many victims of a notorious gang.—KGF Vissers", "Sgt. Grey informs that after the corruption problems of Nick Armstrong and Erin Cole, there will be changes in the station to try to rebuild the reputation of the police department. Lopez is promoted to detective and her first case is a mysterious breaking in a mortuary. Nolan and Harper are assigned to community policing in a poor area also as a form of punishing them. West has a new Training Officer to replace Lopez, Doug Stanton, and soon West notes that Doug is a racist police officer. The car of Chen is stolen and soon she discovers that the homeless teenager Tamara Colins is the thief.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "13433298", "rating": 6.4, "votes": 2286, "number_of_episodes": 144}