{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1252685": "Toks Olagundoye", "0084581": "Joshua Bitton", "1631435": "Aimee Teegarden", "0718693": "David Reivers", "3390771": "Sam M. Hall", "0821344": "Steve Stafford"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["An Amber Alert sends the team on a race against time to find a newborn infant who was stolen from a local hospital. Meanwhile, Officers West and Chen work their last shift as rookies as Officer Nolan continues on for 30 more days.", "Chen and West are working their last shift as rookies, while Nolan still has 30 more days. Nolan's professor joins him and Harper on a ride along, to do research for a book she's writing. While on patrol, they receive an amber alert on a missing baby. They all try to find the baby. When one suspect turns out to be innocent , they focus their attention on another.—Rcs0411@yahoo.com", "On Chen and West's final day as rookies, the department races against the clock when a newborn is reported kidnapped from the hospital. Nolan and Harper do a ride-along with his psychology professor Fiona Ryan, who prepares a book about police reform. Lopez rides with West on his final day as a rookie, contemplating her future as a parent, reassures by West and advised by Harper during the search. The prime suspect, baby's father, is found after crashing his car, but he never took the baby. CCTV at the hospital reveal that Rita Cissane kidnapped the baby after her own died of SIDS and is found her on a bridge with the baby- Nolan and Lopez convince her to return the baby. Tim duly has mixed feelings about arrogant Chen and her bucket list, especially the intent to become an undercover agent while lucking ruthlessness. As Chen and West celebrate their last day as rookies, Harper invites Nolan for a home dinner with her and her daughter.—KGF Vissers"], "genres": "N/A", "imdbID": "13433322", "rating": 7.5, "votes": 1562, "number_of_episodes": 144}