{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0333982": "Currie Graham", "0209850": "Kamar de los Reyes", "1828818": "Christian Keyes", "3513898": "Zayne Emory", "0866300": "Lauren Tom", "3165233": "Henderson Wade", "1410258": "T.V. Carpio", "1555781": "Linara Washington", "0733025": "Robby Robinson", "1483917": "Marisa Brown", "3580507": "Lauren Shaw", "4586267": "Rachel Gelfeld", "1478964": "Dusty Sorg", "11362429": "Seth Yaitanes", "5881425": "Leaphy Khim", "10933720": "Aurelia Jones", "2090998": "Collin Christopher", "7862804": "Michelle Eddins", "1997689": "Mercedes Mason"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Harper and Nolan respond to a bank robbery in progress and realize the motives of the thief run much deeper than just needing money. West and Chen's first day riding without training officers isn't what they thought it would be.", "Near the end of his probation, Nolan is called to a bank robbery in progress but when the robber is shot trying to surrender, Nolan can't stop thinking that there is more to the robbery. Lucy and Jackson ride together on their first day as newly minted officers. Nolan's friend Ben is back in town and offers Henry a job that makes him quit college. Overwhelmed with wedding preparations, Angela taps Tim to be her \"man of honor\".", "Ben visiting Nolan reveals that son Henry now works for him, which means he has dropped out of college for a dream job. West's family falsely made him believe he and and Chen would be celebrated formally on becoming full-fledged police officers. Before the Wests celebrate privately, Chen's mother tries to get her to abandon her \"thankless job\" to become really useful as a doctor. Harper feels awkward when she sees someone from her past. Tim Bradford sacrifices his day off to assist bridezilla Lopez preparing her and Wesley's wedding, insisting to plan it the way she really wants, so is promoted her 'man of honor', staring with firing the actually immensely-relieved maid. Nolan responds to a call where a man is holding people hostage well, but a nervous security guard fatally shoots the man. Continuing the investigation informally with Harper, they discover that the man's family were disturbed by robbers who forced him to pay back, prompting him to rob a bank. His wife and daughter are abducted to force her to steal from her workplace. Nolan assists her while Harper causes a distraction, giving Chen and West time to find the daughter.—KGF Vissers"], "genres": "N/A", "imdbID": "13433326", "rating": 7.8, "votes": 1367, "number_of_episodes": 144}