{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1252685": "Toks Olagundoye", "0345477": "Camille Guaty", "7491262": "Dylan Conrique", "3905984": "Jason Canela", "0873998": "Michael Trucco", "1751175": "Alain Uy", "2366079": "Bob Morley", "0198450": "Jane Daly", "0400194": "Brent Huff", "12342339": "Nik Sanchez", "9008679": "Britni Camacho", "1564087": "Jenna Dewan", "0809590": "Peter James Smith", "3016639": "Adam Wang", "8305441": "Mair Flores", "4448255": "Joe Coffey", "2294433": "Lawrence Broughton", "2525916": "Ruben Avitia"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan mildly injures himself while chasing down a shoplifter and the local DA wants to charge the suspect with assault despite Nolan's wishes. Meanwhile, Lucy goes undercover, Lopez' wedding venue is seized by the FBI and Nolan meets his new neighbor.", "With Cesar Madrigal clearly unwilling to turn informant against La Fiera, and Nolan approaches Madrigal's girlfriend -guarded by her cousins- to talk him over, but she calls that hopeless and when Nolan and interim partner Smitty locate Cesar, he is shot dead by La Fiera's sniper. Back on patrol, they chase and arrest a shoplifter who is unjustifiably charged with assault instead of his simple misdemeanor, on the devious grounds that Nolan accidentally dislocated his own thumb during the pursuit. Nolan manages to get professor Ryan and Grey's backing to force ADA Sean Delmonte -who spells revenge- to reduce the charge so as to spare his assailant a criminal record. Chen starts her undercover work in a rundown motel and is duly grabbed by Salonga's brother Dahrio, who forces her with goon Half-Life to help steal in a lab chemical ingredients for the drugs he wants her to cook. Suddenly La Fiera storms Dahrio's compound to force them to join her cartel but the police, alerted by Harper, arrive to arrest the gang. Lopez forthrightly tells locked-up La Fiera that she has only herself to blame for her son's death, but she is later broken out from her prisoner transport. As Wesley and Lopez's wedding ceremony -which Tim wisely got arranged by mother Patrice Evers, Tamara and her autistic boyfriend- begins, Nolan delivering the bouquet discovers Lopez's bracelet on the floor with Lopez herself missing, actually kidnapped by La Fiera's men.—KGF Vissers"], "genres": "N/A", "imdbID": "13433346", "rating": 8.2, "votes": 1556, "number_of_episodes": 144}