{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "3513898": "Zayne Emory", "0345477": "Camille Guaty", "7491262": "Dylan Conrique", "2208749": "Derek Phillips", "0004986": "LisaGay Hamilton", "1274545": "Reynaldo Gallegos", "0024593": "Tony Amendola", "3905984": "Jason Canela", "4552582": "Piper Curda", "3999574": "Madeleine Coghlan", "2864800": "Anthony Keyvan", "0221043": "Emily Deschanel", "3502799": "Crystal Coney", "4453003": "Molly Cerne", "10169527": "Mayur Chauhan"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["After rushing his son, Henry, to the hospital following his collapse, Nolan is reunited with his ex-wife, Sarah, and they must come together to help their son. Meanwhile, Detective Lopez discovers \"La Fiera\" is in the same hospital and wants to find out exactly why.", "Nolan brings his son to the hospital. His ex-wife shows up. They are told their son's condition is serious. They are told they have two options one less risky but not a complete fix. The other which will make sure that he's cured but dangerous. The son wants the risky procedure. So Nolan and his ex must try to counsel their son on what to do. Harper and Bradford visit Nolan and see La Fiera and inform Lopez who is also in the hospital for a check up. She leaves to confront La Fiera who says she's only their to bring her son for medical consultation. But they don't think so . Till they discover she is meeting with an ailing drug lord, in the hospital. So they keep an eye on them. West and Chen bring a girl they chased for speeding who was injured . They learn she's a mule who has drugs in her and they try to convince to name whom she is working for.—Rcs0411@yahoo.com", "In the Shaw Memorial, Nolan and Abigail meet Sarah while waiting for the results of Henry exams to decide how will be his surgery. Meanwhile, Lopez and Wesley are waiting for the obstetrician consultation when she learns that La Fiera and her beloved son Diego are also in the hospital for a surgery on his knee. But when Lopez discovers that the drug pin Tomás Madrigal is terminal in the same hospital, she suspects that La Fiera has the intention to make a deal with Tomás and she teams-up with Harper to investigate the meeting of the dangerous drug dealers. Meanwhile Tim meets his addicted old friend Mack Daniels hired by Cesar Madrigal to work as bodyguard of his father Tomás.—Claudio Carvalho, Rio de Janeiro, Brazil", "After rushing son Henry, to Shaw Memorial hospital following his sudden collapse as cardiac troubles reemerges after quiet years since childhood, Nolan is reunited with his ex-wife Sarah, who opposes Henry's choice to risk a permanent surgical solution now, rather the wait after a quick fix, which is safer for now, Nolan follows his son's wise wish. Meanwhile, Detective Lopez discovers \"La Fiera\" is in the same hospital for genuine treatment of her good teen son Diego, as turns out also a cover to negotiate a takeover from dying rival cartel boss Tomás Madrigal, sparking a bloody confrontation with his heir Cesar, whom Tim finds to have hired fired junkie detective ex-mate Mack Daniels as Tomas's bodyguard. An innocent victim too many spells a gang war. West and Chen deal with a speeding girl cocaine mule who needs surgery for a bursting swallowed bag.—KGF Vissers"], "genres": "N/A", "imdbID": "13433330", "rating": 7.6, "votes": 1300, "number_of_episodes": 144}