{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0005260": "Frankie Muniz", "2361807": "Daniel Lissing", "3835303": "Lizze Broadway", "1321094": "Skyler Samuels", "0767443": "Doug Savant", "3966184": "Joe Adler", "0517792": "Karina Logue", "0731533": "Robin Roberts", "0528761": "Meredith Scott Lynn", "4026997": "Jovana Lara", "3459191": "Payson Lewis", "0933988": "Rainn Wilson", "9408062": "Ethan James Spitz", "10808573": "Kendall Grace Samuelson", "8342614": "Haven Everly", "0019174": "Mann Alfonso", "6697782": "Debreion Brooks"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team gets the true crime docuseries treatment when they analyse a recent case featuring a former child actor whose adult life has garnered him a cult following.", "In a true crime documentary, the station breaks down a recent case of former child actor Corey Harris , known for his role in Paul's Place, a Nolan family favorite, who turned into the leader of a cult, which Lopez and West encountered previously. Harper and Nolan initially responded to a call where Harris was reported by Debbie's father, before Nolan convinced her to stop to see her terminal mother. Harris is reported missing from his house, with blood later identified to his former co-star, Charlotte Luster, and a mummified Charlie Chaplin is found under his bed. Luster is reported missing next, her car found at LAX. Harris is found alive, and remains silent for five hours before demanding a lawyer, actually Wesley. Harris' mother is arrested after CCTV shows her parking Luster's car. She confesses claiming sole responsibility. Harris himself is later murdered during a live-stream to his followers, by his former acting student Ronald Sanchez.—KGF Vissers"], "genres": "N/A", "imdbID": "13433314", "rating": 4.4, "votes": 3393, "number_of_episodes": 144}