{"cast": {"0277213": "Nathan Fillion", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "3600675": "Titus Makin Jr.", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1252685": "Toks Olagundoye", "0807351": "Arjay Smith", "7491262": "Dylan Conrique", "2208749": "Derek Phillips", "2745297": "Kara Wang", "1490183": "Jon Jon Briones", "0400194": "Brent Huff", "1211344": "Leonardo Nam", "2047955": "Austin Highsmith Garces", "0745194": "Will Rothhaar", "4351387": "Joshua Triplett", "12342339": "Nik Sanchez", "5626368": "Denny McAuliffe", "8990934": "Chelsea M. Davis", "0515225": "Barry Livingston", "6908744": "Tess Cline", "2334495": "Lisa Catara", "1145611": "Shenita Moore"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan's decision to return to school in order to become a training officer proves to be much harder than he expected; Officer Chen considers going into undercover work after getting a taste of the job.", "Bradford and Chen are assigned to work in the security of a convention of covert operations and he meets his old friend Mack Daniels with a hooker and notes that he is addicted in Oxycodone. West is working at community policing. When a criminal breaks in the convention, Nolan and Harper come to give support to Bradford and Chen and one classmate identifies Nolan and exposes him to the class. Later, Harper and Chen help Harper's former colleague June in an undercover work, and Chen's work is praised by her colleagues.—Claudio Carvalho, Rio de Janeiro, Brazil", "Several TOs and rookies are assigned to security at the hotel where undercover agents (UC) hold their nation convention. Tim Bradford's initial smile meeting his former colleague Mack Daniels there duly fades, as he rightly spots the man is not only cheating on his wife Beth, which as such is a private matter, but also developed an opiate addiction, lying it's still on prescription, which requires a CPR intervention in his 'love nest' hotel room, wrecking both relationships and his career, without pension, so his family also suffers. Nolan happily goes on alone, as Harper is asked to give a feminist lecture stepping in for an active UV friend, Fresno PD detective June Zhang, who next asks urgent help in a narcotics operation, for which Chen eagerly volunteers to get a taste of what undercover work is like even at thee expense of helping her charge Tamara Colins with an assignment as interviewed career model. Nolan's return to college to finish his degree, starting with an ethics class, becomes an ethical dilemma discussed there, especially after he is outed as a police officer, hence treated by classmates as 'establishment spy'. Meanwhile on community policing center duty, West takes watchful youngsters seriously and befriends hunky mounted police officer, Isaac Young. After the adventure with a drug cartel, Chen resolves to become UC.—KGF Vissers"], "genres": "N/A", "imdbID": "13433312", "rating": 6.7, "votes": 1932, "number_of_episodes": 144}