{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0621788": "Niecy Nash", "0265670": "Frankie Faison", "1928172": "Kat Foster", "0813101": "Felix Solis", "0807351": "Arjay Smith", "3713971": "Yuriy Sardarov", "4441529": "Elizabeth Grullon", "8176857": "Keith Machekanyanga", "0400194": "Brent Huff", "0304599": "Leif Gantvoort", "0659143": "Sam Pancake", "0241539": "Jacy King", "0664499": "Adrian Pasdar", "0821344": "Steve Stafford", "0634323": "Matt Nolan", "6816275": "Christopher Wolfe", "6185588": "Spencer Ward", "1132465": "Carolyn Hollingsworth"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team, alongside the LA division of the FBI, is in a race to stop truck bombs. The joint task force is suspicious of the CIA's involvement.", "The team tried to locate a terrorist planning several,attacks. When they stop his latest one, they try to locate him they go to the C.I.A. Cause they suspect he has ties to them. The man they talk to says he knows nothing but he meets with someone whom he tells to handle it. Tim calls someone he knows who works for the C.I.A. But before she could say anything she's picked up but they get her back and she tells them that the C..I.A. ran an op wherein they recruited foreigners whom the man they are looking for is. They learn he was caught by his country and imprisoned ans abandoned by the CIA and is looking for revenge only against whom and what's his next target. Simone Clark an eager FBI cadet who was brought in to help decides to ignore orders and goes after the man herself.—Rcs0411@yahoo.com", "The LAPD Mid-Wilshire station and LA Division of the FBI race to stop bombs that have been scattered throughout the city on board separate vans from the same delivery firm. Deducing that the targets are main freeways, Clarke and Nolan take one, stopping one of the trucks and narrowly sideswipe it just before a freeway bridge. Grey and FBI agent Garza mount an FBI chopper to get an overview from there, while Bradford and Chen and cavalcades of LAPD and FBI manage to stop the remaining vans- only one still detonates, killing 17 people. At the LA CIA station, its chief, Bill August, tells Garza and Grey he can't help with the theory of rogue CIA agents, only promises to look into the classified file on Gurin, but also warns his men. Bradford and Nolan meet Tim's former associate Kate Hill, now in the CIA, who quickly shut them down, but the LAPD turns the tables. Hill reveals that \"Enervo\" was a black Ops plan to destabilize foreign cities, headed by August and the lead perpetrator being Gurin, code for Ilya Shokorov. Clarke and Zeke identify a Russian chocolate bar Gurin had. She meets and fights him near the aquarium till Nolan arrives. They track Shokorov into the aquarium, where he explains his acts of terrorism are revenge for August deserting his crew and leaving them for dead. August's men arrive and flee outside, shooting as the LAPD and FBI arrive to arrest them.—KGF Vissers"], "genres": "N/A", "imdbID": "18555908", "rating": 6.1, "votes": 1555, "number_of_episodes": 144}