{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0807351": "Arjay Smith", "4461705": "McCarrie McCausland", "0050584": "Alimi Ballard", "1312073": "Billy Lush", "2263793": "Jay Hunter", "0403096": "Chuma Gault", "2344587": "Toni Ann De Noble", "6687295": "Ronak Gandhi", "0402358": "Brad Hunt", "0701818": "Wayne Pére", "3784878": "Scott Deckert", "3606607": "Edward Gelhaus", "4354950": "Nicole Fong", "8922093": "Nate Gray", "4603479": "Randy Gonzalez", "4180584": "Ryker Baloun"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["John Nolan and Lucy Chen must fulfill three quests if they want to get a stolen police helicopter back safely from a teenage thief; Nyla Harper and Aaron Thorson must guard a convicted cop killer in the hospital following a prison riot.", "A Young man claiming to be the son of a cop goes inside the station and takes their helicopter. Nolan who talked with him offers to Try to talk him down but he wont land unless Nolan does what he asks him to do. He asks Nolan to arrest some PEople. The kid claims hes out to get the ones who gave a friend drugs. But When they check him out things don't add up. They think there's more going on but he wont landfill they do what he says. Ti is told That a small time criminal he knows was arrested with items That were stolen in a robbery wherein some PEople were killed. He tells them That he had nothing to do with it. So they check it out and learn hes lying and That there's another job So they have to Find out where it is. Thorsen and Harper are assigned to watch over a convicted cop killer who was sent to the hospital because he was Injured a riot. He asks Thorsen to talk to him and he claims That he was unfairly convicted. Thorsen asks Wesley and James to meet the man and they think hes telling the truth but Harper warns Thorsen he could get In trouble pursuing this.—Rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "16994466", "rating": 7.2, "votes": 1142, "number_of_episodes": 144}