{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0322182": "Matthew Glave", "2253954": "Steve Kazee", "7491262": "Dylan Conrique", "0807351": "Arjay Smith", "4306292": "Kanoa Goo", "0005067": "Tamala Jones", "0139936": "Ever Carradine", "6420873": "Rome Flynn", "0808606": "Jamil Walker Smith", "2063276": "Flula Borg", "1042946": "Michael Patrick McGill", "4879443": "Dylan Saunders", "3966113": "Gustavo Gomez", "0426300": "Taneka Johnson", "2289663": "Andrew Staton", "1565203": "Devon Michaels", "11052628": "Benjamin Sanchez", "9780347": "Seth Fuentes"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team must rely on a criminal for his expertise to take down a bigger threat. Officers Chen and Bradford investigate a murder of a homeless teenager.", "Nolan believing that Bailey's ex framed her he offers to prove it. They go to see Oscar for info on how he did it. He tells them he could've gotten help from a lonely woman who wrote to him when he was in prison, looking for a relationship. They go see her and convince him of his duplicity and she gives them evidence that proves he's involved with criminals. Harper Trieste help James with the drug dealer whose hounding him. She gets injured and goes to the hospital and is given life changing news. Chen still tries to help the young man she arrested avoid being convicted of a felony by talking to the D.A. She and Bradford are called by Lopez to a crime scene where in a young girls body is found. Lopez tells them that Tamara knows her so they talk to her who tells them she lost contact so they investigate. Thor den is being hounded by his mom to do a reality show to fix his image.—Rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "16594480", "rating": 7.6, "votes": 1120, "number_of_episodes": 144}