{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0873998": "Michael Trucco", "1720134": "Angel Parker", "4306292": "Kanoa Goo", "1998498": "Helena Mattsson", "0198450": "Jane Daly", "0263881": "Kayla Ewell", "2565039": "Jessika Van", "3994981": "Patrick Cage", "0502986": "Page Leong", "0400194": "Brent Huff", "9069699": "Carsyn Rose", "0947459": "Paul Yen", "0366509": "Roxanne Hart", "6643369": "Pauline Dyer", "1067251": "Johnny Pacar", "3502799": "Crystal Coney", "0696402": "David Preston", "0606574": "Grinnell Morris", "5243917": "John Wusah", "3043674": "Erica Pitts", "0392703": "Hugh B. Holub", "4584319": "Chen Chen Julian", "6509232": "Max Hawksford", "11043743": "Michael Vargas"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Sgt. Grey supports Officer's Nolan to become a training officer and rides with him to help him prepare for the exam. Tim and Lucy decide on their plans for Mother's day and a romantic vacation.", "Grey supports Nolan's desire to become a training officer, given his ideally combined qualities, but duly warns for retaliation from the union President after standing up to him earlier, who indeed sabotages his exam by scheduling a mandatory posting at a new station the same day: two years delay. They respond to a call at a film set, where method acting star Sabrina Fowler explains that underling Monica Ditmar attempted to steal something from her and cause d a mess on set, so they call a search. Bradford and Chen search for a parking valet escaping in a Porsche with car and keys of rich people, while Lopez and Wesley's mother are among victims of a robbery at an expensive mother's day dinner. Tim, Lopez, Harper and Chen find both crimes were planned and executed by a couple, who post some social revenge message. Grey and Nolan clear an apartment and the surrounding areas to set up a boundary for gang informant Daniel Tran, who turned witness but didn't realize the strictness of the protection program. DA Sean Delmonte reluctantly allows Tran to visit his mother, Nolan and Grey find him at her stud farm and must take out two goons sent to kill Tran, who escapes sneakily followed by a third, whom Nolan manages to disarm him to save Tran. Bradford and Chen trail the robber couple Monica and Jonah Cahill to a church, where they force forward their own wedding, but Monica spots them, triggering a shootout. Jonah is shot and injured, while Monica escapes; Jonah is transferred to a surgery, Lopez lures Monica to another patient's room before arresting her. Evers decides to transfer to a regular position at the DA's office after his mother suggests it's the only chance to help present clients to fairer trials.—KGF Vissers"], "genres": "N/A", "imdbID": "18555910", "rating": 7.4, "votes": 1053, "number_of_episodes": 144}