{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1998498": "Helena Mattsson", "4306292": "Kanoa Goo", "0279209": "Patrick Fischler", "0248698": "James Eckhouse", "0196325": "Federico Dordei", "0667350": "Jay Paulson", "1603142": "Eugene Kim", "0111179": "Ivar Brogger", "4209486": "Sara Amini", "0400194": "Brent Huff", "2263793": "Jay Hunter", "3502799": "Crystal Coney", "7316175": "Paula Alvarez", "7471466": "Jared Morgan", "0950104": "Tanya Young", "1796104": "Jan M. Janssen", "5100354": "Blake Webb", "5512378": "Amber Stonebraker", "6056424": "Mike Milian"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team responds to the report of a severed hand that has washed up on the beach. Tim attempts to prove his isn't a control freak to Lucy and invites her on a double date.", "Nolan's election as the station's union representative and intent to accomplish actual changes meet grim hostility from union president Lt. Landon Briggs. Tim and Chen discover a severed hand on the beach, which belonged to Mark Klinke, who got himself to a hospital before dying. He worked for a biotech company, where head Devin Swaine proves reluctant to reveal any further information due to confidentiality. His lawyer desperately seeks exclusive access to culprit Chester Frey's house, which Lopez denies. Frey had obtained multiple human arms to test if they could be healed and animated. Bradford and Chen ambush and arrest him in the morgue. Grey accompanies 'carabiniere' (Italian paramilitary police) detective Romeo Cabarelli hunting down wanted mobster Kai Zullo; however, upon them finding Zullo, Cabarelli fires on him without signs of him pulling a gun. Grey learns Cabarelli is under investigation for misconduct in Italy. Grey, Nolan and Harper trick him into a staged arrest of Zullo, leading to exposed Cabarelli's own arrest.—KGF Vissers"], "genres": "N/A", "imdbID": "16899090", "rating": 7.3, "votes": 1120, "number_of_episodes": 144}