{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0203457": "Pete Davidson", "0876138": "Alan Tudyk", "8337399": "Tru Valentino", "7491262": "Dylan Conrique", "4725564": "Meg DeLacy", "4988352": "Stephanie Arcila", "1635108": "David Meunier", "0254862": "Greg Ellis", "0685755": "John Paul Pitoc", "0400194": "Brent Huff", "0094636": "Michelle C. Bonilla", "0749081": "Sara Rue", "2586351": "Tommy Kijas", "4488868": "Alex Barone", "1675098": "KB Holland", "6347323": "Yuli Zorrilla", "0280214": "Dennis Fitzgerald", "3185337": "Michelle Jubilee Gonzalez", "5113082": "Tony Graham", "1874027": "Panuvat Anthony Nanakornpanom", "3834853": "Gian Shaw", "0797075": "Ray Siegle", "3849403": "Eric Watson"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officer Nolan is forced to spend a week in solitary confinement in a quiet border town with a young local officer who is in need of some training; Sgt. Bradford and Officer Chen go under cover together in a possible drug trafficking case.", "Nolan is sent to a small border as part of his punishment from the union president for going behind his back. Bailey accompanies him as does Elroy Basso and Nell Forrester. When he meets the town's only officer he tries to give her what wisdom he can bestow. He also runs into his brother who is on a road trip with his girlfriend. When Tamra buys a car Tim and Lucy discover there are drugs in it. They try to find the previous owner and are shocked to discover that he looks like Tim. When the guy tells them what he knows. They decide to send Tim undercover. After meeting the one behind it. Tim needs to stay under a while longer and Lucy joins him. Nolan arrests a criminal who tells him to let him go. And his people show up trying to convince Nolan to let him go by offering money and threatening him. He doesn't budge but knows he's going to be on his own.—Rcs0411@yahoo.com", "Nolan and Bailey travel to tiny, sleepy border town Frontera, where he is to spend his \"day in the hole\" assessing/instructing local cop trainee Gabrielle Navar. Their calls are limited, Nolan says she does OK, until a roadside pull-over almost leads to a shootout, when she didn't evaluate the risks properly. Blair Darvill, the arrested man, demands to let him go before his gang gets suspicious, but Nolan refuses. Its leader arrives and tries in vain to bribe Nolan, so the gang shoots up the station-diner in an attempt to retrieve Darvill. Making a stand at the diner slash 'police station' with Navar and Ellroy, Nell Forester's boyfriend and Nolan's forensic cleaner friend who came along, they defeat the gang and have the survivors arrested as the CHP arrives. In Los Angeles, Tim and Chen investigate the discovery of drugs in Tamara's new car, which actually belonged to Jake Butler, a doppelganger of Bradford, so he reluctantly agrees to impersonate him undercover to Butler's boss, drug lord Roy Hajek, who gives him another mission. Surprisingly, Butler's girlfriend is a doppelganger of Chen, who must join Tim Bradford undercover, struggling to make an authentic backstory and awkwardly practice kissing, just when Tamara arrives. Harper gets Grey to arrange her stay on as a detective after her parental leave, and a new training officer for Thorsen.—KGF Vissers"], "genres": "N/A", "imdbID": "18555914", "rating": 6.9, "votes": 1659, "number_of_episodes": 144}