{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0648846": "Peter Onorati", "8337399": "Tru Valentino", "0348231": "Sean Gunn", "0121805": "Michael Reilly Burke", "1998498": "Helena Mattsson", "0827561": "Maury Sterling", "0804471": "Jon Sklaroff", "5828411": "Roland Buck III", "1564087": "Jenna Dewan", "5402595": "Keylor Leigh", "0176861": "Keith Coogan", "0452572": "Carol Kiernan", "4121885": "Shaun Bedgood", "5264429": "Nash Carter", "0436751": "Matt Kaminsky", "3700572": "Ashley Antonio"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan and team are on a hunt to retrieve a buried stash of gold before any treasure seekers get hurt. Meanwhile, Bradford is tasked with encouraging the oldest cop at the station to retire and invites him to ride with him.", "Bradford is tasked by Grey with the worst kind of sergeant's job: talking veteran officer Jerry McGrady into retiring,but instead of being blunt takes his old mate McGrady with him on patrol, reminiscing and preparing a fine send-off. Grey admires Nolan, Chen and Harper cleverly investigating a treasure hunt for a gold loot from a jewelry heist, based on a cryptic poem which Nolan and Harper found with a suspect. Bradford and McGrady join the hunt on a wager to find it first, as McGrady rightly links evidence from an old case. They gradually decipher the poetic clues, finding civilian gold-diggers who get as far causing havoc and harming each-other. Nolan, Harper and Chen track the clues to an old abandoned 1920s subway, and are forced to tackle two men who end up in a brawl. McGrady's daughter Ashley hints to Bradford that she's interested in him. Nolan, Bailey and Lopez continue the investigation into the previously mentioned inter-state serial killer, who Nolan suspects to be Bailey's superior, fire lieutenant Fred Mitchell, having discovers acetone similar to the one used by the killer in his garage as he hosts a barbecue, and Bailey gets caught searching his house illegally. Just as the police arrive with a search warrant, the house explodes.—KGF Vissers"], "genres": "N/A", "imdbID": "15743812", "rating": 8.3, "votes": 1369, "number_of_episodes": 144}