{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1065454": "Tricia Helfer", "7491262": "Dylan Conrique", "8337399": "Tru Valentino", "5132341": "Marisela Zumbado", "1564087": "Jenna Dewan", "3194961": "Sushana Watkis", "7329793": "Christine Rose Schermerhorn", "8532186": "Joanne Nguyen", "1035414": "Chris Gann", "5719590": "Candido Carter"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan and Officer Chen's run-in with an infamous thief tips them off to a potentially big heist surrounding the Getty's big gala event. Meanwhile, Nolan works up the courage to ask Bailey out on date.", "Nolan and Chen pull over a woman for speeding who they learn is a thief who has pulled off some major jobs but has never been arrested. So they decide to keep an eye on her to find out what her target is. Bradford is promoted to sergeant. Sgt. Grey decides to try and teach him he needs to be more of a leader, but Bradford's old instincts surface. Harper learns her new partner is a rookie who was accused but acquitted of murder; she's predisposed to give him the boot but he's determined to prove himself worthy. Angela and Wesley find having a baby harder than they thought. Nolan runs into Bailey and asks her out but things don't turn out so well.—Rcs0411@yahoo.com", "Tim Bradford is no longer instructor, finally promoted to Sergeant, and learns that job from Wade Grey, for one leading the roll call. Nolan and Chen pull over never convicted master thief Claire Ivey for speeding, and she gives them a clue for an upcoming robbery. The department stake out Ivy and her crew, managing to prevent the robbery by disguising themselves as the targeted convoy. Nolan gets the nerve to ask Bailey out for a date, to which she agrees, but after a night together, she initially breaks up with him. Afterwards he manages to convince her that she can change and try out a first relationship. New rookie Aaron Thorsen is assigned to Harper, who is convinced Thorsen doesn't have what it takes to become a cop, as he is suffering from memories of his trial for having allegedly murdered his roommate in Paris. However, Thorsen proves courageously motivated to become a cop, convincing Harper to deserve a fair go.—KGF Vissers"], "genres": "N/A", "imdbID": "15174052", "rating": 7.6, "votes": 1329, "number_of_episodes": 144}