{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4306292": "Kanoa Goo", "0873998": "Michael Trucco", "6420873": "Rome Flynn", "0821817": "Josh Stamberg", "0400194": "Brent Huff", "4872557": "Paul Castro Jr.", "0379066": "Karl Herlinger", "1495204": "Brian Maillard", "1685477": "Michelle Lee", "3502799": "Crystal Coney", "0134137": "Johnny Cannizzaro", "5202715": "Nikki Castillo", "3960085": "Brie Eley", "5207662": "Kati Salowsky", "2852678": "Derek Smith", "5230093": "Greg Berman", "13533627": "Forest Meadows"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Harper puts Thorsen through \"Plain Clothes Day,\" but the exercise is interrupted by an unexpected visitor. Meanwhile, two witnesses for an upcoming grand jury case are murdered, and Sgt. Grey might be next on the list.", "Thorsen's Plain-Clothes Day gets tough as his mother's film crew following them, also bumping into and must arrest for attacking police the father of Patrick Hayes, the friend whom he was accused of having killed, but they decides to let him go in a matter of hours. As Grey heads to court to testify against a powerful mobster, leaving Tim in charge. While Nolan mans reception, 'helped' by lazy Smitty, the man he ordered back in line is found dead on a chair, actually poisoned, while a woman is killed in a drive-by - both are witnesses in the same case. Grey is shot and wounded by a female assassin, whom he manages to wound and ultimately kill in return. In a raid, the LAPD uncovers burned documents pointing to attorney Kellen Myers, who sold the names of the witnesses and the prosecutors to Mateo Rubio for cash. Myers also reveals that Assistant District Attorney Sean Delmonte is on the hit list. Delmonte and Chris Sanford manage to avoid a second assassin upon his arrival and hold out until Bradford, Lucy and other officers arrive and apprehend him. Grey contemplates retirement when he awakes in the hospital and soul searches seeking advice from Nolan, returning the favor Grey did him after Nolan's first on-the-job kill.—KGF Vissers"], "genres": "N/A", "imdbID": "18275828", "rating": 7.8, "votes": 1110, "number_of_episodes": 144}