{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1564087": "Jenna Dewan", "1564963": "Brandon Jay McLaren", "0827561": "Maury Sterling", "0428426": "John Marshall Jones", "0910376": "Susan Walters", "1178940": "Benita Krista Nall", "0263040": "Mary Beth Evans", "2436687": "Allie Gonino", "1188294": "Billy Miller", "9322387": "Kevin Holloway-Harris", "7214293": "Stephen Joseph"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Chen and Officer Bradford demand a treasure hunt rematch and enlist Officer Grey to help set the terms to a new bet, all while they arrest a series of wealthy female criminals.", "In the aftermath of Fred's house explosion, Officer Nolan and Bailey discover there's more to Fred's death than meets the eye. Meanwhile, Officer Chen and Officer Bradford demand a treasure hunt rematch and enlist Officer Grey to help set the terms to a new bet, all while they arrest a series of wealthy female criminals. Elsewhere, Wesley struggles to keep it together under the pressure of his debt to Elijah.", "Severely injured in an explosion, Bailey is needing crutches. Nolan, Lopez and Harper reopen the serial arson investigation after a colleague of Bailey reveals that Fred was in the Nevada hospital during the murders, concluding the real killer tried to frame him. As Tim Bradford and Chen investigate several cases of alleged illegal substances used in makeup and skin cream, one of the rivals reveals the other's plans to have her husband killed by a hitman, so wired Tim goes in undercover as a hitman and arrests her. Nolan is captured by the real killer, revealed to be Fred's neighbor, Marcus, who forces Nolan to a cat-and-mouse chase in an abandoned silo complex, eventually escaping and running Marcus over, arresting him in the process. Evers reluctantly discredits a witness for Elijah Stone, but having suffered an absurd near-beating from Elijah, due to an asinine lack of communication, Wesley finally confides in Lopez.—KGF Vissers"], "genres": "N/A", "imdbID": "15798054", "rating": 7.8, "votes": 1193, "number_of_episodes": 144}