{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "7491262": "Dylan Conrique", "0807351": "Arjay Smith", "4306292": "Kanoa Goo", "0768620": "Raphael Sbarge", "0944143": "Amanda Wyss", "0654369": "Geoffrey Owens", "1225406": "Colin Ford", "1755731": "Deidrie Henry", "11688452": "Julian Obradors", "0324788": "Siena Goines", "1132876": "Judith Moreland", "0271134": "Yan Feldman", "3703126": "Christopher Bencomo", "2732922": "Emily Alabi", "12576681": "Honey Robinson", "3502799": "Crystal Coney", "5330683": "Elizabeth Haley", "5065974": "Alexis Victoria Bloom"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer John Nolan and the team feel they must negotiate with a distraught man who is holding a hospital hostage to ensure his wife receives a lifesaving surgery.", "Nolan arrives before his fire lover on the scene of a car accident whose lone occupant suffered catastrophic injuries, so talks with the mother till she dies and is found an organ donor, so Nolan accompanies her ambulance to hospital, where Tim meet , the teenager is already being prepped to receive the victim's heart saving her life. Things start going wrong at the hospital as Jonah Russell hacks the system to put his dying wife Meredith first on the list for a transplant. Officers can't talk him and his wife out of their plan, so despite instituting contingency plans, patients start dying and the hospital agrees to give the heart to the wife. Nolan must arrest the teen's father attacking Jonah and the transplant team, but the teen gets the wife to change her mind. When arrested Jonah tries to release the hospital, his ransom-ware partners still demand money, but IT and Tim's team find and arrest the pair.. Harper and lover are at the same hospital due to potential pregnancy complications, asked to mind pre-teen Rory Kane, she resorts to her badge to prevent his parents taking the boy home for 'prayer healing' and learn from Grey he was actually abducted at age three, born Scott Reynolds. Lucy is scheduled to give a deposition about her kidnapping for additional charges against Rosalind Dyer, watches the video of her barrel ordeal and decides not to testify in the case, but happily encourages Tamara Colins to flirt with handsome, also eco-minded legal intern Austin Geoffrey.—KGF Vissers"], "genres": "N/A", "imdbID": "18555878", "rating": 7.1, "votes": 1150, "number_of_episodes": 144}