{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0621788": "Niecy Nash", "0265670": "Frankie Faison", "1928172": "Kat Foster", "0813101": "Felix Solis", "3713971": "Yuriy Sardarov", "0343325": "Arye Gross", "8176857": "Keith Machekanyanga", "4145209": "Garrett Coffey", "3820328": "Amanda Suk", "0531762": "James MacDonald", "0316344": "David Gianopoulos", "1896018": "Brian Oblak", "1894575": "Andre Boyer", "13604788": "Ken Patterson", "6185588": "Spencer Ward", "0634323": "Matt Nolan", "9850411": "Jeff Coppage"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan and the LA division of the FBI enlist the help of FBI trainee Simone Clark when one of her former students is suspected of terrorism following an explosion at a local power station.", "Nolan and Chen respond to a call about a suspicious person when they arrive they find a bomb. When the FBI learns of it they show up and takeover when they get a fingerprint which they identify the suspect they learn an FBI cadet, Simon Clark whom they bring over. She adamantly proclaims their suspect is not a terrorist, they don't agree with her. Nolan thinks she knows her stuff so she brings her along to find him which they do. When they question him he says some guy asked him to make detonators. While the Feds take over, they think they know what the next target is and find him there and as he escapes. They learn he took explosives. Diaz and Harper answer a call from a guy who says someone broke in to his house and attacked him and took something. He says his attacker is an alien. When they talk to him they don't make a connection but Clark who's watching suggests a different approach and she gets him to say that her attacker is the same one the Feds are looking for.—Rcs0411@yahoo.com", "Responding to a call of a suspicious person near a power station, Nolan and Chen realize last-minute there's a a bomb and escape before it detonates. The FBI's Los Angeles division is called in when it is suspected that the bomber belongs to a terrorist cell. Learning the suspect, Zeke Freemont, has a connection to FBI trainee Simone Clark, his former school counselor and mentor, they call her in to assist. Her rejection of the FBI profile is soon dismissed, as she is from the task-force, but Nolan teams up, encouraging her to stand up for herself, finding common grounds as she is now the oldest trainees at Quantico. Lead agent Matt Garza calls her back to question Freemont, who only wants to speak to her. He reveals that he built bombs for the bomber, assuming it was just an experiment. Lopez and Harper investigate a supposed break in at LSD experiment-affected, aliens-obsessed professor Meadows's house, and with Clarke's help, discover that it was the same suspect as with the bombing, identified as Trevor Gurin, with a classified connection to Groom Lake: area 51. Garza takes Clarke on to his team. Through map evidence at the suspect' house and the code-word \"Enervo\", they deduce that Gurin was former military. He steals further bombs from the National Guard's weapon storage, planning to take down the city's infrastructure, starting with the roads: the professor's expertise.—KGF Vissers"], "genres": "N/A", "imdbID": "18555886", "rating": 6.1, "votes": 1736, "number_of_episodes": 144}