{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0203457": "Pete Davidson", "7491262": "Dylan Conrique", "2222175": "Enver Gjokaj", "4725564": "Meg DeLacy", "0006970": "Patricia Belcher", "1525011": "Shalim Ortiz", "0862328": "T.J. Thyne", "1422552": "Adam Korson", "1993113": "Emily Chang", "9032557": "Ayi", "3502799": "Crystal Coney", "9069699": "Carsyn Rose", "0220635": "Debi Derryberry", "9772956": "Asher Morrissette", "2944298": "Lisa Dobbyn", "13081312": "Seren Merrill", "1797023": "Mateo Mpinduzi-Mott", "1568438": "Derrick Aguis", "4586267": "Rachel Gelfeld", "5298300": "Xochitl Duran", "1421422": "Amon Platis", "5804939": "Selina Hui", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["When a new designer drug hits LA streets, it turns users into \"zombies,\" and Officer Nolan and the team have a Halloween they won't soon forget. Back at home, Lucy questions whether her apartment building might be haunted.", "Its Halloween, Nolan's half brother Pete comes for a visit. Later Petes girlfriend calls Nolan telling him why Pete is there. Chen learns one of her neighbors hired some people to exorcise her apartment. The neighbor claims they are scamming her. Chen tells Angela about them and she meets with them and she thinks they are sincere but crazy. She talks to the neighbor, who refuses to press charges. Cause she feels the spirit is gone and says the building* is haunted. Which she tells Chen who doesn't believe it. But learns her Building has an eerie history. Chen learns her mom has made a life decision for her. When people start behaving erratically, they suspect a designer drug. When they get a lead. Nolan turns to Pete, a recovering addict for help in finding the dealer. Harper goes trick or treating with her daughter and her ex.—Rcs0411@yahoo.com", "In the Halloween, Pete unexpectedly arrives at Nolan's house and soon he learns that Chastity is pregnant, and his half-brother is fleeing from his responsibilities. Chen is informed that her middle-aged neighbor hired a couple of con-artists to cleanse her apartment from spirits since she believes the building is haunted and she asks for Lopez to help her in the investigation. While patrolling the streets, Chen and Nolan see people running from a zombie and soon they learn that there is a new drug on the streets that melts the brain of the user. The police departments use Pete to help them to find the dealer. Harper and Donovan spend the Halloween night with Lila with an unexpected end. In the Halloween, anything can happen.—Claudio Carvalho, Rio de Janeiro, Brazil", "On Halloween, Nolan and Harper detain a crazed person in an L.A. park, which looks like a zombie attack, till they learn at the hospital that the woman took the extreme drug Bomb-X. Chen tries to rescue neighbor Mrs. Crouch, whom two ghost hunters charge more than she can afford for an exorcism. Lopez is handed the case, but the victim decides to drop the case. Lopez finds the building haunted. Chen and Tamara investigate the alleged ghosts that the ghost hunters mentioned, only to discover another neighbor being attacked by a stalker, whom Chen manages to stop. Bradford encounters another person affected by Bomb-X, so he and Nolan make Nolan's junkie half brother Pete wear a wire to buy the drug so they can catch the supplier.—KGF Vissers"], "genres": "N/A", "imdbID": "15575390", "rating": 7.7, "votes": 1297, "number_of_episodes": 144}