{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1564087": "Jenna Dewan", "8337399": "Tru Valentino", "1564963": "Brandon Jay McLaren", "0807351": "Arjay Smith", "1828818": "Christian Keyes", "0760254": "Jeffrey D. Sams", "0400194": "Brent Huff", "2529790": "Shane Coffey", "2263793": "Jay Hunter", "3381677": "Jonah Wharton", "0302968": "Randy Vasquez", "1748600": "Zarah Mahler", "0691205": "Ashley Holliday Tavares", "1845903": "Vince Reign", "11557204": "Omar Cook", "5582459": "Jaylen Davis"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan and Chen report to a structure fire and suspect that there is more to the situation than meets the eye. Meanwhile, after witnessing a sniper shooting, the team searches for the shooter.", "Officer Nolan and officer Chen report to a structure fire and suspect that there is more to the situation than meets the eye. Meanwhile, after witnessing a sniper shooting, the team searches for the shooter and discovers that the perpetrator has a connection to one of their own.", "Responding to a house fire with Chen, Nolan rescues a man trapped inside, rebuked by his fire-woman lover due to the inhalation risk. The LAFD discovers a corpse inside, which an autopsy reveals killed before the fire occurred. On a break, Nolan, Bradford, Chen, Harper and Webb witness a sniper shooting at a private escort vehicle., who escapes; Harper and Thorsen discover he has military experience. Nolan and Chen investigate a suspect pool and question Aidan Merritt, who briefly holds them hostage in his own home before Nolan subdues him. Caught in debt to crime boss Elijah Stone after Lopez's rescue in Guatemala, Wesley must work for him, risking his bar career. Stone first assigns him to defend Merritt, with a test. Investigating the fire and the suspect pool inspires realizing multiple similar fires occurred in Nevada, suggesting it's a serial killer.—KGF Vissers"], "genres": "N/A", "imdbID": "15485460", "rating": 7.7, "votes": 1174, "number_of_episodes": 144}