{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1564087": "Jenna Dewan", "8337399": "Tru Valentino", "1564963": "Brandon Jay McLaren", "0209850": "Kamar de los Reyes", "0498046": "Reggie Lee", "3077071": "Kathryn Prescott", "0400194": "Brent Huff", "3381677": "Jonah Wharton", "0282649": "Dave Florek", "8921894": "Carson Fagerbakke", "3603663": "Mackenzie Marsh", "1634949": "Gene Farber", "3706350": "Rey Borge", "1128410": "Joe Peracchio", "10445498": "Shey Bogumil", "11557204": "Omar Cook", "5582459": "Jaylen Davis", "1077299": "Kevin Mangold"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan and Officer Chen search for a missing person who may have international ties that puts everyone's lives in danger; Harper continues the search for a serial arsonist; Wesley must overcome an impossible task.", "Angela goes back to work and is given a menial assignment. Nolan encounters some men who says that the wife of one of them ran off because she's mentally disturbed, Nolan tries to find her and when he does , the men show up and start shooting at him. They go back to the house and surmise that the house is safe house for spies, they suspect are Russian.it isn't long till the Feds and CIA agent show up and tells them to back off. But they learn a few things which makes them investigate. Thorsen runs into an old friend who asks him to go out with her. Harper tells him to be weary cause not too many believed him to be innocent. Harper gives Angela a case about a man who was ran over and then abducted. Wesley continues to be under Elijah's thumb. Chen tries to be friendly with Thorsen.—Rcs0411@yahoo.com", "Nolan investigates an alleged home dispute where Linda Charles has escaped from her husband's house. Nolan later finds her walking in an alley, disoriented and speaking a foreign language. The husband and his assistant arrive and rather then let the police investigate pull guns on them. All three of them are later revealed by CIA Mike Weston and his FBI partner to be Russian agents, with Linda Charles, born Katerina Antonov, having gone rogue. Harper and Thorsen investigate a hit and run where the biker was taken away by the driver. As Harper tracks the stolen car to a warehouse, where she finds the victim knocked unconscious, the warehouse is caught ablaze, but she escapes with the victim. Nolan and Bailey discover a chip that Antonov lost in his patrol car, only for her to hold Bailey hostage. They break up the fight until the FBI arrest Antonov. Just back on the job, Lopez finds the warehouse fire was caused by the same assailant from the previous episode. Drug baron Elijah Stone has Aidan Merritt killed, as a last warning after Evers fails to get him released.—KGF Vissers"], "genres": "N/A", "imdbID": "15533040", "rating": 7.8, "votes": 1201, "number_of_episodes": 144}