{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "2063276": "Flula Borg", "7491262": "Dylan Conrique", "0263881": "Kayla Ewell", "0101152": "John Ross Bowie", "4508906": "Meera Rohit Kumbhani", "3330483": "Rebekah Graf", "0400194": "Brent Huff", "0808606": "Jamil Walker Smith", "1423270": "Erin Cummings", "0138371": "Tonantzin Carmelo", "0159017": "Alexandra Bokyun Chun", "0217936": "David DeLuise", "1570123": "Stephanie Czajkowski", "0170909": "Aaron Coleman", "0280173": "Annie Fitzgerald", "0429348": "Tilky Jones", "3824861": "Nick Bender", "1662118": "Josh Latzer"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nolan and Harper help Skip Tracer Randy complete his first bounty. Officer Chen and Sergeant Bradford hunt for a perpetrator on a citywide crime spree.", "*German, ever-excited 'Rainman' Skip Tracer Randy turned bounty-hunter and arrives at the station to meet Nolan and Harper about his first bounty: notorious society madam Ivy Flynn, whom he sets out to capture, teaming up with them as soon as he learns police doesn't share in the bounty. She gets away during their sting operation, while rival bounty hunter Alicia Kaufman, Randy's rudely non-reciprocal lover, was about to apprehend Flynn, sparking arguments between the four. A vice investigator tells Nolan and Harper that Flynn was involved in prosecution in addition to her own business, clashing with dangerous thugs, the biker gang Dead Bastards even invested in her nest capital. At a hotel, they ambush and arrest Flynn but thugs attack them, Kaufman snatches away fleeing Flynn for the bounty, but Nolan saves them when ambushed in the parking garage and learns a rivalry twist in his own living-room. Lopez gets Grey to recommend Wesley as 'legal advisor' in a TV lawyer series, but the Method actress lead Sabrina Fowler (playing Margo Caine)'s uncontrollable behavior keeps putting him on edge. Bradford and Chen look for restaurant worker Jordan Conner, who unleashed rats in the restaurant where she worked after getting fired and throwing a Molotov cocktail into a man's car. She had cancer before learning about unhoped remission and describes her own actions as 'creating karma' against various people who disowned her when all seemed hopeless, unrepentant at arrest. After questioning Tim what to do, Chen tries to find her biological father and learns from aunt Amy that he was a patient that her 'faultless' mother had an illegal affair with.—KGF Vissers"], "genres": "N/A", "imdbID": "17521328", "rating": 6.8, "votes": 1261, "number_of_episodes": 144}