{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "0345477": "Camille Guaty", "0209850": "Kamar de los Reyes", "0001717": "Kyle Secor", "6552877": "Gigi Zumbado", "1564963": "Brandon Jay McLaren", "1015516": "Onahoua Rodriguez", "2262592": "Elena Campbell-Martinez", "0539651": "Joshua Malina", "4750149": "Jose Velazquez", "4773250": "Tiago Roberts", "1517335": "Chuck Ashworth", "11557204": "Omar Cook", "5582459": "Jaylen Davis", "0346144": "Chavo Guerrero Jr."}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Nolan and the entire team race against the clock to locate Lopez after she is kidnapped on her wedding day, not only to save her life but her unborn child's.", "With Angela missing. All of her friends try to find her. They learn La Fiera abducted her and had Jackson killed. They learn that La Fiera took her to Guatemala where she plans to take her baby. They turn to black ops man Max for help.who gets them there .While grey and Chen try to find the one who killed Jackson.—Rcs0411@yahoo.com", "While Nolan reports Lopez's kidnapping and mobilizes his colleagues, security video shows West was killed in an attempt to save her. Grey and Evers seek the help of the DEA, but special agent Sam Taggart is bound by the political ramifications as LaFiera's gang took her pregnant hostage to a Guatemalan stronghold. Nolan, Bradford and Harper enlist -by implicit blackmail- Max, who gives them a helicopter and arms to rescue Lopez. Evers receives crucial information from amused criminal Elijah Stone, promising future favors before travelling there himself to make a deal with La Fiera, who threatens to kill Lopez once 'her' baby is born. Nolan and the others resort to their backup plan, as he impersonates a billionaire's development manager and fakes a fire alert to steal the plans of the stronghold. Evers is separated from Lopez as she is brought to the hospital in a staged labor. Bradford and Harper ambush La Fiera at the hospital and save Lopez, who kills La Fiera as they're about to escape in the helicopter. Nolan saves Evers from the remaining goons. Three months later, Lopez has given birth to her and Evers's son, who they name Jackson in honor of West.—KGF Vissers"], "genres": "N/A", "imdbID": "14661428", "rating": 7.5, "votes": 1851, "number_of_episodes": 144}