{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0807351": "Arjay Smith", "0362862": "Mark Harelik", "1192060": "Drew Seeley", "3837944": "Brandon Larracuente", "4138624": "Ian Owens", "2263793": "Jay Hunter", "0400194": "Brent Huff", "12342339": "Nik Sanchez", "9069699": "Carsyn Rose", "0750037": "Olesya Rulin", "0701457": "Shawn Pyfrom", "0342399": "Greg Grunberg", "0363954": "Herbert Russell", "2754988": "Thomasina Gross"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Robbery of a train filled with valuable auction items turns deadly, the team is called to investigate.", "The robbery of a freight train filled with valuable auction items turns deadly, and the team is called to investigate. Officer Chen has doubts about being Sergeant Bradford's aide and is upset when he doesn't give her the recognition she deserves. Officer Harper takes matters into her own hands and makes a life-changing decision about her personal life.—Tawrens", "Harper decides to propose to James while he accepts that he has mix feelings. Thorsen rides with Bradford and tries to show him how good he is but it doesn't always work out. Chen rides with Nolan and expresses her displeasure at Bradford because he doesn't give her credit for her work. They get a call from a rail yard and meet the railroad police officer Larry Macer, the rookie LAPD cop who got kicked out after a single day for accidentally discharging his weapon. While there Larry's coworker encounters someone who shoots him. The man gets away. They learn he broke into a shipping container containing the seized items of a fraudulent financier, and that only a single low value item was taken. They find the shooter, who is dead, and learn he has ties to the financier. Larry thinks he knows why they took the item.—Rcs0411@yahoo.com", "Nolan and Chen investigate, jointly with former pissing pole Larry \"The Badger\" Macer, who is now working for the railway police, the robbery of a cargo train, where only a vase was stolen from a freight car belonging to millionaire William Bloomfield. Implying Lopez and Harper, they learn that Bloomfield's cellmate, Brian Shab, stole the vase, but is later found dead in his home by the broken pieces. Bloomfield himself points from jail to his ingrate children: Francis, Danielle and Zachary. Larry realizes the missing piece of the vase had an offshore bank account number on it, probably the motive. Returning to the train yard after a burning car on the tracks is called in, Nolan, Chen and Larry find the children fighting over the money, Danielle and Zachary pointing to Francis as the killer. Thorsen struggles to find his \"superpower\" while patrolling with Bradford. But after talking down a man on parole from visiting his child, Bradford notes that experience as silver spoon and from being in jail, enable Aaron to empathize with people who experienced the same. Harper proposes to James, who is uncertain afterwards due to how suddenly she did it. In the end, they agree to marry and the wedding is attended to by family and friends.—KGF Vissers"], "genres": "N/A", "imdbID": "18555882", "rating": 7.5, "votes": 1102, "number_of_episodes": 144}