{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "1564087": "Jenna Dewan", "1564963": "Brandon Jay McLaren", "2222175": "Enver Gjokaj", "7491262": "Dylan Conrique", "0514228": "Peyton List", "6552877": "Gigi Zumbado", "0401799": "Mary-Margaret Humes", "2253954": "Steve Kazee", "3513898": "Zayne Emory", "0400194": "Brent Huff", "0001664": "James Remar", "7214293": "Stephen Joseph", "8492018": "Noel Savoy", "11557204": "Omar Cook", "5582459": "Jaylen Davis", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Wesley finally manages to break free of his dirty contract. Nolan deals with an increasingly serious relationship and underhanded election techniques. Bradford learns some unpleasant things about his parents.", "Off duty, Tim Bradford and Chen help his sister Jenny refurbishing their childhood home. Tim stumbles upon a gun in a wall, and investigates. The gun was probably used by Bradford's dodgy father Tom in a botched home invasion 25 years ago. Tom had an affair with the neighbor's wife, who later confessed to having shot her husband 'in self-defense', which Tom helped her cover it up. Bradford visits his father on his death bed to learn the truth, but still doesn't make up. Grey initiates Evers' wiretapping operation, but his cover is blown by drug baron Elijah Stone, who threatens Evers' family. Next Stone and his crew are attacked by a rival gang, which Stone reveals to be led by La Fiera's former security enforcer Abril Rodas, who warns Lopez not to hunt her down. Nolan finally presents Bailey to his son Henry and considers proposing to her, which Henry approves of. Suddenly, a man walks up to the lovers in a restaurant, revealing himself to be Bailey's husband.—KGF Vissers"], "genres": "N/A", "imdbID": "16256694", "rating": 7.8, "votes": 1139, "number_of_episodes": 144}