{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0807351": "Arjay Smith", "4306292": "Kanoa Goo", "0873998": "Michael Trucco", "0514228": "Peyton List", "0460990": "Lily Knight", "2031749": "Fiona Rene", "0400194": "Brent Huff", "2457450": "Jesse Luken", "2335463": "Danny Vasquez", "4090175": "Chelsea Alden", "3795134": "Noah Baron", "9875427": "Laith Wallschleger", "3960963": "Chris Grant Wenchell", "2804267": "Altin Axel", "4103215": "Dion LaMarr Harvey", "4961628": "Moses Munoz", "2692989": "Hymnson Chan", "14607207": "Davis Yasuda"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer John Nolan is moving closer to his new role as a training officer. Meanwhile, Lucy's successful undercover assignment earns her an invitation for specialized training in Sacramento.", "Assistant DA Chris Sanford recovers from his injuries. Lucy hesitates to go to undercover school, despite encouragement. Playing his golden ticket, Nolan passes his TO exam, is scheduled to attend a certification course and allowed to be Aaron's TO as a trial run. Responding to a welfare check they discover a deputy sheriff's corpse. Tim's ensuing investigation finds that the deputy and a group of his colleagues worked undercover against drug dealers, but kept cash and sold drugs they confiscated, proven by the killed deputy's recordings of his interactions with corrupt colleagues. Harper is home and due to give birth, but becomes suspicious of her and James' neighbors. Once gun shots are heard, Smitty investigates, but doesn't find any evidence. Harper later reports to Grey the neighbors putting a corpse in a car trunk. The night she is due to give birth, the neighbors break into her house and one of them figures James just as Grey arrives. Harper tackles the second man on her own and delivers a girl. Aaron assures insecure TO Nolan that his tactic was beneficial and instructive.—KGF Vissers"], "genres": "N/A", "imdbID": "21346132", "rating": 7.5, "votes": 1185, "number_of_episodes": 144}