{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "2125623": "Bridget Regan", "7491262": "Dylan Conrique", "1130496": "Alysia Reiner", "0553468": "Benito Martinez", "1404034": "Assaf Cohen", "0327063": "Nick Gomez", "3981496": "Josh Brodis", "2089891": "Ian Stanley", "1476559": "Alan Heitz", "4579261": "Christine Uhebe", "6995042": "Bryan Jordan", "9263426": "Jesus Trujillo", "14521434": "Adiya Gauge", "14095617": "Danny Bias"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer John Nolan and Bailey search for a mystery gunman after a shooting hits a little too close to home; Aaron struggles to live within his means; Wesley suspects that a judge is taking bribes.", "Officer John Nolan and Bailey are on the hunt for a mystery gunman after a shooting hits a little too close to home. Meanwhile, Aaron struggles to live within his means and joins Lucy to help Tamara when the mother of a child she babysits goes missing. Elsewhere, Wesley suspects that a judge is taking bribes after he excludes valuable eyewitness testimony from a case.", "Tim starts work with Metro and experiences some initial setbacks during military style training, but eventually proves himself showing backbone and is welcomed to his team. Bailey gets shot at in her ambulance, the start of a rage killing spree of firefighters and EMT workers till Nolan finds and arrests the perpetrator: a fired firefighter. Wesley absurdly loses a routine preliminary decision related to Elijah, convincing him that the judge working the case must be corrupted, so he confronts the judge, who hints at the truth but dies mysteriously. Wesley warns opponent Monica that Elijah may target her next. Tamara does multiple jobs to move out of Lucy's place to give her and Tim privacy. She reports parents at her babysitting gig act strangely, so the police investigate the mother's kidnapping due to the father's illegal activity. Tim participates in the rescue as part of Metro. Nolan keeps receiving calls from his crook mother, who wants to be paid for staying away from his wedding. Looking away from her tricks, until finally learning that she was hospitalized and later died.—KGF Vissers"], "genres": "N/A", "imdbID": "26231950", "rating": 7.5, "votes": 903, "number_of_episodes": 144}