{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "4306292": "Kanoa Goo", "0715915": "Jed Rees", "0266611": "Mark Famiglietti", "0710417": "Tim Ransom", "1705050": "Leonora Pitts", "2083743": "Lak Rana", "6087036": "Sharmita Bhattacharya", "1190376": "Anthony Molinari", "6006096": "Judith Foster Thompson", "7930774": "Garland Scott", "14043451": "Jemi Smith", "15210009": "Stephon Alonzo Candia"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["Officers John Nolan and Celina Juarez are in a race against time to stop the source of an explosive rampage.", "Nolan and Celina attempt to stop speeding driver Pam Winfield, who wears a collar around her neck, told it explodes if she stops. The police guide Pam to a secure spot for the bomb squad to attempts handling the collar, but the bomb goes off, killing her, actually on a timer. Tim and Lucy discover the next driver Creighton Mitchell, also with a collar around his neck, who panics, grabs some garden shears and manages to get the collar off, then identifies the assailant as Richard Dormer, a colleague at an oil company both marks work for. Richard's motives stems from his sister Susan dying in captivity abroad and the company unsuccessfully negotiated her release. Nolan, Celina, Harper, Lopez and Aaron arrest Richard at his home without resistance. His last target is the company CEO Henry Parsons, who must live-stream an apology. The police evacuate the company building and Nolan works to disarm Henry's collar to Richard's instructions while Henry complies, but Celina senses that Richard wants to see him dead despite the apology; so Nolan cuts the other cable, fortunately. Chris proposing house hunting to Lucy takes her aback and she struggles sorting out her feelings for him and Tim, who duly questions her and plead honesty. Thorsen asks to join Harper and Lopez, desiring to become a detective. They give him an old case to 'solve' by asking only five questions.—KGF Vissers"], "genres": "N/A", "imdbID": "23624880", "rating": 7.8, "votes": 1036, "number_of_episodes": 144}