{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "0807351": "Arjay Smith", "1130496": "Alysia Reiner", "0287168": "Marlene Forte", "0694100": "Drew Powell", "4518293": "Brandon Black", "0001021": "Veronica Cartwright", "0400194": "Brent Huff", "0566406": "Kevin McCorkle", "1813689": "Joel Steingold", "6125709": "Shea Buckner", "14500998": "Zander Hawley", "5832496": "Jordan Gagne", "14500999": "Cameron Lee", "14501000": "Andrew Pham", "11428929": "Bennett Emery", "2406530": "Devin McGee", "5706082": "Adrienne Lewis", "2308010": "Keilan Matthews", "0762121": "Gloria Sandoval", "13765780": "Ellia Rae Love", "5199296": "Alex Mauga"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["In the midst of a heatwave and a citywide blackout, Nolan and Aaron follow increasingly large leads after they discover criminals hiding at the station.", "In the midst of a heatwave and a citywide blackout, Officer John Nolan and Aaron follow increasingly large leads after they discover criminals hiding at the station. While on duty, Officer Chen makes an alarming discovery after being called to a scene where a pungent smell has wreaked havoc. Meanwhile, Lucy and Harper scheme to get Tim out of his new job and into a more exciting position.", "A heat wave is causing rolling blackouts across the city. Nolan's trainee Celina misses a question from Sgt. Grey, causing him to be her partner for the day, indirectly testing Nolan as TO. They foil a robbery in progress, Grey exceptionally puts the rookie on command post duty. She is overwhelmed, but learns as meant to ask for help, which she does when she can't get contact her claustrophobic mother. When the backup generator at the station fails to come on, Nolan and Aaron discover two fake cops trying to break a friend out of jail, who rat on a ghost gun seller, which Lopez takes down in an undercover operation, then rolls on a fentanyl dealer processing raw product in a home. Surveillance shows there to be a child in the building. Celina is exposed while rescuing her, but resuscitated by Narcan. Cued by Harper, Lucy gathers a group to brainstorm -many colleagues came to Nolan's anyway, as his backup generator offers air conditioning- to plot which dominoes to put in motion to get Tim transferred to Metro, back in action, where he belongs.—KGF Vissers"], "genres": "N/A", "imdbID": "25994806", "rating": 7.9, "votes": 1029, "number_of_episodes": 144}