{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "1998498": "Helena Mattsson", "0692419": "Rose Portillo", "5041191": "Julio Macias", "4763365": "Cristian Gonzalez", "2057036": "Shiloh Fernandez", "0121652": "David Burke", "0400194": "Brent Huff", "7050290": "Marnee Carpenter", "9790748": "Cody John", "1796104": "Jan M. Janssen", "3378752": "Roy Williams Jr.", "11045897": "Sashleigha Hightower", "3598524": "Maurice Hall", "9009551": "Xavier Jimenez", "7272844": "Alan Pontes", "2030554": "David Piggott", "6749577": "Anthony Darrell"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["John and Celina are on the hunt for a fugitive after a car incident goes awry. Lucy helps Tim in his time of need.", "Bailey treats a man injured in an accident and brings him to the hospital when they arrive she leaves the ambulance. The man wakes up and attacks the one watching him. She reveals she noticed the man was shot. It is discovered he committed a crime and was shot. He ran into the hospital so everyone shows up to find him. Tim collapses and is brought to the same hospital. He is told a bullet that's still in him is moving so he needs to be operated. Lucy is worried. West goes to visit Tim but he collapses too and is confined. So this means the station is in the hands of Smitty so West tells Lucy to go back and make the place doesn't fall apart. When Angela's mother is injured she's brought to the same hospital. Angela thinks something's off her mother tells her she was attacked and the attacker said it's because of her son. So Angela gathers her three brothers and interrogates them to find why their mother was attacked and it doesn't help she has issues with her brothers.—rcs0411@yahoo.com", "Nolan and Celina respond to a car accident, but the driver escapes from the ambulance upon arriving at the hospital. He's identified as Rob Lukasey, who burgled a house and was shot in self defense. The huge hospital is put on lock-down as Rob tries to self-medicate, disguises himself as a medical officer and next a doctor before taking Celina hostage, but she sneakily subdues him with morphine under the guise of treating his injuries. While helping at the hospital, Tim is hospitalized with after effects of an old bullet wound, which is threatening his spine. He has emergency surgery after escaping Rob roughed Tim up and successfully recovers, but his girlfriend Ashley breaks up, unable to deal with cop risk recalling her late father. Grey is hospitalized for food poisoning at a restaurant with colleagues, leaving in charge of the station seniority-entitled acting sergeant Smitty and appointed Lucy, who ultimately keeps everything running although down on half normal staff numbers. Angela Lopez's mother Emilia faints having reached her door and explains that she was attacked by someone claiming that one of her sons should be cautious. Harper takes the case, and Angie calls in her three brothers living in LA. None admits any involvement, but Angie and Harper discovers that the priest, Damian, cheated with the wife of a former gang member working at his church, while Benny has $100,000 loan shark debt after a failed stock investment, so they go arrest the loan shark and his enforcer goon for attacking the mother.—KGF Vissers"], "genres": "N/A", "imdbID": "22442706", "rating": 7.6, "votes": 1058, "number_of_episodes": 144}