{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "1225628": "Kelly Clarkson", "4438177": "Lisseth Chavez", "2125623": "Bridget Regan", "7491262": "Dylan Conrique", "0322182": "Matthew Glave", "1564963": "Brandon Jay McLaren", "0703939": "Molly C. Quinn", "1017524": "Audrey Marie Anderson", "2750563": "Luke Jones", "0832989": "Michael Stoyanov", "9495985": "Austin Woods", "0028879": "Todd Eric Andrews", "2252589": "Curtis Nelson II", "2939740": "Marvin Telp", "2668785": "Ryan Windish", "0077074": "Jesse Bernstein", "3278108": "Morgana Wise", "10316227": "Victor Carrera", "14427463": "Tyler H Connor", "5582459": "Jaylen Davis"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nolan and Celina must stand guard at a hospital after a dangerous prisoner needs surgery; Aaron, Lopez and Harper look into a string of robberies.", "Officer John Nolan and Celina are enlisted to stand guard at a hospital after a dangerous prisoner must have surgery and they suspect there's more to it than meets the eye. Meanwhile, Aaron gets Lopez and Harper to help him investigate a string of home robberies, and Tim and Lucy consider how their new secret relationship will affect their work. Elsewhere, Lopez gets unexpected news.", "Nolan and Celina have their hands full to protect the ever-manipulative Oscar Hutchinson on prison leave to donate a kidney to his estranged daughter, constantly attempting to delay the procedure so he can stay out of prison longer, from attempts on his life by his past victims. Tim and Lucy struggle to keep their budding romance from interfering with their work, especially when they're assigned to ride together for a single day, until a transfer opportunity arises for each. Ultimately Tim decides to accept a transfer to a desk job, no more patrols. Lopez has a tense exchange with Harper while helping Aaron investigate serial home robberies involving one of Elijah's associates before apologizing invoking the stress of her unexpected pregnancy. Tim, Nolan, Celina and Lucy end a plot to block Oscar's surgeon from performing his surgery.—KGF Vissers"], "genres": "N/A", "imdbID": "25374832", "rating": 7.8, "votes": 1027, "number_of_episodes": 144}