{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "1564963": "Brandon Jay McLaren", "0514228": "Peyton List", "5041191": "Julio Macias", "0298221": "Drew Fuller", "3112508": "Amanda Leighton", "0816185": "Dan Southworth", "1542212": "Aaron Behr", "8675809": "Al-Teron", "0022374": "Harvey J. Alperin", "1789162": "Samantha Futerman", "5580591": "Jason David", "8420743": "Landon Gordon", "8788404": "Zach Chyz", "0011386": "Tacey Adams", "5195131": "Germain Arroyo", "4643289": "Jon Snow", "5505923": "Dan Lippert", "1248567": "Jessica Lancaster", "5927882": "Vince Yap", "9045302": "Nathan People", "14030984": "Chelsea Moser"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team ends up in a gang war while Lucy investigates a domestic abuse case.", "Tim must step in as baseball coach as his sister's son Tyler's walks out of the looser bunch, and gets help from Lucy as his instructor toughness doesn't kick in with minors. Lopez's brother Damian asks her to look for a kid gone missing from his local shelter. She and Harper learn that he, Matteo, was involved with the gang Quinlan Rights. They, Nolan and Celina search an abandoned building were Matteo's phone last pinged, discovering his corpse packed liked a cocoon along with other bodies. While Moses Warden, Quinlan's rival, denies any wrongdoing. Just then, Quinlan's men come shoot up the workshop. The gang's informant Ricky reveals that Elijah Stone told him to inform the police about a drug bust, effectively orchestrating the gang war in order to clear his name. Hosting the Citizen Academy at the station, Lucy suspects attendees Kyra Cook is facing domestic abuse after she raises a question about it. Lucy convinces her to go to a shelter, but Kyra leaves after an incident with staff, calling again when she again faces abuse from her 'boyfriend' Oliver. Lucy arrives at their house and fights Oliver and arrests him, but Kyra holds her at gunpoint. Lucy manages to talk her down before arresting her as well.—KGF Vissers"], "genres": "N/A", "imdbID": "24249890", "rating": 7.5, "votes": 929, "number_of_episodes": 144}