{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "2063276": "Flula Borg", "2125623": "Bridget Regan", "1597260": "Mircea Monroe", "7491262": "Dylan Conrique", "0081827": "Casey Biggs", "0546671": "Lesli Margherita", "5944803": "Alison Thornton", "0444749": "Brandon Keener", "0400194": "Brent Huff", "0019169": "Juan Alfonso", "8186095": "Sean Anthony Baker", "0740264": "Michael Rooker", "1796104": "Jan M. Janssen", "13837115": "John 'Jack' Doerer III", "3130214": "Dave Reaves"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Tim Bradford's ex-wife returns and asks the team to help her save someone from her undercover past. Isabel's return also creates additional pressure in Lucy and Tim's relationship as they assist in the search.", "Tim's ex Isabel asks him to help find missing Dara Tesca, whom she looked after during a past assignment. They and Lucy find Dara fled home, hiding in a motel Isabel used to bring her to for safety. Upon securing Dara, Isabel and Lucy must reveal their real identities to help her escape hitman sent by her uncle Ed to murder her father, who had her uncle killed, and Isabel promises to stay in touch. Grey assigned Aaron to assist Lopez during her day due to her second pregnancy, but lets her stay at home until the birth. Harper and Nolan assist skip tracer Randy, who stumbles upon a corpse after breaking in. The victim trolled people online, which Randy was asked to investigate. His constant interference with their investigation forces them to take him along, but at bay. Randy deduces that a friend with prior history cryptically threatens him through emojis and plans to row him up in order for Nolan and Harper to arrest him. Bailey's friend from college, Libby, is crashing with them and is dragging her around L.A., attempting to relive their college days and avoid her own problems, culminating in a meet-up with an untrustworthy man leading to Bailey's arrest after a fight with the man who runs away. Libby decides to return home after accusing Bailey of being an alcoholic, to continue avoiding both her problems and taking responsibility.—KGF Vissers"], "genres": "N/A", "imdbID": "27235310", "rating": 7.2, "votes": 934, "number_of_episodes": 144}