{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0004726": "Lance Bass", "4438177": "Lisseth Chavez", "0005020": "Josh Hopkins", "7434050": "Cameron Cowperthwaite", "1149075": "Alexi Hawley", "0003115": "Christine Lakin", "2676231": "Adam Karst", "6637451": "Carmireli Rodriguez", "2786023": "Nalini Sharma", "1022263": "Karen Strassman", "1796104": "Jan M. Janssen", "0364864": "Jodi Harris", "1411619": "Craig Johnson", "5000232": "Selwyn Huqueriza"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["When Dim goes missing, Officer Chen and Sergeant Bradford, along with the CIA, set out to find him and enlist the help of Juicy.", "Tim's Doppelgänger \"Dim\" is released from prison and with Lucy's \"Juicy\" Doppelgänger they begin to scam the rich until Dim disappears, through the lens of a documentary, the protagonists tell the story of how they found these Doppelgängers and the investigation of Dim's disappearance, which turns out to be quite weird.—Cesar Augusto Rosenow", "(The story is told as an in-work documentary, with character interviews interspersing the action) Tim Bradford's look-alike Jake 'Dim' Butler is out of prison, so on a new crime spree he and his girlfriend Sava plan to take jobs such as handyman or nanny for a rich and/or famous family, then steal from the family. After an initial score on Lance Bass, they move on to the Boudelaire family with a stash of very expensive, often illegal antiquities in a secret room. Jake goes missing and is later found dead, like the family's nanny in their garden house. One of their previous handymen admits he accidentally killed the nanny. Sava receives threats from Turkish dealer, who the CIA had connected with an Iranian weapons deal. A video from Jake and Sava's stolen car leads the police to her friend Lisa Miller, who had an affair with Jake and took a historic gun from the Boudelaires to kill him. Nolan is shot during her arrest, but saved by his bullet-proof vest.—KGF Vissers"], "genres": "N/A", "imdbID": "26936066", "rating": 4.6, "votes": 1849, "number_of_episodes": 144}