{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "1429380": "Britt Robertson", "0813101": "Felix Solis", "4306292": "Kanoa Goo", "7491262": "Dylan Conrique", "4438177": "Lisseth Chavez", "0400194": "Brent Huff", "9859979": "Ayaamii Sledge", "6101717": "Julian Zane", "3338719": "Kunal Shetty", "0447981": "Danielle Kennedy", "1383226": "Katie Foster", "1796104": "Jan M. Janssen", "11059536": "Brett Metter"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer John Nolan is assigned his first rookie, Officer Celina Juarez, whose unconventional approach to police work poses a unique challenge for him.", "A month later, Nolan has completed his TO certification, Lucy her undercover course and Harper maternity leave. Nolan is assigned as rookie impulsive, superstitious Celina Juarez, making a rocky start after a traffic stop gone awry: the vehicle contains a blood stained carpet, but since she obtained it in an illegal search, it's inadmissible in court. The carpet is also linked to the disappearance of Jill Baskin, Harper's case. Together with Lopez, they all follow Jill's suspected abductor Tyler Harvin undercover, but he escapes. Looking through evidence, Celina dreams where Jill could possibly be held. Nolan gives her a chance after updating their working relationship based on open communication, and the two search a property in the woods, where they find Jill. Celina pursues Tyler alone and would be killed in a fight with him hand't Nolan located her and arrested Tyler. Patrolling solo, Lucy gets locked inside an old warehouse while conducting a welfare check, has an epiphany after looking through a document from the 'Dye Hards' online group Chris joined looking into Rosalind Dyer. After Tim smells a rat and finds her, she and Chris approach the FBI with the suspicion of Rosalind being a user in the group, which trails to an address in Seattle, where a joint team with local police finds a blood written message from Rosalind on a wall saying \"Better luck next time\".—KGF Vissers"], "genres": "N/A", "imdbID": "21346140", "rating": 7.4, "votes": 1091, "number_of_episodes": 144}