{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "1429380": "Britt Robertson", "0813101": "Felix Solis", "0954225": "Kevin Zegers", "4438177": "Lisseth Chavez", "2125623": "Bridget Regan", "1564963": "Brandon Jay McLaren", "1024264": "Julie Ann Emery", "6552877": "Gigi Zumbado", "0186761": "Ellen Crawford", "3040388": "Drew Rausch", "2336481": "Mike Capozzi", "5107477": "Nisalda Gonzalez", "1384118": "David Bianchi", "1698761": "Daeg Faerch", "2654185": "Tony Wade", "1372074": "Oren Skoog", "4459654": "Omar Nazel", "14564624": "Daivd St. Pierre", "14564625": "Daniel J. Gilbert", "6760066": "Matthew Dion", "0267894": "Freddie Joe Farnsworth", "2007868": "Aulsondro Novelist Hamilton", "4422347": "Marco Vazzano"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["With help from the FBI, Lopez puts everything on the line to help Elijah Stone take down a gang leader in exchange for her safety; Nolan and Bailey must deal with the secrets and shady dealings his late mother left behind.", "Nolan and Bailey travel to Nolan's late mother's now-vacant home in Foxburg, Pennsylvania, to deal with the -cheapest- funeral and inheritance, but mainly various secrets and shady dealings she left behind, including contraband, her regular accomplice masquerading as John Nolan, a foreclosed mortgage and her latest scams, deviously linked with drug dealers who send armed goons; they must coordinate with sheriff Steve McNeese, having no jurisdiction. Lopez's LAPD and Matthew Garza's FBI team in a task force put everything on the line to help Elijah Stone take down La Fiera's heiress Abril Rodas in exchange for Lopez's safety as part of an elaborate operation, with Wesley informally offering Abril a similar deal. Garza's team moves to use Abril's girlfriend Daylin as bait for Elijah. But the night he arrives to have Abril shot, he withdraws last minute mistrusting a unintended distraction caused by Aaron. Secretly, Elijah offers Abril to work with him.—KGF Vissers"], "genres": "N/A", "imdbID": "26542368", "rating": 7.6, "votes": 1023, "number_of_episodes": 144}