{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "1311488": "Jake Tapper", "14212778": "Jack Tapper", "4438177": "Lisseth Chavez", "2125623": "Bridget Regan", "0873998": "Michael Trucco", "4306292": "Kanoa Goo", "0807351": "Arjay Smith", "1564963": "Brandon Jay McLaren", "0724124": "J. August Richards", "9069699": "Carsyn Rose", "6838027": "Deyo Forteza", "6836195": "Kasey Landoll", "1391090": "Walter Perez", "3445312": "Luciana Faulhaber", "5129979": "Maggie Carney"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nolan and Celina investigate a cash deposit linked to an old DEA case; Wesley grows increasingly concerned about his deposition and is shocked when he realizes Elijah's attorney is a familiar face.", "Officer John Nolan and a sleep-deprived Celina investigate a cash deposit linked to an old DEA case. Meanwhile, Wesley grows increasingly concerned about his deposition and is shocked when he realizes Elijah's attorney is a familiar face from his past.—mikkiparker", "Nolan and Juarez respond to call from a bank about questionable money being deposited, they talk to the person was depositing it and let her go. Later they find money being burned in a dumpster and determine it and the money they encountered earlier are the same. They discover the money was being used in an undercover DEA op and that the agent who had the money disappeared. So his partner shows up wanting to find out what happened. Wesley learns that Elijah's trial is about to begin and he has to testify and he learns that an old girlfriend is Elijah's lawyer and during deposition she rattles him. When Tim misplaces his radio, Lucy gets it and decides to have fun with him.—Rcs0411@yahoo.com", "Nolan and Celina respond to a cash dispute at a bank, which turns out burned following a robbery. Superstitious Celina fears that the money is cursed after Macy Tompkins, whom they met at the bank, is found dead in a luxury flat after Harper and Lopez launched an investigation in cooperation with the DEA because the money once belonged to drug smuggler Winslow Harris. Celina has a vision of Winslow departing by boat, which the DEA agent confirms from his older cases, so he, Nolan and Celina apprehend Winslow at the marina, who explains having killed the agent's partner by accident. Helping a movie director loading props despite his back-rehab, Bradford forgets his police radio in the both, which the director returns it to Lucy, but she puts Tim and Aaron out on a hunt for it to places from their past before returning it, hoping to help him move on after Ashley. Proceeding with the case against Elijah Stone under his DA boss Sean Delmonte, Wesley is surprised to find his ex-girlfriend Monica is Elijah's defense attorney, trying to portray him and the LAPD as incompetent, deliberately making it personal for Wesley. Despite his warning that Elijah is manipulative, she blackmails Delmonte into dropping the case. Elijah later warns Wesley outside the office that he hasn't seen the last of him yet.—KGF Vissers"], "genres": "N/A", "imdbID": "22505048", "rating": 7.2, "votes": 1032, "number_of_episodes": 144}