{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "4306292": "Kanoa Goo", "1720134": "Angel Parker", "0514228": "Peyton List", "1372721": "Matthew Alan", "9070920": "Jade Payton", "8300011": "Troy Leigh-Anne Johnson", "7770979": "Kayli Tran", "0129551": "Wilmer Calderon", "1679591": "Shelli Boone", "5997474": "Michael Lawson", "2484632": "Jennifer C. Holmes", "0271134": "Yan Feldman", "5082721": "Chris Wu", "0924854": "Harrison White", "10207701": "Dave Kumar", "3502799": "Crystal Coney", "10978660": "Brian D. Cohen", "1861772": "Monica Estrada", "5945694": "Monique Schwaneman", "10994135": "Áine O'Neill", "7280433": "Ricardo Félix Rojas", "10260181": "Tom Sons", "12638762": "Aly Fabrizio", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nolan and the team investigate the death of a suspect in police custody; Grey and his wife go to New York to visit their daughter, only to realize she never made it home from the night before.", "Officer John Nolan and the team investigate the unexpected death of a suspect in police custody. Their search also uncovers a very delicate loose end that could jeopardize Officer Celina Juarez's career. Meanwhile, Sergeant Grey and his wife, Luna, go to New York to visit their daughter, Dominique, only to realize she never made it home.", "Nolan helps Tim's sister Genny recover her lucky-charm bracelet, thrown away by her son Tyler, furious at her divorce. Tim is acting station sergeant while Grey and his wife Luna visit their teen daughter Dominique in New York but become concerned when she does not meet them and contact the NYPD, who advise that it is too soon to worry. They learn from her room-mate that Dominique switched major and made some possibly dubious new friends. They trace her movements to a Uber driver who appears helpful but Grey spots his taxi has a broken tail-light, a trick he taught Dominique. They follow him and rescue her from her abductors. Celina fights and apprehends bank robber Ryan Davis, who is placed in a cell, where he gets injured beaten by other prisoners, later dies in hospital of a ruptured spleen. There is an investigation to determine who caused his death. Nolan supports her and is union rep during questioning by Wesley and Chris. Autopsy and camera footage prove her innocence. Lucy anxiously rehearses scenarios with Aaron for her break-up with unsuspecting Chris, but when the time comes blurts out Tim's blunt advice asking Chris to \"hand in his playbook\".—KGF Vissers"], "genres": "N/A", "imdbID": "23624890", "rating": 7.6, "votes": 1017, "number_of_episodes": 144}