{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "1564963": "Brandon Jay McLaren", "0005283": "Jacqueline Obradors", "3100064": "Brigitte Kali Canales", "8513764": "Nicole Chanel Williams", "9664223": "Elijah M. Cooper", "1224863": "Jean Paul San Pedro", "0113158": "Brianna Brown", "2642874": "Cherinda Kincherlow", "1796104": "Jan M. Janssen", "7469254": "Brandon McShane", "5696945": "Lewie Bartone", "2279777": "Willis Chung", "2589966": "E.R. Ruiz", "1478537": "Emanuel Loarca", "14214773": "Ana Esperanza Dominguez", "6234459": "Jorga Caye"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Nolan and Celina witness a shooting and realize the victim was already dead; Bailey has been feeling off-center since the proposal, leaving Nolan to wonder what he can do to make her feel more comfortable.", "Officer John Nolan and Celina witness a shooting, realize the victim was already dead, and investigate further. Back at home, Bailey has been feeling off-center ever since the proposal, leaving Nolan to wonder what he can do to make her feel more comfortable. Elsewhere, Lopez and Harper enlist Lucy's help to investigate the gang-related murder of a local shopkeeper.", "Nolan and Celina investigate the murder of doctor Alvin Mitchelsen, who was shot by a former patient, but was first fatally stabbed, but medical examination later adds that he was already fatally poisoned. His former patient shot Alvin for mistreating her father's drugs, while his wife reveals his heart problems before his death, but is found by Nolan and Celina to have actually killed him with poison for life insurance expecting him to be caught with an illegal opioid prescriptions trade. Aaron and Bradford respond to a noise complaint, so Aaron connects with black knave Tabin Cordon, as turns out the brother of Vina Cordon, a member of the female gang Double R, arrogantly led by Shana Quelli, who Harper, Lopez and Lucy investigate for a murder. Lucy connects undercover with Shana, while Tabin is temporarily reunited with his sister. During debt collecting, Shana alludes to Vina having murdered the victim Harper and Lopez were investigating, so Vina ends up arrested at home, in front of Tabin, who feels used. Mobster Elijah Stone launches a lawsuit against Wesley, the LAPD, Lopez, Nolan, Grey and Harper for freeing Lopez from La Fiera and files a restraining order against Wesley who is forced to apologize and plead a second chance for ex-client Elijah in front of the press.—KGF Vissers"], "genres": "N/A", "imdbID": "22753260", "rating": 7.3, "votes": 991, "number_of_episodes": 144}