{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0621788": "Niecy Nash", "4438177": "Lisseth Chavez", "1344966": "Ben Levin", "0323067": "Bob Glouberman", "0400194": "Brent Huff", "6225953": "Nick Alvarez", "1556548": "Rebecca Metz", "8135862": "David J. Castillo", "0740264": "Michael Rooker", "1796104": "Jan M. Janssen", "6306242": "Andrew Tippie", "3430603": "Bries Vannon", "3276257": "Danielle Juliet Ma", "2266358": "Palma Lawrence Reed"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Officer Chen goes undercover to infiltrate an illegal firearm operation, and Detective Harper and Officer Nolan work together to solve a mystery involving severed limbs found around the city.", "Nolan, Harper and Celina tackle a cold case favor involving a severed torso, searching wounds up a arm belonging to it and two friends of the victim. Video footage in their possession reveals that they accidentally shot their friend and cut his body up and hid the parts. Lucy goes undercover as a sales agent in order to gain Frank Tesca's interest following his release from prison. He asks her to take some under payment in favor for products from her company. Frank learns that his brother's crew is after him, while some of his own men also turned on him. After a drive-by shooting, he knows which associate was behind it, Lucy stops him from killing him as Tim's metro squad arrives. Frank concedes that he has lost control over his crew after his prison time and Lucy encourages him to reconcile with his daughter in Ohio. Wesley duly suspects pregnant Angela can't keep quiet without doing some police work 'behind his back'. Luckily Aaron is eager to assist her 'as educational practice' with detective work while she is at home, and questions a reluctant witness of a robbery, leading to a corpse in a vehicle with and a workshop with a decreased suspect. He solves the case and seven other tie-ins. Nolan duly points Celina to a foxy dog owner witness showing interest leading to a date.—KGF Vissers"], "genres": "N/A", "imdbID": "27235314", "rating": 7.5, "votes": 919, "number_of_episodes": 144}