{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "0621788": "Niecy Nash", "0504571": "James Lesure", "0807351": "Arjay Smith", "4438177": "Lisseth Chavez", "0893283": "Vincent Ventresca", "8173771": "Ashli Auguillard", "6673809": "Jojo Nwoko", "6357215": "Jack Mikesell", "1853494": "Kate Mines", "0566133": "Chuck McCollum", "6707479": "Alyssa Brayboy", "6170022": "Nick Ricciardi", "3278108": "Morgana Wise", "5263129": "Aaron LaPlante", "7575422": "J.E. Burton", "1796104": "Jan M. Janssen"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Detective Nyla Harper and James find themselves in the middle of a bank robbery which leads the entire team on a citywide manhunt. Meanwhile, Tim and Lucy finally go on their first date, but it does have a few complications.", "Tim and Lucy have their first 'regular' date, but must handle a dispute between a cook and chef. Grey warns against a relationship. At their bank teller, Harper and James land themselves in a middle of a heist committed by so-far bloodless serial robber Todd Shelf with three associates. Harper has an employee trigger the silent alarm, so police cars arrive. Todd escapes with Roger Armistead, but leaves him behind. The LAPD soon realizes this wasn't just for cash but something invaluable in a safe locker and collaborates with FBI agent Simone Clark and her superior/training FBI Special Agent Carter Hope. They track an unusual money wiring to Taylor Barnes, who reveals he hacked the FBI's undercover agents and informant list to sell to the highest bidder. Taylor is shot by a sniper before he can reveal the buyer. Tim, Lucy and reinforcements surround Roger taking a hostage in a neighborhood. Bradford distracts him and Roger is arrested. Todd's unidentified third associate, Amy Wright, escapes from ER and reunites with Todd. They push Tim and Aaron's patrol car nearly off a parking garage roof, but they narrowly get out. Shortly after, Nolan and Celina find Todd's corpse in the truck he and Amy stole.—KGF Vissers"], "genres": "N/A", "imdbID": "23624888", "rating": 7.3, "votes": 1147, "number_of_episodes": 144}