{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "4438177": "Lisseth Chavez", "0807351": "Arjay Smith", "1260407": "Felicia Day", "0772704": "Kyle Schmid", "1049386": "Kyle Davis", "3819588": "Preeti Desai", "2943385": "Augie Duke", "4816336": "Tom Plumley", "2904269": "Lee Simpson", "7322444": "Dani Bryan", "9477126": "Elaine Whae", "9864247": "Kondwani Phiri", "2075254": "Jeff Karr", "1051000": "Dartenea Bryant"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["The team must stop a militia from detonating a highly combustible truck in their possession. Meanwhile, Nolan, Thorson, Juarez, and Harper search for three men who may have been exposed to Ebola and detain them for quarantine.", "The team must stop a militia from detonating a highly combustible truck in their possession. Meanwhile, Officers Nolan, Thorson, Juarez, and Detective Harper search for three men who may have been exposed to Ebola and detain them for quarantine.", "The Mid-Wilshire station works with suburb Victorville PD detective Noah Foster to stop a militia group from using sarin gas in a terrorist attack in the city. When a militiaman is found dead due to the gas, his questioned sister plays dumb, but a tap on her phone reveals their target is Union Station. A road block with spike strips is set up while the truck with sarin gas is forced towards it, ordering the driver out for arrest. Bailey, Celina and Harper work with the CDC to secure and quarantine three men returning from Nigeria, suspected to be exposed to Ebola. Though all of them cooperate, the third forces an entire bus into quarantine due to potential exposure. Lucy finds animosity from Tim is due to him learning that she was behind his transfer to Metro without even informing him beforehand. Lopez and Wesley increase their residential security by hiring a foxy ex-CIA private security specialist and receive as Elijah Stone Valentine's Day gift dead roses crawling with insects.—KGF Vissers"], "genres": "N/A", "imdbID": "26678246", "rating": 7.3, "votes": 967, "number_of_episodes": 144}