{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "0935721": "Eric Winter", "8337399": "Tru Valentino", "1429380": "Britt Robertson", "0954225": "Kevin Zegers", "1156709": "Annie Wersching", "4438177": "Lisseth Chavez", "0215281": "Thomas Dekker", "0400194": "Brent Huff", "2421884": "Melissa Marty", "2633431": "Freya Adams", "6226214": "Julian Yuen", "1266276": "Paul Lacovara", "7211325": "Robyn Paigé"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["Rosalind returns with a vengeance and Bailey's life is left hanging in the balance. With a ticking clock, the LAPD and the FBI join forces.", "Responding to a supposed medical emergency, Bailey falls into a booby trap through the floor of an old house. During her more challenging joint rescue by the fire and police departments, Nolan receives a blackmail call from Rosalind to sneak off and meet her one last time, if he fails of tries anything, Bailey will die. The rescue team discover obstacles at every turn and the tank begins to fill up with water. Nolan leaves clues for his colleagues, but his trail ends being asked to drive a van to Rosalind's location. Harper, Lopez, Aaron, Laura Stensen and Brandon Acres from the LA FBI office, investigate a warehouse where Rosalind's henchman Jeffrey Boyle has stored materials for building booby traps for her victims. The former three spot and chase Jeffrey, who triggers explosives which detonate the warehouse. Luckily all of them get out in time. With notes of how the traps work, the rescue team disarms other traps while activating a last one before Bailey is recovered from the tank. Nolan arrives at Rosalind's meet up location to share a last supper before he is meant to kill her. Moral Nolan decides rather to bring her in, but a sniper fatally shoots her.—KGF Vissers"], "genres": "N/A", "imdbID": "22185408", "rating": 7.3, "votes": 1335, "number_of_episodes": 144}