{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "4438177": "Lisseth Chavez", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "8337399": "Tru Valentino", "0935721": "Eric Winter", "2125623": "Bridget Regan", "1720134": "Angel Parker", "2836740": "Danielle Campbell", "7491262": "Dylan Conrique", "0924552": "Brian White", "1287636": "Malcolm David Kelley", "0870701": "Saxon Trainor", "0400194": "Brent Huff", "2810287": "David Dastmalchian", "2335825": "Drea Castro", "9825902": "Joe Corzo", "15999064": "Valentine Cline Krayser", "12831387": "Nicholas Wagner"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["42"],  "plot": ["When a toddler is found at the scene of a crime, John and Bailey must decide what to do with it. Meanwhile, when someone from his past returns, Tim disappears and leaves Lucy in the dark.", "Tim calls off a date night with Lucy, to block former army friend Mark Greer's plan to murder assumed-dead Ray Watkins, who tried to have them bombed in Iraq. But their written lies to spare Ray's family is used against them, so after confronting Ray at his cancer-terminal mother's home, Tim vows to take all the heat alone if Ray ever strikes back, Mark ditches the plan shortly after. Nolan and Celina respond to a murder of a family, with only a toddler surviving and her mother, who later dies in hospital, so Nolan suggests he and Bailey could take care of the toddler until either relatives or a foster family is found. Bailey worries about taking care of the toddler due to past trauma looking after a neighbor's child. Investigating the family's death, Harper and Lopez learn from their tenant that a coworker of the father became vengeful over a lottery ticket. A shootout ensues at the coworker's residence before a swift arrest. As Aaron encounters therapist Blair at a bar, she seems flirtatious, but later denies it at a meeting. By the time Nolan is as ready as Bailey to adopt the family's toddler, her uncle arrives to take custody.—KGF Vissers"], "genres": "N/A", "imdbID": "31631160", "rating": 7.5, "votes": 793, "number_of_episodes": 144}