{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "4438177": "Lisseth Chavez", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "8337399": "Tru Valentino", "0935721": "Eric Winter", "0873998": "Michael Trucco", "7491262": "Dylan Conrique", "1885129": "Brooke Lyons", "2985178": "Kedrick Brown", "2753054": "Sammi-Jack Martincak", "0400194": "Brent Huff", "2424044": "Evan Gamble", "2201055": "Hayley McFarland", "1771714": "Ramon Fernandez", "1219164": "Sara Malal Rowe", "0004729": "Michael Beach", "2810287": "David Dastmalchian", "1796104": "Jan M. Janssen", "7866026": "Alexya Garcia"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["After fostering, Bailey pushes for a baby while John and Celina hunt a vengeful escapee.", "'Secrets and lies' Following their time as foster parents, Bailey has decided she wants to have a baby and forces John to reconsider their decision to not have children. Meanwhile, John and Celina discover a prison escapee whom they fear is out for revenge and race to find her before it is too late.—annaelisepensa", "After taking care of a child, Bailey wants to have one with John who's unsure if he wants to. When Tim continues his crusade to get the man who can ruin his life. Lucy tells Angela about Tim's peculiar behavior which makes her decide to tag along with him. While helping some convicts who are released to help clean an area where the homeless go to. Thorpe n discovers one of the homeless has in his possession an item that belongs to a girl who was murdered a few years ago. Harper joins him as the guy shows them where he found it. They find her body and discover that she wasn't killed in the manner who confessed to the murder said he killed. Harper and Thorsen talk to Delmonte who maintains the one who confessed is guilty but Thorsen speaks out which leads Harper to tell him to leave. She tells him they need to look into it and get more information and/ or evidence. Nolan learns one of the convicts escaped after her mother visited her. They learn she was convicted of assaulting her friend whom she thought was hooking up with her boyfriend. Thinking she will finish the job they go to the friend who tells them she already saw her and said she knows it wasn't her. The friend confirms her boyfriend was cheating on her but question is with who?—Rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "31631162", "rating": 7.5, "votes": 825, "number_of_episodes": 144}