{"cast": {"0277213": "Nathan Fillion", "0039162": "Shawn Ashmore", "4438177": "Lisseth Chavez", "2065368": "Mekia Cox", "1564087": "Jenna Dewan", "1595801": "Alyssa Diaz", "0429114": "Richard T. Jones", "2047780": "Melissa O'Neil", "8337399": "Tru Valentino", "0935721": "Eric Winter", "7491262": "Dylan Conrique", "2836740": "Danielle Campbell", "3267651": "Erica Piccininni", "3774317": "Chloe Wepper", "10078590": "Bella DeLong", "0400194": "Brent Huff", "0152839": "Tara Strong", "12757517": "Ana Nicolle Chavez", "5074497": "Cathryn Dylan Ortiz", "7919540": "Javier Bolaños", "4643289": "Jon Snow", "12153715": "Ella Rodriguez", "4870123": "Clarrel Pope"}, "geners": ["Action", "Crime", "Drama"], "runtimes": ["43"],  "plot": ["When two teenagers go missing, it is up to the entire team to find the girls and uncover the truth about their disappearance. Meanwhile, Lopez and Harper are on a different kind of investigation - the search for the perfect nanny.", "After Tim's fiasco he finds himself back on patrol and Grey decides to have Dr. London ride with him to observe and evaluate him. Lucy is dealing with Tamara leaving and Tim breaking up with her.Lopez and Harper are searching for an adequate nanny. When a person reports her nanny missing all of them get involved in searching for her. They also discover her friend is missing too.—Rcs0411@yahoo.com", "* Having taken the blame to protect everyone else, Tim is demoted and back on patrol. He receives an informal 'drive along' psychological evaluation from Blair, who concludes that he still is fit for duty, yet volunteers for therapy. Nolan and Celina track down a missing babysitter and the client who had an affair with his, soon assisted by other patrols. They find that the babysitter's friend also was kidnapped, but later find her dead in a parking garage. The babysitter escapes the man is found in his car, but shot elsewhere. The babysitter escapes from an ambulance and wields a knife at police, confessing her pregnancy and having killed the man when he broke things off and abused her, as well as her friend who wanted to call the police about the murder. As Tamara moves out, Celina takes Nolan's cue to become Lucy's new roommate. Harper and Lopez share babysitter advice and vet a new babysitter, which they ultimately decide to share.—KGF Vissers"], "genres": "N/A", "imdbID": "31955725", "rating": 7.3, "votes": 785, "number_of_episodes": 144}