{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0379626": "Keith Hernandez", "0020922": "Rae Allen", "0001431": "Wayne Knight", "0839836": "Carol Ann Susi", "0578810": "Lisa Mende", "1648298": "Roger McDowell", "0699309": "Stephen Prutting", "0039738": "Richard Assad", "0328710": "Melanie Good"}, "geners": ["Comedy"], "runtimes": ["46"],  "plot": ["Elaine and Keith are hitting it off until he pulls out a cigarette; Keith wants Jerry to help him move, leading Jerry along with Elaine to breakup with Keith.", "In the first hour-long episode, Jerry hooks up with Keith Hernandez at the gym. He tries to meet with Keith only to be shunned because Keith is infatuated with Elaine. George tries to keep his unemployment money coming in when he tells the unemployment officer that he got a job with \"Vandelay Industries,\" a company that manufactures latex. Kramer and Newman recall an incident in which Keith spit on them after a really bad Mets game. The details of the incident strangely mirror that of the JFK assassination.—halo1k", "At the gym, Jerry spots baseball star Keith Hernandez in the locker room and before he can work up the courage to introduce himself, he walks over and tells him how much he admires his comedy act. They soon become fast friends but Jerry is jealous - of what he's not quite sure - when Hernandez starts dating Elaine. Kramer and Newman have their own views about Hernandez, convinced that he spit on them after a game several years before. Jerry analyzes the event with Warren Commission-like detail. George meanwhile is having trouble extending his unemployment benefits and makes up a story about a job interview. He then gives Jerry's address and phone number for the employment counselor to check out his story.—garykmcd", "Elaine and Keith Hernandez are still seeing one another and Jerry can't quite come to grips with his emotions. When Keith asks him to help move his furniture, everyone thinks their friendship has gone to a new level. Elaine likes Keith, at least until she learns about one of his personal habits. When Kramer and Newman finally meet Hernandez, the truth of the spitting incident is revealed. George meanwhile latches on to yet another scheme to keep his unemployment benefits flowing - dating the employment counselor's unmarried daughter.—garykmcd", "This first hour long episode details a very extensive story line. For one Jerry develops a man crush on Mets first baseman, Keith Hernandez. While Keith on the other hand yearns for Elaine. Also, George struggles to keep his unemployment money coming. And during all this commotion Kramer and Newman accuse Keith of perpetrating a JFK style spitting assassination on Kramer.—Da_Playboi"], "genres": "N/A", "imdbID": "0697738", "rating": 8.6, "votes": 5376, "number_of_episodes": 172}