{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0754676": "Ernie Sabella", "0830712": "Barbara Stock", "0312564": "Rhoda Gemignani", "0095478": "Mark Boone Junior", "0490383": "Christopher Collins", "0897126": "Barry Vigon", "0720429": "Joe Restivo", "0729998": "Daryl Keith Roach", "2006878": "Chet Nelson", "0202970": "Larry David", "0576442": "Peter Mehlman", "0836081": "Dan Studney", "0935944": "Jennifer Winter"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Everyone has an uncommon experience while going their separate ways on the subway; Kramer overheard a hot tip on a horse on his way to pay a traffic violation.", "Jerry, George, Elaine, and Kramer have separate adventures within the New York subway system. Jerry must go to Coney Island to get his car out of the impound lot; George is on his way to a job interview; Elaine is on her way to be the best man in a lesbian wedding; Kramer is on his way to court to sweet-talk his way out of a number of traffic violations. On the way to Coney Island, Jerry has a hard time finding anyone to go with him, but meets a rather overweight individual who strips down to his waist and decides to go on the rides with Jerry. George meets an attractive woman who takes him back to his hotel, robs him blind, steals his clothes, and leaves him handcuffed to the bed. On her way to the wedding, Elaine takes the one train in which the power goes out, and curses into oblivion. After leaving court, Kramer wanders into a betting shop and actually wins lots of money for once. On his way back he nearly gets robbed, but is saved by an undercover cop. Back at the coffee shop, nobody wants to remember their journeys on the subway, except for Jerry and Kramer, and they're all stunned when Kramer actually pays for once.—halo1k", "With full days ahead of them, the four friends head off to separate adventures: Elaine is to be \"best man\" at a lesbian wedding, but her train breaks down; Kramer overhears a hot tip on a horse and heads off to OTB to place a bet, but getting his winnings home could be a problem; George is heading off to a job interview but meets an attractive woman and decides to go off with her, much to his later chagrin.—garykmcd"], "genres": "N/A", "imdbID": "0697792", "rating": 8.7, "votes": 5453, "number_of_episodes": 172}