{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0132559": "Jennifer Campbell", "0122020": "Scott Burkholder", "0120160": "Jim J. Bullock", "0913667": "Allan Wasserman", "0741532": "Lenny Rose", "2465581": "Karen Denise Williams", "0466843": "Annie Korzen", "1995441": "Deck McKenzie", "0250699": "Maggie Egan", "0492924": "Mark Christopher Lawrence", "2461228": "Jack Graiman", "0557656": "Bill Masters", "0153078": "Larry Charles", "2405378": "Cherie Chetyrbok", "0202970": "Larry David", "0401945": "Renée Humphrey", "7315306": "P. Raymond"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry and Elaine fly back to New York. Jerry travels on first class while Elaine on coach. George and Kramer run into trouble while trying to arrive on time to pick up Jerry and Elaine at the airport.", "Jerry and Elaine are on their way back to New York but learn their original flight has been canceled. As a result, Jerry ends up in first class and Elaine in coach. While Jerry has a wonderful flight with food, champagne and a beautiful blond model as a seat mate, Elaine suffers through the flight from hell. Back in New York, George and Kramer are supposed to meet Jerry and Elaine but the change in flight - and then a change in airport - has them running all over the place. More mayhem ensues when Kramer thinks he recognizes someone from his past.—garykmcd", "Jerry and Elaine are returning from one of Jerry's gigs in Saint Louis. George is supposed to pick them up at Kennedy airport. The two are forced to switch to a different flight, one that arrives at Laguardia. Elaine suffers a series of degradations in the coach section of the airplane, while Jerry is pampered in first class, and enjoys the company of a sexy model. George and Kramer dash from airport to airport to meet the flight, which is eventually re-routed back to Kennedy.—Anonymous"], "genres": "N/A", "imdbID": "0697647", "rating": 8.9, "votes": 5263, "number_of_episodes": 172}