{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0224588": "Barry Diamond", "0031759": "Perry Anzilotti", "0478631": "Tom La Grua", "0691588": "Eric Poppick", "0370935": "Cathy Lind Hayes", "0464255": "Allan Kolman", "0165884": "Molly Cleator", "0578107": "Christie Mellor", "1558013": "Jeff Norman", "0252029": "Paul Eisenhauer", "0353705": "Montrose Hagins", "0160636": "Tory Christopher", "0202970": "Larry David", "0392616": "Chela Holton", "1415992": "Sergio Kato", "0804887": "Steve Skrovan", "1173905": "JD Walters"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry does a set at a comedy club, then goes to meet George, Elaine, and Kramer afterward to see a screening of Checkmate. However, a simple miscommunication causes the four to keep missing each other at two different theaters.", "It's a evening of mix-ups and mayhem when Jerry is supposed to get together with Elaine, Kramer and George to go to the movies. He has two gigs that night and in the process of moving them round, he manages to miss both of them. George is first at the theatre and gets in line not realizing the tickets had to be bought first. By the time he realizes what's going on, the movie is sold out. George, Elaine and Kramer then go to another theater but their attempts to leave Jerry a message only adds to the confusion.—garykmcd", "Jerry tries to make two show dates and afterwards go to the movie theater to meet everyone. George gets in the wrong line for tickets. George, Elaine and Kramer decide to go to another theater to see the movie. Kramer waits outside for Jerry but also wants a hot dog. Jerry misses his first show, then goes to movie theater to tell everyone he won't make the movie, but no one is there. Through a comedy of errors, everyone (but Kramer) misses the movie, they were originally going to see."], "genres": "N/A", "imdbID": "0697735", "rating": 8.1, "votes": 4233, "number_of_episodes": 172}