{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0792210": "Liz Sheridan", "0551949": "Barney Martin", "0364680": "Estelle Harris", "0005191": "Paula Marshall", "0171096": "Kari Coleman", "0542134": "Anthony Mangano", "0715314": "Ben Reed", "0541849": "Lawrence A. Mandley", "0308092": "Charley J. Garrett", "1995441": "Deck McKenzie", "0316651": "David Gibbs", "0160636": "Tory Christopher", "1131118": "Ruth Cohen"}, "geners": ["Comedy"], "runtimes": ["22"],  "plot": ["A prank by Elaine leads a newspaper journalist to think that Jerry and George are gay.", "A woman is eavesdropping on the conversation that Elaine has with Jerry and George at the coffee shop. Elaine decides to give the woman the impression that Jerry and George are a homosexual couple. Unfortunately that woman is a reporter from NYU who is doing an interview with Jerry for the school newspaper. She goes to Jerry's apartment and the suspicions are confirmed when Jerry and George get in a fight over a piece of fruit. She publishes an article using the angle that Jerry and George are a homosexual couple. Things get even worse when Jerry's birthday gifts don't help his case any when Kramer gives Jerry a faulty two-line phone and George gets Jerry tickets to the musical \"Guys And Dolls.\" George doesn't help his case any when he uses the homosexual angle of the article to get out of a bad relationship and his mother freaks out and is admitted to the hospital. Not that there's anything wrong with that.—halo1k", "When Elaine notices that two young women in the next booth are eavesdropping she decides to have a bit of fun and tells George and Jerry that they should come out and tell everyone they are a couple. They play along but unbeknownst to anyone, one of the women is a student journalist from NYU who later interviews Jerry. When he finally makes the connection, he tries to convince her that he and George are not homosexual - not that there's anything wrong with that. - but the more he tries, the more he convinces her otherwise. The story goes viral and George decides to put their new found notoriety to use in his own relationship."], "genres": "N/A", "imdbID": "0697745", "rating": 9.4, "votes": 7155, "number_of_episodes": 172}