{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0364680": "Estelle Harris", "0005467": "Jerry Stiller", "0123078": "Maryedith Burrell", "0445420": "Peter Keleghan", "0333174": "John Christian Graas", "3279150": "Hugh A. Rose", "0396515": "Lisa Houle", "0590039": "Jed Mills", "0300235": "John Gabriel", "0475181": "Darrell Kunitomi", "0321320": "Rudy Giuliani"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Kramer invests in a new non-fat yogurt store.", "Kramer invests in a new new non-fat yogurt store, which becomes a hit in the city. Jerry and Elaine discover that they've been gaining weight and wonder if the yogurt really is non-fat. Jerry tries to unravel this mystery while dealing with a neighbor's kid who saw his act during a rare instance of him unleashing profanities on-stage. Meanwhile, George runs into former childhood acquaintance Lloyd Braun, who is working on the mayoral campaign for incumbent Mayor Dinkins, but the campaign is quickly jeopardized when Elaine proposes a nametag system. The mayoral campaign is also jeopardized when Kramer dates one of the lab technicians and accidentally spills some of the yogurt into Giuliani's blood sample.—halo1k", "Everyone is enjoying the no-fat yogurt from a new store that's just opened in the neighborhood. Nobody can quite believe that something that tastes so good could be fat-free but Kramer, who is part-owner, assures everyone that it is. When both Jerry and Elaine put on weight, they doubt it's fat-free and decide to have it tested. Meanwhile, George runs into an old neighbor and competitor, Lloyd Braun, who now works in the Mayor's office, and a little white lie leads to George going to a doctor on a referral by the Mayor. Elaine has a suggestion for Braun to use in the Mayor's upcoming re-election bid.—garykmcd"], "genres": "N/A", "imdbID": "0697739", "rating": 8.3, "votes": 4412, "number_of_episodes": 172}