{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0005467": "Jerry Stiller", "0364680": "Estelle Harris", "0551949": "Barney Martin", "0792210": "Liz Sheridan", "0056310": "Sandy Baron", "0002235": "Mike Hagerty", "0933332": "Dorien Wilson", "0669126": "Stephen Pearlman", "0466843": "Annie Korzen", "0001662": "Judge Reinhold", "0675939": "Lisa Pescia", "0809322": "Melanie Smith", "0790970": "LaRita Shelby", "0541292": "Jason Manary", "1131118": "Ruth Cohen", "0202970": "Larry David", "2179862": "Rebecca Greene"}, "geners": ["Comedy"], "runtimes": ["43"],  "plot": ["Jerry and his latest girlfriend finally get alone time when they go on a date to see \"Schindler's List,\" where Newman oversees them making out.", "In this two-part episode, Jerry's parents are visiting before leaving for France. Jerry has a hard time connecting with his new girlfriend Rachel because his parents are spending so much time in his apartment. George uses the trip to get out of volunteering for the Big Brother program, but is stunned to learn that his Little Brother is searching for his dad in France. Kramer and Morty team up to sell Morty's old beltless trenchcoat, \"The Executive,\" to a vintage clothing store. Elaine's creepy new boyfriend is a \"close talker\" who enjoys spending time with Jerry's parents.—halo1k", "Jerry's parents are in town as they prepare for a trip to Paris, an anniversary gift from Jerry. He can't wait for them to leave as he and his girlfriend have had no private time together since their arrival. Elaine's new boyfriend Aaron takes a strange liking to Jerry's parents and takes them out to dinner and the theater. Elaine thinks it's bizarre. Morty and Kramer get into a business venture when Morty sees him in a raincoat that he designed years before. Meanwhile, George must endure his own parents when Jerry's parents snub their dinner invitation.—garykmcd"], "genres": "N/A", "imdbID": "0697764", "rating": 8.3, "votes": 4035, "number_of_episodes": 172}