{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0153589": "Melanie Chartoff", "0185274": "Veanne Cox", "0410101": "Dom Irrera", "0269463": "Jon Favreau", "0675939": "Lisa Pescia", "0440947": "Hiram Kasten", "0166495": "Patience Cleveland", "0500828": "Lawrence LeJohn", "1752076": "Norman Brenner", "1131118": "Ruth Cohen", "0202970": "Larry David", "0242763": "Shannon K. Dunn", "0364680": "Estelle Harris", "1995441": "Deck McKenzie", "0005467": "Jerry Stiller"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["George struggles to keep his cool in a fire. Elaine's co-worker heckles Jerry's act, and Jerry's retaliation causes an accident where Kramer has to save the day.", "George dates a woman who has a son, and she invites him to the boy's birthday party. At the party, a fire breaks out in the kitchen and George screams \"FIRE!\" and knocks down the kids and an old lady as he makes his cowardly escape. The clown (not Bozo) puts out the fire with his big shoe. Meanwhile, at Pendant Publishing, Elaine learns that she's up for a very nice promotion; her main competition, Toby, is working with Kramer on his coffee-table book. The three head over to the comedy club where Jerry is doing an important set where a writer from Entertainment Weekly will be present to do a review of the show for the magazine. Toby heckles Jerry. After Jerry gets the magazine and sees the mostly-negative review of his show, he decides to do something unheard-of: heckle the heckler. He goes to Toby's office, where his heckling so upsets her that she rushes out of the building, and a street-sweeper severs her pinkie toe. Kramer gets the toe and hijacks a bus to take it to the hospital where it is reattached to Toby's foot. Shocked at the incident, Mr. Lippman decides to promote Toby over Elaine for the senior-editor's job. Toby's first order of business is to get Kramer's coffee-table book in stores ASAP. The next day, Jerry goes to the comedy club to plead with the Entertainment Weekly reviewer for a second chance; he gets one and runs into prop comic Ronnie Kaye, who tells Jerry that what he did is unprecedented. Jerry agrees and says that it's finally time they drew a line in the sand. During the show, George stops by the comedy club and sees Ronnie holding what looks like a firearm. Thinking that Ronnie's robbing the place, George screams and tries another cowardly escape that knocks everybody down. This interrupts Jerry's set and he's furious with George.—halo1k", "Kramer pitches his idea for a coffee table book about coffee tables and Elaine's co-worker Toby just loves it. In fact the bubbly and effusive Toby is also in competition with Elaine to fill the vacant senior editor position. Kramer takes Toby to see Jerry's act but she heckles him from the audience. An outraged Jerry later visits her at the office and gets his revenge, though it also leads to an accident that makes him out to be the bad guy. George's new girlfriend has a son and he agrees to help out at his birthday party. He overreacts somewhat to a fire in the kitchen showing a side of his character that she does not like.—garykmcd"], "genres": "N/A", "imdbID": "0697697", "rating": 8.6, "votes": 4391, "number_of_episodes": 172}