{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0364680": "Estelle Harris", "0005467": "Jerry Stiller", "0266697": "Richard Fancy", "0705222": "Marty Rackham", "0266441": "Siobhan Fallon Hogan", "0322339": "Paul Gleason", "0679410": "Dedee Pfeiffer", "0809322": "Melanie Smith", "0005310": "Regis Philbin", "0317537": "Kathie Lee Gifford", "0440947": "Hiram Kasten", "0829390": "French Stewart", "0847543": "Ken Takemoto", "0556324": "Fritz Mashimo", "0781870": "Susan Segal", "0430122": "Oscar Jordan", "0596789": "Rolando Molina", "3520427": "Michael Friedman", "0106020": "Marvin Braverman", "0860838": "Wesley Thompson", "3441267": "Jeff Barton", "0902701": "Jeffrey von Meyer", "0640046": "Colette O'Connell", "12349946": "Jeff Alpert", "0063849": "Lee Bear", "1325532": "Jeff Bye", "1131118": "Ruth Cohen", "0202970": "Larry David", "0377784": "Darin Henry", "0858556": "Brady Thomas"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["George decides to turn his life around by doing the exact opposite of what he would usually do. Elaine is having a lot of bad luck. Jerry keeps breaking even. Kramer gets the coffee table book published.", "A simple pick up line in the coffee shop proves Jerry's theory that every instinct George has is wrong. George decides to try the opposite, and that lands him an attractive girlfriend, a job offer with the New York Yankees, and an apartment that allows him to finally move out of his parent's house. Simultaneously, Elaine's mistake of stopping off for candy after learning her boyfriend was hospitalized causes her fortune to take a downturn. She gets kicked out of her apartment, breaks up with her boyfriend, and the candy causes a chain reaction that ultimately leads to the end of her longtime employer. Jerry sees the parallel between his two friends and realizes that he breaks even on just about everything. Kramer continues to take the book tour for his coffee table book, but Pendant Publishing's bankruptcy puts the book on the shelf.—halo1k", "George is feeling lower than he normally does when he decides to take Jerry's advice and do the opposite of everything he would normally do. By doing so, he manages to pick up an attractive blond. Even better, her uncle works for the New York Yankees and she arranges a job interview for him. While George's star is on the rise, Elaine's is going in the opposite direction. Her boyfriend breaks up with her after learning she stopped to buy candy after she learned he was in the hospital. Then at work, an apparently minor oversight leads to her company into bankruptcy. For Jerry however, every just seems to work out evenly.—garykmcd", "George decides that every instinct he ever had was wrong and decides to do the opposite, which causes his luck to turn around and he gets a girlfriend, job and apartment. Meanwhile Elaine's fortune take a downfall causing her to lose her boyfriend, job and apartment and become more like George.—BOARshevik"], "genres": "N/A", "imdbID": "0697744", "rating": 9.5, "votes": 7456, "number_of_episodes": 172}