{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0000415": "Jami Gertz", "0004844": "Dan Cortese", "1131118": "Ruth Cohen"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["When mystery woman withholds toilet paper from Elaine, who turns out to be Jerry's new girlfriend, Jerry tries to stop her figuring it out. George becomes enamored with Elaine's \"cool guy\" boyfriend. Kramer keeps calling a phone sex line.", "At a movie theater's restroom, Elaine, realizing she doesn't have any toilet paper left, asks the woman in the next stall (Jami Gertz) if she has any toilet paper to spare, but the woman refuses, claiming that she \"can't spare a square.\" Elaine pleads with the woman, but she leaves, ignoring Elaine. The woman returns to her seat, and is revealed as Jerry's girlfriend, Jane. Elaine is shown returning to her seat, with her new boyfriend Tony (played by Dan Cortese). The two women tell their dates about what had just happened. At Jerry's apartment, Kramer walks in, asking to use Jerry's phone. Jerry accuses Kramer of using it to call a telephone sex line. Elaine comes into the apartment, and describes to Jerry the incident that occurred at the movie theatre. Jerry realizes that the woman that Elaine was bickering for toilet paper was Jane. He tries to defend Jane, while not letting Elaine know that it was her. Meanwhile, George becomes enamored of Elaine's boyfriend, claiming that \"He's such a cool guy.\" Jerry suspects that Elaine dates Tony only because he is attractive, and that Tony is a \"male bimbo,\" or a \"mimbo\" for short. At the coffee shop, Tony, and George plan on going rock climbing together, which excites George, but Kramer is invited by Tony when he enters, and George starts fearing that Kramer will become better friends with Tony than him. Jerry and Kramer tease George about this later, claiming that George is in love with Tony, which George quickly denies. Jane calls Jerry's apartment, and Kramer answers the call without Jerry knowing. He talks to Jane, and after giving the phone to Jerry, he says that her voice sounded \"flinty,\" and seems to try to remember where he's heard it before. Later, Elaine calls Jerry on his buzzer to tell him that she's coming up, while Jane is still there. Still trying to keep the two from conflicting, Jerry panics to disguise Jane's voice by saying that it smelt from the lunch they just had, and gave her many pieces of gum, muffling her voice to an unrecognizable level. On Tony, Kramer and George's rock climbing trip, Tony gives Kramer a rope to tie a knot to keep him from falling, but Kramer gives the rope to George, and then distracts him by asking him for food. Tony begins to climb again, but doesn't know that his harness isn't tied onto the wall, and he falls down the mountain. A few days later, Kramer and George tell Elaine what had happened. Upon hearing the news, Elaine quickly asks the two if there was any damage to his face, and is told that he hit his face off of a large rock. She rushes to Tony's house, to see that his face is completely bandaged. He tells her that he can't remember if the doctors said if there was any long-term damage to his face. At that time, George walks in to apologize to Tony about the trip, but Tony says that he doesn't want to see him anymore. While Jerry and Jane were at Jerry's apartment, Kramer walks in and is introduced to Jane for the first time. He starts to act strangely at the sound of her voice, and quickly refuses to split a taxi to go uptown. When she leaves, Kramer claims that her voice closely resembles that of \"Erika,\" one of the girls on the phone sex line that he has been frequently calling, but Jerry doesn't believe him. At the coffee shop, Kramer is sitting at a table by himself, saying to Jerry that he made a date with Erika, to prove that it is, in fact, Jane. When Jane arrives, Jerry is shocked. She moves to Jerry's table instead of Kramer's, but Kramer still persists on calling her \"Erika,\" as he and Jerry confront her, claiming that she \"sells sexual pleasure over the phone.\" She dispels the claims by saying she sells paper goods. Elaine hears Jane's voice, and realizes that she was the woman that refused to give her any spare toilet paper. Jane then says that she needs to use the washroom, and Elaine races her to the door. There is then a camera angle of the washroom stalls very similar to the one used at the beginning of the episode. Jane's voice is heard asking the woman in the stall next to hers, who she doesn't know, if they have any toilet paper, but is revealed to be Elaine, who tells Jane that she \"can't spare a square.\" Jane then exclaims that it's the same woman from the movie theater, and then Elaine is shown running out of her stall, carrying many rolls of toilet paper. After exiting the restroom, Jane tells Jerry to never call her again, and then she turns to Kramer and says for him not to call her either, but using a \"flinty\" voice, the same one she uses while in her Erika persona. Jerry and Kramer then look at each other with their mouths opened, visibly stunned.—Tummy AuGratin", "Jerry's new girlfriend and Elaine have an argument at the toilet, unaware of each other's identities. Jerry finds himself in an awkward position, as both parties claim their right on the matter, as well as trying to avoid confrontation between the two.—Deus Maximus", "Elaine has a problem when she goes to the washroom at the movie theatre but realizes too late there is no toilet paper. She asks the woman in the next stall for some paper but the woman refuses. She never sees the woman and is outraged that she wouldn't pass her any. It turns out the woman is Jerry's new girlfriend Jane and when Jerry hears both sides of the story, he does his best to keep the two of them apart. Kramer has taken a liking to phone sex, but the voice at the other end of the line is oddly familiar. George becomes friends with Elaine's new boyfriend Tony. Elaine realizes Tony's a 'mimbo', a male bimbo but, but George thinks is the coolest guy he's ever met.—garykmcd"], "genres": "N/A", "imdbID": "0697785", "rating": 8.6, "votes": 4397, "number_of_episodes": 172}