{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0763858": "Reni Santoni", "0004895": "David James Elliott", "0393666": "Robert Hooks", "0236225": "Denise Dowse", "0652663": "Patton Oswalt", "0857477": "Diana Theodore", "0372961": "Jessica Hecht", "0002985": "Mari Weiss", "0178410": "Tamar Cooper", "1880552": "Beverly C. Brown", "0688432": "Jeris Poindexter", "1752076": "Norman Brenner", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "1995441": "Deck McKenzie"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry's new couch is completely ruined when Elaine upsets a man with a bladder condition. Kramer decides to start up his own new pizza business. George joins a book club but instead of reading the book he watches the movie.", "Elaine dates a moving guy, and things are going well for her until Jerry wants to know what his opinion on abortion is. Poppy returns and he and Kramer are going into business together to create a restaurant where you make your own pizza. Meanwhile, George goes out of his way to cheat on a book club test by renting \"Breakfast At Tiffany's\" instead of reading the book.—halo1k", "Jerry finds the perfect couch for his apartment and gladly gives his old couch to Elaine who is far more interested in the hunky delivery than the old couch. Kramer and his friend Poppie decide to go into business together and open a make it yourself pizza restaurant. Jerry and Elaine go to Poppie's for dinner but Jerry causes trouble when Jerry asks him about his views on abortion leading Elaine and several other patrons to walk out of the restaurant. Poppie has his own form of revenge. Similarly, Jerry gets Elaine to ask her new boyfriend about his views on abortion with similar results. George meanwhile joins a book club but doesn't like to read so tries to rent the movie instead.—garykmcd"], "genres": "N/A", "imdbID": "0697681", "rating": 8.0, "votes": 3886, "number_of_episodes": 172}