{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0000541": "Bette Midler", "0005467": "Jerry Stiller", "0453550": "June Kyoto Lu", "0384032": "Amy Hill", "0641417": "John O'Hurley", "0587845": "Adelaide Miller", "0159017": "Alexandra Bokyun Chun", "3555369": "Vonnie C. Rhee", "0858656": "Craig Thomas", "0567912": "Michael McDonald", "0227155": "Lou DiMaggio", "0065168": "Jason Beck", "0789624": "Bob Shaw", "0798721": "Johnny Silver", "0060477": "Billy Bastiani", "0115668": "Bonnie Bruckheimer", "0141879": "Randy Carter", "1131118": "Ruth Cohen", "0202970": "Larry David", "0275261": "Norman Fessler", "0343440": "Marjorie Gross", "2209357": "Darin Mangan"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["Jerry's girlfriend cries easily. George runs over Bette Midler during a softball game and Kramer gives in to her every demand. Elaine meets a new potential employer.", "Jerry dates the ultra-sensitive understudy for Bette Midler in Rochelle, Rochelle: The Musical. When the Improv is scheduled to play Rochelle Rochelle in a softball game, George plows into catcher Bette Midler to score the winning run. Bette is injured because of the incident and is unable to perform in the Broadway premiere. Jerry, George, and the understudy are vilified for the incident, and Kramer goes out of his way to help Bette. Meanwhile, Elaine suspects that a local nail shop is making fun of her in Korean. She learns that George's dad Frank speaks Korean and brings him along to spy on them. Frank recalls his time in the Korean war and how he had an affair with a young Korean woman. Elaine gets kicked out of the nail shop and wanders around aimlessly, and has a chance encounter with catalog magnate J. Peterman, who hires Elaine to work for the catalog.—halo1k", "Jerry's new girlfriend Gennice understudies Bette Midler in her upcoming Broadway musical. She very emotional and seems to cry at the drop of a hat. When Jerry's softball team plays the team from Midler's musical, George slides into home plate and knock Midler out cold. Soon everybody is accusing them of arranging for Gennice to have the starring role. Elaine meanwhile enlists the help of Frank Costanza to find out what her Korean manicurist is saying about her. Frank speaks Korean and even had a love affair with a beautiful Korean girl named Kim. Barred from the shop after her deception is found out, Elaine has a life altering meeting with someone on the street.—garykmcd", "Jerry begins to date a girl who is an understudy for Bette Midler in her new Broadway musical, Rochelle, Rochelle. Jerry, George and Kramer all play on the Improv softball team and happen to be playing against the cast and crew of Rochelle, Rochelle. Kramer fawns over Bette and Jerry's girlfriend cries about her frankfurter falling on the ground but not about her grandmother dying.—LizC2421"], "genres": "N/A", "imdbID": "0697802", "rating": 7.8, "votes": 3771, "number_of_episodes": 172}