{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0186505": "Bryan Cranston", "0875768": "Jessica Tuck", "1483877": "Cleto Augusto", "0333412": "Wayne Grace", "4091077": "Randall Broadrick", "1131118": "Ruth Cohen", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Tim Whatley gives Jerry a label maker as a thank you for his Super Bowl tickets. George is uncomfortable with his girlfriend's male roommate. Kramer and Newman play a game of Risk.", "Jerry gets Super Bowl tickets but can't use them because of obligations to attend a friend's wedding. He gives them to Tim Whatley and gets a label maker in return. Elaine is convinced that the label maker is the exact same one that she gave him a week before. Jerry then accuses Whatley of \"re-gifting\" the label maker. George learns that his girlfriend has a male roommate and gets weirded out by the concept, but loves the male roommate's possessions, which include a velvet couch. The couple learns that the wedding is on the same day as the Super Bowl and then calls the wedding completely off because of it, and Jerry goes in search of getting his tickets back. But then Jerry learns that Whatley gave one of his tickets to Newman. Meanwhile, Kramer and Newman engage in a heated game of Risk.—halo1k", "Jerry has two tickets for the Super Bowl but can't attend as he has a wedding to go to that day. He offers them around with no takers until dentist Tim Whately takes them and sends Jerry a label maker as a thank you gift - one that Elaine had given Whately for Christmas. When the wedding is called off, Jerry would like the tickets back but Tim has already made plans. In the end, Jerry ends up at the game with someone he knows all too well. Kramer and Newman are involved is an epic game of Risk and leave the board at Jerry's. Kramer suspect Newman is planning a sneak attack. George gets to go to his new girlfriend's apartment for the first time and learns that she has a male roommate.—garykmcd"], "genres": "N/A", "imdbID": "0697719", "rating": 8.5, "votes": 3917, "number_of_episodes": 172}