{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0636065": "Sheree North", "0834373": "Gail Strickland", "0001470": "Charlotte Lewis", "0438837": "Jann Karam", "0842202": "Terry Sweeney", "0575977": "Heather Medway", "0742610": "Clive Rosengren", "3541478": "Jacqueline M. Houston", "0364246": "Cheryl Francis Harrington", "1048322": "Tish Smiley", "1131118": "Ruth Cohen", "0202970": "Larry David", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry wants to switch from dating a non-laughing woman to dating her roommate; Elaine has difficulty retrieving a tennis racket she loaned out; George enlists Kramer's mother to spy on his seemingly bulimic girlfriend.", "Elaine loans Mr. Pitt's expensive tennis racket to an executive from Doubleday who hints there may be a job opening for Elaine soon. When the woman injures her arm, Elaine can't quite get the racket back. Jerry's girlfriend never smiles or laughs at his jokes but her roommate laughs at everything he says so he contemplates the switch. George comes up with an idea as to how he might get away with it. George's girlfriend, a model, eats like a horse but never puts on weight. Kramer suggests she might be bulimic. The gang learns Kramer's first name, thanks to his mom Babs.—garykmcd", "Elaine lets a potential employer borrow Mr. Pitt's tennis racket, but the injury suffered may ruin her chances, especially when she must get his racket back. Jerry's girlfriend never laughs but he meets her roommate who does, so Jerry decides he would like to make \"the switch.\" George's model girlfriend may be bulimic. He needs proof so he meets Kramer's mother, who's a bathroom matron. While there he finds out Kramer's first name, Cosmo. Kramer decides it is time to be himself and begins to use his first name. George has the perfect plan for \"the switch,\" a menage a trois.—Anonymous"], "genres": "N/A", "imdbID": "0697796", "rating": 8.9, "votes": 4946, "number_of_episodes": 172}