{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0504335": "Len Lesser", "0000718": "Ian Abercrombie", "0168907": "Kelly Coffield Park", "0908542": "Billye Ree Wallace", "0714753": "Brian Reddy", "0820847": "Rebecca Staab", "2257163": "Danny Tartabull", "0942875": "Tom Wright", "0721759": "James Reynolds", "0101242": "Lauren Bowles", "0727798": "F.J. Rio", "0894725": "Thom Vernon", "1131118": "Ruth Cohen", "0202970": "Larry David", "0275261": "Norman Fessler", "0171322": "Lisa Guerrero", "0377784": "Darin Henry", "5218234": "Gregory Pellico", "1196975": "Jeffrey Yerkes"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Kramer finds Jerry's old birthday checks from his grandmother and insists he deposits them, which puts Nana in unexpected debt. Elaine accidentally tells the high talker a secret. Mr Pitt eats a Snickers bar with utensils.", "Jerry hosts the annual PBS pledge drive and asks George to get some of the Yankee players to appear on the show. George comes through and gets Danny Tartabul to appear on the show. Kramer discovers that Jerry has been getting some birthday cards from his Nana with money inside. He cashes them in and suddenly Nana's bank account is overdrawn. Nana then goes missing. Jerry gets in trouble with Elaine's friends (one of whom has an unusually high voice) when Elaine starts a rumor that the wife was hitting on Jerry. George thinks everybody is giving him the finger and decides to follow one offender while driving Danny Tartabul to the pledge drive. Kramer volunteers to become a phone-answerer for PBS and Elaine discovers that Mr. Pitt eats his candy bars with a knife and fork, starting an unusual trend.—halo1k", "Jerry is invited to participate in a PBS pledge drive and gets George to get one of the Yankee players to appear, though not without some difficulty. At Kramer's insistence, Jerry cashes some old checks his grandmother had sent him for past birthdays. Unfortunately, there isn't any money in the account leading her to leave her apartment and go to a rather seedy part of town. Elaine meanwhile has trouble with a couple whose voices are identical.—garykmcd"], "genres": "N/A", "imdbID": "0697756", "rating": 8.2, "votes": 3964, "number_of_episodes": 172}