{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0911320": "Patrick Warburton", "0783596": "Katy Selverstone", "0213648": "Mark DeCarlo", "0083541": "Raye Birk", "0556130": "Pierrino Mascarino", "0482329": "Joe Lala", "1519593": "Peggy Lane", "0724488": "David Richardson", "0694656": "David Powledge", "0248892": "Jan Eddy", "0500828": "Lawrence LeJohn", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0316455": "Donald Gibb", "2006217": "Kenny Kramer", "0831550": "Fred Stoller"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry, Elaine, Kramer, and David Puddy go to two Stanley Cup playoff games; Kramer holds a grudge against a chimpanzee who hit him with a banana peel; George resolves to take the dramatic step of telling his girlfriend he loves her.", "Jerry scores premium tickets to a New Jersey Devils playoff game. He invites Kramer, Puddy, and Elaine along. But Jerry gets weirded out when Puddy shows up at the game and paints his face to match the team colors. Puddy gets so worked up after the game that he freaks out a visiting pastor from El Salvador, who is convinced that Puddy really is the devil. Elaine tries to convince him otherwise. Kramer enjoyed the game so much that he tries to convince Jerry to get more tickets from the guy Jerry got them from. Meanwhile, George decides to tell his girlfriend that he loves her, only to have the plans backfire on him while Kramer battles a chimpanzee at the zoo.—halo1k", "Jerry gets tickets to a Rangers-Devils playoff game from Alec Berg, someone he and Elaine dislike. When George opts not to go Elaine gets Jerry's okay to bring her boyfriend Puddy. No is quite prepared for Puddy's level of enthusiasm however. George didn't go to the game so he could keep a date with his new girlfriend Siena. He decides to take a leap of faith and tells her he loves her. Her response is not quite what he was hoping for. When Jerry fails to call Berg the next day to thank him, he suddenly finds himself getting the cold shoulder.—garykmcd"], "genres": "N/A", "imdbID": "0697693", "rating": 8.4, "votes": 3836, "number_of_episodes": 172}