{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0792210": "Liz Sheridan", "0551949": "Barney Martin", "0504335": "Len Lesser", "0005176": "Wendie Malick", "0908542": "Billye Ree Wallace", "0500140": "Carol Leifer", "0575339": "Julio Oscar Mechoso", "0715671": "Rondi Reed", "0255368": "Eugene Elman", "0770462": "Mary Scheer", "0008657": "Louisa Abernathy", "0573934": "Timothy McNeil", "0280051": "Mark Fite", "0479633": "Carl LaBove", "0941781": "Wendy Worthington", "0057937": "Belinda Barry", "1752076": "Norman Brenner", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0588581": "Jeffrey Kurt Miller"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["George gets in an argument regarding a cancellation policy. Jerry and Elaine try to use Kramer's bluntness to deliver some much needed fashion advice.", "Kramer tries to create a Utopian society when he puts up pictures of all the residents of his and Jerry's building. Jerry doesn't mind until the women of the building want to be greeted with a kiss. After Jerry objects to kissing hello, he's vilified and nearly kicked out of the building. Jerry also has to settle some family issues when Nana remembers that Uncle Leo was supposed to give Jerry's mom some money 50 years ago and Uncle Leo puts Nana in a home to keep her quiet. Meanwhile, Elaine's friend who is a physical therapist skips out on George's appointment and goes skiing instead, and they have a hard time telling her about her dated hairdo.—halo1k", "Jerry dislikes Elaine's friend Wendy because she gives him a kiss on the cheek every time they meet. Wendy sports a somewhat dated hair style and neither Jerry nor Elaine really have the nerve to tell her so they come up with the perfect solution: introduce her to Kramer who is bound to blurt out some inappropriate comment. It doesn't quite go as planned. Kramer has decided that everyone in the building would be nicer to each other if they knew everyone's name and so puts up photos in the lobby. Soon Jerry has every woman in the building kissing him hello. He tries to stop it but faces dire consequences. George has a problem when he misses an appointment with Wendy and she wants to charge anyways. Jerry gets his parents arguing with his uncle Leo after revealing a family secret.—garykmcd"], "genres": "N/A", "imdbID": "0697718", "rating": 8.2, "votes": 3703, "number_of_episodes": 172}