{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0842056": "Heidi Swedberg", "0536980": "Bruce Mahler", "0670299": "Kelly Perine", "0747785": "John Rubano", "0669658": "Evie Peck", "1131118": "Ruth Cohen", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["George gets cold feet and tries everything he can to postpone the wedding; Elaine is jealous of George's engagement; Kramer spills hot coffee on himself.", "Immediately after proposing, George tries to postpone his marriage to Susan. Elaine becomes increasingly jealous of George's engagement and has a discussion with her neighbor, a rabbi, who then proceeds to tell the whole neighborhood. Kramer sneaks a caffé latte in the movie theater and burns himself, and he hires Jackie Chiles in an effort to sue the coffee shop.—halo1k", "George is now in a total panic over his upcoming marriage to Susan. He suggests to her that they delay until the first day of spring but she bursts into tears and George immediately crumbles. He decides to try another way. Elaine has a chat with a rabbi who lives in her building and opens up about how she's jealous of George being engaged. Soon everyone she meets seems to know her innermost feelings. Kramer meanwhile tries to sneak a coffee into a movie theatre only to burn himself. That's okay since he's now suing the coffee shop for serving coffee that's too hot.—garykmcd", "George wants to postpone the wedding with Susan, but he doesn't know how to approach the situation, and is afraid of how Susan will react to it. Elaine is jealous at George, because she also wants to get married, and she confides this fact to the local Rabbi, who then betrays her trust by telling her secrets to every person he meets. Meanwhile, Kramer spills hot coffee on his lap and wants to sue the place that sold it to him.—KnatLouie"], "genres": "N/A", "imdbID": "0697759", "rating": 8.2, "votes": 3639, "number_of_episodes": 172}