{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0842056": "Heidi Swedberg", "0005547": "Alexandra Wentworth", "0859130": "Larry Thomas", "0405337": "Steve Hytner", "0660893": "John Paragon", "0891485": "Yul Vazquez", "0058175": "Thom Barry", "0578278": "Vince Melocchi", "0309430": "Ana Gasteyer", "0584689": "Michael Michaud", "0005330": "Buddy Quaid", "0110014": "Marcia Brito", "1131118": "Ruth Cohen", "1168926": "Cedric Duplechain", "0275261": "Norman Fessler", "0449742": "Judy Kerr", "0541849": "Lawrence A. Mandley", "0926378": "Vivicca A. Whitsett"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["A soup stand owner obsesses about his customers' ordering procedure, but his soup is so good that people line up down the block for it anyway.", "In this series-defining episode, everyone goes to this new soup stand because the soup is so great. Unfortunately, the owner is obsessed about his customer's ordering procedure. Jerry and his new girlfriend annoy everybody by using baby talk. George tries to do the same thing with Susan to show how annoying they are to everybody. Jerry and his girlfriend get rejected from the Soup Nazi's kitchen when they're caught kissing in line. Elaine buys an Armoire and asks Kramer to watch it. While watching it, Kramer is robbed by some gay, trash-talking street toughs who want nothing more than the Armoire. She then gets rejected from the soup kitchen when she offends the \"Soup Nazi.\" Kramer, who befriends the Soup Nazi, gets a new Armoire exactly like the one that was stolen from him. He then gives it to Elaine, who discovers the Soup Nazi's recipes inside. Jerry pleads with her not to do anything, but Elaine threatens to put the Soup Nazi out of business.—halo1k", "Jerry finds a new soup shop that makes the best soup anyone has ever tasted. The only problem is that the owner, who's earned the nickname the Soup Nazi, is something of an eccentric. Despite warnings to the contrary, both George and Elaine fail to follow the 'rules' and suffer the consequences. Elaine has also found the perfect armoire but can't move it in to her building on a Sunday. Kramer offers to stand guard with little effect. Kramer makes up for his less than stellar guard skills by finding Elaine a new armoire from none other than the soup Nazi. She finds something inside that levels the playing field.—garykmcd", "A soup stand owner has a fanatic way of keeping his customers' ordering procedure as quick and smooth as possible, so he dismisses every customer who is incapable of following his instructions. His soup is so good that people line up down the block for it anyway, and this particularly annoys Elaine, who thinks he's an arrogant jerk, which results in her trying to destroy his business. Meanwhile, she asks Kramer to guard her newly-bought Armoire, but a couple of homosexual thugs rob him in bright day-light, and he's not able to stop them because they are too tough.—KnatLouie"], "genres": "N/A", "imdbID": "0697782", "rating": 9.5, "votes": 7783, "number_of_episodes": 172}