{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0005467": "Jerry Stiller", "0364680": "Estelle Harris", "0842056": "Heidi Swedberg", "0606862": "Phil Morris", "0378800": "Richard Herd", "0641417": "John O'Hurley", "0834947": "Brenda Strong", "0001734": "Armin Shimerman", "0742172": "Arthur Rosenberg", "0535291": "Cynthia Madvig", "0865795": "Marilyn Tokuda", "0063849": "Lee Bear", "1325532": "Jeff Bye", "0202970": "Larry David", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Elaine buys a friend a bra. Jerry and Kramer take care of George's car while he's away at Susan's family cottage.", "Elaine's floozy former ex-roommate Sue Ellen Mischkie returns. George locks his keys in his car and leaves it in the Yankees parking lot. Elaine, out of spite, buys Sue Ellen a bra for a birthday gift as she has never worn one. George, having successfully convinced Wilhelm and Steinbrenner that he's putting in extra hours, decides to skip town with Susan after learning that her father rebuilt the cabin. So George asks Kramer and Jerry to go to Yankee Stadium and take the fliers off of his car. The car is really dirty, and Jerry and Kramer decide to go take it to the car wash. But along the way, they see Sue Ellen wearing the bra as a top. Jerry and Kramer get distracted and crash George's car. They return the damaged car back to Yankee Stadium. Steinbrenner, having seen the damage, and with George nowhere in sight, thinks George is dead. Kramer injures his arm in the accident, and his golf game is ruined. Elaine decides that Sue Ellen is a menace to society, and Kramer hires smooth-talking attorney Jackie Chiles to represent them. Unfortunately, the trial is jeopardized when Kramer asks Stan The Caddy for advice.—halo1k", "Elaine plots a little revenge against old nemesis Sue Ellen Mishckie who many years before had lured Elaine's boyfriend away by going bra-less. It seems fitting that she would give her a bra as a present which she takes to wearing as a top. George meanwhile is trying to finagle a promotion at work and leaves his car there to have his bosses think that he's putting in a lot of extra hours. In fact he's off for the weekend with his girlfriend and gets Jerry to make sure there are no fliers on the windshield. Jerry and Kramer take the car to be washed but on the way back to the parking lot, see the bra-wearing Sue Ellen walking down the street. Kramer sues the woman after he's injured in the ensuring crash, affecting his golf game.—garykmcd"], "genres": "N/A", "imdbID": "0697666", "rating": 8.6, "votes": 3899, "number_of_episodes": 172}