{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0378800": "Richard Herd", "0083586": "Jeremiah Birkett", "0751762": "Leon Russom", "0113536": "Ernie Lively", "0194234": "Charles Cyphers", "0612310": "Kate Mulligan", "0410573": "Susan Isaacs", "0058175": "Thom Barry", "0588581": "Jeffrey Kurt Miller", "0063849": "Lee Bear", "1131118": "Ruth Cohen", "0202970": "Larry David", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry helps a marathon runner that overslept at the Olympics. Elaine deals with writer's block. George pretends to be busy at work while Kramer gets a hot tub.", "Wilhelm thinks George is cracking under the pressure of working in the big leagues. So he has George entertain a group of visiting baseball officials from the Houston Astros, who are in New York to discuss inter-league play. George picks up a bad habit from them, who call everyone either a \"bastard\" or a \"son of a bitch.\" Kramer buys a hot tub from his friend Lomez and installs it in his apartment. At the same time, Elaine is having a marathon runner from Trinidad And Tobago named Jean Paul Jean Paul stay with her as a house guest. Jean Paul was in the Olympics and became famous for having over slept and missed the entire race. She tells Jerry about it, and Jerry meets Jean Paul. Jean Paul reveals that there were separate knobs for the volume and the radio volume. Elaine also gets a severe case of writer's block when Peterman asks Elaine to come up with an idea for the Himalayan Walking Shoes. The previous night, Kramer runs the heat pump too hot and it blows out, reducing his body temperature in the process. The next day after George meets the baseball officials, he curses at them on the phone. Wilhelm once again thinks George is cracking under the pressure and reports it to Steinbrenner. Back at Elaine's, Jean Paul comments on what a \"cute little bastard\" her neighbor's baby is. Jean Paul gets kicked out of the building and has to go stay with Jerry. Jerry checks Jean Paul into a hotel and makes sure that the alarm clock situation is satisfactory. But after Jerry offends the wake-up guy, they bail on the hotel and go back to Jerry's apartment. Jerry tells Kramer to set his mental alarm for 6:30 AM. Elaine, meanwhile, becomes disillusioned with Jerry about the whole Jean Paul ordeal and takes a walk, when she finally overcomes her catalog writer's block and comes up with a great write-up for the Himalayan Walking Shoes. But then during the night, Kramer's heat pump blows out all the fuses in the building. Jerry realizes that they had overslept and he and Jean Paul rush out to get to the race in time. They succeed and Jean Paul is leading the race when they get to the finish line. But Kramer is so cold from having the heat pump blown out that he is drinking boiling hot cups of coffee. Jean Paul grabs Kramer's drink instead of one of the other drinks and burns himself. George meets with Steinbrenner, who educates him on the nerve-calming capabilities of the hot tub.—halo1k", "Elaine has a an acquaintance, Jean-Paul from Trinidad, who's come to New York to run in the marathon. Some years before he slept in and missed running in the Olympic marathon. Jerry thinks she's taken on a major responsibility but Elaine seems completely unfazed. Jerry obsesses over it and decides to make sure Jean-Paul doesn't sleep in. Kramer's hot tub conks out. Meanwhile George is enjoying his job with the Yankees and he thinks he's come up the perfect scheme to make people believe he's very busy. Elaine has catalog writers block.—garykmcd", "George picks up a bad habit from some visiting baseball officials. During the time of the New York City Marathon, Elaine has an out of country runner as her house guest. The runner had overslept and missed the big race at the last Olympics and Jerry obsesses with ensuring that it doesn't happen again. Kramer gets a hot tub from his friend Lomez, and Elaine has writer's block.—Anonymous"], "genres": "N/A", "imdbID": "0697710", "rating": 8.5, "votes": 3903, "number_of_episodes": 172}