{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0378800": "Richard Herd", "0641417": "John O'Hurley", "0834947": "Brenda Strong", "0004951": "Brad Garrett", "0449777": "Patrick Kerr", "0444747": "Mary Jo Keenen", "0397555": "Rance Howard", "0779414": "Karen Lynn Scott", "0577539": "Nicholas Mele", "0911832": "Sandy Ward", "0419256": "Harvey Jason", "0689853": "Larry Polson", "0640284": "Dan O'Connor", "1048246": "Bonnie McNeil", "0063849": "Lee Bear", "0202970": "Larry David", "0275261": "Norman Fessler", "0487055": "James Lansbury", "0517165": "Phil Lodwick", "0541635": "David Mandel", "0724488": "David Richardson", "0859438": "Robert Thomas"}, "geners": ["Comedy"], "runtimes": ["42"],  "plot": ["A garage mechanic steals Jerry's car. Elaine tries to win J. Peterman JFK's presidential golf clubs at an auction. George is asked to work on a mysterious assignment. Kramer and Newman run a recycling scam.", "In this two-part episode, Kramer and Newman scheme to make money on recycling by taking a mail truck to Michigan full of bottles and cans. But their road trip takes a turn for the worst (literally) when Jerry's car is stolen by a psychotic auto mechanic and they track Jerry's car out in the Midwest. Elaine outbids Sue Ellen Mischkie by double her budget for JFK's golf clubs and leaves them in Jerry's car. George gets a project from his boss Wilhelm but doesn't hear the other end of what he's supposed to do. Steinbrenner sees the results of George's project and has him committed to a mental hospital.—halo1k", "Elaine's boss Peterman sends her to Sotheby's to buy JFK's golf clubs. She gets into a bidding war with her long-time rival Sue Ellen but eventually wins, paying double the price Peterman had authorized. After Kramer and Newman borrow his car, Jerry has to take it into his temperamental mechanic Tony who takes off with the car - that still has the JFK clubs on the backseat. At work, George is given a special project by his boss Wilhem but he hasn't a clue what it's about and he's afraid to ask him what he wants. George later learns that he's done a great job on the project - but he has no idea who did it or what it was about. Kramer and Newman meanwhile are on their way to Michigan to collect the extra bottle deposit but find Jerry's car on the road along the way.—garykmcd"], "genres": "N/A", "imdbID": "0697660", "rating": 8.6, "votes": 4257, "number_of_episodes": 172}