{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0842056": "Heidi Swedberg", "0606862": "Phil Morris", "0582420": "Mark Metcalf", "2039859": "Gary Yates", "0584185": "Paul Michael", "0633422": "James Noah", "0046730": "Tim Bagley", "0569501": "Richard McGonagle", "0752660": "Kenneth Ryan", "0627637": "Kymberly Newberry", "1320427": "David Wendelman", "1752076": "Norman Brenner", "1338054": "Carol Brown", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "1995441": "Deck McKenzie"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Elaine's latest boyfriend likes to be known as \"The Maestro\"; Kramer reaches an unsatisfactory settlement with the coffee company, much to his lawyer's chagrin.", "Kramer is pursuing his lawsuit against a coffee shop for selling him coffee that was too hot. Jackie Chiles represents him and thinks they'll make a fortune. He may have a problem when Elaine's new boyfriend gives him a balm that cleans up his burn mark overnight. The boyfriend, who conducts the police band, insists that everyone call him Maestro, which is just a bit too pretentious. Meanwhile, George goes shopping with Susan at a store owned by her family. He's not too keen on the clothes she thinks he should wear and he's bothered by the fact that the security guard must stand all day.—garykmcd", "Elaine is dating Kramer's friend Bob Cobb, who wants everybody to call him \"Maestro\" because he's a conductor and Leonard Bernstein's closest friends called him \"Maestro\" too. Bob owns a house in Tuscany, but tells Jerry that it's impossible to get a house down there. Of course Jerry tries to confirm this. Meanwhile, Kramer wants to sue the coffee shop (Java World) that sold him the hot coffee which scalded him in the previous episode. He hires Jackie Chiles, a lawyer with a striking resemblance to real-life attorney Johnnie Cochran. George thinks it must be hard for the security guard at Susan's uncle's store to stand up all day so he buys him a chair.—KnatLouie"], "genres": "N/A", "imdbID": "0697726", "rating": 8.0, "votes": 3745, "number_of_episodes": 172}