{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0000673": "Marisa Tomei", "0792210": "Liz Sheridan", "0551949": "Barney Martin", "0842056": "Heidi Swedberg", "0390805": "Walter Olkewicz", "0348800": "Annabelle Gurwitch", "0056310": "Sandy Baron", "0346893": "Ann Morgan Guilbert", "0062844": "Frances Bay", "0534409": "Bill Macy", "0924964": "Jesse White", "0466843": "Annie Korzen", "0669254": "Daniel Zacapa", "0823095": "Golde Starger", "0203774": "Janice Davies", "0291192": "Art Frankel", "1131118": "Ruth Cohen", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["44"],  "plot": ["In this hour-long episode, Jerry performs the biggest show of his life in Atlantic City. He receives a rather generous pay check for the event, and decides to buy his father a Cadillac. Unfortunately, doing so puts Morty in the hot seat with the condo board of directors, where he serves as president. Morty is accused of stealing money from the board, and ultimately gets removed from his post as president and kicked out of the condo. Meanwhile, thanks to Elaine, George can score a date with \"My Cousin Vinny\" star Marisa Tomei but Elaine objects because of George's engagement with Susan. Kramer turns the tables on the cable company when they want to disconnect his service.—halo1k", "After a particularly big payday, Jerry decides to surprise his parents by buying them a new car. He flies down to Florida and personally delivers a fully loaded Cadillac. His Dad is thrilled with the car and proud to have such a giving son. Some of his neighbors, especially Jack, aren't so keen and Morty is accused of stealing condo funds to pay for his new rich lifestyle. There's a move to impeach Morty as the condo president and the deciding vote rests with Mrs. Choate who is sure she's seen Jerry somewhere before. In New York meanwhile, George begins to obsess over the possibility that he could have a date with Marisa Tomei thanks to one of Elaine's friends who knows her. The fact that he's engaged doesn't seem to bother him. Kramer meanwhile is getting his revenge on the local cable company by constantly agreeing to appointments for them to come to his apartment but then making a point of not being there—garykmcd", "Jerry purchases a new Cadillac for his parents; George questions his relationship with Susan after Elaine's friend sets him up with actress Marisa Tomei. The retirement community impeached Marty over the new Cadillac that Jerry bought him; George bombs with Marisa Tomei after revealing his engagement.—Dynasti Noble"], "genres": "N/A", "imdbID": "0697667", "rating": 8.5, "votes": 4001, "number_of_episodes": 172}