{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0606862": "Phil Morris", "0750468": "Debra Jo Rupp", "0834947": "Brenda Strong", "0644022": "Bob Odenkirk", "0269599": "Meagen Fay", "0080990": "Tamara Bick", "0871618": "Alex Trebek", "1157013": "Derek Jeter", "0930092": "Bernie Williams", "0541849": "Lawrence A. Mandley", "0280235": "Fern Fitzgerald", "0050164": "Noëlle Balfour", "0309307": "Kyle Gass", "0449742": "Judy Kerr", "5422885": "Antonio Bardales", "0141879": "Randy Carter", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0001468": "David Letterman"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Abstinence allows George to become a genius, but it turns Elaine into an idiot. Jerry gets bumped from career day at his old Jr. High School. Kramer turns his apartment into a smoking lounge and all the smoke disfigures his face.", "When George's new girlfriend gets mononucleosis, he's told there'll be no sex for at least six weeks. Frustrated, he begins to realize he has interests in science and history. Jerry says the lack of sex has made him smarter as he's now concentrating on his brain. For Elaine however, the lack of sex is having the opposite effect. Jerry is supposed to speak at career day at his old junior high but is continually being bumped first by someone who goes over his time and then by a fire drill. Kramer doesn't like having to go outside the restaurant to smoke and seeing there are many in the same boat, decides to turn his apartment into a smoker's lounge. It all has a serious effect on his looks and turns to lawyer Jackie Chiles to get justice.—garykmcd", "George's girlfriend says she has mononucleosis, so they should not have sex for the moment. And when George appears to be smarter, Jerry postulates that not having sex is probably why he is smarter. Elaine is dating a guy who's 'sort of' a doctor; he finished medical school but hasn't passed the certification. She wants him to pass so she can tell everyone she's dating a doctor. So she helps him study and when it appears he having trouble remembering things, Elaine, upon learning what happened to George decides to stop having sex with him. But for some reason Elaine is getting dumber. Jerry then assumes that not having sex has the reverse effect on women. When Kramer is thrown out of the restaurant when he tries to smoke, he runs into some other guys who are bummed that they can't smoke inside. So he turns his place into a smokers' lounge. But when his appearance is altered by the smoking, he decides to sue the tobacco company. So he tries to get Jackie Chiles to take the case which he is hesitant to do until he learns whom he wants to sue.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "0697646", "rating": 9.0, "votes": 4645, "number_of_episodes": 172}