{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0000978": "Lloyd Bridges", "0792210": "Liz Sheridan", "0551949": "Barney Martin", "0641417": "John O'Hurley", "0633564": "Chelsea Noble", "0174064": "O'Neal Compton", "0578810": "Lisa Mende", "0245940": "Gene Dynarski", "0735424": "Marco Rodríguez", "0881991": "Joe Urla", "0848154": "Jill Talley", "0390209": "Jill Holden", "0420408": "Todd Jeffries", "0776679": "Earl Schuman", "0806446": "Edgar Small", "0101242": "Lauren Bowles", "0306240": "Juan Garcia", "0588581": "Jeffrey Kurt Miller", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "5012093": "Kenneth J. Morgan"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Elaine is dragged to see the movie The English Patient (1996) on multiple occasions, even though she absolutely hates the film.", "Jerry visits his parents in Florida. Kramer asks Jerry to pick up some Cubans while he's there, but Kramer doesn't specify whether they are cigars or not. The next day, Jerry has an encounter with Izzy Mandelbaum, the founder of the Magic Pan crepe restaurant. Izzy challenges Jerry to a weight-lifting contest, but when Izzy takes it too far, he winds up in the hospital. Jerry goes to visit and learns that Izzy, his father and his son are nearly identical in age, and each one challenges Jerry to a weight-lifting contest. Meanwhile, back in New York, Elaine is repeatedly dragged to go see the best picture winning film The English Patient (1996), but she absolutely despises it. Peterman nearly fires Elaine when she gets angry and leaves half way through the movie. Peterman gets so angry at Elaine that instead of firing her, he decides to teach her a lesson by making her go to Tunisia and live in a cave for six weeks. Jerry gets back to New York and Kramer learns that the Cubans aren't really Cubans but Dominicans. They then take jobs rolling crepes at the Magic Pan restaurant, but get fired and wind up becoming Cubans, hijacking Elaine's plane and flying it to Cuba.", "Elaine seems to be the only person around who thinks the film The English Patient (1996) is the most boring movie ever made. People get mad at her and her boyfriend starts to avoid her. When Peterman raves about the movies she's reluctant to tell him what she really thinks and so tells him she's not seen it. He has the solution for that. Jerry meanwhile travels to Florida to visit his parents and is introduced to Izzie Mandelbaum, an octogenarian who is intent to prove to everyone that he is the fittest man in the room. Jerry also agrees to do Kramer a favor by agreeing to pick up some Cubans for him - only it turns out the Cubans in question aren't cigars.—garykmcd"], "genres": "N/A", "imdbID": "0697691", "rating": 8.5, "votes": 3883, "number_of_episodes": 172}