{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0835722": "James Patrick Stuart", "0378800": "Richard Herd", "0913797": "Gedde Watanabe", "0793634": "Sab Shimono", "0101337": "John Bowman", "0687443": "Jack Plotnick", "0908648": "George Wallace", "0865084": "Toshi Toda", "0592664": "Goh Misawa", "0882769": "Tony V.", "0625130": "Akane Nelson", "1139689": "Cherie Hankal", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0303991": "Tom Gammill", "0682326": "Dave Pierce", "0784328": "Doug Senior"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry gets hundreds of royalty checks, worth 12 cents each, for appearing on a Japanese TV program and gets writer's cramp. George and Jerry pitch their pilot to Japanese TV executives.", "Elaine falls hard for her new boyfriend, who gets hypnotized every time he hears the song \"Desperado.\" Jerry has to endorse hundreds of royalty checks from Japan because of his work on the \"Super Terrific Happy Hour Show.\" The checks are worth 12 cents each. Jerry claims that he invented the umbrella twirl and then gets ousted by the umbrella salesmen he used to work with. Elaine's new boyfriend has a thing for a furniture designer named Karl Farbman. He buys Kramer a dresser made by Farbman. Kramer's Japanese friends run out of money and wind up staying in the drawers of the dresser. When the hot tub warps the drawers (Jerry can't open them because his hands are cramped from endorsing checks) he axes the Farbman dresser. Elaine's boyfriend tries to stop him but Jerry swings and hits him in the head. While at the hospital, the doctor loses his patient when he becomes hypnotized by Elaine's favorite song, \"Witchy Woman.\"—Jim", "Elaine dates a furniture salesman who is obsessed with the Eagles song \"Desperado\" as well as furniture designed by Karl Farbman. He sells Kramer a nice set of drawers. Kramer befriends some Japanese tourists and starts throwing some of their yen around. Jerry gets hundreds of royalty checks from a show called \"The Super Terrific Happy Hour.\" George, inspired by this, gets the idea to sell the \"Jerry\" pilot to Japanese television.—halo1k", "Jerry is getting writers camp from the hundreds and hundred of royalty checks he's receiving from a Japanese TV show. The problem is that each check is worth only a few cents. Elaine's new boyfriend has a particular reaction to a song he hears on the radio. Kramer meanwhile befriends some visiting Japanese tourists and offers them lodging in his apartment - specifically in a large chest of drawers Elaine's boyfriend has given to him.—garykmcd"], "genres": "N/A", "imdbID": "0697672", "rating": 8.0, "votes": 3536, "number_of_episodes": 172}