{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0641417": "John O'Hurley", "0731393": "Mark Roberts", "0435770": "Kymberly Kalil", "0731426": "Michael D. Roberts", "0502998": "Wesley Leong", "3024707": "Christopher Aguilar", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "10605902": "Jenny Inge"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Kenny Rogers' Roasters sets up shop across the street from Jerry and Kramer's apartments. Unfortunately, their unusually large chicken sign causes problems for everybody. Kramer and Jerry wind up switching apartments--and personalities--because of it. Jerry is freaked out by a wooden doll in Kramer's apartment, and Newman gets Kramer hooked on Kenny Roger's chicken. Elaine gets comfortable in her position as president of the catalog but is quickly accused of abusing the company credit card, especially when she buys George an expensive hat and George purposefully leaves it at his girlfriend's apartment in hopes that it will score another date. Meanwhile, Jerry's old college friend has lunch with him and winds up getting fired; he takes a new job at the Chicken Roaster's.—halo1k", "Kramer is upset when a Kenny Rogers chicken restaurant opens across the street from the apartment building. He thinks that it will never succeed, but when Newman raves about it, Kramer is soon addicted. The other problem he has is the neon lighting that bathes his apartment in a bright red glow. He's soon moved in with Jerry, but the two of them start to undergo a personality transplant. Elaine gets into trouble with the company accountant when she starts putting personal items on her company credit card, including a ridiculously expensive sable hat for George. Jerry's old college friend blows off an important meeting to have lunch with Jerry.—garykmcd"], "genres": "N/A", "imdbID": "0697674", "rating": 8.9, "votes": 4757, "number_of_episodes": 172}