{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0000079": "Raquel Welch", "0641417": "John O'Hurley", "0788340": "Molly Shannon", "0001605": "Amanda Peet", "0881991": "Joe Urla", "0706838": "Victor Raider-Wexler", "0219536": "Peter Dennis", "0806613": "Tucker Smallwood", "0928657": "Wayne Wilderson", "0316532": "Blake Gibbons", "0816962": "Adrian Sparks", "0426675": "Jane A. Johnston", "0101242": "Lauren Bowles", "0329240": "Sue Goodman", "0283568": "Neil Flynn", "0047520": "Tom Bailey", "0078815": "Denise Bessette", "0541635": "David Mandel", "1131118": "Ruth Cohen", "0179357": "Rick Corcoran", "1250208": "George Doty IV", "0275261": "Norman Fessler", "0449742": "Judy Kerr", "0545908": "Jim Marcos", "1054700": "Pete G. Papanickolas", "1660819": "Karen Wilkie"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Unemployed again, George decides to have a \"memorable\" summer. Jerry's new girlfriend has another dude. Kramer wins a Tony Award. A new woman at work is hostile towards Elaine.", "With three months' severance pay from the Yankees, George decides that he's going to have a great summer. Things don't quite go as planned. Jerry meanwhile is dating someone new, Lanette, whom he invites to attend the Tony awards with him. When he picks her up, however, she seems to have a live-in boyfriend. Kramer is also at the awards ceremony and gets dragged on stage with some of the winners. He basks in the glow of having 'won' a Tony, and the producers decide to use him to get rid of their star, Raquel Welch. At her work, Elaine makes a comment about a co-worker and is accused of being catty.—garykmcd", "George gets a severance check from the Yankees and decides to take advantage of his windfall by living it up during the summer. Jerry dates a woman who apparently has another \"feller,\" but when she dumps him, he finds out that she is high maintenance, so he and George team up to make one normal man. Kramer accidentally gets a Tony and in order to keep it, he has to fire Raquel Welch from the production. Elaine is accused of being catty when she makes fun of a woman who doesn't swing her arms when she walks.—Todd Walker"], "genres": "N/A", "imdbID": "0697794", "rating": 8.5, "votes": 3806, "number_of_episodes": 172}