{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0364680": "Estelle Harris", "0005467": "Jerry Stiller", "0405337": "Steve Hytner", "0378800": "Richard Herd", "0881991": "Joe Urla", "0068709": "Ned Bellamy", "0486277": "A.J. Langer", "0493535": "Katie Layman", "0020479": "Eddie Allen", "0569076": "Gwen McGee", "0543327": "Lynn Manning", "1752076": "Norman Brenner", "1131118": "Ruth Cohen", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry's new girlfriend's mentor is dating Bania; Kramer volunteers to host a Jewish singles mixer; George tries to study up on risk management; Elaine promotes a man she is afraid to fire.", "Kramer volunteers to set up a Jewish singles mixer. He has a hard time finding a cook for the event until he learns that Frank was a cook in the Korean War. But Frank refuses to cook for the event because he experienced a severe case of shell shock. Meanwhile, Elaine tries to get rid of an unruly employee in Peterman's mailing room but winds up promoting the guy instead. Jerry dates a woman with a mentor, but he gets weirded out when he finds out that the mentor is dating hack comic Kenny Bania. Jerry, inspired by this, decides to take Bania under his wing and mentor Bania to the top. George must give a report on the subject of risk management for the Yankees.—halo1k", "Kramer's latest scheme is to organize a mixer for Jewish singles. He's rented the Knights of Columbus Hall for the event and plans to do the cooking himself. It's soon obvious that he can't cope and begs George's father Frank, who was an Army cook in the Korean War, to help him, but Frank is still scarred by a particularly traumatic experience there and hasn't cooked since. Meanwhile, Jerry is happy that his new girlfriend has a mentor, but not so please when he learns that the woman dates Bania. George must give a talk on risk-management at a Yankees lunch. Elaine can't quite bring herself to fire the mailroom clerk, so she does the next best thing: she keeps promoting him.—garykmcd"], "genres": "N/A", "imdbID": "0697694", "rating": 8.0, "votes": 3577, "number_of_episodes": 172}