{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001762": "Jill St. John", "0001822": "Robert Wagner", "0005226": "Debra Messing", "0186505": "Bryan Cranston", "0940173": "Danny Woodburn", "0190550": "Suzanne Cryer", "0128462": "Stephen Caffrey", "0941572": "Henry Woronicz", "0187253": "Monica Lacy", "0550497": "Ali Marsh", "0151347": "David Chandler", "0914918": "Virginia Watson", "0291628": "Walter Franks", "0546439": "Jerry Maren", "0057480": "Elizabeth Barrington", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0506697": "Eugene Lew", "1738630": "Andrea Ragsdale", "0736821": "David Rogers"}, "geners": ["Comedy"], "runtimes": ["26"],  "plot": ["George's new girlfriend keeps including \"Yada Yada\" in her stories. Jerry is offended by Tim Whatley's Jewish jokes. Elaine tries to help her friends adopt a baby. Kramer and Mickey fight over two women.", "George's new girlfriend often fills in her stories with the expression yada-yada leaving out much of the detail. Jerry tells him she's being concise but not knowing what's going starts to drive George crazy. Jerry meanwhile is convinced that his dentist, Tim Whatley, has converted to Judaism to he can tell Jewish jokes. When he continues to tell Catholic jokes, he even complains to Whatley's former priest. It all leads Kramer to accuse him of being an anti-Dentite. Elaine is asked by friends to be a character reference with a adoption agency but she doesn't exactly help them. Kramer and Mickey can't quite agree on which of two women they've met they'd like to date.—garykmcd", "George's new girlfriend Marcy is fond of the expression \"yada yada yada.\" Jerry feels uncomfortable when his dentist converts to Judiasm. Kramer and Mickey have trouble deciding which girl they each prefer when they double date,and Elaine is used as a character reference by some friends planning to adopt but manages to mess things up.—two_green_bottles"], "genres": "N/A", "imdbID": "0697814", "rating": 9.0, "votes": 5009, "number_of_episodes": 172}