{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0504335": "Len Lesser", "0730140": "Richard Roat", "0040717": "Fort Atkinson", "0700793": "David Purdham", "0132504": "Heather Campbell", "0290632": "Ramón Franco", "0929780": "Bari K. Willerford", "0015606": "Shuko Akune", "0662238": "F. William Parker", "0376531": "Lyn Alicia Henderson", "0336029": "Bill Gratton", "0504185": "Susan Leslie", "0275261": "Norman Fessler", "0367005": "Phil Hartman", "0541635": "David Mandel"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["A mysterious package arrives for Jerry. Elaine is curious about what the doctors are writing in her records. George tries to hit on the cute girl at the \"One Hour Photo\" place.", "Kramer tries to get a \"refund\" for Jerry's broken stereo. Jerry is against the idea until he gets a mysterious package in the mail. Newman accuses Jerry of mail fraud when Uncle Leo signs for the package and an explosion is heard while he is talking to Jerry. George, meanwhile, gets involved with \"Photo Store Shelia\" when she accidentally slips an enticing photo in George's pictures. George decides to send one back, but the plan backfires. And Elaine gets a rash and is barred from every doctor in New York when she takes a peek at her medical chart.—halo1k", "Jerry's stereo isn't working properly and Kramer comes up with a scheme to replace it. He sends him a package of broken parts through the US Mail and insures it for $400. Turns out claiming the insurance isn't as easy as he thought. Elaine meanwhile is upset after she reads an old entry in her medical file describing her as difficult. She becomes obsessed with knowing what else might be in the file and a round of doctor shopping ensues. George thinks he's made it when the attractive woman at the photo developing shop takes an obvious interest in him but he isn't quite prepared for what it all leads to.—garykmcd", "When Jerry's stereo breaks and there's no warranty, Kramer comes up with a plan to get the Postal Service to pay for a new one but it turns out to be not legal and Newman calls Jerry out on it. George thinks the girl at the photo developing place likes him but he's too timid to make a move. And when he finds a photo in his pack of a scantily clad woman, Kramer convinces him she's trying to entice him, so he gets George to join in and take some provocative photos and give it to her to develop. But ends up with the wrong person. And Elaine goes to her doctor and when he catches a glimpse of her chart and didn't like what was in it and complained to the doctor and made a big fuss about it. Later when she comes down with a rash, she goes to another doctor who got from her previous doctor her chart and upon reading it gives her a polite brush off and not really treating her.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "0697746", "rating": 8.6, "votes": 3877, "number_of_episodes": 172}