{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0641417": "John O'Hurley", "0034305": "Lee Arenberg", "0448620": "Shannon Kenny", "0567422": "Megan Cole", "0378800": "Richard Herd", "0933560": "Jane Edith Wilson", "1453507": "George Adams", "1131118": "Ruth Cohen", "1029377": "Eric Feder", "0275261": "Norman Fessler", "0935895": "Tony Winters"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Kramer sets his watch an hour ahead. George tries to avoid a breakup with his girlfriend. A colleague keeps calling Elaine, Susie. Jerry gambles on a basketball game, but the bookie can't pay him.", "A co-worker of Elaine's thinks Elaine is called Susie, and Elaine doesn't bother to correct her, when she badmouths Elaine to \"Susie.\" Elaine complains of this to Jerry, who commiserates with her. Later, Peggy gets \"Susie\" called in front of Peterman, who demands that Elaine be there also. Elaine finds a way to wriggle out of the situation so that neither realizes Susie doesn't exist. Meanwhile, Kramer puts 100 dollars on a basketball game in Jerry's name with Mike, the guy who called Jerry a phony in \"The Parking Space.\" When Kramer attends the game, he gets in a fight with the players, causing Jerry to win his bet. Mike doesn't have enough money to pay Jerry, however, so he tells him that he'll fix his trunk. As he's looking at it, Jerry doesn't notice him and closes the trunk on Mike's hands. Mike thinks this is a classic case of having his thumbs broken because he can't pay, so he promises he'll get the money. Later, as he's trying to fix it again, Mike falls into the trunk, which locks behind him. When Jerry and Elaine are driving around, Elaine is complaining about Susie, and Jerry says she should \"eliminate\" her. Mike hears them say this, and then hears them laughing, but he doesn't know they're laughing at a bumper sticker. The next day, Peterman assigns Susie to a project that Elaine wanted, so she tells Peterman that Susie took her own life. Jerry goes with Elaine to Susie's wake, where they discover that, although Susie only existed for a few days, she has more friends than Elaine, because the room is packed. Peggy see Elaine and thinks she's Susie back from the dead. Elaine tells her that she is Elaine, and Peggy realizes she never met Susie. Elaine goes up to give the eulogy, but Peterman pushes her aside before she has to think of something to say. He then gives this long string of events which clearly never happened and Peterman invent, such as Susie and he sleeping together. Meanwhile, Mike manages to escape from the trunk and realizes he's at the wake of the girl he heard should be \"eliminated.\" He runs in and tells everyone that Jerry killed her, and Jerry just laughs. Peterman puts Elaine in charge of a foundation in Susie's honor, which she will spend every spare moment on. This parallel's George's own experience with Susan's death exactly, even down to the exaggerated yell of \"SUUUUSIEEEE!\" George is dating a sexy blonde, Allison, who has just bought a backless black dress for a ball, and he intends to have her spin her way in. George can't wait, because it'll be his first grand entrance. He's made a lot of grand exits, but for once, he wants to be known as soon as he walks into the room. There is one problem, however; Allison wants to break up with him. He starts not leaving his house and screening his calls because, \"If she can't find me, she can't break up with me.\" He even goes so far as to call her at her house, even though he knows she's at work. However, Kramer breaks up with him for Allison, and decides to attend the ball with George, without George's knowledge. When George tells Kramer to leave, they start pulling on each other, which causes George to fall forward, ripping the back of Kramer's suit and sending him twirling into the room, just as Allison would have done. Everyone congratulates George on a grand entrance.—lonedragon1422", "Elaine fails to correct a co-worker after woman calls her Susie leading to all kinds of confusion at work. When Peterman hears good things about Susie he wants to meet her. Things get really complicated when Elaine announces that Susie has died. George meanwhile is looking forward to a gala evening hosted by the Yankees. He's bought himself a new tuxedo for the occasion but he's particularly happy that his girlfriend will be wearing an attractive backless gown. The only problem is that she plans on breaking up with him and has to use Kramer as an intermediary when George begins to avoid her. After Kramer places a bet in Jerry's name and wins, the bookie can't pay up.—garykmcd"], "genres": "N/A", "imdbID": "0697795", "rating": 8.6, "votes": 3874, "number_of_episodes": 172}