{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0792210": "Liz Sheridan", "0551949": "Barney Martin", "0005467": "Jerry Stiller", "0364680": "Estelle Harris", "0641417": "John O'Hurley", "0056310": "Sandy Baron", "0798971": "Sarah Silverman", "0335523": "Leon W. Grant", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0447836": "Wayne Kennan", "1995441": "Deck McKenzie", "1054700": "Pete G. Papanickolas", "0724488": "David Richardson"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry's parents believe he is financially unstable. Kramer has trouble sleeping with his girlfriend. Elaine enjoys her position as President of the J. Peterman catalog. George hopes to get his parents' money when they die.", "Jerry buys his parents a Cadillac. His parents sell it to Jack Clompus for 6000 dollars and try and give the money to Jerry. Elaine has stock options at Peterman's and buys George coffee. George feels that she is \"sticking\" it to him. George tries to convince his parents to stay in Queens because he wants their money. They then decide to buy expensive things and move to Florida. Kramer's girlfriend has the \"jimmy legs\" and they sleep in the Costanza's apartment when they go to Florida. Jerry buys back the Cadillac from Clompus for 14000 dollars. Clompus crashes it along Alligator Alley. Jerry has to sleep in the Cadillac because he has no money. Elaine hires Morty Seinfeld because he thinks he needs to support Jerry. Peterman returns and dismisses Elaine from her position with no stock options. The Seinfelds sell their condo and attach a camper to their Cadillac.—Jim", "Jerry is upset when he learns that his parents have sold their Cadillac - which Jerry bought for them - to their Florida neighbor Jack Clompus. Jerry flies down to buy it back from him and Jack is more than happy to provide the pen to sign the rather large check Jerry will have to give him to get the car back. George meanwhile is amazed to hear about the money he might inherit from his parents but his probing of their age and health leads them to start spending. Elaine's attempt to help out by hiring Jerry's father turns to into a financial mess for her.—garykmcd"], "genres": "N/A", "imdbID": "0697734", "rating": 7.7, "votes": 3380, "number_of_episodes": 172}