{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0641417": "John O'Hurley", "0266697": "Richard Fancy", "0812133": "Rena Sofer", "0164918": "Melinda Clarke", "0320581": "Chaim Jeraffi", "0248913": "Sonya Eddy", "0469461": "Barry Kramer", "0852328": "Elayn J. Taylor", "0609055": "Paige Moss", "0830390": "Viola Kates Stimpson", "0727051": "Jack Riley", "0838677": "Bunny Summers", "0140804": "Earl Carroll", "1752076": "Norman Brenner", "0052753": "Reuven Bar-Yotam", "0233115": "Vince Donvito", "0122235": "Chris Burmester", "1995441": "Deck McKenzie", "0279153": "Victoria Fischer", "0783432": "Keith Sellon-Wright", "0043888": "Beth Aylward", "0063849": "Lee Bear", "0129244": "Neill Calabro", "1131118": "Ruth Cohen", "0202970": "Larry David", "0275261": "Norman Fessler", "0442646": "Gregg Kavet", "1054700": "Pete G. Papanickolas", "0732165": "Andy Robin"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Elaine tells her former boss Mr. Lippman about an idea to sell only the tops of muffins. Lippman does and Elaine is shocked to see the store, until he gives her a cut of the profits and she tells him how to improve the business.", "While promoting Peterman's book, Elaine runs into her former boss, Mr. Lippman, and tells him about an idea to sell only the tops of muffins. Lippman does, and Elaine is shocked to see the store, until he gives her a cut of the profits and she tells him how to improve the business. Kramer learns that Elaine put her stories in Peterman's book (see \"The Van Buren Boys\"), but when Peterman won't give Kramer a cut of the profits, Kramer starts the Peterman Reality Bus Tour. Elaine has a hard time getting rid of the muffin stumps and asks Kramer to take the bus to haul the trash to the dump, but the task is easier said than done. George is asked to watch a guy's suitcase on the street and is mistaken for a tourist. He then gets a date with the head of the New York tourist bureau and decides to run with it. But then the girl meets Steinbrenner and thinks that George is working two jobs, and George ultimately gets traded to Tyler Chicken in Little Rock, Arkansas in exchange for a bunch of chicken products to be used at Yankee Stadium concession stands. Meanwhile, Jerry starts shaving his chest to impress his new girlfriend.—halo1k", "George makes the mistake of agreeing to keep an eye on someone's suitcase while he runs into a store. He gives up after a long time, but starts wearing the guy's clothes. His new get-up gets him a date with the attractive head of the visitors' bureau. Elaine runs into her old boss Lippman and suggests that a good business venture would be to sell only muffin tops. She eventually goes into business with him but has a slight problem. When Peterman finally publishes his autobiography, he includes several of Kramer's stories, so Kramer decides to make a bit of money out of the situation.—garykmcd"], "genres": "N/A", "imdbID": "0697736", "rating": 8.3, "votes": 3763, "number_of_episodes": 172}