{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0362862": "Mark Harelik", "0825401": "Ben Stein", "0689177": "Joel Polis", "0587431": "Ivana Milicevic", "0834960": "Danny Strong", "0515289": "Richard Livingston", "0434739": "Charles Kahlenberg", "0783378": "Stan Sellers", "0543448": "Peggy Mannix", "0522935": "Fatima Lowe", "0153108": "Nancy Linehan Charles", "0369099": "Jeff Hatz", "0000913": "Robby Benson", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "0298333": "Robert Fuller"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["George tries to come up with a good comeback after someone insults him. Elaine falls in love with a mysterious employee at the video store. Kramer wants to die a certain way. Jerry takes advice from a tennis player who stinks.", "George gets insulted by a co-worker named Reilly during a business meeting with the line \"Hey George, the ocean called and they're running out of shrimp.\" He plans to get back at him with the \"jerk store\" remark, which all his friends try to change. Jerry buys a new tennis racket from Milos, a tennis pro-shop worker, because he thinks he is a great tennis player. Jerry finds out that Milos is a terrible tennis player and Milos offers Jerry his wife, Patty as some sort of \"medieval sexual payola.\" Patty loses respect for Milos so Milos begs Jerry to let him win a game of tennis in front of Patty. Elaine is renting videos from \"Vincent's Picks\" and develops a secret phone relationship with him. She betrays him when she rents \"Weekend at Bernie's,\" a \"Gene Pick.\" Kramer asks Elaine to act as a witness to \"pull the plug\" if he ever goes into a coma because he watches \"The Other Side of Darkness.\" He finds out that the woman coma victim wakes up and changes his mind after he signs the will. Vincent sends Elaine the play button of his VCR. George flies to Akron to try and zing Reilly with his \"jerk store\" remark. Elaine meets Vincent at his apartment with vodka, cigarettes, and fireworks and finds out that he is 15 years old. Kramer goes to meet his lawyer, Shellback, and gets pummeled with tennis balls. George's \"jerk store\" remark flops, and he tells Reilly that he had sex with his wife. George then learns that Reilly's wife is in a coma.—Jim", "George can't come up with a comeback to a fellow worker's catty remark and obsesses over how he'll deal with their next encounter. After watching a horror film, Kramer wants to give Jerry power over his health care should he be incapacitated and then decides it should perhaps be Elaine. Jerry is upset after learning that the sporting-goods salesman, Milos, who sold him an expensive new tennis racket, is a terrible tennis player. Milos tries to make amends. Elaine meanwhile finds that she has the same tastes in movies as a video-store employee though she's never met him.—garykmcd"], "genres": "N/A", "imdbID": "0697678", "rating": 8.5, "votes": 3917, "number_of_episodes": 172}