{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0005467": "Jerry Stiller", "0321358": "Neil Giuntoli", "0568777": "Rebecca McFarland", "0881991": "Joe Urla", "0641368": "Tim O'Hare", "0115234": "Johnathan Brownlee", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "1054700": "Pete G. Papanickolas", "0673642": "Vicki Sirotta"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry is forced to bootleg a movie for Kramer's friend. George tries the \"bad boy\" image. No one has the heart to tell Elaine that she's a terrible dancer.", "Kramer's friend Brody forces Jerry to bootleg the movie Death Blow. George follows Elaine to her office party and finds out that she has a \"unique\" dancing style. She starts to get a weird vibe from her subordinates and blames it all on George. George becomes the bad boy and wins the affection of Elaine's employee Anna. Jerry finds out that he is a gifted bootlegger and demands perfection while shooting Cry, Cry, Again. Kramer tells Elaine she can't dance. She then videotapes herself dancing over the bootleg of Cry, Cry, Again. Elaine apologizes over the phone to George calling him a \"good seed.\" He tries to win back Anna's affection by pretending to be a bootlegger. George is arrested and has to be picked up by his father. While picking up Anna from the police station, Elaine and Frank Costanza throw fists.—Jim", "George invites himself to Elaine's office party, primarily to get free food He meets Anna, who seems only interested in him is she thinks he's a bad boy. The big revelation however is Elaine's somewhat awkward dancing style. She has no idea how foolish she looks and it makes her the butt of office jokes. Jerry meanwhile meets Kramer's friend Brody who bootlegs movies he films off the screens in cinemas. When he gets Jerry to handle the camera he proclaims the result a masterpiece.—garykmcd"], "genres": "N/A", "imdbID": "0697725", "rating": 8.9, "votes": 4664, "number_of_episodes": 172}