{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0000413": "Janeane Garofalo", "0001117": "Bruce Davison", "0951471": "Grace Zabriskie", "0296583": "Warren Frost", "0641417": "John O'Hurley", "0881991": "Joe Urla", "0910376": "Susan Walters", "0098013": "Todd Bosley", "0145262": "Diana Castle", "0702850": "Stuart Quan", "0593388": "Herb Mitchell", "0447445": "Robert Louis Kempf", "0541849": "Lawrence A. Mandley", "0101242": "Lauren Bowles", "1519593": "Peggy Lane", "0848402": "Paige Tamada", "1519649": "Robert Padnick", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "2203857": "Renee Fishman"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["George enjoys the single life. Elaine takes over the catalog when J. Peterman suddenly goes missing. Kramer is taking karate lessons.", "After Susan dies, George decides to live the high life by going the bachelor pad route. But his fun quickly ends when Jerry quotes Star Trek II and the Ross's decide to create a foundation in Susan's memory. Jerry gets reacquainted with Mulva (see episode \"The Junior Mint\") and decides to do some research into which recent break-up story was more believable - his or George's. Elaine gets in trouble when J. Peterman flees to Burma and puts her in charge of the catalog. She doesn't think she is up to the task of running a large business until Kramer motivates her with some life lessons he learned in martial arts training. The stories do the trick until Elaine discovers who Kramer has really been fighting.—halo1k", "George decides he's been in mourning long enough and the time has come to start living again. Susan's parents make that just a little difficult when they tell him he's to sit on the board of a new charitable foundation they've set up in her memory. Kramer has been taking karate lessons which impresses everyone until they see his classmates. Elaine is filled with self-doubt when Peterman goes off to Burma and leaves her in charge of the company. Jerry has broken his engagement and runs into his old girlfriend Dolores (whose name rhymes with a body part).—garykmcd"], "genres": "N/A", "imdbID": "0697699", "rating": 8.1, "votes": 3596, "number_of_episodes": 172}