{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0405337": "Steve Hytner", "0911320": "Patrick Warburton", "0432410": "Gordon Jump", "0004862": "Kristin Davis", "0338456": "Everett Greenbaum", "0768145": "Connie Sawyer", "0284492": "Matthew Fonda", "0663177": "Chris Parnell", "0887279": "Frank van Keeken", "0924204": "Shannon Whirry", "2587904": "Nancy Balbirer", "3336016": "Erica Y. Becoat", "0901024": "Torsten Voges", "0313739": "George Georgiadis", "0130339": "Brian Callaway", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "4996775": "Carmi Greene", "0905928": "Hilary Wagner", "0930172": "Brian J. Williams", "0818454": "Spice Williams-Crosby"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Kramer discovers the amazing yet unknown uses of butter, but accidentally fries himself after using it as sunscreen.", "Kramer discovers a new use for butter by applying it to his face while he shaves, but he accidentally cooks himself when he uses it as sunscreen. George gets a job with a company that makes playground equipment, and really enjoys it after he successfully convinces his boss that he's handicapped. Jerry is riding a wave of success at comedy clubs, but hates the fact that hack comic Kenny Bania is riding his coattails. Elaine is on her way back from Scandinavia with Puddy and they repeatedly break up and get back together.—halo1k", "Following his recent accident, George is walking with the use of a cane and has little difficulty getting a job as his employers think he's handicapped. He gets a beautiful office, a chair lift to get up the stairs and his own private bathroom. It can only go downhill from here. Kramer starts applying butter to his face before shaving. He soon covers his whole body and goes sunning on the roof - with the expected results. Jerry is still bugged by his fellow comedian Bania who he is convinced is stealing his ideas from him. Elaine and Puddy spend a month together in Europe and she decides to break up with - just before they get on a very long flight home.—garykmcd"], "genres": "N/A", "imdbID": "0697665", "rating": 8.3, "votes": 3909, "number_of_episodes": 172}