{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0005467": "Jerry Stiller", "0364680": "Estelle Harris", "0911320": "Patrick Warburton", "0853372": "Laurie Taylor-Williams", "0403947": "Toby Huss", "0332344": "Dana Gould", "0474056": "Richard Kuhlman", "0353705": "Montrose Hagins", "0089429": "Peggy Blow", "0086515": "Clement Blake", "3348364": "D.A. Johnson", "0000979": "Wilford Brimley", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "2579867": "Renee McClellan"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Kramer is annoyed with the catalogs he keeps getting in the mail. Elaine falls in love with a guy because of his smile. George's parents are avoiding him. Jerry can't find it in his heart to reject a gift from an old school friend.", "Kramer becomes annoyed at all the junk mail he gets, so he decides to stage a crusade against the post office. Jerry runs into \"Fragile Frankie\", a former childhood acquaintance, who tries to sell Jerry a huge new van. Frank and Estelle try to find a way to spice up their love life, against George's objections. Meanwhile, Elaine dumps Puddy for a guy who does TV spots for an electronics store called \"Nobody Beats The Wiz\".—halo1k", "Kramer starts a crusade against the post office when the catalogs and junk mail start piling up. Jerry is offered a new car from \"Fragile Frankie\", an old childhood acquaintance of Jerry's, but Fragile Frankie gives Jerry a huge new van instead. Frank and Estelle try to cut George loose in an effort to spice up their love life. Elaine dumps Puddy for a guy who used to do advertisements for an electronics store called \"Nobody Beats The Wiz\".—halo1k", "Kramer is upset with junk mail and the number of catalogs he's receiving. He tries to fight back but they just keep appearing so he sets out to neutralize the real source of the problem: the U.S. Post Office. Newman tries to warn him off but it may be too late. Jerry gets a car for doing work for a dealership and his childhood friend Frankie gets him the van they always dreamed about - when they were 10 years old. Elaine is enamored with her new boyfriend until Jerry points out the man used to do a bizarre commercial on a local television station. George meanwhile has to put up with his parents whose sex life seemingly holds no bounds.—garykmcd"], "genres": "N/A", "imdbID": "0697716", "rating": 7.9, "votes": 3518, "number_of_episodes": 172}