{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0551949": "Barney Martin", "0792210": "Liz Sheridan", "0915499": "Kellie Waymire", "0457389": "Audrey Kissel", "0416381": "Colton James", "0245940": "Gene Dynarski", "0268534": "Yvonne Farrow", "0000978": "Lloyd Bridges", "1131118": "Ruth Cohen", "0275261": "Norman Fessler"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry's parents hire their friend Izzy Mandelbaum to become Jerry's personal trainer while George decides to associate food and television with his love life.", "Jerry starts gaining weight and his parents hire Izzy Mandelbaum (see episode \"The English Patient\") to assist Jerry as a personal trainer. Kramer starts giving blood and uses his own refrigerator to store it, but it freaks Jerry out. Then, George starts dating a woman who uses incense, and he gets the idea to associate food and sex with his love life. He makes something called \"pudding skin singles\" using an Exacto knife. Back at Jerry's, he yells at Kramer to get the blood away from him, but then he pounds the table and the Exacto flies at him and cuts his throat. Jerry loses blood and Kramer gives Jerry some of his, causing Jerry to freak out. Meanwhile, Elaine is out in the suburbs visiting her friend Vivian. Vivian wants somebody to watch her troublesome son Jimmy but she doesn't think Elaine is responsible enough. So Elaine goes to great lengths to prove it, even taking Kramer's spot. Vivian then tells Elaine that she is experiencing some health problems, and that Elaine might be on deck as a permanent babysitter for Jimmy. The next day, Izzy shows up at Jerry's and takes him to a gymnasium, circa 1920. Kramer keeps trying to get Jerry to pay back the favor of donating blood by letting him and Newman watch a video. Unfortunately, it's an instructional video on how to make your own sausage. Izzy sees the sausages and orders them to be thrown out. George ups the ante on his Caligula complex by eating pastrami sandwiches during love making. Elaine watches little Jimmy but is quickly running out of purses. The next day Newman and Kramer are mad at Jerry and Kramer asks to borrow Jerry's car to take his blood back to the blood bank. Jerry obliges and, but the engine in the car burns out and Kramer uses blood to replace the oil. George decides to up the ante again and add television to the equation but then his girlfriend finally catches wind of what George is doing and dumps him. Later that day, George gets infatuated at the coffee shop eating a sandwich. After that, Jerry meets up with Izzy, who ties Jerry to the back of his car and starts pulling him. Jerry collapses when Izzy's son speeds up the car when he notices blood dripping on his feet. George meets Vivian, who shares his passion for the erotic qualities of salted cured meats. George meets Jerry in the hospital and now he's watching out for Jimmy. Jerry learns who the blood donor is this time around, and it's Newman.—halo1k", "Kramer has taken to storing several units of blood at a local blood bank, just in case. When he gets into a dispute with them he decides to take the blood home, which Jerry finds absolutely disgusting. George has a new girlfriend who burns incense while they have sex. The smell makes him ravenous and he starts to eat during their love-making. After several comments telling him he's getting pudgy, Jerry decides to start an exercise regimen. He also decides to get a personal trainer and ends up with Izzy Mandelbaum. Elaine is upset when her friend Vivian suggests Elaine may not be responsible enough to babysit her son Jimmy. She insists on proving herself but regrets having to up with the devil incarnate.—garykmcd"], "genres": "N/A", "imdbID": "0697658", "rating": 8.1, "votes": 3603, "number_of_episodes": 172}