{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0189220": "Marcia Cross", "0901926": "Daniel von Bargen", "0779467": "Larry B. Scott", "0603655": "David Moreland", "0275261": "Norman Fessler", "13548006": "Travis Wesley"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["Elaine borrows Kramer's meat slicer to feed her neighbor's cat while George tries to hide his not-so-great past from his new boss.", "Kramer buys a meat slicer and really enjoys making fresh sandwiches. Elaine's neighbor goes to Europe but forgets to turn his alarm off, driving her nuts. George gets a new job at Kruger Industrial Smoothing. Jerry dates Dr. Siterides, a dermatologist. Thanks to George's suggestion, Jerry tries a revenge date when Dr. Siterides makes him feel inadequate for not saving lives, but the plans quickly backfire. George enjoys his new job at the incompetent company but when he sees a photo sitting on his boss's desk, he remembers when he first encountered Kruger. George steals the photo out and has himself airbrushed out. Elaine enlists Kramer to help her blow the fuses in her building. But when that finally turns the alarm off, they learn that Elaine's neighbor has a cat, and blowing the fuses shut off the automatic feeder. So she borrows the meat slicer in order to feed the cat, but gets slicer happy and cuts off part of her shoe. George, meanwhile, gets the photo back, but the photo store clerk accidentally airbrushed Kruger out instead of him. Back at Jerry's, George panics because they airbrushed the wrong guy out of the photo. He needs a photo of a shirtless Kruger and gets Dr. Siterides to do a skin cancer screening at Kruger. Dr. Siterides agrees, but after Jerry accuses her of giving him hives, she bails on the screening. But after Kramer gets his meat slicer repaired at Kruger, the clueless Kruger mistakes Kramer for a real doctor, and Kramer does the screening anyways, posing as Dr. Van Nostrand. Later, Jerry realizes that it was Dr. Van Nostrand, not Dr. Siterides, who gave him hives. George manages to successfully get himself airbrushed out of the picture and returns the picture to Kruger's desk, without him noticing.—halo1k", "Jerry's new girlfriend is a doctor named Sara and she is continually belittling his occupation asking him if he has any idea what it feels like to save a person's life. When Elaine tells him she's a dermatologist, he mocks Sara on their next date not realizing exactly what it is her work implies. Kramer decides he can make better sandwiches than he's getting at the coffee shop and buys a meat slicer. It happens to come in particularly handy when Elaine needs to feed a neighbor's cat. George meanwhile thinks he's found the perfect job at a company where no one seems to know what they are doing. He gets more than a little concerned when he realizes that he had an unpleasant encounter with his boss many years before.—garykmcd"], "genres": "N/A", "imdbID": "0697777", "rating": 8.3, "votes": 3574, "number_of_episodes": 172}