{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0641417": "John O'Hurley", "0132610": "Julia Campbell", "0001780": "Peter Stormare", "0052753": "Reuven Bar-Yotam", "0787910": "Sam Shamshak", "0928657": "Wayne Wilderson", "0128110": "Mark Daniel Cade", "0260558": "Jack Esformes", "0219852": "Melissa Denton", "0611407": "Oliver Muirhead", "0068166": "Drake Bell", "0107470": "Eve Brenner", "1131118": "Ruth Cohen", "0188243": "Jennifer Crittenden", "0275261": "Norman Fessler", "0672575": "Bob Pepper"}, "geners": ["Comedy"], "runtimes": ["22"],  "plot": ["George is obsessed with preserving his Frogger high score for posterity; Jerry stays one step ahead of a serial killer; Elaine eats Peterman's expensive cake.", "Jerry's dating a girl who always finishes his sentences. He decides the time has come to have it out with her. Elaine is getting tired of all the cake parties at work every time someone leaves, arrives, is sick and so on. She realizes she's gotten use to the sugar rush though and raids Peterman's office fridge only to eat a collectible piece of cake from a very special weeding that he bought at a Sotheby's auction. George decide he wants to buy the Frogger game from his old hangout after he sees that he still has the high score. He has to figure out a way to get to his place without erasing the game's memory. Kramer says there's a serial killer around, the Lopper, and that his latest victim resembled Jerry.—garykmcd", "Jerry and George find out that their old high school hangout location, Mario's Pizza, is about to close down, so they decide to go back for one last slice. After being greeted coldly by the cynical Mario, George's eye happens to fall on a Frogger machine which he used to play endlessly. After examining the game, he realizes that he still holds the top score he placed in high school. Jerry reminds him that if he unplugs the machine, the roster will be reset. With time running out until Mario's closes down, George tries to track down some of Kramer's friends to help him transport the Frogger to his house without the Frogger losing power. Elaine, meanwhile, has accidentally eaten a 70-year old piece of cake from that her boss, Mr. Peterman, bought at an auction. She tries to replace it with an accurate replica of said slice - an Entimanns - without the professional Peterman has hired to give the slice an estimate noticing.—Gafaddict"], "genres": "N/A", "imdbID": "0697701", "rating": 8.7, "votes": 4279, "number_of_episodes": 172}