{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0005467": "Jerry Stiller", "0364680": "Estelle Harris", "0186505": "Bryan Cranston", "0901926": "Daniel von Bargen", "0277690": "Karen Fineman", "0282649": "Dave Florek", "0567852": "Kevin McDonald", "0504832": "Tracy Letts", "1185206": "Amit Itelman", "0380676": "Stacey Herring", "0540406": "Colin Malone", "0228869": "Jerry Dixon", "0044494": "Thomas Azzari", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "1197680": "Jodi Carol Harrison", "1738630": "Andrea Ragsdale"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["Jerry goes out with a woman who is beautiful one day and ugly the next. Kramer goes back to work at H&H Bagels. George makes up a charity. Elaine gives a fake number to a man.", "Kramer returns to H&H bagels after a 12 year strike. Elaine gives \"denim vest\" a fake number on her free sub card. Jerry meets a woman named Gwen who is \"two faced\". (She doesn't look good in some light)George creates a fake charity called \"the human fund\" to give fake Christmas presents at Kruger. He invites Kruger over to celebrate \"Festivus\" when he can't cash the 20,000 dollar charity check to \"the human fund\".—Jim", "Kramer is thrilled at the news that the 12 year strike at H and H Bagels is over and that he can now go back to work. Most are just amazed that he ever worked in the first place. Things don't quite go as planned. Jerry's in something of a quandary when he realizes that his new girlfriend Gwen looks radically different depending on the how the light falls on her face. After someone gives George a gift by donating in his name to a charity, he decides to do the same at his work but creates a phony charity and gives out the cards. He's caught out however forcing him to blame his conduct on Festivus, the holiday his father had created many years before as a reaction to the commercialization of Christmas. George is soon reliving his childhood nightmare. Elaine gives out a fake telephone number to someone at a party but then realizes she gave away her card for a free sub sandwich.—garykmcd"], "genres": "N/A", "imdbID": "0697790", "rating": 8.7, "votes": 4623, "number_of_episodes": 172}