{"cast": {"0000632": "Jerry Seinfeld", "0000506": "Julia Louis-Dreyfus", "0724245": "Michael Richards", "0004517": "Jason Alexander", "0001431": "Wayne Knight", "0551949": "Barney Martin", "0792210": "Liz Sheridan", "0641417": "John O'Hurley", "0504335": "Len Lesser", "0672103": "Jonathan Penner", "0740360": "Ted Rooney", "0340973": "Jon Gries", "0248913": "Sonya Eddy", "0242257": "Merrin Dungey", "0749225": "Kevin Ruf", "0604705": "Heather Morgan", "0101242": "Lauren Bowles", "0128110": "Mark Daniel Cade", "0323853": "Joe Goddbiff", "1752076": "Norman Brenner", "1131118": "Ruth Cohen", "0275261": "Norman Fessler", "1682771": "Johann John Jean", "0665108": "Pete Pastore", "0707795": "Andrew Patrick Ralston", "0732311": "Lesley Robins", "1187735": "Frank Sackett", "0848558": "Maureen Tamblyn"}, "geners": ["Comedy"], "runtimes": ["23"],  "plot": ["George is forced to buy a book he took with him into the bathroom. Jerry finds out that his Uncle Leo is a shoplifter. Elaine doesn't want to be known as the office skank. Kramer and Newman start a Hong Kong rickshaw business.", "While at Brentano's, George is forced to buy an expensive art book after taking it into the bathroom. George has a hard time getting rid of said book. Jerry catches Uncle Leo shoplifting and has a hard time dealing with the situation. Kramer and Newman set up a rickshaw business using New York's homeless population but the plans quickly backfire. Elaine gets in trouble when she has a drunken make out session at Peterman's party and Peterman orders the guy to attend rehab.—halo1k", "George drags Jerry to Brantano's bookstore as it's reputed to be the new in place to meet women. While there however, George takes an expensive art book with him when he goes to the bathroom. The store insists that he buy it. While in the store, Jerry is flabbergasted to see his Uncle Leo steal a book. Elaine doesn't dance at this year's party but she gets drunk and makes out with a co-worker. Kramer and Newman decide to pursue their idea of having rickshaws in New York City. They plan on using the homeless as labor.—garykmcd"], "genres": "N/A", "imdbID": "0697659", "rating": 8.1, "votes": 3465, "number_of_episodes": 172}