{"cast": {"0567184": "David McCullough", "0285231": "Shelby Foote", "2719095": "Barbara Fields", "4415661": "Daisy Turner", "0064007": "Ed Bearss", "6562725": "Stephen B. Oates", "2683775": "James Symington", "0001832": "Sam Waterston", "0364915": "Julie Harris", "0001673": "Jason Robards", "0000151": "Morgan Freeman", "0736259": "Paul Roebling", "2716065": "George Black", "0445087": "Garrison Keillor", "0007186": "Arthur Miller", "0613997": "Christopher Murney", "3661884": "Charles McDowell", "0285210": "Horton Foote", "0687321": "George Plimpton", "0097842": "Philip Bosco", "2717131": "Terry Courier", "0694169": "Jody Powell", "0855602": "Studs Terkel", "0001394": "Derek Jacobi", "0000460": "Jeremy Irons", "0903361": "Kurt Vonnegut Jr.", "0428122": "Gene Jones", "0218731": "Jerome Dempsey", "0000401": "Laurence Fishburne", "1263066": "Betsy Apple", "2740370": "Carol Craven", "0178636": "Marissa Copeland", "2663877": "Halo Wines", "0548801": "David Marks", "0715622": "Pamela Reed", "0318224": "Ronnie Gilbert", "0001826": "M. Emmet Walsh", "0001924": "Hoyt Axton", "0366698": "John Hartford", "0534249": "Walt MacPherson", "0223157": "Colleen Dewhurst", "0724665": "LaTanya Richardson Jackson", "6166035": "Bradford Washburn", "1177540": "Jesse Carr", "3656026": "Wendy Tilghman", "0560514": "Joe Mattys"}, "geners": ["Documentary", "History", "War"], "runtimes": ["96"],  "plot": ["The turning point of the war occurs at the Battle of Gettysburg, Lincoln makes a memorable speech as he dedicates the Union cemetery at Gettysburg, and draft riots break out in New York.", "In trying to draw Union troops away from the siege of Vicksburg, Robert E. Lee invaded Pennsylvania and over three days 150,000 men would do battle at Gettysburg. Confederate soldiers had gone into Gettysburg as they had heard there was a large supply of shoes available. The town soon became the focus of the battle that would shape the rest of the conflict. On the first day at Gettysburg, the Union forces were pushed back and by mid-afternoon, Confederate soldiers occupied the town. The second day focused on positioning leading to the battle of Little Round Top. an ideal position from which to gain the high ground and battlefield. The Union quickly gained control of the site and repelled several Confederate attempts to oust them. On day three, Lee ordered Gen. George Pickett to lead the charge against the Union forces on Cemetery Hill. Gen. Meade anticipated the attack and the rout of Confederate forces was complete with 6,500 casualties including most of the commanders. The next day, Lee began the retreat to Virginia and wrote to Jefferson Davis offering to resign; Davis declined the offer. In Vicksburg meanwhile, Grant's artillery bombarded the city daily leading to the Confederate surrender. In the North, Lincoln's conscription bill allowed those who paid $300 to be exempted. It led to the New York draft riots where for three days the mob was in control, killing blacks at every turn. The first black regiments when into battle and fought and died with honor. In the battle of Chickamauga, the Union forces again prevailed.—garykmcd"], "genres": "N/A", "imdbID": "1066647", "rating": 8.7, "votes": 416, "number_of_episodes": 9}