{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0930454": "Dick Anthony Williams", "0101621": "Alan Boyce", "0261452": "Christine Estabrook", "0419054": "Graham Jarvis", "0362222": "Jerry Hardin", "0609157": "Robin Mossley", "0304422": "Merrilyn Gann", "0864154": "Gordon Tipple", "0205657": "William B. Davis", "1477778": "Courtney Arciaga", "0676792": "David Petersen", "0235227": "Robin Douglas"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["46"],  "plot": ["A criminal believed to have died in a prison years earlier wages a vendetta against Mulder.", "The man whom Mulder worked for before calls him to tell him of something weird, a robbery and a note left for him. When Mulder reads it, it's how a criminal whom he pursued 6 years ago would leave notes for him. Thing is the man died a few years ago in prison. But when more crimes occur Mulder wonders, if the man is really dead. And later someone calls Mulder and talks like the man but the voice is younger. Mulder goes to the prison where the man died and inmate says that on the night he died he was in the infirmary being treated for an infection to his hand and the doctor said he's dead but he saw he was alive and the doctor threatened him. Later Mulder's mentor is killed. Mulder later learns that the doctor who treated the man was working on a secret project to reverse the aging process. But he was so reckless that he was shun by the medical community. Mulder thinks the doctor was working on it and needed elderly test subjects like the criminal so he thinks he did it so the man is now younger. .—rcs0411@yahoo.com", "John Barnett, Mulder's first Bureau case and seemingly dead killer, is back in action. Reclaiming his affection for cryptic messages as well as his taunting personality, he leads Mulder and Scully on a chase involving heart, mystery, and science.—EJS"], "genres": "N/A", "imdbID": "0751265", "rating": 7.2, "votes": 5782, "number_of_episodes": 217}