{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0822694": "Claire Stansfield", "0864133": "Wayne Tippit", "0797268": "Gregory Sierra", "0534298": "Michael MacRae", "0853805": "Jill Teed", "0447064": "Tamsin Kelsey", "0014803": "Andrew Airlie", "0235596": "Bill Dow", "0558645": "Hrothgar Mathews", "0461635": "Jayme Knox", "0841867": "Scott Swanson", "0639944": "Sean O'Byrne", "0416404": "David James Lewis", "0548226": "D. Neil Mark", "0337020": "Jason Gray-Stanford", "0399391": "Rhys Huber", "0613759": "Jessica Murdoch", "0613763": "Lachlan Murdoch"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Mulder and Scully track a legendary creature that has roamed the New Jersey countryside for over 40 years.", "When a homeless man is found in the woods just outside Atlantic City with his arm and shoulder chewed off, Mulder thinks it may be the work of the fabled Jersey Devil. Mulder has an X file from a killing in 1947 where a man who stopped to fix a flat tire was snatched and dragged into the woods in front of his wife and children. The agents are in Atlantic City informally but they get little or no support from the local police. It's clear that they know there is beast out there but are worried about the impact it might have on tourism if it became widely known. Mulder and Scully investigate on their own with the help of a park ranger and a paleontologist.—garykmcd", "Three miles outside of Atlantic City, NJ, someone or something in the woods is hungry for human flesh. Scully tells her partner about a new case being handled by the local authorities as Mulder pulls out an X File from 1947 on \"The Jersey Devil,\" reputedly a huge quasi-human beast. Of course, Mulder is open-minded and willing to explore a correlation between the two cases and others. According to a retiring deputy and a homeless man, local law enforcement supposedly knows about the beast, but turns a blind eye.—LA-Lawyer", "When a body is found in the woods of New Jersey missing a limb, Mulder tracks the case to an old X-File and decides to investigate. Despite the local police department, Mulder and Scully try to find the legendary \"Jersey Devil\" before it attacks again.—EJS"], "genres": "N/A", "imdbID": "0751229", "rating": 6.9, "votes": 7533, "number_of_episodes": 217}