{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0075359": "Xander Berkeley", "0005031": "Felicity Huffman", "0405337": "Steve Hytner", "0462116": "Jeff Kober", "0457090": "Ken Kirzinger", "0839709": "Sonny Surowiec"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["46"],  "plot": ["Mulder and Scully are sent to investigate when a team of geophysicists stationed at a remote Alaskan outpost are killed by a parasitic alien life form.", "Mulder and Scully head off to Alaska when the scientists working on the Arctic Ice Core project have seemingly gone crazy and killed each other. The project team had just beaten the record for the deepest core sample when they soon began to act oddly. Along with two scientists and a helicopter pilot, the agents arrive at the deserted post and soon find that an ancient micro-organism from one of the deep core samples is responsible. The helicopter pilot is the first affected and has to be restrained. One other of the group is also infected and the chief scientist in the group thinks it's Mulder.—garykmcd", "Scully and Mulder visit the Arctic Ice Core Project, a group of geophysicists working in Icy Cape, Alaska, 250 miles north of the Arctic Circle. In blistering temperatures of 35+ degrees below zero, the team, three specialists and a pilot investigate suicides and other occurrences by members of the scientific team caught on tape. Various circumstances progress from weird to bizarre as the team finds a dog with black nodules, possible bubonic plague, murder and messages \"We're not who we are...\"—LA-Lawyer", "When a team of arctic drillers suddenly disappear and a cryptic final transmission is received, Mulder and Scully are sent to investigate the cause of their demise. With two other top scientists and the pilot, they must survive the arctic cold - or the real threat, each other.—TSTKE"], "genres": "N/A", "imdbID": "0751141", "rating": 8.7, "votes": 8914, "number_of_episodes": 217}