{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0364748": "Harriet Sansom Harris", "0471265": "Erika Krievins", "0471266": "Sabrina Krievins", "0362222": "Jerry Hardin", "0869548": "George Touliatos", "0800014": "Tasha Simms", "0388250": "Janet Hodgkinson", "0456136": "David Kirby", "0318303": "Tina Gilbertson", "0881467": "Christine Upright-Letain", "0864154": "Gordon Tipple", "0202713": "Garry Davey", "0535544": "Joe Maffei", "0004265": "Maria Herrera", "0507674": "Robert Lewis", "0113418": "Diane Brown", "0584110": "Finn Michael", "0668857": "Derek Peakman"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["46"],  "plot": ["Mulder and Scully search for two missing girls who disappeared after their fathers were murdered in an identical fashion.", "Scully and Mulder are called into investigate a strange case of a man found sitting in his backyard having been exsanguinated and having two bite marks on his neck. The man's daughter, Teena, only remembers seeing what she calls red lighting. They've barely started the investigation when they learn there has been a virtually identical attack on the west coast. When they meet that man's daughter, Cindy, she is identical to Teena. Deep Throat provides Mulder with information about the Litchfield experiments, attempts at gene modification where children, named Adam and Eve, were produced. They trace a common link from the girls to Dr. Sally Kendrick who was fired for her position at a fertility clinic for experimenting in eugenics. The agents take the girls into protective custody but it's not the girls who need protecting.—garykmcd", "The fathers of two identical girls are found exanguinated in the back yard of their homes. Could these murders be a step-up in the series of accumulating cattle-mutilations in the U.S., or a missing link to a government project known as \"The Litchfield Experiments\"?—EJS"], "genres": "N/A", "imdbID": "0751116", "rating": 8.0, "votes": 7157, "number_of_episodes": 217}