{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0697587": "Barry Primus", "0910610": "Lisa Waltz", "0301874": "Lorena Gale", "0814552": "Veena Sood", "0370971": "Deryl Hayes", "0289093": "Kelli Fox", "0681918": "Tom Pickett", "0372784": "Tom Heaton", "0940837": "Janie Woods-Morris", "0572712": "Nora McLellan", "0272370": "Anna Ferguson", "0028136": "Charles Andre", "0029973": "Forbes Angus"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["46"],  "plot": ["Mulder and Scully investigate the deaths of two men believed to have been killed by a powerful psychokinetic force.", "Scully and Mulder are called in by two secretive government agents and asked if they've ever had an X file with similarities to their most recent case. Two men were found dead in an alley but still have a residual electrostatic charge and it appears their throat and larynx were crushed, but from the inside. Mulder manages to get a fingerprint from each of the dead men and learns they both had ties to terrorist organizations. Using video from a nearby ATM, they find that the two men had attacked Lauren Kyte, a secretary at Defense Department contractor HTG Industrial Technologies. She's recently decided to leave her job after the death of her boss Howard Graves, who recently committed suicide. Lauren isn't sure how she got away from those men or how they were killed. It all leads Mulder to believe that Lauren may have a guardian angel.—garykmcd", "Two unidentified agency \"spooks\" quiz Mulder and Scully about two dead bodies found in strange circumstances. Mulder uses the lenses of his eyeglasses to surreptitiously lift fingerprints from the corpses and learns they were Iranian national terrorists caught on camera attempting to grab a young woman at a Philadelphia ATM. The young woman, Lauren Kyte, is secretary to Howard Graves, defense company CEO believed to have committed suicide. But unlike the other authorities, Scully and Mulder do not take Graves' death for granted and encounter telekinesis and similar phenomena in their investigations.—LA-Lawyer", "Two terrorists are found dead in a back alley of Philadelphia. Their body temperature still remains normal, and their muscles still move. Mulder and Scully investigate the case in lieu of CIA officials, and discover a woman with an unfortunate past involving the suicide of her boss.—EJS"], "genres": "N/A", "imdbID": "0751201", "rating": 7.2, "votes": 7041, "number_of_episodes": 217}