{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0362222": "Jerry Hardin", "0005588": "Rob LaBelle", "0245145": "Wayne Duvall", "0542558": "Blu Mankuma", "0125148": "Tom Butler", "0053390": "Gillian Barber", "0061883": "Marc Baur", "0277481": "Bill Finck", "2786742": "Theodore Thomas"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["On Halloween, Mulder and Scully investigate the death of a corporate executive who may have been murdered by a thinking computer.", "Mulder and Scully are asked by Mulder's old partner Agent Jerry Lamana for help on a case. Benjamin Drake chairman of Eurisko, a major computer company, was electrocuted at the office. The dead man was a personal friend of the Attorney General and Jerry doesn't want to mess up on such a high profile case. Computer genius Brad Wilczek co-founded the company with Drake and had a falling out over the direction of the company. Mulder wonders is someone might have hacked into the Eurisko building's elaborate computer system to use it to electrocute Drake. He turns to his new contact, Deep Throat, to try and figure out what is going on.—garykmcd", "Benjamin Drake, greedy executive of a Fortune 500 company dies in his executive bathroom in the course of causing a small corporation called Eurisko, and its premier invention, COS Project, to be terminated and separated from its rightful creator and owner, Brad Wilczek. It is Halloween; both Scully and Mulder team with Mulder's old partner in Violent Crimes Division, Jerry Lamana. They team up to investigate the possibility of automatic murder via artificial intelligence.—LA-Lawyer", "The chairman of Eurisko, a computer corporation, is found electrocuted in an executive bathroom. An old partner of Mulder's asks him to help, and they soon track down the computer genius responsible for the main operating system. They must shut it down, but it has other plans...—EJS"], "genres": "N/A", "imdbID": "0751131", "rating": 6.7, "votes": 6988, "number_of_episodes": 217}