{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0362222": "Jerry Hardin", "0294153": "Michael Bryan French", "0001293": "Seth Green", "0741388": "Gabrielle Rose", "0662505": "Monica Parker", "0601874": "Sheila Moore", "0511429": "Lalainia Lindbjerg", "0426526": "Andrew Johnston", "0193850": "Johnny Cuthbert", "0582482": "Vince Metcalfe", "0701304": "Michael Puttonen", "0298943": "Brian Furlong", "0364629": "Doc Harris", "3253576": "Carrie Classen", "0437188": "Mark Kandborg", "0538363": "Steve Makaj", "0603771": "Tony Morelli", "0785331": "Cody Serpa", "0928412": "Bob Wilde"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["46"],  "plot": ["Mulder and Scully investigate the mysterious case of a military test pilot who disappeared after experiencing strange psychotic behaviour.", "Mulder and Scully investigate the mental breakdown and disappearance of a U.S. Air Force officer, Col. Robert Budahas, once a well regarded test pilot. Mulder's research reveals that there is a pattern of breakdowns at Ellens Air Force base but Scully thinks there are any number legitimate medical reasons for what has happened. Mulder is soon in touch with local UFO enthusiasts and learns where in the area is best to view UFOs. He comes across two young people who regularly sneak onto the base through a hole in the fence to sit back and watch. Mulder believes the aircraft the locals are seeing were built using alien technology and it becomes apparent that the U.S. government is hiding something and will go to great lengths to keep it that way. Throughout, Mulder receives advice and a friendly warning from an unknown man, Deep Throat, who warns him to be careful and confirms Mulder's suspicions about aliens.—garykmcd", "Mulder shares the reason behind his quest with Scully but it does not make her less skeptical. Their case takes them to Ellen AFB in Iowa which, to Scully's surprise, is not documented on official charts. They investigate a pattern of abducted airmen and both see UFOs. Scully will not admit it was a UFO and, after some time passes, Mulder cannot.—LA-Lawyer", "Against the advice of a mysterious contact, Mulder and Scully go to Idaho to investigate the disappearance of an Ellens Air Base test pilot. While there they observe what could be the flying of alien UFO aircraft by the U.S. military. In attempting to get a closer look on base, Mulder gets captured by the military and Scully must find a way of freeing him.—Muldernscully"], "genres": "N/A", "imdbID": "0751099", "rating": 8.0, "votes": 8658, "number_of_episodes": 217}