{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0811202": "Carrie Snodgress", "0146938": "Michael Cavanaugh", "0316455": "Donald Gibb", "0658297": "Joel Palmer", "0162541": "Charles Cioffi", "0654462": "Shelley Owens", "0860065": "Don Thompson", "0605682": "Akiko Morison", "0214232": "Taunya Dee", "0365480": "Anthony Harrison", "0730095": "Glen Roald", "1351227": "Mauricio Mercado"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Mulder becomes obsessed with solving a case that closely parallels an \"encounter\" he experienced as a child.", "Mulder and Scully travel to Sioux City to investigate the disappearance of a teenager, Ruby Morris, whose mother Darlene claims was abducted by aliens. There's some reluctance on the part of the FBI to even open an X-File on the matter until Mulder finds that the Darlene was also supposedly abducted during a girl scout outing when she was a teenager. Ruby had something of a wild reputation and the local authorities believe she may have run off with a biker. Ruby's younger brother Kevin is seeing something on the television that he can translate into binary code, something that is of interest to the NSA. For Mulder, the case is far too reminiscent of his sister Samantha's abduction by aliens when he was 12 and she 8 years old.—garykmcd", "The X File team returns to Iowa, Sioux City this time, for a case that has similarities to the facts and circumstances surrounding the childhood disappearance of his sister. Scully tells their superiors Mulder does not have his own agenda when he wants to take the case. Mulder uncovers the fact Darlene Morris, mother of Ruby Morris, the teen who disappeared from a family camp out, is officially on US record in Evanston, Ill. as having sighted a UFO.—LA-Lawyer", "A Sioux City girl, whose mother once encountered a UFO, disappears in the middle of the night. Mulder pulls Scully into the case while an inquiry is made about his choices: does he intend to use this case to further the search for his own abducted sister?—EJS"], "genres": "N/A", "imdbID": "0751094", "rating": 7.5, "votes": 7521, "number_of_episodes": 217}