{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0006535": "Doug Hutchison", "0006610": "Donal Logue", "0065798": "Henry Beckman", "0574081": "Kevin McNulty", "0446892": "Terence Kelly", "0936071": "Colleen Winton", "0068258": "James Bell", "0381733": "Gary Hetherington", "0608080": "Rob Morton", "6937588": "Paul Joyce"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["Mulder and Scully search for a humanoid killer whose savage murder spree reoccurs every 30 years.", "Scully and Mulder are called in when a businessman is found dead in his office. The doors and windows were locked from the inside and the only other possible opening is an extraordinarily small air vent, which no person could possibly go through. The dead man also had his liver torn out. There is also a strange elongated fingerprint on the vent which leads Mulder to find two sets of old cases the first dating to 30 years ago and the other 30 years before that. All of the victims had their livers torn out of their bodies. More importantly, the elongated fingerprint is an exact match, despite the long interval in between events. Mulder is convinced that the killer is the same man who comes out of hibernation every 30 years to feed his appetites.—garykmcd", "Agent Colton, a friend of Scully's from the Academy, asks for her assistance on an eerie serial murder. In each case, there is no clear ingress or egress and the liver of each victim is taken by hand. Mulder has knowledge about the case that Colton and his associates do not want to consider. Colton seems to want Scully to dump her new work with Mulder; Mulder gives her his blessing to jump ship. But Scully is intrigued and stubborn; when Mulder sees proof Scully is the next victim, he has to move fast to save his partner.—LA-Lawyer", "Every thirty years, five victims are found with their livers extracted in seemingly inescapable locations. The only possible exit is through tiny spaces no normal man could fit through. It is up to Mulder and Scully to stop him - even if it means one of them becoming dinner...—EJS"], "genres": "N/A", "imdbID": "0751208", "rating": 8.5, "votes": 9189, "number_of_episodes": 217}