{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0162541": "Charles Cioffi", "0002037": "Cliff De Young", "0467165": "Sarah Koskoff", "0751762": "Leon Russom", "0030644": "Zachary Ansley", "0589358": "Stephen E. Miller", "0829121": "Malcolm Stewart", "0075563": "Alexandra Berlin", "0418012": "Jim Jansen", "0133400": "Ken Camroux-Taylor", "0009002": "Doug Abrahams", "0205657": "William B. Davis", "0307008": "Katya Gardner", "0717398": "Ric Reid", "0263890": "Lesley Ewen", "0084622": "J.B. Bivens", "0496726": "Laura Lee Connery", "0220903": "Joe Doserro", "7910737": "Amram Ducovny", "1312015": "Christopher Hutson", "0710417": "Tim Ransom", "0672413": "June B. Wilde"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["48"],  "plot": ["Agent Dana Scully is instructed to debunk an FBI project dubbed \"The X-Files,\" paranormal cases that have been reopened by Agent Fox Mulder.", "Skeptical FBI Special Agent Dana Katherine Scully is reassigned by Section Chief Scott Blevins to work with the \"believer\" Fox William Mulder. Their first case together takes them to Bellefleur, Oregon; where the fourth member of the BHS class of '89 has been found dead...with two mysterious pink marks on her back, which all other victims have had.—Marc-David Jacobs <AgentMarcFBI@hotmail.com>", "Special Agent Dana Scully is called into FBI headquarters and assigned to work with another agent by the name of Fox Mulder who specializes on investigation of the X-Files, cases involving strange phenomena. Scully knows something about Mulder who is known at the Academy by his nickname, Spooky. Scully is also told to report to her superiors on Mulder's cases. Mulder knows she is there to spy on him and they are soon off to Oregon on their first case together. There, they investigate a series of deaths and disappearances all involving twenty-somethings who were in the same class in high school. Mulder becomes convinced that they are being abducted by aliens but a naturally pessimistic Scully is more that just a little disbelieving.—garykmcd", "FBI agent, Dr. Dana Scully, joins the rogue genius of the Bureau, Fox Mulder, PhD, in the quest to gather data pertaining to the elusive \"X Files.\" In their first case, they travel to Bellefleur, Oregon where several teenagers have disappeared and/or died in the forest under peculiar but very similar circumstances.—LA-Lawyer", "A young medical doctor in the FBI is assigned to assist Agent Fox Mulder, whom she previously only knew as \"Spooky Mulder\" from his reputation. She's led by Mulder to Bellefleur, Oregon, a site where recent alien abductions are believed to have occurred.—EJS"], "genres": "N/A", "imdbID": "0170817", "rating": 8.2, "votes": 13548, "number_of_episodes": 217}