{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0761190": "Paul Sand", "0247611": "Steve Eastin", "0001679": "Mark Rolston", "0320163": "Lindsey Ginter", "0053390": "Gillian Barber", "0292493": "Bob Frazer", "0167135": "Robert Clothier", "0741960": "Elisabeth Rosen", "0894059": "Crystal Verge", "0479523": "Cameron Labine", "0760221": "Tony Sampson", "0619786": "Gerry Nairn", "0570091": "Brian Knox McGugan", "2179518": "Cory Chetyrbok", "7682137": "Linus Sebastian"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["A vegan religious cult is accused of kidnapping local teenagers for some type of ritual. Mulder and Scully begin to suspect that a different kind of conspiracy is at play when Scully sees Deep Throat's killer in town.", "Mulder and Scully are called in by a Sheriff who believes a local cult is subjecting some of the town's teenagers to some type of ritual. Several of the teens have appeared after a night in the woods, semi-naked with 'He is One' written on their backs. The Sheriff is convinced that the turban-wearing cult that has made their home in the area is responsible and wants the agents to help him get the evidence he needs. As the agents gather evidence however, they begin to think something far more sinister is going on. All of the teens involved were treated by the same doctor and none had any history of normal childhood disease. They are certain he was experimenting on the them but neither are prepared for Scully's revelation - one of the men she sees in town is the man who killed Deep Throat.—garykmcd", "Several kids in Delta Glen, Wisconsin are being taken, and reappear in the woods hours later with cryptic writing on their back. While the local sheriff focuses Mulder and Scully's attention on a nearby religious group against beef, more evidence points to the beef itself.—EJS"], "genres": "N/A", "imdbID": "0751185", "rating": 7.6, "votes": 5325, "number_of_episodes": 217}