{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0232194": "Peter Donat", "0859921": "Brian Thompson", "0321630": "Dana Gladstone", "0500615": "Megan Leitch", "0125148": "Tom Butler", "0683379": "Mitch Pileggi", "0378016": "Tim Henry", "0426526": "Andrew Johnston", "0867480": "Rebecca Toolan", "2475128": "Ken Roberts", "1558628": "Michael J Rogers", "0065548": "Oliver Becker", "0495197": "James Leard", "0052205": "Linden Banks", "0370472": "Bonnie Hay", "0720412": "Kim Restell", "0765140": "Richard Sargent", "0330128": "David L. Gordon", "0584110": "Finn Michael", "0835677": "David Stuart"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["When someone sends Mulder and Scully obituaries showing three separate but identical men apparently having died, the agents investigate, but things take an unexpected turn when Mulder receives a call from his father.", "Mulder and Scully decide to investigate when they anonymously receive three newspaper obituaries for three men who appear to be identical. All of them worked in abortion clinics and they were not brothers. Unbeknown to them, an alien craft immobilized a US submarine patrolling under the Arctic ice and there is now an alien bounty hunter on the loose committing the murders. Mulder's world is turned upside down however when he receives an urgent call from his father telling him to come home. Once there, he finds a young woman in the living room talking to his mother. It's his sister Samantha, who was kidnapped by aliens 11 years ago. She tells him they are being hunted by an alien and that her life is in danger. Scully is surprised when Mulder calls her - because Mulder is standing in the room with her.—garykmcd", "Upon receiving three obituaries of three identical-looking men via anonymous e-mail, Mulder and Scully investigate the growing number of homicides throughout New England. When a new charade of evidence is presented, neither Mulder nor Scully know what to think.—EJS"], "genres": "N/A", "imdbID": "0751093", "rating": 8.7, "votes": 5563, "number_of_episodes": 217}