{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0488253": "Sheila Larken", "0205657": "William B. Davis", "0104006": "Tom Braidwood", "0353750": "Dean Haglund", "0367804": "Bruce Harwood", "0931736": "Steven Williams", "0192271": "Colin Cunningham", "0378016": "Tim Henry", "0052205": "Linden Banks", "0894059": "Crystal Verge", "0200711": "Andre Danyliu", "0535544": "Joe Maffei", "0566232": "John McConnach", "0220903": "Joe Doserro", "0565150": "Heather McCarthy", "0118059": "Pat Buchanan", "0230909": "Bob Dole", "2888730": "Eddie Hardy", "0522709": "Christopher Lovick", "0578610": "Zinaid Memisevic", "0876000": "Sandy Tucker", "0877460": "Chris Turner"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Mulder and Scully investigate a series of murders linked to a mysterious device that alters television signals causing paranoid hallucinations. One of them falls victim to it.", "Scully and Mulder investigate a series of bizarre murders committed by a man who says he saw the killer on TV. They conclude that several people in the community are affected somehow and Mulder believes that the TV signals are being altered in some way. He finds a device in the cable connections at the telephone pole and the Lone Gunmen confirm that there is additional information being transmitted along with the regular broadcasts. He concludes that the signal creates a sense of paranoia in the recipient, preying on their deepest fears, something that is confirmed when Scully sees Mulder sitting in a car, joking and laughing with the Cigarette Smoking Man. It's up to Mulder to bring these experiments to an end.—garykmcd", "A man who killed five people claims that all of his victims were the same war criminal he saw on TV. Investigation by Mulder and Scully turn up something unusual with the television signals in the area, and Mulder must uncover the truth before Scully becomes the next killer.—EJS"], "genres": "N/A", "imdbID": "0751260", "rating": 8.3, "votes": 4640, "number_of_episodes": 217}