{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0465664": "Thomas Kopache", "0308606": "Willie Garson", "0860065": "Don Thompson", "0814807": "Nancy Sorel", "0870439": "Ian Tracey", "0789912": "Paula Shaw", "0370971": "Deryl Hayes", "0498099": "Rob Lee", "0054015": "Andrea Barclay", "0954346": "Beatrice Zeilinger", "0075894": "Pat Bermel", "2179518": "Cory Chetyrbok", "0193987": "D. Harlan Cutshall", "1220117": "Paul Dickson", "0467774": "Brennan Kotowich"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["A quadruple amputee becomes the prime suspect in a series of bizarre deaths at an army hospital.", "Scully and Mulder investigate a series of accidents at a VA hospital in Virginia. Lt. Col. Victor Stans has tried several times to kill himself, but has always survived claiming, \"He won't let me die.\" He says that he sees the shadow-like outline of a soldier who is mentally and physically torturing him. As they look into the case they learn that Stans' family died in a house fire some 6 months before. More revealing is the fact that other soldiers' families have also died in similar fires. Mulder initially suspects a cover up on the part of General Thomas Callahan, but comes to realize that something far more sinister is at work. He believes that one of the patients is using astral projection to seek revenge on those around him.—garykmcd", "Mulder and Scvully investigate the mysterious deaths of the families of Army officers. One of them claims that whoever is behind it won't let them die. He tries several times to kill himself but doesn't. When the son of a General is killed they find evidence implicating an orderly at the VA but Mulder doesn't think he's the one. When they place him in a cell he cries out he's been here and begs to be taken out. Later they find him dead strangled but no one entered the cell. Mulder learns he took care of a soldier named Trimble. When Mulder and Scully sees him, they see he has no arms and legs so it couldn't be him. But Mulder doesn't rule him out.—rcs0411@yahoo.com", "A disabled war veteran at the Army Hospital in Fort Evanston, Maryland makes claims of a phantom soldier who has killed all his loved ones and kept him alive to suffer. Mulder and Scully work to solve the rising amount of homicides, but Mulder has some theories of his own.—EJS"], "genres": "N/A", "imdbID": "0751240", "rating": 7.1, "votes": 4568, "number_of_episodes": 217}