{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0167135": "Robert Clothier", "0060939": "Jo Bates", "0494774": "Nicholas Lea", "0659926": "Morris Panych", "0589358": "Stephen E. Miller", "0813286": "Ari Solomon", "0061356": "Paul Batten", "0274819": "Russell Ferrier", "0110034": "Lenno Britos", "0881167": "Kimberly Unger", "0339385": "Rochelle Greenwood", "0799070": "Joel Silverstone", "0623699": "David Neale", "0774633": "Tom Scholte", "1087206": "Robert F. Maier", "0609096": "Tegan Moss", "0117826": "Michael Bublé", "1886906": "Richard Hersley", "0491394": "Darcy Laurie", "0629421": "Peter Nicholas", "1049223": "Peter Scoular", "1267085": "Cameron K. Smith", "1880857": "Christine Viner"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["The agents investigate the mystery surrounding a sunken World War II aircraft.", "Scully and Mulder investigate the case of the crew of a French salvage ship who are all, with one exception, suffering from severe radiation burns. Mulder is particularly interested in the case as the ship was working at the coordinates he believes is the site of a UFO crash. Evidence at the home of the one salvager who escaped the radiation burns leads Mulder to Hong Kong where he meets Krycek, who he believes killed his father. It's also obvious that the entity, black oil, is transferring itself from one person to another. Meanwhile, Scully is upset to learn that the police will shut down the investigation into the murder of her sister Melissa. Assistant Director Skinner assures her he will pursue the matter but he is warned off by representatives of the intelligence community.—garykmcd", "A French ship on a salvage mission docks in the States, and its crew all suffer strangely severe radiation burns - all but one man, who piloted the rescue suit. Old secrets resurface as Mulder searches for the truth to this newborn mystery as well as its... alien... origin.—EJS"], "genres": "N/A", "imdbID": "0751180", "rating": 8.4, "votes": 4730, "number_of_episodes": 217}