{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0627453": "John Neville", "0205657": "William B. Davis", "0104006": "Tom Braidwood", "0353750": "Dean Haglund", "0367804": "Bruce Harwood", "0494774": "Nicholas Lea", "0574081": "Kevin McNulty", "0506346": "Barry W. Levy", "0155726": "Dmitry Chepovetsky", "0558598": "Suleka Mathew", "0930471": "Don S. Williams", "0110034": "Lenno Britos", "0281028": "Frances Flanagan", "0067289": "Brendan Beiser", "1049223": "Peter Scoular", "0158468": "Jeff Chivers", "0263036": "Martin Evans", "0107023": "Eric Breker", "0117826": "Michael Bublé", "0168643": "Harrison Coe", "1886906": "Richard Hersley", "0443286": "David Kaye", "1380597": "Kristin Kowalski", "1722112": "Stan Walsh", "0912290": "Craig Warkentin"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Mulder uncovers clues about a cover-up involving an alien entity and a sunken World War II aircraft. Scully pursues the man who murdered her sister.", "With Assistant Director Skinner in the hospital recovering from his gunshot wounds, Scully and Mulder pursue various leads. Scully meets with with a retired naval officer, a friend of her father and learns that this is not the first time men have suffered severe radiation burns while investigating that part of the ocean. She fears for Skinner's life when she learns he is being transferred to another hospital. Mulder meanwhile learns the location of the UFO, an abandoned missile site but the Cigarette Smoking Man proves to be a major obstacle. While Mulder pursues his leads on the UFO, Scully continues her investigation into the shooting of her sister and learns that the gun used to kill her was the same as that used on Skinner.—garykmcd", "The search for the long lost digital tape is short-lived once Mulder is able to track down a secretive government official. While Scully cares for hospitalized Skinner, Mulder learns what Krycek has been up to, and they try to track down the salvaged UFO before it's too late.—EJS"], "genres": "N/A", "imdbID": "0751075", "rating": 8.6, "votes": 4711, "number_of_episodes": 217}