{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0004095": "Bobbie Phillips", "0083541": "Raye Birk", "0026627": "Dion Anderson", "0235596": "Bill Dow", "0115813": "Alex Bruhanski", "0469584": "Ken Kramer", "0662518": "Nicole Parker", "0118568": "A.J. Buckley", "0479527": "Tyler Labine", "0004265": "Maria Herrera", "0020018": "Sean Allan", "0926833": "Norma Jean Wick", "0731686": "Wren Roberts", "0372784": "Tom Heaton", "0829216": "Bobby Stewart", "0831096": "Dawn Stofer-Rupp", "0736450": "Fiona Roeske", "0011085": "John Destry", "0550030": "Tony Marr"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["While looking for signs of alien ships in the sky above a small town, Mulder learns of a series of deaths supposedly caused by metallic cockroaches. He turns to sexy entomologist Bambi for help, which makes Scully angrily rush to his aid.", "Agent Mulder is out investigating reports of strange lights in the night sky when he learns from the local sheriff that there is another death in town from killer cockroaches. Intrigued, Mulder tags along and a series of deaths ensue with witnesses all claiming the dead body was covered with roaches, though none are to be found when the police arrive. When he learns that there is a local experiment going on, Mulder meets the entomologist involved, the rather attractive Dr. Bambi Berenbaum. The answer however, lies with other tests going on in town. Throughout, Mulder keeps in touch with Scully who seems to have a logical explanation for everything that's happened so far. As people in the town begin to panic, Scully travels there and joins Mulder to get the poop on just what is going on.—garykmcd", "When an exterminator in Millers Grove, Massachusetts drops dead and two more townspeople follow, every citizen screams \"roaches!\" Indeed Agent Mulder, the town's best hope for survival, is hot on the trail of the creepy crawling insects, and it's all a matter of not bugging out.—EJS"], "genres": "N/A", "imdbID": "0751259", "rating": 8.6, "votes": 6191, "number_of_episodes": 217}