{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0556985": "Tom Mason", "0381763": "Jennifer Hetrick", "0205657": "William B. Davis", "0850102": "Amanda Tapping", "0829121": "Malcolm Stewart", "0659926": "Morris Panych", "0799989": "Michael David Simms", "0800014": "Tasha Simms", "0335652": "Stacy Grant", "0940837": "Janie Woods-Morris", "0067289": "Brendan Beiser", "0330208": "George Gordon", "0492687": "Colin Lawrence", "0584110": "Finn Michael", "0629421": "Peter Nicholas", "0794285": "Bethoe Shirkoff", "1882919": "Cal Traversy", "0889029": "Nathan Vanering"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Skinner, depressed over the fact that his wife is divorcing him, has a one night stand with a stranger who's found murdered in the morning. Mulder tries to prove Skinner's innocence but Skinner refuses to cooperate for some reason.", "With his marriage on the rocks and on the verge of getting a divorce, a depressed Assistant Director Skinner meets an attractive blond, Carina Sayles, in a hotel bar and they decide to get a room and spend the night together. When he awakens in the morning however, Carina is laying beside him dead from a broken neck. Scully and Mulder investigate on their own as Skinner would prefer they just mind their own business. When they learn that their boss has been having nightmares of sorts, Mulder believes he is being visited by a succubus, an old woman of legend who takes the life force out of a man. Some in the FBI move quickly to have Skinner removed from his post and it becomes obvious that it's all part of a greater conspiracy.—garykmcd", "FBI Assistant Director Walter Skinner is the prime suspect in a homicide involving a woman he was with the night of her death. Mulder and Scully are all he has to prove his innocence, as superior officers try to shut him down and the only clue is a mysterious old woman.—EJS"], "genres": "N/A", "imdbID": "0751080", "rating": 7.6, "votes": 4427, "number_of_episodes": 217}