{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0205657": "William B. Davis", "0494774": "Nicholas Lea", "0627453": "John Neville", "0036275": "Stefan Arngrim", "0747962": "Jan Rubes", "0915851": "Fritz Weaver", "0821609": "Brent Stait", "0829121": "Malcolm Stewart", "0132655": "Campbell Lane", "0609157": "Robin Mossley", "0531634": "Brenda McDonald", "0531869": "Pamela MacDonald", "0669826": "Eileen Pedde", "0775296": "Jessica Schreier", "0154833": "Tatiana Chekhova", "0304240": "Raoul Ganeev", "0307796": "Bathsheba Garnett", "0354340": "John Hainsworth", "1897742": "Denis Krasnogolov", "0470397": "Vitaly Kravchenko", "1471109": "Igor Morozov", "0722124": "Anatol Rezmeritza", "3921367": "Olesky Shostak"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Mulder tries to stop a Russian supersoldier from destroying the site in North America where the black oil virus can be excavated. Scully is jailed after she refuses to reveal Mulder's whereabouts at a Senate subcommittee hearing.", "Mulder and Krycek are taken prisoner in Russia and subjected to bizarre experiments that includes the black oil and vaccinations. They manage to escape but are separated and find different ways out. Back in the U.S., Scully is subpoenaed to appear before a Senate sub-committee and is threatened with jail for contempt when she refuses to tell them where Mulder is. Meanwhile, some of the conspirators, including the Cigarette Smoking Man and the Well-Manicured Man are worried their secret is getting out.—garykmcd", "Called upon to disclose Agent Mulder's current whereabouts, Scully must stall the hearings until further understanding of the mysterious \"black cancer\" is revealed. Mulder, in the mean time, must escape a Russian prison camp, or be subjected to the \"testing\" until he dies.—EJS"], "genres": "N/A", "imdbID": "0751216", "rating": 8.1, "votes": 4363, "number_of_episodes": 217}