{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0692298": "Steven M. Porter", "0115813": "Alex Bruhanski", "0489861": "Sydney Lassick", "0279297": "Nancy Fish", "0436663": "Danny Kamin", "0301874": "Lorena Gale", "0701304": "Michael Puttonen", "0929794": "Christine Willes", "0871993": "Ken Tremblett", "0103460": "Jennifer Bradsen", "0104005": "Kate Braidwood", "0179121": "Arthur Corber", "0597744": "Fawnia Mondey", "0619786": "Gerry Nairn", "0634299": "John Nolan", "0878531": "Carolyn Tweedle", "2468072": "Kerry van der Griend"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Apparitions of women killed by a serial killer start appearing to people. Mulder figures they may be harbingers of death for those who see them. Scully is skeptical until she sees one. Their only lead is an autistic psychiatric patient.", "Mulder and Scully investigate a series of deaths after reports that people are seeing the victims' ghosts just before they die. All of the victims were young women and in the most recent case, a bowling alley owner saw the victim's spirit floating above the pin setting machine at the end of one of the lanes. When they examine the bowling lane, they find the message 'she is me' etched into the wood. Harold Spuller works at the bowling alley and is slightly autistic. He lives in an institutional setting and to the local police, he is the prime suspect. Mulder begins to believe there is a psychic connection between the victims and the people seeing their ghosts. It bodes ill for Scully who is still having nose bleeds and then sees a victim's spirit with the 'she is me' message in a bathroom mirror.—garykmcd", "Several women are killed in the same manner within blocks of each other. One of the dead women's ghost is seen by the proprietor of a bowling alley attempting to communicate. The cryptic message \"She is me\" is found where the apparition appeared. It's also apparently the dying woman's final words.—Muldernscully"], "genres": "N/A", "imdbID": "0751110", "rating": 7.8, "votes": 4040, "number_of_episodes": 217}