{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0010264": "Jay Acovone", "0638276": "Mike Nussbaum", "0654334": "Chris Owens", "0867480": "Rebecca Toolan", "0426526": "Andrew Johnston", "0054094": "Terry Barclay", "0605938": "Vanessa Morley", "0107023": "Eric Breker", "0363114": "Rebecca Harker", "1836071": "Shelley Adam", "1044731": "Dean Aylesworth", "1045529": "Alex Haythorne"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Covered in blood and suffering from amnesia, Mulder pieces together the events of the last few days, but the trail leads to a double murder that appears to have been committed with Mulder's weapon.", "Mulder awakens on a Sunday in a cheap motel in Providence, Rhode Island. He has no idea how he got there and has no memory of what may have occurred in the last two days. His clothes are also covered in blood. He has been having vivid dreams however. In one, he recalls his parents having an argument with the Cigarette Smoking Man about Samantha. Mulder was only 12 years-old at the time. He also has images of a white house. Scully soon joins him and they locate the white house with two bodies inside. As far as the local police are concerned, Mulder is their main suspect. Scully however doesn't believe he killed anyone and tries to find the common denominator between her partner and the victims.—garykmcd", "Adult Mulder lays supine on bed flashing about in different perspectives. He sees young Samantha spying through spindle stair in an attic-like space. A woman then man begin to argue.. \"my baby\".. is all that is heard in a mesh of voices. Samantha is worried. A boy in stripe shirt is seen off in attic distant. What he sees is from standing perspectives but he.. then awakens in a sweat; in a strange room; he reaches out to Scully, at 4:50am, confesses of bloody clothes, no memory, deduces he's in Rhode Island off a Motel Key. Together, he picks at any clues. Gun missing two rounds, a place in picture, two bodies. The more he scratches the scab, the more deeper and deeper trouble seems to get Mulder. A deer in hypnotic headlights. Hypothesis says he killed a couple. The Truth is out there, but will it put him away for murder?", "Mulder wakes up in a strange motel room with blood on his shirt and not knowing how he arrived there. A double murder has been committed with Mulder's gun. Mulder and Scully attempt to clear Mulder's name while finding out what is causing Mulder's memory lapses and blackouts.—Muldernscully"], "genres": "N/A", "imdbID": "0751100", "rating": 7.8, "votes": 3980, "number_of_episodes": 217}