{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0816876": "Joe Spano", "0639856": "Tom O'Brien", "0069069": "Scott Bellis", "0186322": "Chilton Crane", "0067289": "Brendan Beiser", "0584353": "Greg Michaels", "0597235": "Robert Moloney", "0776079": "Felicia Shulman", "1372683": "Rick Dobran", "0775094": "Jerry Schram", "0657640": "David Palffy", "0933817": "Mark Wilson", "0927312": "Marek Wiedman", "0722696": "Jon Raitt", "0161865": "Maria Luisa Cianni", "0265429": "Stacy Fair", "0360361": "Dave Hannay", "2790041": "Kathy Rolheiser", "0750343": "Kurt Max Runte", "3892982": "Regy Sayhay", "0774794": "Mark Schooley", "0795084": "Michael Short", "0825189": "Val Stefoff", "3892700": "Peter Taraviras"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["While investigating the unexplained crash of a commercial airliner the agents' search for answers leads to the bottom of a desolate lake and a startling discovery involving Mulder's alien abductee friend Max Fenig.", "Mulder and Scully get involved in the investigation of a commercial airliner crash that had among its passengers a well-known alien abductee, Max Fenig. One survivor is found at the crash site and Scully is quick to notice that he is suffering from radiation burns. Mulder also notices there is a nine minute gap between the time the authorities say the plane crashed and the time found on the watches of several of the dead passengers. The government official in charge of the crash investigation, Mike Millar, scoffs at Mulder's other-worldly explanation of the crash and that it involved an encounter with a UFO. He begins to change his view when he can't explain some of the physical evidence.—garykmcd", "Mulder and Scully investigate a plane crash in New York state. The crash appears to be UFO caused because one of the passengers was Max Fenig, an alien abductee, who Mulder and Scully know from a previous encounter. The agents work against the military which attempts to cover up what really happened to that flight.—Muldernscully"], "genres": "N/A", "imdbID": "0751215", "rating": 8.4, "votes": 4283, "number_of_episodes": 217}