{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0205657": "William B. Davis", "0494774": "Nicholas Lea", "0390229": "Laurie Holden", "0627453": "John Neville", "0067289": "Brendan Beiser", "0915851": "Fritz Weaver", "0829121": "Malcolm Stewart", "0089151": "David Bloom", "0132655": "Campbell Lane", "0036275": "Stefan Arngrim", "0821609": "Brent Stait", "9642950": "David Abbott", "0290742": "Jano Frandsen", "0304240": "Raoul Ganeev", "2929472": "Philip Heinrich", "0470397": "Vitaly Kravchenko", "0614193": "Dawn Murphy", "0722124": "Anatol Rezmeritza", "0747962": "Jan Rubes", "0766276": "Tomoko Sato", "0775296": "Jessica Schreier", "3881709": "Lee Serpa", "0002902": "Andy Thompson"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["A tip from Krycek takes Mulder to a gulag in Tunguska, Russia where prisoners are being used for experiments with the black oil alien virus. Meanwhile, Scully's colleague is infected with the same virus which lay dormant in a meteorite.", "Scully and Mulder participate in a raid on a group of right-wing extremists who are obviously planning an attack of some kind. Mulder has been receiving anonymous notes from someone who knows of the plan. When they stop the terrorists, one of the men turns out to be Mulder's old nemesis Alex Krycek, who claims to be the person who was feeding him information. Meanwhile, a diplomatic courier is caught smuggling a mineral-like object into the United States. Mulder contacts Marita Covarrubias of the UN to learn more about its origin. He and Krycek are soon on their way to Russia.—garykmcd", "When a man carrying a sample of the mythical black oil into the US is detained and the sample is released, the hierarchy involved in its concealment must act. Led by a revived and vengeful Krycek, Mulder and Scully seek to find its origin, its purpose, and perhaps its cure.—EJS"], "genres": "N/A", "imdbID": "0751251", "rating": 8.5, "votes": 4569, "number_of_episodes": 217}