{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0001952": "Rubén Blades", "0190441": "Raymond Cruz", "0947490": "J.R. Yenque", "0576578": "Simi Mehta", "0403622": "Lillian Hurst", "0047734": "Susan Bain", "0862265": "Robert Thurston", "0465959": "Michael Kopsa", "0393125": "Marcus Hondro", "2216128": "Janeth Muniz", "0225031": "Pamela Diaz", "0763702": "Fabricio Santin", "0889860": "José Vargas", "1046827": "Tony Dean Smith", "3882216": "Tina Amayo", "0756022": "Tony Sagastizado I"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["A desperate illegal immigrant who can't speak any English becomes patient zero for a mysterious illness and goes on the run from INS, the FBI and his own brother who blames him for the death of his girlfriend.", "Scully and Mulder investigate the death of Maria Dorantes, a migrant farm worker who was found in a field near the shanty town in which she lived. There were reports of a very bright flash of light followed by a yellow rain just as she was killed. Scully's examination of the body reveals that she died as a result of a massive fungal infection. The locals however are certain that the culprit is El Chupacabra, a mythical beast from Mexican folklore. They're also sure the beast is to be found in Eladio Buente, Maria's brother-in-law who was with her when she died. While Scully looks for a scientific explanation, Mulder believes the fungus may be alien in origin. Regardless, they must find Eladio before the fungus spreads.—garykmcd", "White flashes of lightning followed by yellow rain in the San Joaquin Valley of central California give new life to an old Mexican folk tale of El Chupacabra, a gray-skinned being whose victims decompose fast. Are the stories true, or is there simply a new viral pathogen in the world?—EJS"], "genres": "N/A", "imdbID": "0751109", "rating": 6.7, "votes": 4140, "number_of_episodes": 217}