{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0005138": "Kristin Lehman", "0527722": "Kate Luyben", "0104006": "Tom Braidwood", "0353750": "Dean Haglund", "0367804": "Bruce Harwood", "0931465": "Peter Williams", "0200871": "Robert Daprocida", "0444136": "Patrick Keating", "0775094": "Jerry Schram", "1120298": "Steve Griffith", "0170809": "Ted Cole", "0100074": "Lindsay Bourne", "0220415": "Thor Derkson", "1460816": "Alan Giles", "0354215": "Darwin Haine", "0002872": "Kelsa Kinsly", "0593016": "Nick Misura", "0237380": "Annette Reilly", "0731197": "Jake T. Roberts", "0760221": "Tony Sampson", "0812789": "Shayn Solberg", "0916527": "Dan Weber"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["The brutal murder of a renowned computer programmer leads Mulder and Scully to investigate an artificial intelligence program loose on the Internet that has begun evolving on its own.", "Mulder and Scully's investigation into a mass shooting in a coffee shop leads them to believe that the targets were not the low level drug dealers and wholesalers who were killed but rather Donald Geldman who had been sitting at a table working on his laptop computer. The Lone Gunmen tell Mulder and Scully that Geldman was one of the original computer geniuses who disappeared years before. His laptop leads the agents to a hacker, Esther Nairn, who goes by the name Invisigoth. She tells them of a vast government conspiracy involving artificial intelligence that allows them to see everything and take action against all enemies.—garykmcd", "Two U.S. marshals, several street-level criminals, and a computer software pioneer (Donald Gelman) are all casualties of a bizarre diner shoot-out in the middle of the night. The Lone Gunmen help Mulder and Scully track down Invisigoth, a computer hacker who knew Gelman. She informs them about an artificial intelligence program created by Gelman that has deadly intentions. The only way to stop it is to feed it the \"kill switch\", a CD containing a neutralizing virus.—Muldernscully"], "genres": "N/A", "imdbID": "0751150", "rating": 7.8, "votes": 4383, "number_of_episodes": 217}