{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0683379": "Mitch Pileggi", "0205657": "William B. Davis", "0162541": "Charles Cioffi", "0104006": "Tom Braidwood", "0353750": "Dean Haglund", "0367804": "Bruce Harwood", "0278125": "John Finn", "0538363": "Steve Makaj", "0133400": "Ken Camroux-Taylor", "0506346": "Barry W. Levy", "1043218": "Julia Arkos", "0930471": "Don S. Williams", "0004242": "Fidel Castro", "0252032": "Dwight D. Eisenhower", "0339985": "Ian Gregson", "0425696": "Lyndon B. Johnson", "0448123": "John F. Kennedy", "0451979": "Nikita Khrushchev", "0544552": "Zedong Mao", "0565191": "Joseph McCarthy", "0598744": "Ashley Montagu", "0633271": "Richard Nixon", "0760184": "John Sampson", "0874288": "Harry S. Truman"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Mulder accesses a facility that may hold a cure for Scully's illness. Scully performs an experiment in hopes of determining the origin of the disease.", "In a flashback to 24 hours earlier, Scully returns to her apartment to find Mulder waiting for her return to tell her that there is a dead man in his apartment. He now accepts that he has been duped all of these years into believing the UFO conspiracy and is convinced that Scully may have been given her cancer as part of that plot. He also believes the conspiracy reaches into the depths of the military and the FBI. Mulder uses the dead man's ID to infiltrate the defense research agency where Kritschgau is employed and learns why the military started the UFO hoax. The Cigarette Smoking Man finds something interesting in Mulder's apartment. Scully learns that the ice core samples have interesting microscopic life forms.—garykmcd", "Mulder kills a man in self-defense who was spying on him in his apartment. Scully tells the FBI that the dead man in Mulder's apartment is Mulder. Mulder uses the opportunity and the dead man's ID to infiltrate the Department of Defense and search for answers about Scully's cancer. Scully also continues to look for answers about her cancer and the spying done on Mulder.—Muldernscully"], "genres": "N/A", "imdbID": "0751187", "rating": 8.6, "votes": 4388, "number_of_episodes": 217}