{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0494774": "Nicholas Lea", "0001021": "Veronica Cartwright", "0390229": "Laurie Holden", "0859921": "Brian Thompson", "0418012": "Jim Jansen", "0627453": "John Neville", "0654334": "Chris Owens", "1046785": "Alex Shostak Jr.", "0930471": "Don S. Williams", "0354826": "Ron Halder", "0750343": "Kurt Max Runte", "0601385": "John Moore", "0304240": "Raoul Ganeev", "0722124": "Anatol Rezmeritza", "0943847": "Max Wyman", "0245823": "Barbara Dyke", "0243804": "Judi M. Durand", "0272168": "Oleg Feoktistov", "0291820": "Allan Franz", "0743926": "Willy Ross", "3918634": "Andrew Star", "0893875": "Bruno Verdoni"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Mulder and Scully search for answers when separate groups of alien abductees are burned alive. They meet a woman with an implant in her neck and symptoms similar to Scully.", "Victims of alien abductions are being killed which confounds those responsible for the alien conspiracy. They also have a problem on their hands when Alex Krycek returns to the U.S. from Russia. Maria Covarrubius tells them he has a boy with him that may be particularly problematic. Scully and Mulder meanwhile are at odds. Mulder no longer believes in the alien conspiracy theory convinced that it was all a hoax to hide government experiments. Scully believes the alien conspiracy to be true and visits Cassandra Spender who, like herself, was abducted and has an implant in her neck. She is the mother of FBI Agent Jeffrey Spender who asks her to leave his mother alone.—garykmcd", "Faceless alien rebels are committing mass murders. Mulder and Scully meet a multiple alien abductee, Cassandra Spender. As the consortium tries to determine how to deal with these new alien rebels, Mulder and Scully work to figure out Cassandra Spender's connection with these mass killings. In their way is Agent Jeffrey Spender, who doesn't believe that his mother, Cassandra Spender, is an alien abductee.—Muldernscully"], "genres": "N/A", "imdbID": "0751177", "rating": 8.2, "votes": 3880, "number_of_episodes": 217}