{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0499791": "Fredric Lehne", "0226813": "Garret Dillahunt", "0496082": "Brian Leckner", "0603655": "David Moreland", "0569000": "Darren McGavin", "0669826": "Eileen Pedde", "1044731": "Dean Aylesworth", "0292840": "David Fredericks", "0467416": "Mitchell Kosterman", "0368157": "Roger Haskett", "0675110": "Jane Perry", "0829340": "J. Douglas Stewart", "0196748": "Cory Dagg", "2178281": "Eric W. Gilder", "1556267": "Dean Barrett", "0099269": "Tom Bougers", "0565191": "Joseph McCarthy", "0629421": "Peter Nicholas", "0669234": "David Allan Pearson", "0714940": "Geoff Redknap", "0717445": "Taylor Reid", "0760184": "John Sampson", "7923197": "Paige Vienna"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["In 1990, Mulder investigates the death of a man who disappeared in 1952 before he could be charged in a series of bizarre killings. The retired agent who worked the 1952 case recounts the facts to Mulder and the connection to his father.", "In 1990 a man dies and the last word he utters is Mulder. Mulder thinking that this has something to do with his father, investigates and learns that the man supposedly died in 1952. He then goes to speak to Arthur Dales a retired FBI agent who was supposedly investigating the man then. Initially he doesn't want to talk to Mulder but later changes his mind and proceeds to tell him about the man whom he arrested and who later died while in custody and then later saw alive. He would also tell him that he was contacted by a man named Bill Mulder who told him of a government conspiracy.—rcs0411@yahoo.com", "Working as a profiler early in his FBI career, Mulder takes an interest in Edward Skur, a man who has been killed by a policeman and whose last word was \"Mulder\". Mulder finds there is an X-file on Skur, which he assumes means it is unsolved. He tracks down the original agent who investigated the case in 1952, Arthur Dales, and learns that the X designation means the case is designated not to be solved. In flashbacks, we learn of Skur's strange powers and the role Mulder's father played in it.—garykmcd", "In pre-x-files 1990, Mulder goes to the home of Arthur Dales, a retired FBI agent. Mulder asks him about an unsolved case from 1952. Arthur Dales tells Mulder the story of his involvement in one of the first x-files. The case also involved Mulder's dad, Bill Mulder.—Muldernscully"], "genres": "N/A", "imdbID": "0751247", "rating": 7.4, "votes": 3654, "number_of_episodes": 217}