{"cast": {"0000141": "David Duchovny", "0000096": "Gillian Anderson", "0488253": "Sheila Larken", "0569927": "Melinda McGraw", "0804361": "Pat Skipper", "0877681": "Karri Turner", "0701561": "John Pyper-Ferguson", "0687679": "Gerard Plunkett", "0226405": "Lauren Diewold", "0197137": "Patricia Dahlquist", "0293567": "Rob Freeman", "0107023": "Eric Breker", "0578833": "Stephen Mendel", "0550685": "Walter Marsh", "1994981": "Rebecca Codling", "0790290": "Joey Shea", "0213470": "Ryan DeBoer", "0578728": "Mecca Menard", "1480235": "Zoe Anderson", "0272846": "Jo-Ann Fernandes", "0790264": "Dan Shea"}, "geners": ["Adventure", "Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["While visiting family for Christmas, Scully receives a mysterious phone call that leads to a woman's apparent suicide and a young girl who may be her sister Melissa's daughter.", "At Christmas-time, Scully and her Mom arrive in San Diego to visit her brother Bill and his wife Tara, who is expecting any day. She's no sooner arrived than Scully receives a phone from a stranger saying she needs help. She traces the call but arrives to find that the occupant has committed suicide. The caller sounded like her dead sister Melissa. When she sees the dead woman's little girl, Emily, she is convinced that she's Melissa's child. Birth records confirm that the young girl had been adopted and Scully's examination of the dead woman leads her to believe she was killed. Scully orders DNA tests that prove to be quite informative.—garykmcd", "Agent Scully is spending Christmas with her family in San Diego. While there, she receives a mysterious phone call from a caller with the voice of her deceased sister, Melissa. Tracing the phone call leads her into the investigation of the death of a woman with a young daughter named Emily. Emily bears an uncanny resemblance to Scully's sister Melissa when she was the same age. This leads Scully to find out who Emily's natural mother is.—Muldernscully"], "genres": "N/A", "imdbID": "0751090", "rating": 7.7, "votes": 3984, "number_of_episodes": 217}