{"cast": {"0101198": "Grant Bowler", "0004748": "Julie Benz", "0503060": "Stephanie Leonidas", "0192889": "Tony Curran", "1444665": "Jaime Murray", "0001295": "Graham Greene", "2042776": "Jesse Rath", "0615025": "James Murray", "3369215": "Dewshane Williams", "1740381": "Nicole Muñoz", "1965525": "Anna Hopkins", "0199139": "Noah Dalton Danby", "1869640": "Kristina Pesic", "2838132": "Douglas Nyback", "1760388": "America Olivo", "5318612": "Kevin Shand", "0692874": "Tim Post", "3353780": "Katie Douglas", "0018582": "Lizz Alexander", "0236105": "James Downing", "5046593": "Amy Forsyth", "2952937": "Amelia Burstyn", "2756114": "Hannah Cheesman", "2782425": "Jessica Nichols"}, "geners": ["Action", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["With Nolan searching for Irisa, Amanda is forced to take on the badge as Deputy when the shocking murder of one of their own rocks Defiance.", "Treasure Doll is dead, having been thrown from the window of the Gateway Arch. Amanda investigates as Law-keeper Nolan leaves Defiance to retrieve Irisa, still possessed by Irzu. Nolan finds Irisa, but is captured. He and Tommy escape the ark-affected with Irisa, but she wakes and gets away. Alak is arrested for Treasure Doll's murder. Stahma covers it up only to discover that neither Alak nor Datak were responsible.—dnystrk", "Nolan sets off to find Irisa and comes across Tommy whose body has rejected the ark-brain. Nolan knows that it comes from an ancient spacecraft buried deep under old St. Louis. He manages to get her out of the camp but the ark seems to be in complete control and she escapes yet again. Deirdre is killed while hosting her radio show - she was thrown out a window at the top of the arch. With Nolan away, it's left to Amanda to find the killer and she starts by visiting her most recent client, Datak Tarr. Evidence however points to Alak and he is soon arrested. Stahma, assuming Datak was responsible, arranges for the evidence to point elsewhere. Datak insists he had nothing to do with it.—garykmcd"], "genres": "N/A", "imdbID": "3522410", "rating": 7.9, "votes": 364, "number_of_episodes": 39}