{"cast": {"0101198": "Grant Bowler", "0004748": "Julie Benz", "0503060": "Stephanie Leonidas", "0192889": "Tony Curran", "1444665": "Jaime Murray", "0001295": "Graham Greene", "2042776": "Jesse Rath", "1965525": "Anna Hopkins", "0000157": "Linda Hamilton", "0855564": "Lee Tergesen", "0167626": "Conrad Coates", "0732945": "Nichole Galicia", "2276274": "Trenna Keating", "3171589": "Justin Rain", "1740381": "Nicole Muñoz", "2838132": "Douglas Nyback", "0431451": "Robert Joy", "4007171": "Percy Hynes White", "0533832": "Billy MacLellan", "0662505": "Monica Parker", "0767455": "Gilles Savard", "1793153": "Clint Butler", "1151681": "Tyler Westerlund", "0290860": "Brian Frank", "5741283": "André Dae Kim", "6321850": "Spencer Macpherson", "2832642": "Carlos Pinder", "0738280": "Grant Roll", "0319273": "Caroline Gillis", "3012062": "Anthony Lake", "6981092": "Drew Carrymore"}, "geners": ["Action", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["You are introduced to another Race. Defiances supplies are running low. The search continues for the two children and their kidnappers. We discover more about the Votanis Collective. Irisa and Nolan escape and try to return to Defiance.", "Nolan and Irisa are rescued from their underground confinement by a mysterious force, just in time to discover that enemy forces are marching on the town of Defiance. The town itself has fallen on hard times following the collapse of the gulanite mines, leaving it defenseless. Meanwhile... Datak, Stahma and Rafe run into a deadly complications on their quest to reunite their family.", "Things are not going well in Defiance. It's been 7 months since the McCawley mine has collapsed, there's high unemployment, severe electricity shortages and the stasis nets have to be periodically shut down. Doc Yewl is planning to leave and try her luck out west but Amanda talks her into staying. Two blue-eyed, purple-skinned visitors from an unknown race, arrive to mine gulanite and in the process free Joshua and Irisa who survived in a stasis pod. Meanwhile, Dara, Stahma and Rafe McCawley continue to track Rafe's ex-wife Pilar and rescue Christie, Alak and their newborn grandchild. They run into a squad from the Votanis collective and their leader, General Rahm Tak, who tells them he's headed to Defiance to kill all the humans and burn it to the ground.—garykmcd"], "genres": "N/A", "imdbID": "4378634", "rating": 7.9, "votes": 441, "number_of_episodes": 39}