{"cast": {"0344435": "Ioan Gruffudd", "1004211": "Alana De La Garza", "0601376": "Joel David Moore", "1334507": "Donnie Keshawarz", "0005501": "Lorraine Toussaint", "0002139": "Judd Hirsch", "1122026": "Hilarie Burton Morgan", "0677680": "Robert Petkoff", "1684743": "Victoria Haynes", "0005412": "Jane Seymour", "0115402": "Christina Brucato", "3389143": "Jason Babinsky", "0498976": "Joel Leffert", "0658861": "Jimmy Palumbo", "3317479": "Marmee Regine Cosico", "0191450": "Chris J. Cullen", "6981232": "Ari Werlein"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Henry and Jo become immersed in the world of a dominatrix, who doesn't dole out pain for kinky pleasures but for therapeutic purposes. Meanwhile, Abe reacquaints himself with his own form of pain and pleasure - his former wife.", "Henry and Jo discover there is a fine line between pleasure and pain when the death of a successful businessman and devoted husband points to a form of ritualized punishment. Henry learns it may be all a question of trust. The man's \"domination therapist\" comes under scrutiny as a murder suspect, who also wants to help Henry work through his own issues. Flashbacks reveal Henry's emotional story of betrayal after he shares his secret with his first wife, Nora. Meanwhile, Abe is flabbergasted when the object of his intense passion - Maureen Delacroix - his two-time ex-wife, reappears with a tempting offer.—Jiilo_Kim", "When a dead body is found on the street, Henry and Jo investigate. They see the man has marks on his neck which makes them think he was strangled. But Henry thinks there is more going on. When he examines the man in the morgue, he sees the man has cuts and bruises on his body. When they talk to his wife, she says that he was having domination therapy. Henry and Jo go to the therapist and Jo doesn't approve of what she does while Henry keeps an open mind. They bring her in for questioning and when she sees the photos she tells them he wasn't strangled, he was electrocuted which Henry agrees with. But it still doesn't exclude her as suspect. Henry goes to her and she shows him what she does. Abe's ex-wife shows up and Henry reminds him of how disastrous their reunions are.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "4152092", "rating": 8.4, "votes": 1382, "number_of_episodes": 22}