{"cast": {"0005295": "Trey Parker", "0001778": "Matt Stone", "1866326": "Spencer Lacey Ganus", "0567143": "Kyle McCulloch", "0551065": "Mona Marshall", "0773791": "Eliza Schneider", "0005002": "Isaac Hayes", "15388619": "Alex Richardson"}, "geners": ["Animation", "Comedy"], "runtimes": ["22"],  "plot": ["The boys go to Canada to retrieve Ike, after his birth parents show up in South Park and claim him as their own.", "When Ike's birth parents arrive at the Broflovski's door during Hanukah celebrations, and say that they want Ike back because the new Canadian prime minister created a new law saying that anyone of Canadian birth must return. The Broflovski's are outraged and go to court but lose and Ike is forced to return to Canada with his birth parent's. Kyle then goes to Stan, Kenny and Cartman and asks them to help him go to Canada and appeal to the Canadian prime minister to change his mind, they immediately say no because they might not get to have a christmas adventure. A few days later, at the lighting of the town christmas tree, the mayor and the towns people decide to show their support to the Broflovski's by not buying any presents for their children and instead, give all their money to them. Again Kyle asks Stan, Kenny and Cartman and they say yes. Not long after, the boys are on the phone trying to get a flight to Canada. They then call City Wok and Mr Lu Kim answers the phone and when it is revealed that they are looking for City Airlines Mr Lu Kim turns the 'City Wok' Sign around revealing 'City Airlines' underneath and puts a pilot hat on. After negotiations about the price of the flight they eventually reach the agreement of $62. When the boys get to the airport and see the plane Kenny and Cartman are reluctant to get on but eventually do. The plane flies all night and reveals that everyone is asleep including Mr Lu Kim, who wakes up as the plane is going down. They all panic and Mr Lu Kim jumps out with a parachute and the plane crashes. The boys survive and discover that they aren't in America anymore. At this point they are greeted by many startled Canadians who hid because they thought that it was an invasion. After a song and dance number they set of on 'the only road in Canada' for Toronto, they meet a few people who want to join them in their cause before eventually ending up in Newfoundland and finding out that they went the wrong way. On Christmas day they eventually get to Toronto and get to talk to the prime minister... A Giant Head that denies their appeal, before Stan notices a curtain nearby and opens it revealing... Saddam Hussein.—Chras"], "genres": "N/A", "imdbID": "0705936", "rating": 7.5, "votes": 2868, "number_of_episodes": 328}