{"cast": {"0005295": "Trey Parker", "0001778": "Matt Stone", "0453996": "Jonathan Kimmel", "0829181": "April Stewart", "0005002": "Isaac Hayes"}, "geners": ["Animation", "Comedy"], "runtimes": ["22"],  "plot": ["Can Cartman and Kenny stay as \"Best Friends Forever\", even when Kenny buys the last PSP in stock?", "Cartman and Kenny's \"best friend\" status is strained when Kenny buys the last PlayStation in stock and uses it to conduct a war between heaven and hell. Meanwhile, Kenny's body is in a coma and Cartman must decide if there's one person that he can put above his own greed.", "Cartman and Kenny's friendship becomes strained when Kenny buys the last of the Sony PSPs in stock. As soon as Kenny plays its game, Heaven vs. Hell, and reaches level 60, he gets killed, and his spirit is chosen as Heaven's Keanu Reeves, the one who can command heaven's armies against the armies of Satan. However, Kenny is brought back to life in Hell's Pass Hospital, but in a \"persistent vegetative state\", and kept alive by a feeding tube, leaving heaven in danger. Meanwhile, Kenny's lawyer reads a will he has left, which says that Kenny has left his entire possessions to his friends and the PSP to Cartman out of sympathy, but the last page of the will is missing just when he gets to the part of Kenny's being in a vegetative state. At that time the boys are informed that Kenny's alive; however, this becomes a burden to Cartman, who wants him dead so that he can get the PSP, so he goes to the Supreme Court and testifies that he was Kenny's BFF (Best Friend Forever), and Cartman has one half of the BFF medallion while Kenny has the other. When the officers and Cartman find Kenny and the other medallion half in the hospital as proof, they get the feeding tube removed from Kenny. But Stan and Kyle rally the protesters to try to keep Kenny alive against the efforts of Cartman and the protesters and Heaven's angels. Can Cartman's side and the BFF medallions win out by allowing Kenny to die, or will it be universal Armageddon?—Debbie Kearns <angeldeb82@hotmail.com>"], "genres": "N/A", "imdbID": "0763046", "rating": 8.5, "votes": 3501, "number_of_episodes": 328}