{"cast": {"0001172": "Christopher Eccleston", "0684877": "Billie Piper", "0168554": "Camille Coduri", "1812592": "Corey Doabe", "0427716": "Ceris Jones", "0850526": "Jack Tarlton", "0137278": "Lachele Carl", "0512705": "Fiesta Mei Ling", "1307302": "Basil Chung", "0048749": "Matt Baker", "1070816": "Andrew Marr", "0889338": "Rupert Vansittart", "0894857": "David Verrey", "0159527": "Navin Chowdhry", "0934362": "Penelope Wilton", "0046183": "Annette Badland", "0605283": "Naoko Mori", "0693426": "Eric Potts", "0164929": "Noel Clarke", "1835544": "Jimmy Vee", "0818648": "Steve Speirs", "0287657": "Elizabeth Fost", "1208004": "Paul Kasey", "0750603": "Alan Ruscoe", "0203980": "Simon Davies", "1980968": "Spencer Hawken", "0593272": "Dean Mitchell", "2059560": "Sule Rimi"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Doctor returns Rose to her own time - well, sort of - but her family reunion is ruined when a spaceship crashes in the middle of London. What is the origin of the spaceship, and where has the Prime Minister gone in this time of crisis?", "The Doctor and Rose return to present day London where she finds that she hasn't been away for the 12 hours she thought had gone by, but 12 months. Her mother had been searching for her frantically, having filed a report with the police and putting posters with her photo on every lamp post. To their amazement, an alien spacecraft crashes in the Thames and Earth has it's first contact with extra-terrestrial beings. The Prime Minister has vanished however and those in charge are not what they seem to be. Working with the only Member of Parliament who seems to be in London, Rose and the Doctor battle a race of alien beings, the Slitheen, who want to destroy the Earth and sell it off, piece by piece.—garykmcd", "The Doctor and Rose arrive back in Modern Day, London where an anonymous spaceship containing a creature has crashed into the Thames. The Doctor is interested, and has many questions. Where is the Prime Minister, and who exactly is Harriet Jones?—nunnj-45457"], "genres": "N/A", "imdbID": "0562985", "rating": 6.9, "votes": 9189, "number_of_episodes": 175}