{"cast": {"0001172": "Christopher Eccleston", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0227681": "Shaun Dingwall", "0059240": "Robert Barton", "1735132": "Julia Joyce", "1128310": "Christopher Llewellyn", "0747531": "Frank Rozelaar-Green", "1747004": "Natalie Jones", "1689376": "Eirlys Bellin", "1821176": "Rhian James", "1812628": "Casey Dyer"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Rose asks The Doctor to take her to 1987, on the day her father was killed.", "All of her life, Rose's mother told how great a man her father Pete was. He was killed by a hit and run driver when Rose was just a baby and among her many regrets was that her father died alone, just lying on the street. Rose asks the Doctor to take her back to that day. Rather than just be with him when he dies, she actually saves him and later admits that this was her plan all along. She soon realizes that her parents' marriage was not exactly the golden relationship she had claimed it to be. Far worse however, is that by saving her father, Rose has created a tear in space and time with the result that Reapers are now feasting on humans. The Doctor isn't sure he'll be able to make everything right. Pete knows what he has to do, however.—garykmcd", "Rose asks the Doctor to let her meet her dad that died when she was a baby and to be with him at the moment of his lonely death, when he fulfill her wish she makes the decision of save her dad thinking that as he is an ordinary man there will be no consequences if he stay alive, but when she does it things soon start to go wrong.", "The Doctor takes Rose back to the day her father died, but when she tries to save him she creates a paradox that damages time and space. As the universe starts to come apart, the monstrous Reapers - creatures that feed on time distortions - begin to consume the Earth. And this time The Doctor will not be able to save the day!—Anonymous", "The Doctor and Rose travel back to the year 1987, to the day where Rose's father Pete was killed in a hit-and-run accident when she was only a year-old. When saving Pete's life, Rose's interference with history creates time paradoxes and causes flying monsters \"Repears\" to appear and to take over the entire planet. Will The Doctor and Rose save the Earth and restore history?—Daniel Williamson"], "genres": "N/A", "imdbID": "0562989", "rating": 8.3, "votes": 9585, "number_of_episodes": 175}