{"cast": {"0001172": "Christopher Eccleston", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0164929": "Noel Clarke", "0072949": "Mark Benton", "0307804": "Elli Garnett", "1293690": "Adam McCoy", "0750603": "Alan Ruscoe", "1208004": "Paul Kasey", "1635193": "David Sant", "0287657": "Elizabeth Fost", "1754266": "Helen Otway", "0109070": "Nicholas Briggs", "3772914": "Rachel Chambers", "0245533": "Richard Dwyer", "3386071": "Leighton Haberfield", "3173569": "Kevin Hudson", "1739136": "Paul Kulik", "0497856": "Maurice Lee", "0525967": "Holly Lumsden", "2951513": "Melanie Mort", "3286368": "Saul Murphy", "2154186": "Jo Osmond", "2512794": "Lisa Osmond", "3154200": "Sean Palmer", "4495179": "Elen Thomas", "0940468": "Rod Woodruff"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["When ordinary shop-worker Rose Tyler meets a mysterious stranger called the Doctor she is drawn into his strange and dangerous world; her life will never be the same again.", "Rose is a shop assistant at Harrods and finds herself in a top floor storage room when the mannequins seem to come to life. She's rescued by a man who calls himself the Doctor but reveals little about himself. Her Internet search leads her to a man who believes that the Doctor is an immortal alien who has been instrumental in averting various Earthly disasters. Their paths cross again and Rose helps the Doctor in fighting a race of plastics-based creatures whose home world may have been destroyed in a battle involving the Doctor. Rose seems like the perfect companion for his future travels.—garykmcd", "The first appearance of Christopher Eccleston as the Doctor. Rose Tyler meets a mysterious stranger called the Doctor, and her life will never be the same again. Soon, she realizes that her mum, her boyfriend, and the whole of Planet Earth are in danger. The only hope for salvation lies inside a strange blue police box...—Logan", "When Rose Tyler meets a mysterious stranger called The Doctor,her life will never be the same again. Soon,she realises her Mum,her boyfriend and the whole of Planet Earth is in danger. The only hope for salvation lies inside a strange blue box...—Beatdude"], "genres": "N/A", "imdbID": "0562992", "rating": 7.5, "votes": 11493, "number_of_episodes": 175}