{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0172604": "Pauline Collins", "0360171": "Ian Hanmore", "0242050": "Michelle Duncan", "0725701": "Derek Riddell", "0803397": "Jamie Sives", "0231871": "Ron Donachie", "1440170": "Tom Smith", "2084788": "Ruth Milne", "1980968": "Spencer Hawken", "2844233": "Ruari Mears"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Doctor and Rose are transported to 19th Century Scotland, where they meet Queen Victoria, and try to protect her from a ravenous werewolf and a band of assassinating warrior-monks", "The Doctor intends to take Rose to a 1979 pop concert, but instead they arrive in Balmoral, Scotland in 1879. They have a chance meeting with Queen Victoria who is traveling with her entourage to the Torchwood estate, home of Lord Robert and his wife, Lady Isobel. Adopting the alias of Dr. James McCrimmon, the Doctor convinces the Queen that they are friends of the crown and are invited as guests of her majesty. But little do they know that a brotherhood of monks have turned from god and are now worshiping an alien consciousness that fell to Earth centuries ago. It takes the form of a werewolf and has been passed down the centuries from person to person. It wants to take the royal throne and It's next intended host is Queen Victoria herself. Can the Doctor and Rose prevent the rise of the Empire of the Wolf?—Robert McElwaine", "The Doctor and Rose land in 1879 Scotland where they soon meet Queen Victoria who is visiting the Torchwood Estate, the home of Sir Robert and Lady Isabelle MacLeish. Unbeknown to any of the visitors, the estate has been taken over with Lady Isabelle and the servants in the cellar under lock and key. The house has been taken over by Father Angelo and other monks from a nearby Abbey who have with them an alien creature that takes the shape of a werewolf when the moon is full. Their goal is nothing less than control of the throne and the Empire.—garykmcd"], "genres": "N/A", "imdbID": "0563002", "rating": 7.6, "votes": 8815, "number_of_episodes": 175}