{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0164929": "Noel Clarke", "0910738": "Zoë Wanamaker", "0302491": "Sean Gallagher", "0188568": "Doña Croll", "0280332": "Michael Fitzgerald", "0732867": "Lucy Robinson", "0027957": "Adjoa Andoh", "1917814": "Anna Hope", "0524849": "Simon Ludders", "0734654": "Struan Rodger", "2470960": "Nathalie Cuzner", "3846475": "Sophia Day", "2216935": "Lucy Hassan", "3173569": "Kevin Hudson", "2200805": "Melissa Stanton", "1667332": "John R. Walker"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Doctor and Rose arrive on New Earth and meet old friends and enemies in a hospital which can cure every disease. But the cures come at a terrible cost.", "The Doctor and Rose set out on their first adventure together since the Doctor regenerated. The Doctor takes Rose to see the Planet New Earth, colonized by the human race since the destruction of the original planet Earth. On arriving the Doctor receives an invitation to visit a hospital run by the sisters of plenitude. A sisterhood of cat-women nuns who have the uncanny ability to cure so many long thought incurable diseases. But as the Doctor and Rose discover there is a sinister method as to how the Sisterhood manage to develop such cures. While unknown to them both an old enemy thought to be deceased, awaits the Time lord and his companion.—Robert McElwaine", "The Doctor and Rose travel New Earth in the year 5 billion and 23 after he receives a mysterious message. Once there, he visits the hospital where his contact is to be found in Ward 26. There he finds the Face of Boe, apparently the last of his kind and hears of a legend that has him telling of a great secret. Rose meanwhile has been lured to to hospital's basement where she encounters Cassandra who has somehow miraculously survived. She needs a body however and Rose's will do just fine. When the Doctor realizes the hospital is successfully treating diseases for which a cure has yet to be developed, he concludes that something very sinister is going on.—garykmcd"], "genres": "N/A", "imdbID": "0562990", "rating": 7.3, "votes": 8791, "number_of_episodes": 175}