{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0164929": "Noel Clarke", "0227681": "Shaun Dingwall", "0807314": "Andrew Hayden-Smith", "0643322": "Tracy-Ann Oberman", "0416849": "Raji James", "1208004": "Paul Kasey", "0109070": "Nicholas Briggs", "1141268": "Barnaby Edwards", "0670406": "Nicholas Pegg", "1458289": "Stuart Crossman", "2308968": "Anthony Spargo", "2301688": "Dan Barratt", "0359999": "David Hankinson", "0851113": "Catherine Tate", "5917383": "Jon Davey", "3173569": "Kevin Hudson", "2666793": "Fay McDonald", "2143424": "Kevin Wickenden"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Earth becomes a battleground for the Daleks and the Cybermen. With the whole planet at stake and the Genesis Ark activated, how much will the Doctor sacrifice in order to end the war?", "Earth becomes the battlefield for the greatest and deadliest war of all time, as the Daleks and the Cybermen clash with the whole universe at stake. The Doctor and Rose, reunited with old friends and Cybermen experts Mickey and Jake, race to find a way to bring the war to an end before it brings about the destruction of the whole of space and time. But the Doctor soon faces an even bigger dilemma - could ending the war mean the death of Rose?—Anonymous", "The daleks have found there way out of the void and the cybermen seize this opportunity to forge an alliance and 'upgrade the universe' an offer which the daleks promptly decline, causing the two sides to go all out in a battle to control the earth, Rose realises that she is the only one who can save the world but she may not survive to tell the tale......—tomp1000", "The ghostly beings who have been appearing from time to time are shown to be Cybermen who are crossing the void from the alternate universe that the Doctor and Rose had recently visited. What they don't immediately realize is that the sphere the Torchwood Institute recovered is carrying the last of the four Daleks in existence. They say they need Rose to energize the Genesis Ark, though no one seems to know what that is until it's opened - and out flood Daleks by the thousands. With help from Mickey and Peter Tyler, The Doctor devises a plan to have both the Cybermen and the Daleks sucked back into the void but it may cost him one thing - Rose.—garykmcd"], "genres": "N/A", "imdbID": "0756450", "rating": 9.2, "votes": 11220, "number_of_episodes": 175}