{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0164929": "Noel Clarke", "0617009": "Sophia Myles", "1883181": "Ben Turner", "2286962": "Jessica Atkins", "1076294": "Angel Coulby", "2268332": "Gareth Wyn Griffiths", "1208004": "Paul Kasey", "0858794": "Ellen Thomas", "2241138": "Jonathan Hart", "0431521": "Emily Joyce", "2084348": "Julian Hensey", "4495179": "Elen Thomas"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Doctor, Mickey and Rose land on a spaceship in the 51st century only to find 18th century Versailles on board, the time of Madame De Pompadour! To find out what's going on the Doctor must enter Versailles and save Madame De Popmpadour but it turns into an emotional roller coaster for the Doctor.", "The Doctor, Rose and Mickey materialize in the 51st Century on-board a derelict space craft. While searching for the crew, they discover that all of the ship's energy is being diverted to maintain \"time windows\" - two-way portals in space and time - all of which are pointed at France at various points in the 18th Century. Who is the young woman on the other side who calls for the Doctor by name, and what is the crisis that is about to befall her? And who in the 51st Century is watching all this?—Balkaster", "The Doctor, Rose and Mickey travel to what appears to be an abandoned space ship in the 51st century. The engines are functioning however and the power is being used to power a portal to 18th century Paris. There the Doctor meets a young girl, Reinette and saves her from a creature under her bed. He sees again her after some years have passed and as a young woman, she is the future Madame de Pompadour. He soon realizes that the ship has been geared to track her activities at various points in her life but it's not exactly obvious why they are doing so. At the same time, he and Reinette develop a unique bond.—garykmcd"], "genres": "N/A", "imdbID": "0562998", "rating": 9.2, "votes": 13789, "number_of_episodes": 175}