{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0443153": "Peter Kay", "0912938": "Marc Warren", "0376602": "Shirley Henderson", "0338425": "Simon Greenall", "0103696": "Moya Brady", "0238776": "Kathryn Drysdale", "1208004": "Paul Kasey", "0256082": "Bella Emberg", "2243868": "Natalie Danks-Smith", "1627767": "Barney Harwood", "0005056": "Elton John", "4497482": "Andy Jones", "2448364": "Claudio Laurini"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Elton Pope is an ordinary man intrigued by the world of the Doctor. When he and fellow enthusiasts - L.I.N.D.A. - meet the mysterious Victor Kennedy, their lives will never be the same again.", "A run in with the Doctor at a young age leads Elton to a group who's studying him, they become friends and have a laugh until Victor Kennedy arrives. Suddenly everything becomes more serious then people start disappearing from the group.—Time-witch", "Elton Pope, an ordinary man on present-day Earth, becomes obsessed with his brief meeting with the Doctor from when he was 4 years old. Him and his group of equally curious friends hold weekly meetings to discuss their individual findings about the Doctor and Rose - but when the mysterious Victor Kennedy arrives and, one by one, the group starts to disappear, it seems the answers may be closer than they realise...—Steve", "As a young lad, Elton Pope had an encounter with the Doctor and has ever since tried to make sense of it all. He's researched other sightings of the Doctor and soon finds others who also had encounters with him. The group takes to meeting one another trying to learn more about him and learn who he is. Their group is taken over in a way with the arrival of Victor Kennedy who organizes them and brings some discipline to their work. One by one however, they start to disappear and Elton realizes that there is much more going on than he had bargained for.—garykmcd"], "genres": "N/A", "imdbID": "0766171", "rating": 6.1, "votes": 9651, "number_of_episodes": 175}