{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0164929": "Noel Clarke", "0227681": "Shaun Dingwall", "0516181": "Roger Lloyd Pack", "0807314": "Andrew Hayden-Smith", "0913116": "Don Warrington", "0157774": "Mona Hammond", "0341211": "Helen Griffin", "0817228": "Colin Spaull", "0031524": "Paul Antony-Barber", "0789575": "Adam Shaw", "2259874": "Andrew Ufondu", "0240375": "Duncan Duff", "1208004": "Paul Kasey", "0109070": "Nicholas Briggs", "5917383": "Jon Davey", "3173569": "Kevin Hudson", "1693955": "Gethin Jones", "2844233": "Ruari Mears", "4001404": "Emma Raine Walker", "13054625": "Justin Walters", "2143424": "Kevin Wickenden"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The TARDIS crash lands in London on a parallel world, where Rose's dad is still alive, people are disappearing off the streets and one of the Doctor's deadliest enemies is about to be reborn.", "The TARDIS falls through a gap in the time vortex which leads the crew to find themselves in a parallel version of London, England in the year 2006. It's a slightly more advanced era where Zeppelins fly overhead and the populace wear special ear pods where information can be downloaded via the Cybus corporation. A multi-million pound conglomerate owned by the crippled genius John Lumic. Lumic is involved in his own personal business project which involves an alternate version of Rose Tyler's father, Pete who has become a millionaire in this reality and whom Rose is hell bent on meeting. Lumic wishes to convince the President of Great Britain that his new project which involves the human brain being transferred to a robotic body of pure steel would mean that people need never die. A fate that Lumic is facing as he is suffering from a critical illness. But it's a project that the President dismisses as unethical and immoral. All the while homeless people on the streets of London are being coaxed in to vans by mysterious men in uniforms and never to be seen again. Before long the Doctor discovers that Lumic, now shunned, has far greater and sinister designs. Ones that involves an army of his monstrous creations, which the Doctor discovers to his horror are an alternate version of some of the most terrifying enemies from his past.—Robert McElwaine", "When the Tardis fails - and is apparently unrepairable - it lands in present-day London, or so it seems until they see the sky filled with zeppelins. It seems that they have landed in a parallel world or universe that is akin to Earth but with significant differences. The arrival is quite dramatic for Rose who learns that in this world her father Peter, who died when she was only 6 months old, is alive. Peter works for a wealthy industrialist, John Lumic, who has a plan to take control by recreating one of the Doctor's greatest foes - the Cybermen.—garykmcd"], "genres": "N/A", "imdbID": "0562991", "rating": 7.7, "votes": 8337, "number_of_episodes": 175}