{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0164929": "Noel Clarke", "0934362": "Penelope Wilton", "0262665": "Daniel Evans", "0305081": "Adam Garcia", "0318409": "Sean Gilder", "0648285": "Chu Omambala", "1715194": "Aníta Briem", "1544441": "Sian McDowall", "2167957": "Paul Anderson", "0614145": "Cathy Murphy", "0137849": "Sean Carlsen", "2106003": "Jason Mohammad", "0038169": "Sagar Arya", "0137278": "Lachele Carl", "4924191": "Greg Bennett", "3260601": "Ian Hilditch", "3173569": "Kevin Hudson", "1559658": "Mike Mungarvan", "2143424": "Kevin Wickenden"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["It's Christmas Eve, but this is to be a far from silent night - the cruel Sycorax have come to Earth to enslave mankind and, as ever, only The Doctor can stop them. Unfortunately, he's lying in a coma in Jackie's home...", "The newly regenerated Doctor travels to present day London and Rose is happy to be home. Her mother is happy to see her, her protestation to the contrary. The Doctor isn't well however suffering from what he describes as a surplus of energy. While he is in a coma-like state, the people of the Earth are threatened by the Sycorax who threaten to destroy one-third of the planet's population if they don't surrender. The Prime Minister, in the apparent absence of the Doctor, asks for assistance from Torchwood but it's slow in coming and the end is fast approaching. Rose's mum Jackie has the cure for the Doctor, however.—garykmcd", "Post-regenerating trauma is setting in, and shortly after the tardis crash-lands on earth, in London, on Christmas's eve, an alien threat approaches earth. Only the doctor can stop the aliens. Problem is, he unconscious in a bed inside Jackie Tylers apartment...—the_stuff_of_legends", "Shortly after regenerating into his Tenth incarnation. The Doctor and Rose returns to present-day London, England on Christmas Eve, where The Doctor is suffering from trauma from the regenerative process and falls into a coma. Where U.N.I.T led by Prime Minister Harriet Jones investigates a British space probe, where the Earth is invaded by the Sycorax who plan to control the human race and declare themselves as rulers of Earth.—Daniel Williamson"], "genres": "N/A", "imdbID": "0562994", "rating": 8.0, "votes": 9369, "number_of_episodes": 175}