{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0164929": "Noel Clarke", "0372117": "Anthony Head", "0805207": "Elisabeth Sladen", "0037820": "Rod Arthur", "1843386": "Eugene Washington", "1247393": "Heather Cameron-McLintock", "2055187": "Joe Pickley", "0807420": "Ben Smith", "0862540": "Clem Tibber", "1096355": "Lucinda Dryzek", "0077504": "Caroline Berry", "0498770": "John Leeson", "1980968": "Spencer Hawken"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Krillitanes - aliens with a mix-and-match physiology - are trying to crack the 'God-Maker', a paradigm to give them ultimate power. They are using children as a computer, and only the Doctor and Rose, re-united with Sarah Jane Smith and K9 can prevent them from becoming masters of time and space.", "The Doctor, Rose and Mickey goes to investigate Deffry Vale High School, where the students have become super-intelligent and teachers aren't what they seem and lunch times are really peculiar. When the Doctor learns the teachers and the headmaster Lucas Finch are sinister aliens, reuniting with investigative journalist Sarah Jane Smith and mobile computer K-9 mark 3, The Doctor set out to uncover Finch and the teacher's evil intentions and foil their evil scheme.—Daniel Williamson", "Following the suspicions of Roses's ex-boyfriend Mickey, the Doctor and his young companion go undercover as a school teacher and dinner lady in a London high school. With the further help of Mickey their investigations lead them to discover that the schools new headmaster, the charming yet sinister Mr. Finch and his newly appointed members of staff are not of this Earth. This bizarre revelation begins to partly explain why many of the schools pre-pubescent pupils have abnormally high Intelligence. But as the Doctor has just previously discovered. An old friend and traveling companion from his past has crossed his path once again. Her name: Sarah Jane Smith. Together with the help of a now old and rusted robot dog called K-9 that was a gift to her from the Doctor. Sarah strives to help her old time lord friend and his new companions outwit the evil Mr. Finch and his cronies.—Robert McElwaine", "The Doctor and Rose are working in a school, he as a teacher and she in the kitchens - much to her consternation - after her boyfriend Mickey tells them something odd is going on there. The Doctor discovers that the students know far more that they should and that the Krillitanes have in fact taken over the school. They are trying to unlock a secret that will make them all powerful. The Doctor is delighted when assistants from his past comes to the school and enlists to help him: none other than Sarah Jane Smith and K-9. Having met one of her predecessors, Rose begins to wonder what the future may hold for her.—garykmcd"], "genres": "N/A", "imdbID": "0562993", "rating": 8.2, "votes": 9333, "number_of_episodes": 175}