{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0168554": "Camille Coduri", "0164929": "Noel Clarke", "0643322": "Tracy-Ann Oberman", "0416849": "Raji James", "1303956": "Freema Agyeman", "2301662": "Hadley Fraser", "2301664": "Oliver Mellor", "0934774": "Barbara Windsor", "1409709": "Hajaz Akram", "0207201": "Anthony Debaeck", "1212366": "Takako Akashi", "1648137": "Paul Fields", "1034298": "David Warwick", "2301634": "Rachel Webster", "2301632": "Kyoko Morita", "1065011": "Maddi Cryer", "1358878": "Derek Acorah", "0996378": "Alistair Appleton", "0323846": "Trisha Goddard", "1208004": "Paul Kasey", "0109070": "Nicholas Briggs", "1141268": "Barnaby Edwards", "0670406": "Nicholas Pegg", "1458289": "Stuart Crossman", "2308968": "Anthony Spargo", "2301688": "Dan Barratt", "0359999": "David Hankinson", "2505173": "Marc Aeon Bradley", "5917383": "Jon Davey", "0001172": "Christopher Eccleston", "0300513": "Rochelle Gadd", "3173569": "Kevin Hudson", "2448364": "Claudio Laurini"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["When ghosts of loved ones appear all over the world the Doctor traces the phenomena to the Torchwood Tower, where some old friends and enemies are waiting.", "As the ghosts of loved ones appear, the whole world celebrates. But as the Doctor investigates he believes that there is a more sinister motive behind their appearence. And deep within the Torchwood tower, a mysterious sphere containing the greatest enemies of the Doctor is opened...—bazzmund", "The Doctor and Rose return to present day Earth to visit Jackie - only to find the people of Earth rejoicing as the ghosts of loved ones have arrived. The Doctor is naturally suspicious, and discovers that the nearby Torchwood Institute is responsible. But the ghosts are masking an imminent invasion from a different dimension. Which of the Doctor's oldest and greatest enemies is about to return? Which old friend is about to return when the Doctor thought he would never be seen on Earth again? And just what is the mysterious sphere in the bowels of Torchwood Tower hiding? Earth is about to become the battlefield for the most deadly war of all time...—Steve", "The TARDIS lands in the present day and Rose's mother Jackie is thrilled to see her and the Doctor. She thinks her mother has gone mad however when she says that Rose's Grandad Prentiss is dropping in for a visit. The only problem is that he died 10 years ago. Just as Jackie predicts however, ghost-like images appear for a few minutes and then vanish. It's a worldwide phenomenon and the Doctor, Rose and Jackie are soon at the source of the images: the Torchwood Institute. Torchwood has amassed a considerable amount of alien technology and it's the Institute that is causing the ghosts to appear. The Doctor concludes that there is rip in space that is allowing beings to travel from one dimension to the Earth. They will all have to face an enemy the Doctor thought had been defeated.—garykmcd"], "genres": "N/A", "imdbID": "0756449", "rating": 8.4, "votes": 8544, "number_of_episodes": 175}