{"cast": {"0855039": "David Tennant", "0684877": "Billie Piper", "0815317": "Nina Sosanya", "2179116": "Abisola Agbaje", "0234270": "Edna Doré", "0267003": "Tim Faraday", "1357414": "Abdul Salis", "1121559": "Richard Nichols", "1689710": "Erica Eirian", "1133728": "Stephen Marzella", "0250048": "Huw Edwards", "5335141": "Becky Wright", "3260601": "Ian Hilditch"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["When children vanish into thin air in 2012 London, the Doctor and Rose find the answers in a seemingly ordinary household and a girl whose drawings can come to life.", "The Doctor and Rose travel to London in 2012 to see the Olympics - only to find that children are mysteriously disappearing before peoples very eyes. The answer seems to lie with a young girl named Chloe and her strange drawings - but is there something more sinister behind the disappearances?—Steve", "A series of mysterious disappearances involving children in London blight what should be a happy day for its residents. It's the eve of the 2012 Olympics, and the ceremony of the torch lighting, which the Doctor has taken his traveling companion Rose Tyler to witness, is to take place in a matter of hours. After stumbling on the mystery and the paranoia among parents that has arisen as a result of their children vanishing, the Time Lord and his young sidekick agree to try to solve what's causing the bizarre series of events. Their investigations lead to the conclusion that a psychic alien force is spiriting children away from under the noses of their parents--an alien presence that has housed itself in a little girl named Chloe and is exploiting her talent for drawing pictures for its own alien motives. But are the creature's motives as selfish and evil as they might seem? And what is the dreaded monstrosity that hides in the imaginative child's closet? The Doctor might have an answer to these questions. To save the missing kids and Chloe, he and Rose must convince Chloe's mother that they can help the young child, but as the Doctor and Rose soon learn, the solution might cost the Doctor and spectators at the London Olympics their own freedom.—Robert McElwaine", "The Doctor and Rose land in London in 2012, just hours before the opening ceremonies of the summer Olympic Games. They're in a nice neighborhood but the streets are empty and there is a strange feeling in the air. They also learn that three children have gone missing in the last six days. It soon becomes apparent that the locals are afraid, but of what isn't quite obvious. The Doctor and Rose soon trace it all to a house occupied by Trish and her daughter Chloe. Chloe in particular has been acting strangely and her mother is obviously not telling everything she knows. The Doctor is convinced the child has been taken over by an alien being but when he too disappears, it's left to Rose to save the day.—garykmcd"], "genres": "N/A", "imdbID": "0756446", "rating": 5.8, "votes": 8638, "number_of_episodes": 175}