{"cast": {"0855039": "David Tennant", "1303956": "Freema Agyeman", "0057882": "John Barrowman", "0001394": "Derek Jacobi", "1496158": "Chipo Chung", "0951843": "René Zagger", "0717503": "Neil Reidman", "1788798": "Paul Marc Davis", "1836638": "Robert Forknall", "2686004": "John Bell", "0533700": "Deborah Maclaren", "0134623": "Abigail Canton", "0799591": "John Simm", "0014677": "Anthony Ainley", "2470960": "Nathalie Cuzner", "0217069": "Roger Delgado", "0318409": "Sean Gilder", "0684877": "Billie Piper", "0734654": "Struan Rodger", "4495179": "Elen Thomas"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Soon after bumping into old friend Jack Harkness, Martha and The Doctor head off to Malcassairo, a distant planet where an old professor will do anything he can to keep his people alive...", "The Doctor and Martha arrive in present day Cardiff to refuel the TARDIS and are inexplicably thrust to a distant planet 100 trillion years into the future. When they arrive they realize they have an unexpected passenger in Captain Jack Harkness who has been patiently waiting for the Doctor's return since the mid-19th century. On the planet they eventually meet Professor Yana who is running the 1000-year old Utopia project, the aim of which is to relocate the human-like creatures to a new planet, away from the outsiders who they fear they will become if they don't leave. When Prof. Yana has need of someone to make repairs in a room in which no one can survive, the Doctor has the perfect candidate. The Professor is not what he seems to be however and Martha notices he has a fob watch much like one the Doctor recently made use of.—garykmcd", "On a fleeting pit stop to refuel the TARDIS. The Doctor and Martha pick up a surprise passenger. None other than the Doctor's old friend and head of Torchwood, Captain Jack Harkness who leaps on-board the time machine as it makes it's departure. In a desperate bid rid itself of the former time agent. The TARDIS races through the time vortex. Taking the crew trillions of years in the future to the planet Malcassario and the end of the universe. It is here where the last surviving remains of human civilization struggle to protect themselves from the Futurekind. A race of semi-human creatures who it is believed are what the human race will eventually become. And it is also here that the Doctor, Martha and Jack meet Prof. Yana. An elderly genius who dreams of helping guide the last members of mankind to 'Utopia'. A legendary location where they may somehow survive as the universe collapses. With there being so little help in the way of scientific intelligence. Prof. Yana looks to the Doctor for the assistance he needs. But in agreeing to help the kind old man. The Doctor discovers to his shock that the two of them have more in common than just their genius.—Robert McElwaine"], "genres": "N/A", "imdbID": "1000259", "rating": 8.7, "votes": 8912, "number_of_episodes": 175}