{"cast": {"0855039": "David Tennant", "1303956": "Freema Agyeman", "0641192": "Ardal O'Hanlon", "1917814": "Anna Hope", "1490405": "Travis Oliver", "1564072": "Lenora Crichlow", "0377244": "Jennifer Hennessy", "0877436": "Bridget Turner", "0026753": "Georgine Anderson", "0669160": "Simon Pearsall", "2542922": "Daisy Lewis", "0099610": "Nicholas Boulton", "2609199": "Erika Macleod", "0635543": "Judy Norman", "0655600": "Graham Padden", "1275283": "Lucy Davenport", "2622652": "Tom Edden", "0931370": "Natasha Williams", "1817883": "Gayle Telfer Stevens", "0734654": "Struan Rodger"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Doctor takes Martha to New Earth, where she is kidnapped by two carjackers and taken to an underground Motorway, where the remainder of humanity on the planet live in perpetual gridlock.", "The TARDIS takes the Doctor and Martha to New Earth in the year Five Billion and Forty-Three, where the Face of Boe finally reveals his message to the Time Lord; meanwhile, terrifying beasts are lurking beneath the city of New New York - creatures that the Doctor believed he defeated many, many years ago.—Jonathan Tonkin", "The Doctor returns to New Earth only to find that it has much deteriorated since he was last there. They no sooner arrive than Martha is kidnapped, or 'carjacked' in local parlance, which will allow a young couple traveling by car to New Brooklyn to use the fast lane on the motorway. The only problem is that they estimate that it will take them 5 years to get there. While trying to find Martha, the increasingly desperate Doctor once again meets Novice Hame who is under orders to take him to the Face of Boe who reveals his great secret - and it has to do with the Doctor.—garykmcd", "As promised the Doctor takes Martha on her second journey which is to be in the future, traveling to New Earth where the Time Lord had previously taken Rose Tyler. But far from being the glittering metropolis it once was, the planet's main major city has become a grimy shadow of its former self where pharmacists eagerly ply their trade, selling mood manipulating drugs. But before the Doctor can voice his disapproval any more than usual, Martha is kidnapped by a young couple who are traveling through the cities vast underground motorway. The purpose of which is to make it to the motorway's fast lane where a third passenger is strictly necessary. Racing to his young friend's rescue. the Doctor hitches a lift with Brannigan, a Cat person who with his human partner Valerie and their offspring are also traveling the motorway. But as the Doctor discovers, it's a journey with an end that will be a long time coming. And all the while, unknown to the Time Lord, an old acquaintance of his has dispatched someone on an important mission to seek him out.—Robert McElwaine"], "genres": "N/A", "imdbID": "1000253", "rating": 8.0, "votes": 8717, "number_of_episodes": 175}