{"cast": {"0855039": "David Tennant", "1303956": "Freema Agyeman", "0828961": "Jessica Hynes", "1368934": "Rebekah Staton", "1032473": "Thomas Brodie-Sangster", "0516003": "Harry Lloyd", "2615168": "Tom Palmer", "0394531": "Gerard Horan", "2174138": "Lor Wilson", "0868476": "Pip Torrens", "2613565": "Matthew White", "0807944": "Derek Smith", "0100019": "Peter Bourke", "2844233": "Ruari Mears"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["In 1913, Martha watches in jealousy from afar as The Doctor learns what it is to be human and to fall in love with the local school nurse, Joan Redfern.", "It's 1913 and John Smith is a middle-aged teacher who works in a private school where he is assisted by his doting Maid Martha who was previously employed by his father. John has his head frequently in the clouds. He has recurring dreams which he jots down details of in his journal and recounts to Joan Redfern, the school's plain, kind-hearted Matron. They involve an alien time traveler who calls himself the Doctor who journeys through time and space in a blue box, picking up numerous companions along the way. But he wonders if it's all really just the dream. As John and Joan's feelings become more and more apparent is there more to Martha's concerns over Mr. Smith than just mere infatuation? Events begin to take another twist when a mysterious, other-worldly family with an army of animated scarecrows make their presence known.—Robert McElwaine", "When Doctor realizes that he is being hunted by the family, he must find a place to hide - he must also turn himself into a human. He and Martha travel to 1913 England where the Doctor in human form, known as Mr. John Smith, is a schoolmaster. He has no memory of who he really is or what has happened and has become romantically interested in the school nurse, Miss Joan Redfern. Martha is working in the school as a housemaid and knows what is going on. She also knows that the Doctor has put his essence into a watch that that return him to his former self. The Family is getting closer and a young student has borrowed the watch.—garykmcd"], "genres": "N/A", "imdbID": "1000254", "rating": 8.9, "votes": 9928, "number_of_episodes": 175}