{"cast": {"0855039": "David Tennant", "1303956": "Freema Agyeman", "0707214": "Miranda Raison", "1408453": "Ryan Carnes", "0702934": "Hugh Quarshie", "1940449": "Andrew Garfield", "0520580": "Eric Loren", "2606443": "Flik Swan", "0129880": "Alexis Caley", "2599975": "Earl R. Perkins", "0111730": "Peter Brooke", "0692139": "Ian Porter", "0598922": "Joe Montana", "0991334": "Stewart Alexander", "1943374": "Mel Taylor", "1141268": "Barnaby Edwards", "0670406": "Nicholas Pegg", "2308968": "Anthony Spargo", "0359999": "David Hankinson", "0109070": "Nicholas Briggs", "1208004": "Paul Kasey", "3260601": "Ian Hilditch", "3173569": "Kevin Hudson", "2448364": "Claudio Laurini", "2844233": "Ruari Mears", "3177118": "Pablo Raybould", "13054625": "Justin Walters"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The Doctor and Martha travel to New York in 1930, where people have been mysteriously vanishing from the streets, and an old enemy resurfaces.", "This is the first of a two part story, it is set in 1930's New York. The Doctor and Martha arrive in New York, there is, however, trouble as the Daleks return once again, this time attempting to create a Dalek/Human hybrid creature in the New York sewers! These two episodes also see the return of the Dalek Sec and the Cult of Skaro.—Brantyman", "The doctor and Martha arrive in New York City in November 1930 where they visit the shanty town, known as Hooverville after the President of the day, that's been built by the poor and the destitute in Central Park. The Great Depression is taking its toll but there is a mystery about the shantytown as men have been disappearing into thin air. Hooverville is in the shadow of the what will be the tallest building in the world, the Empire State building. It's about a month away from being completed and the building's master are pushing to get it done even more quickly - the masters are Daleks. They are experimenting on humans, but have not as yet succeeded in their still secret plan.—garykmcd"], "genres": "N/A", "imdbID": "0993186", "rating": 7.0, "votes": 7998, "number_of_episodes": 175}