{"cast": {"0855039": "David Tennant", "1303956": "Freema Agyeman", "0717176": "Anne Reid", "0550462": "Roy Marsden", "0027957": "Adjoa Andoh", "1813221": "Gugu Mbatha-Raw", "0946815": "Reggie Yates", "0481994": "Trevor Laird", "1756391": "Kimmi Richards", "2241142": "Ben Righton", "1581584": "Vineeta Rishi", "1208004": "Paul Kasey", "0109070": "Nicholas Briggs", "0183037": "George Cottle", "2470960": "Nathalie Cuzner", "3173569": "Kevin Hudson", "2844233": "Ruari Mears", "7510963": "Michael Llewellyn Williams"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["When medical student Martha Jones meets a mysterious stranger called The Doctor, and finds herself transported to the moon, her life will never be the same again.", "As the Doctor says goodbye to Donna Noble, he goes undercover at the Royal Hope Hospital in London, where he meets medical student and future companion Martha Jones. The duo are whisked away with the entire hospital to the moon by an alien courier connected with the Judoon, a brutal mercenary police force, and only the Doctor can defeat them.—anon", "The Doctor must foil a plot from the mighty clan of Galactic Stormtroopers known only as the Judoon, who transport the Royal New Hope Hospital of London to the Moon. Martha Jones is a medical student who must help the Doctor - known to her as John Smith - before all hell breaks loose.—Steven", "The Doctor, along with hundreds of staff and patients, is transported to the Moon when an entire London hospital is inexplicably relocated. The hospital is under a protective barrier and oxygen is limited. With the arrival of the Judoon, a sort of intergalactic police force, it becomes obvious they are looking for an extra-terrestrial being. In the chaos of the hospital, the Doctor meets Martha Jones who is fascinated by what she sees and what is happening to them. When one of the physicians, Mr. Stoker, is found dead it appears there is in fact a blood sucking being, a Plasmavore, among them which they must identify if the Earthlings are going to survive. For the Doctor, who is still pining for Rose, Martha might prove to be a most capable companion.—garykmcd"], "genres": "N/A", "imdbID": "0974728", "rating": 7.9, "votes": 8514, "number_of_episodes": 175}