{"cast": {"0855039": "David Tennant", "0851113": "Catherine Tate", "0661703": "Sarah Parish", "1173717": "Don Gilet", "0041033": "Howard Attfield", "0454800": "Jacqueline King", "1506051": "Trevor Michael Georges", "2253388": "Glen Wilson", "1163105": "Krystal Archer", "2038426": "Rhodri Meilir", "2435205": "Zafirah Boateng", "1208004": "Paul Kasey", "0684877": "Billie Piper", "3764470": "Richard Price"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["The Doctor is baffled when a young woman is transported to the TARDIS on her wedding day, and attempts to find out how she is connected to an alien plot to destroy Earth.", "Donna, a middle aged woman who is on the verge of marrying her fiancé; Lance finds herself transported within the confines of an immense spaceship. That spaceship being the TARDIS. Much to the shock of the obnoxious Bride as well as the Doctor who has just recently had to get over the departure of Rose Tyler. The Time Lord learns that Donna is in some way linked to an alien plot to destroy the planet Earth. With time ticking away and the Doctor having to face off against a small army of robotic Santa's once again. Can he prevent the evil Empress of the Racnoss's plot to eradicate the world?—Robert McElwaine", "The Doctor is stunned when Donna Noble suddenly appears in the TARDIS. He has no idea how she got there and she wants to return to exactly where she was when she vanished - walking down the aisle of the church and about to be married. A quick return to Earth and a check into her background reveals that her company was once owned by the now defunct Torchwood Institute. The Doctor finds that Torchwood had built secret facilities under the Thames barrier where he also finds the cause of the problem: the Empress of Racnoss, a spider-like creature who is trying to re-establish her kind. The Doctor and Donna will have to travel billions of years back in time to the very formation of the Earth to understand what she is up to.—garykmcd"], "genres": "N/A", "imdbID": "0827573", "rating": 7.6, "votes": 8825, "number_of_episodes": 175}