{"cast": {"0855039": "David Tennant", "1303956": "Freema Agyeman", "1813221": "Gugu Mbatha-Raw", "0946815": "Reggie Yates", "0027957": "Adjoa Andoh", "0309693": "Mark Gatiss", "0055289": "Thelma Barlow", "1412682": "Lucy O'Connell", "1584487": "Bertie Carvel", "4924191": "Greg Bennett", "4088744": "Barbara Fadden", "1192630": "Jennie Fava", "3260601": "Ian Hilditch", "2927778": "Garry Marriott", "5213437": "Sally Martin", "3764470": "Richard Price", "0801245": "Tracie Simpson"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The famous Dr Lazarus has appeared to discover the secret of eternal youth - but do his experiments hide a sinister secret?", "The Doctor brings Martha home but decides to stay on when he hears that that very evening, a scientist will reveal a discovery that will forever change mankind. The 72-year old Dr. Lazarus hosts a lavish party, organized by Martha's sister Tish, to unveil his new machine. He enters it and a few moments later - with only a slight hiccup rectified by the Doctor - emerges as a young man. Everyone is amazed but the Doctor and Martha soon realize that the younger Dr. Lazarus has had his genetic code scrambled and is now a beastly creature. Martha's mother is also at the reception and is not pleased that Martha has taken up with this strange man who doesn't seem to have a name. It doesn't help that someone keeps telling her that the Doctor is very bad news.—garykmcd", "The Doctor brings Martha home, only to know that there is a scientist called Dr. Lazarus who will change what it means to be human. When Lazarus invites some people to his party, he tells everyone to gather around as he steps into his machine which basically turns Lazarus into a hideous creature. With Lazarus on the loose, it's up to the Doctor, Martha and Tish (Martha's sister)to defeat the evil Lazarus once and for all, can they do it?"], "genres": "N/A", "imdbID": "1000257", "rating": 6.5, "votes": 7978, "number_of_episodes": 175}