{"cast": {"0855039": "David Tennant", "0851113": "Catherine Tate", "1303956": "Freema Agyeman", "0595634": "Georgia Tennant", "0856050": "Nigel Terry", "1478079": "Joe Dempsie", "1208004": "Paul Kasey", "2844233": "Ruari Mears", "2141398": "Akin Gazi", "2999193": "Lekan Lawal", "5917383": "Jon Davey", "4088744": "Barbara Fadden", "4497482": "Andy Jones", "3764470": "Richard Price"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Caught in the middle of a war between the Humans and the Hath in the planet Messaline, the Doctor finds himself once again a father.", "The TARDIS as seen before seems to display a mind of Its own and whisks the Doctor, Donna and the Time Lords former companion Martha Jones to the planet Messaline, a world where a savage war is being fought between humans and a race of fish like creatures called the Hath. In the ensuring confusion of their arrival, Martha is abducted by the Hath. Rescuing Martha becomes the Doctor and Donna's main priority as well as attempting to put a stop to the ugly war that has consumed the planet. But that would have been complicated enough had it not been for the fact that the Doctor had suddenly been made a father again.—Robert McElwaine", "Martha doesn't have time to leave the TARDIS when it is whisked away to a distant planet by forces beyond the Doctor's control. When they arrive they find two civilizations that seemingly have been at war with one another for generations. One of the two, human-like creatures, have the ability to create clones and use the Doctor to create Jenny who is, effectively, the Doctor's daughter. The Doctor and Donna finds themselves trapped with the human creatures after a tunnel cave-in. Martha however is taken by the other group, the Hath. As the Doctor continues to learn more about the human-Hath war, he realizes just how long they have been fighting.—garykmcd"], "genres": "N/A", "imdbID": "1205439", "rating": 7.5, "votes": 8210, "number_of_episodes": 175}