{"cast": {"0855039": "David Tennant", "0001541": "Kylie Minogue", "0658244": "Geoffrey Palmer", "0869871": "Russell Tovey", "0182688": "George Costigan", "0639575": "Gray O'Brien", "0369854": "Andrew Havill", "2095259": "Bruce Lawrence", "0154708": "Debbie Chazen", "0746488": "Clive Rowe", "0842578": "Clive Swift", "1835544": "Jimmy Vee", "0187754": "Bernard Cribbins", "0936667": "Nicholas Witchell", "1208004": "Paul Kasey", "2880067": "Stefan Davis", "2106003": "Jason Mohammad", "0568801": "Colin McFarlane", "0047257": "Ewan Bailey", "0552510": "Jessica Martin", "5917383": "Jon Davey", "2555299": "Johnathon Farrell", "0325050": "Murray Gold", "2216935": "Lucy Hassan", "2368987": "Nathan Head", "6556096": "Tobias James-Samuels", "4497482": "Andy Jones", "2448364": "Claudio Laurini", "7809089": "Tat Wa Lay", "2866917": "Yamit Mamo", "5198773": "Laura Marklew", "5213437": "Sally Martin", "2844233": "Ruari Mears", "5530088": "Craig Palmer", "7820488": "Roger Shepherd", "9272038": "Rachel Sophia-Anthony", "4001404": "Emma Raine Walker"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["71"],  "plot": ["When disaster hits the Titanic, the Doctor uncovers a threat to the whole human race. Battling alongside aliens, saboteurs, robot Angels and a new friend called Astrid, can he stop the Christmas inferno?", "The Doctor finds his TARDIS colliding with a spaceship based on the RMS Titanic during a Christmas party. With the help of a waitress named Astrid, the Doctor must take on the race called the Hosts as the lives of the Titanic crew and those on Earth are in danger.—Anonymous", "Now traveling alone, the Doctor has something of a surprise when the TARDIS crashes into the Titanic - only this version of the famed ship is a luxury space liner. It's a Christmas-themed cruise with a visit to this strange planet called Earth. When some of the passengers travel down to the planet's surface, they find London deserted, owing to a series of alien attacks that in recent years always seem to occur at Christmas-time! The Captain purposely lowers the ship's shield resulting in severe damage from asteroids. Joined by Astrid Peth, a waitress, and several passengers including Foon and Movin Von Hoff, Bannakaffalatta, Rickston Slade and Mr. Copper, the Doctor fights robot-like creatures in the form of angels. The angels have been tasked with killing everyone aboard and crashing the space liner into the Earth. The reason why is not obvious though the ship's owner, Max Capricorn, has his reasons.—garykmcd"], "genres": "N/A", "imdbID": "1061123", "rating": 7.6, "votes": 8687, "number_of_episodes": 175}