{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "0192889": "Tony Curran", "2287780": "Nik Howden", "0182991": "Chrissie Cotterill", "2926465": "Sarah Counsell", "2880372": "Morgan Overton", "2505602": "Andrew Byrne", "0631490": "Bill Nighy"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["47"],  "plot": ["The Doctor and Amy travel back in time to meet Vincent Van Gogh and face an invisible monster that only the painter can see.", "Visiting a museum, the Doctor and Amy are especially excited with the gallery for Vincent van Gogh. Many of van Gogh pieces are displayed, including \"The Church at Auvers (1890)\". However there is something irregular discovered on the painting - a small alien image within a window pane. The Doctor quickly takes Amy back to 1890 where they locate the troubled artist that upsets the locals, cannot pay his bills, and is able to see an invisible monster that no one else is able to see.—racliff", "The Doctor and Amy travel to France in 1890 to meet Vincent van Gogh after The Doctor sees something ominous in one of Van Gogh's paintings. The painter is quite poor, with no one even willing to give him a drink for one of his works. He also has a reputation in the town as being something of a madman. In fact, the Doctor determines that van Gogh does in fact see a monster, invisible to everyone else, that travels through space. The Doctor knows that van Gogh will produce several of his masterpieces in these months before his death and doesn't want to upset him. He gives him a gift that is a true eye opener.—garykmcd", "Taking Amy to a Museum with an exhibit of Van Gogh's paintings, the Doctor spots something strange in one of the paintings, an alien figure he somewhat recognizes as one. Going back to 1890 they soon meet the troubled artist, poor, misunderstood and depressed, with some other mental instabilities, but soon determine he is in fact capable of seeing a beast from space no one else can and stand with him to help him defeat it.—sonicx-11701"], "genres": "N/A", "imdbID": "1591786", "rating": 9.3, "votes": 13823, "number_of_episodes": 175}