{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "0429363": "Toby Jones", "0387614": "Nick Hobbs", "2282217": "Joan Linder", "1553379": "Audrey Ardington", "4497482": "Andy Jones", "1528384": "Huw Rees"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Five years after finally leaving the TARDIS, Amy and Rory, now married, live in the quiet little village of Leadworth; but everything is not what it would seem.", "It is five years after Amy and Rory have married and reside in the quaint, sleepy little village of Leadworth. Amy is now heavily pregnant with their first child and all seems to be going well for the couple. But the peace is soon shattered as grinding sounds of the TARDIS signal the return of the Doctor who has decided to pay them a visit. But as is always the case, trouble soon follows when the Time Lord makes an appearance. The trio collapse and awaken to find themselves once more within the confines of the TARDIS with the lights out and the system disabled and they are drifting perilously close to a \"cold\" star. The plot thickens when a mysterious, mischievous stranger who appoints him self the moniker of the Dream Lord makes his presence known. Have the trio awoken in reality or have they slipped in to a dream like state in Leadworth? Only the Dream Lord knows the truth and he's giving very little away as that would make things all too easy.—Robert McElwaine", "The Doctor, Amy and Rory seem to be experience two alternate realities. In one, they are aboard the Tardis and all seems normal, except they are dreaming of an alternate life where, five years into the future, Amy and Rory are happily married and she is very pregnant expecting their first child. In that second reality, they dream of the first aboard of the Tardis. The soon meet the Dream Master who tells them that only one is real and if they die in that one, it's the end.—garykmcd"], "genres": "N/A", "imdbID": "1591788", "rating": 8.1, "votes": 8078, "number_of_episodes": 175}