{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "3761542": "Caitlin Blackwood", "0905564": "Nina Wadia", "0536239": "Marcello Magni", "0072610": "Perry Benson", "0188950": "Annette Crosbie", "2584392": "Tom Hopper", "0184913": "Arthur Cox", "1469236": "Olivia Colman", "3865652": "Eden Monteath", "3868117": "Merin Monteath", "0209095": "David de Keyser", "0928388": "William Wilde", "0601716": "Patrick Moore", "0048346": "Colin Baker", "0048982": "Tom Baker", "1909127": "Pope Benedict XVI", "0205749": "Peter Davison", "0001172": "Christopher Eccleston", "0003987": "Mohandas K. Gandhi", "0367156": "William Hartnell", "0566809": "Sylvester McCoy", "0001524": "Paul McGann", "0675727": "Jon Pertwee", "0855039": "David Tennant", "0873743": "Patrick Troughton"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["65"],  "plot": ["With his TARDIS in ruins, the newly-regenerated Doctor with the help of Amy Pond must save the world in less than twenty minutes from galactic policemen known as the Atraxi.", "Having just regenerated, the Doctor arrives in a small English village where he meets a seven year old Scottish girl named Amelia Pond. Fascinated and puzzled by the mysterious and bizarre stranger who claims to be a time traveler, Amelia finds herself caught up in an adventure involving an escaped alien convict and the Atraxi, who are in pursuit of it. If the Doctor doesn't act soon, the world will end in twenty minutes...but that won't happen for another twelve years.—Robert McElwaine", "Still getting used to his surroundings, the new Doctor crashes on Earth severely damaging the Tardis. There he meets a young girl, Amelia Pond, who tells him she has a crack in her bedroom wall which he determines is actually a crack in space and time. The Doctor has to leaves for 5 minutes and as promised Amelia, returns - only it's 12 years later and Amelia, now known as Amy, is a young woman. When aliens known as the Artraxi begin broadcasting a message around the world, the Doctor realizes they are only 20 minutes away from the Earth being completely destroyed. If he's to save the planet, the Doctor must ensure that the aliens recapture an escapee, Prisoner Zero.—garykmcd"], "genres": "N/A", "imdbID": "1577256", "rating": 8.7, "votes": 10435, "number_of_episodes": 175}