{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "0005094": "Alex Kingston", "2804975": "Nina Toussaint-White", "3761542": "Caitlin Blackwood", "4405099": "Maya Glace-Green", "4402338": "Ezekiel Wigglesworth", "0722180": "Philip Rham", "0226819": "Richard Dillane", "3248587": "Amy Cudden", "1859610": "Davood Ghadami", "0447785": "Ella Kenion", "0919979": "Albert Welling", "2075330": "Mark Killeen", "0072855": "Paul Bentley", "1604904": "Eva Alexander", "3839140": "Tor Clark", "1303956": "Freema Agyeman", "3904286": "Louise Bowen", "5917383": "Jon Davey", "0684877": "Billie Piper", "11051535": "Samantha Spragg", "0851113": "Catherine Tate"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["49"],  "plot": ["The search for Melody Pond brings the Doctor and his friends to Berlin in 1938, face-to-face with Adolf Hitler, River Song and a justice-serving, shapeshifting robot.", "In the desperate search for Melody Pond, the TARDIS crash lands in Thirties Berlin, as the time-travelling drama returns for the second half of the series shown earlier in the year. The Doctor comes face to face with the greatest war criminal in the Universe. And Hitler. Old friendships are tested to their limits as the Doctor suffers the ultimate betrayal and learns a harsh lesson in the cruelest warfare of all. As precious time ebbs away, the Doctor must teach his adversaries that time travel has responsibilities. And he must succeed before an almighty price is paid.—BBC Press Release", "After a summer's absence, the Doctor - who hasn't yet found baby Melody - is reunited with with Amy and Rory. Accompanied by Amy's lifelong friend Mels, they land in Nazi Germany circa 1938 just as a humanoid robot is about to kill Adolf Hitler. They're not keen at having saved Hitler but the assassins, intergalactic police who terminate evil beings. When they see the Doctor and his fellow travelers, they focus on Mels who definitely isn't who - or what she seems to be. Her crime: she is the person who history records as the assassin who kills the Doctor. She's also the only person who can save him.—garykmcd"], "genres": "N/A", "imdbID": "1795142", "rating": 7.9, "votes": 7572, "number_of_episodes": 175}