{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "0002091": "Michael Gambon", "1605049": "Katherine Jenkins", "2875966": "Laurence Belcher", "3985526": "Danny Horn", "1095324": "Leo Bill", "0703342": "Pooky Quesnel", "2166395": "Micah Balfour", "1061647": "Steve North", "3424047": "Bailey Pepper", "1043031": "Tim Plester", "0539712": "Nick Malinowski", "1162450": "Laura Rogers", "0654207": "Meg Wynn Owen"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["62"],  "plot": ["Festive edition of the time-travelling drama. The Doctor has one hour to save a crashing spaceship and a miser's soul - but what lurks in the fog?", "A space liner, with a large number of passengers aboard, is in difficulties while flying through the atmosphere of an unknown planet. Amy and Rory have been spending some time on board in the honeymoon suite and they quickly appear on deck. Amy calls the doctor for help and the TARDIS soon appears ahead of the ship. However the Doctor cannot save them and the only other option is to land on the planet below. There the Doctor meets a Scrooge like figure by the name of Kazran Sardick, the only person that can save Amy, Rory and all the other lives on the Spacecraft. The Doctor learns that the atmosphere surrounding the planet is controlled by Kazran who is unwilling to help the liner. The only option to save the ship is for the Doctor to persuade Kazran to save the liner himself.—Peter Alcock", "It's Christmas and once again the good Doctor comes to the rescue. Amy and Rory are aboard an intergalactic cruise ship that is about to crash and the only person who can do anything about it is completely disinterested. Kazran Sardick controls the clouds above his planet and he could save the liner with the flick of a button but he's become Scrooge-like in his hatred of Christmas and his fellow beings. Like his father before him, he's taken to lending money but demands that a member of the family be given to him in return. These are kept in a cryogenic state until the money is repaid. The doctor realizes there is only way to get Sardick to save the 4,000 souls aboard the ship and that is to go back into his past ensuring a happier childhood which will hopefully remove the bitterness he now carries as an old man. As a youth - and later as a young adult - Sardick meets and falls in love with the beautiful Abigail who he and the Doctor release from her cryogenic state every Christmas Eve. Will it be enough to save Amy?—garykmcd"], "genres": "N/A", "imdbID": "1672218", "rating": 8.5, "votes": 9184, "number_of_episodes": 175}