{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "0005094": "Alex Kingston", "0053384": "Frances Barber", "2003845": "Charlie Baker", "1214965": "Dan Johnston", "2925304": "Christina Chong", "4313239": "Joshua Hayes", "1839902": "Damian Kell", "0570679": "Neve McIntosh", "1409024": "Catrin Stewart", "0872937": "Richard Trinder", "2499702": "Annabel Cleare", "4312772": "Henry Wood", "2396083": "Dan Starkey", "0279839": "Simon Fisher-Becker", "0764527": "Danny Sapani", "0095017": "Hugh Bonneville", "2962011": "Oscar Lloyd", "0109070": "Nicholas Briggs", "3904286": "Louise Bowen", "5917383": "Jon Davey", "4313039": "Fern Deacon", "7403761": "Marcus Elliot", "4088744": "Barbara Fadden", "0309693": "Mark Gatiss", "3260601": "Ian Hilditch", "3173569": "Kevin Hudson", "4497482": "Andy Jones", "2448364": "Claudio Laurini"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["49"],  "plot": ["A member of The Doctor's team has been abducted and he will call in every favor and maybe even go to war to get them back.", "The Doctor and Rory begin their quest to find Amy who has been kidnapped. She's also given birth and they have her baby girl, Melody, as well. They begin by scouring the universe where the Doctor calls in debts and head for Demon's Run where Amy is being held. The only one who refuses to join him is River Song. The battle is short-lived and both Amy and Melodie are saved. Perhaps the battle to save them was too easy. It's clearly Melodie the kidnappers were interested in and her DNA reveals she's something more than just human. They've also been fooled however and the baby has been taken. When River Song appears, she reveals who she truly is.—garykmcd", "Amy has been kidnapped by Madame Kovarian and taken to Demon's Run for her newborn baby, Melody, that appears to be the ultimate stratagem for war apparently. Meanwhile The Doctor and Rory are recruiting everyone they might need to free Amy and Melody, everyone except River Song who is not willing to go until the end because this will be the day when The Doctor founds out who she is..."], "genres": "N/A", "imdbID": "1777781", "rating": 9.0, "votes": 9320, "number_of_episodes": 175}