{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "0005094": "Alex Kingston", "0791968": "Mark Sheppard", "0792003": "William Morgan Sheppard", "2257390": "Marnix Van Den Broeke", "0589645": "Stuart Milligan", "1030244": "Chukwudi Iwuji", "0341295": "Mark Griffin", "3041653": "Sydney Wade", "1893071": "Nancy Baldwin", "3312688": "Kieran O'Connor", "1489025": "Adam Napier", "1666877": "Henrietta Clemett", "1599819": "Paul Critoph", "2091134": "Hermeilio Miguel Aquino", "6837599": "Jamie Hill", "4497482": "Andy Jones"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["The Doctor, Amy, Rory and River Song are reunited in the Utah desert.", "Four envelopes, numbered two, three and four - each containing a date, time and map reference, unsigned, but TARDIS blue - begin the latest series of the time-travelling adventures. Who sent them? And who received the missing number one? This strange summons reunites The Doctor, Amy, Rory and River Song in the middle of the Utah desert and unveils a terrible secret that The Doctor's friends must never reveal to him. Placing his life entirely in their hands, The Doctor agrees to search for the recipient of the fourth envelope. Just who is Canton Everett Delaware the Third? And what is the relevance of their only other clue: \"Space 1969\"? Their quest lands them in the Oval Office, where they are enlisted by President Nixon himself to assist enigmatic former FBI agent Canton in saving a terrified little girl from a mysterious spaceman.—BBC Press Release", "River Song, Amy, Rory and someone called Canton Everett Delaware III all receive invitations to join the Doctor and find themselves in the Utah desert where the good Doctor is killed by someone wearing a 1960s style space suit. They subsequently learn that the Doctor also invited himself to the event - a younger version of himself no doubt knowing what was about to happen. The invitation referred to Space 1969 though no one quite knows what that that is all about and just who is Delaware, who leaves just as soon as he arrives. The others travel to 1969 Washington where the TARDIS lands in the oval office where a startled President Nixon has been briefing a younger Delaware on a series of mysterious phone calls he's been receiving. River discovers an intricate web of tunnels and it is clear that aliens are on Earth.—garykmcd"], "genres": "N/A", "imdbID": "1723888", "rating": 8.8, "votes": 8984, "number_of_episodes": 175}