{"cast": {"1741002": "Matt Smith", "2394794": "Karen Gillan", "2965271": "Arthur Darvill", "0095017": "Hugh Bonneville", "2962011": "Oscar Lloyd", "0743605": "Lee Ross", "0066781": "Michael Begley", "0524706": "Tony Lucken", "1373874": "Chris Jarman", "0567057": "Carl McCrystal", "2178959": "Lily Cole", "0053384": "Frances Barber"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["46"],  "plot": ["The Doctor, Amy and Rory find themselves aboard a marooned pirate ship whose crew is being picked off one by one by a beautiful - and deadly - Siren.", "On board a 17th century pirate ship sailing the ocean waves, a crew under the command of one Captain Avery are being picked off one by one by a ghostly apparition. They believe it to be a legendary Siren, a beautiful and mesmerizing demon who lures men to their death with its haunting Siren song. She marks her prey before retrieving them with a black spot on their hand, a mark that means certain death. As they are becalmed and stuck in the ocean, all seems lost for the dwindling pirate crew... until three stowaways are discovered with a mysterious blue crate.—Anonymous", "The Doctor, Amy And Rory find themselves on a 17th century pirate ship whose crew is under attack from a sea siren of some sort. Anytime one of the crew is cut or otherwise sheds blood, a black dot appears in the victim's palm and the siren appears to destroy him. By the time the TARDIS arrives, there is only a handful of them left. The ship's Captain, Henry Avery, is surprised to find his son Toby is a stowaway. Soon, Toby and Rory are victims of the siren but the Doctor and Amy have a surprise in store when they learn where they really are.—garykmcd", "Onboard a 17th Century Pirate ship which is sailing the ocean waves, the crew led by its captain, Avery, are seemingly being picked off one by one by a ghostly apparition which appears in the form of a beautiful maiden. Believing it to be a legendary Siren which lures men to their fate with its haunting Siren song, they at least know who it will prey on next when a black spot appears on the next intended victims hand. All seems lost for the men who can do nothing to defend themselves against the mythological creature, that is until they stumble upon three stowaways, one of who calls him self the Doctor.—Robert McElwaine"], "genres": "N/A", "imdbID": "1721225", "rating": 6.6, "votes": 7355, "number_of_episodes": 175}