{"cast": {"1741002": "Matt Smith", "1982510": "Jenna Coleman", "0911886": "Tom Ward", "0001290": "Richard E. Grant", "1409024": "Catrin Stewart", "0570679": "Neve McIntosh", "2396083": "Dan Starkey", "5275169": "Joseph Darcey-Alden", "3385554": "Ellie Darcey-Alden", "1022566": "Liz White", "2991307": "Jim Conway", "5391353": "Cameron Strefford", "1346042": "Annabelle Dowler", "3464538": "Ben Addis", "4789903": "Sophie Miller-Sheen", "1087151": "Daniel Hyde", "0005212": "Ian McKellen", "0128341": "Juliet Cadzow", "5917382": "Simon Carew", "6118829": "Mickey Lewis"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["London, 1892. Snow is evolving, turning into icy monstrosities, but this is no concern for the Doctor who has given up trying to save the universe, leaving it to a clever young governess named Clara to save the day.", "The Doctor is living in 1892 London, still despondent over the loss of his friends. He has no interest in what is happening in the world even after he learns that the snow is strangely sentient and can form into rather vicious snowmen. A local barmaid, Clara, is intrigued by the Doctor and he is soon intrigued by her when it turns out she also works as a governess caring for Captain Latimer's two children. Together, they fight Dr. Simeon who has known the evil snowmen since he was a child. The Doctor is shocked when he realizes that he's met Clara before....and will no doubt meet her again.—garykmcd", "Christmas Eve 1892 and the falling snow is the stuff of fairy-tales. When the fairy-tale becomes a nightmare and a chilling menace threatens Earth, an unorthodox young governess, Clara, calls on the Doctor for help. But the Doctor is in mourning, reclusive and determined not to engage in the problems of the universe. As old friends return, will the Doctor really abandon humankind or will he fight to save the world - and Christmas - from the icy clutches of this mysterious menace?—BBC America Publicity"], "genres": "N/A", "imdbID": "2380513", "rating": 8.3, "votes": 8140, "number_of_episodes": 175}