{"cast": {"1741002": "Matt Smith", "1982510": "Jenna Coleman", "0001671": "Diana Rigg", "0830556": "Rachael Stirling", "1409024": "Catrin Stewart", "0570679": "Neve McIntosh", "2396083": "Dan Starkey", "3193541": "Eve De Leon Allen", "4335624": "Kassius Carey-Johnson", "1981245": "Brendan Patricks", "0877583": "Graham Turner", "4693198": "Olivia Vinall", "2074010": "Michelle Tate", "5652448": "Jack Oliver Hudson", "5917382": "Simon Carew", "5447807": "Helena Dennis", "4701028": "Scott Stevenson"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["47"],  "plot": ["When they find a picture of the Doctor in a recently dead man's eye, it's up to Madame Vastra, Jenny and Strax to save The Doctor and find out what sinister secrets are going on at Sweetsville, Yorkshire.", "The Doctor and Clara arrive in 19th century Yorkshire where moral crusader Mrs Gillyflower is recruiting beautiful people for her idyllic garden city. At the same time rigid corpses dyed red are piling up and the brother of one of the victims seeks help from Madame Vastra. She and her party travel to Yorkshire where they rescue The Doctor and Clara from the clutches of Mrs Gillyflower. They discover that the woman is a fanatical exponent of ethnic cleansing who plans to do away with those who do not meet her standards - even her daughter Ada. The Doctor and his allies set out to stop her and her reclusive partner in crime Mr Sweet.—don @ minifie-1", "In 1893 Yorkshire another dead man is found, his body red from head to toe. The locals are calling it the crimson horror. Madame Vastra, Strax and her maid Jenny soon travel to the North after they find that the latest victim's last sight was of the Doctor. Vastra thinks she seen this red covering before, a very long time ago. Meanwhile Winifred Gillyflower, a prize-winning chemist and chemical engineer, has established a new industrial community known as Sweetville. Jenny goes to get a job there but sneaks off only to find that Sweetville's factories are fake - there's nothing in the large buildings but very large loudspeakers making factory noises. She does find and free the Doctor and together with Clara fight off the creature that is behind it all.—garykmcd"], "genres": "N/A", "imdbID": "2204480", "rating": 7.2, "votes": 6367, "number_of_episodes": 175}