{"cast": {"0134922": "Peter Capaldi", "1982510": "Jenna Coleman", "3586035": "Maisie Williams", "4725341": "Joivan Wade", "7609875": "Naomi Ackie", "3625907": "Simon Manyonda", "1861862": "Simon Paisley Day", "4004793": "Letitia Wright", "0811629": "Robin Soans", "1132069": "Angela Clerkin", "1646092": "Caroline Boulton", "0497510": "Jenny Lee", "4949216": "James Briggs", "5328810": "Antonio Bustorff", "5917382": "Simon Carew", "5917383": "Jon Davey", "8282820": "Steven Lathwell", "6680316": "Clem So"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["46"],  "plot": ["The Doctor and Clara are called back to Earth when Rigsy discovers a strange tattoo on the back of his neck that appears to be counting down to zero. Their investigation leads them to a hidden street in the middle of London, the discovery that Rigsy has been issued a death sentence, and one of them facing the choice of having to make the ultimate sacrifice; to face the Raven!", "When Rigsy contacts The Doctor about a mysterious countdown tattoo, he, The Doctor, and Clara infringe upon an alien refugee camp run by Ashildr . It is up to them to get the countdown to stop, for if it hits 000 minutes, you face Death when you Face the Raven.", "The Doctor and Clara are summoned by their old friend Rigsy (Joivan Wade), to investigate a mysterious tatoo on his neck, counting down to zero. Their investigations lead them to a trap street, an alien street hidden in London, where they are reunited with Ashildr (Maisie Williams). They have to race against time to find the truth behind the tatoo, before someone has to face the raven.—Jonathan Robb", "The Doctor and Clara, along with their old friend Rigsy, find themselves in a magical alien world, on a hidden street in the heart of London. Sheltered within are some of the most fearsome creatures of the universe,all being protected by Ashildr (Maisie Williams). With a death sentence hanging over their heads, not all of them will get out alive."], "genres": "N/A", "imdbID": "4701538", "rating": 8.5, "votes": 6960, "number_of_episodes": 175}