{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0028674": "Harry Andrews", "0388092": "Patricia Hodge", "0934179": "Stuart Wilson", "0420010": "Colin Jeavons", "0768945": "Sean Scanlan", "0070987": "Yves Beneyton", "0649695": "Yvonne Orengo", "0769315": "Rosalie Williams", "0072177": "Alan Bennion"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["51"],  "plot": ["Holmes is asked by the country's Prime Minister to aid in the recovery of a stolen diplomatic letter, which, if published, might lead England into war.", "Holmes receives a surprise visit from no less than the Prime Minister and the country's chief foreign diplomat, Lord Trelawney Hope. They ask his assistance in the recovery of a sensitive diplomatic letter stolen mysteriously from the Lord's home. Its contents are so incendiary that they might lead Great Britain into war if they were published. Holmes credits only three active criminals capable of masterminding so audacious a theft, and when one is found stabbed to death on the night in question, The Great Detective correctly surmises that it is not a coincidence. Matters are further complicated by a visit to Baker Street by Lady Trelawney Hope, a visit she wants kept from her husband.—Gabe Taverney (duke1029@aol.com)", "Sherlock Holmes is approached by a government Minister, Mr. Trelawny Hope, who has had an important document stolen from his dispatch box. The box was in his bedroom at the time of the theft but was left unobserved for several hours. The document is of the utmost sensitivity and could have a serious impact on European affairs. Holmes is surprised when Lady Hilda Trelawny Holmes calls on them to get information about her husband's current situation. Holmes is unable to help her, but the murder of Eduardo Lucas, a possible go-between for the stolen document, leads him to the thief.—garykmcd", "Sherlock Holmes meets the Prime Minister and the Secretary of State for Europe around a matter of extreme national importance. The Secretary of State was in possession of a letter from a foreign power, the contents of which if revealed could lead Britain to war. The letter has been stolen and the government want Holmes to retrieve it as a matter of urgency.—grantss"], "genres": "N/A", "imdbID": "0210968", "rating": 8.1, "votes": 1039, "number_of_episodes": 13}