{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0692110": "Eric Porter", "0019996": "Patrick Allen", "0106657": "James Bree", "0420010": "Colin Jeavons", "0064826": "Richard Bebb", "0011665": "Robert Addie", "0117939": "Naomi Buch", "0480274": "Paul Lacoux", "0769315": "Rosalie Williams", "1878214": "Elizabeth Ritson", "0746738": "Roger Rowland", "1872648": "John Palmer", "0942676": "Neville Wright"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["51"],  "plot": ["Believed dead after his fatal encounter with Professor Moriarity three years earlier, Sherlock Holmes returns to England to foil a plot to murder him by a former Moriarity gang member.", "After Dr. Watson testifies at the inquest of the Honourable Ronald Adair, shot to death after returning home from his gambling club, he is followed back to his office by an eccentric bookseller who reveals himself to be Holmes in disguise. After the initial shock wears off, Holmes explains that he did not die in the fall that killed Professor Moriarity in their famous encounter at Reichenbach Falls in Switzerland three years earlier. Holmes has remained out of England to avoid Colonel Sebastian Moran, a Moriarity associate who witnessed Holmes' escape death and has vowed to kill Holmes in revenge. Holmes will try to foil Moran and solve the Adair murder.—Gabe Taverney (duke1029@aol.com", "It is three years since Sherlock Holmes appeared to meet his death at the Reichenbach Falls. Dr Watson is working as a police surgeon when Holmes appears, perfectly alive. After explaining how he survived, Holmes and Watson set out to capture the man out to kill Holmes, the only follower of Moriarty who knows that Holmes is still alive.—grantss", "It's now been three years since his good friend Sherlock Holmes died while fighting Professor Moriarty at the Reichenbach Falls and Dr. Watson has successfully established himself in private practice. He's also working occasionally as a police surgeon and is called into the strange case of the murder of Ronald Adair. The gentleman had returned home from his club the previous evening and was apparently shot in his rooms in his parents house. No one heard a shot and the young man's room was locked from the inside. After testifying at the inquest, Watson bumps into a crippled bookseller who later turns up at his surgery. The man reveals himself to be Sherlock Holmes, alive and well. He recounts exactly what happened at the Falls and what he has been up to for the last three years. He also tells Watson that one of Moriarty's associates, Colonel Sebastian Moran - whom he has dubbed the second most dangerous man in London - is out for revenge for the death of the Professor. There is also a link to the Adair case.—garykmcd"], "genres": "N/A", "imdbID": "0685622", "rating": 8.1, "votes": 1074, "number_of_episodes": 13}