{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0397102": "Alan Howard", "0071290": "Christopher Benjamin", "0311431": "Nicholas Gecks", "1528180": "Nissar Modi", "0077888": "Michael Bertenshaw", "0139727": "Jack Carr", "0253045": "Brenda Elder", "0769315": "Rosalie Williams", "0008832": "William Abney", "0877109": "Mark Turin", "0373451": "Bryan Heeley"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["52"],  "plot": ["The headmaster of a prestigious prep school calls on Holmes for help when the ten year old only son of powerful but publicity-shy duke disappears.", "The headmaster of a prestigious prep calls on Holmes for help in investigating the disappearance of the only son of his patron, a rich and powerful duke who seems more worried about staying out of the public eye than finding his ten year old heir. After he reluctantly agrees to allow Holmes to take on the case, The Great Detective investigates not only the missing boy, but a German teacher and the lone bicycle that have mysteriously vanished also.—Gabe Taverney (duke1029@aol.com)", "When his only son and heir disappears from his private school (apparently kidnapped), why does the Duke of Holdernesse restrict police inquiries so drastically? The headmaster consults Sherlock Holmes, fearing the involvement of one of his instructors. Solving the case requires interviewing small boys, tracing bicycle tracks, and observing family resemblances in ancestral portraits.—jeaneva", "Sherlock Holmes is hired by Dr. Huxtable, the headmaster of prestigious preparatory school Priory School. One of their students, the son of the Duke of Holdernesse, has disappeared but no ransom has been demanded. Also missing is Mr. Heidegger, the German master.—grantss", "Sherlock Homes is approached by the Master of the Priory School to assist in location a missing student. The boy is son of the Duke of Holdernesse and disappeared three days before. No ransom note has been received and the boy's father has refused to go to the police, thus the delay in contacting Holmes. It also appears that the school's German master has also gone missing. Holmes and Watson travel to the school and meet the Duke who seems strangely removed from locating his son. He is hiding something and it requires Holmes to determine exactly what that is if they are to find the boy alive.—garykmcd"], "genres": "N/A", "imdbID": "0685626", "rating": 8.0, "votes": 1027, "number_of_episodes": 13}