{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0932121": "Paul Williamson", "0680317": "Conrad Phillips", "0483069": "Anne-Louise Lambert", "0218964": "Zulema Dene", "0864892": "Oliver Tobias", "0149616": "Nicolas Chagrin", "3066627": "Johanna Briggs"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["52"],  "plot": ["Holmes is called to a manor house to investigate the brutal murder of a country lord with a fireplace poker and reconcile the story of his bruised and battered wife with the facts.", "Inspector Hopkins invites Holmes to assist him in solving the brutal murder of Lord Brackenstall with a fireplace poker at his country estate. According to his bruised and battered wife, her husband was a secret alcoholic who kept his drinking discreetly hidden. On the night in question, she alleges that her house was invaded by a locally notorious thief and his two larcenous sons, who bound her, stole the family silver, bludgeoned her husband to death, and calmly helped themselves to some port wine. Lady Brackenstall denies that the obvious bruising on her face and hands are connected to the murder. When something about the three wine glasses used by the perpetrators bothers Holmes, his mind begins to move in a new direction.—duke1029", "Holmes is urgently called to Abbey Grange in Kent at the request of Inspector Hopkins. Sir Eustace Brackenstall has been murdered. However, Lady Brackenstall was a witness to proceedings and from her testimony the case seems cut and dried - a notorious gang of thieves was responsible.—grantss", "Sherlock Holmes is summoned in the middle of the night by Inspector Hopkins to assist in a case. When Homes and Dr. Watson arrive at Abbey Grange, they learn that Sir Eustace Brackenstall has been bludgeoned to death, apparently with a fireplace poker. Lady Brackenstall recounts to them that the previous evening, she was checking that the house was secure before retiring for the night. She found a door off the dining room open and was confronted by an intruder. When she awoke, she was tied to a chair and her husband was lying on the floor in the dining room as the police subsequently found him. Holmes in convinced that Lady Brackenstall is concealing the identity of the attacker and sets about to learn why. The solution is found when Holmes solves the death of a family pet named Fudge and the mystery presented by a glass of port.—garykmcd"], "genres": "N/A", "imdbID": "0685619", "rating": 7.9, "votes": 1026, "number_of_episodes": 13}