{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0703615": "Denis Quilley", "0858669": "Damien Thomas", "0014902": "Michael Aitkens", "0235782": "Freda Dowie", "0101208": "Norman Bowler", "0789921": "Peter Shaw", "0172223": "Christine Collins", "0766848": "John Saunders", "0602088": "Frank Moorey", "5648042": "Nick Ryall"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["51"],  "plot": ["While convalescing in Cornwall, a depressive Holmes investigates the apparent death from apoplexy of a local woman and the unexplained sudden dementia of her two brothers.", "Suffering from depression and nearing a breakdown, Holmes is accompanied by Watson to Cornwall for rest and recuperation as they tour the area's scenic coastal cliffs and Neolithic sites. The tranquility is interrupted by news that an unexplained tragedy has suddenly struck three siblings while playing cards in their home. The sister has apparently died from apoplexy, and her two brothers are suffering from acute dementia with expressions of fear and horror frozen on their faces. Showing great will power, Holmes discards his cocaine hypodermic and scrutinizes those involved in the case: an estranged third brother, the local vicar, and an enigmatic big game hunter and African explorer.—Gabe Taverney (duke1029@aol.com)", "Sherlock Holmes is convalescing in Cornwall (accompanied by Dr Watson, of course) when three members of the same family are struck down with the same affliction. Brenda Tregennis is dead and her brothers Owen and George insane, found in the same room in their house. A fourth sibling, Mortimer, was also present for part of the evening and had a long-running dispute with his three siblings.", "An ailing Sherlock Holmes travels under doctors orders to Cornwall for a period of rest and convalescence. Dr. Watson accompanies him intent on ensuring his friend follows orders but they are soon approached by the Reverend Roundhay to help solve a most perplexing incident. A young woman, Brenda Tregennis, apparently died of apoplexy while playing cards with her two brothers, George and Owen who are now suffering from some type of dementia. There are wild rumors going about the village including that the incident was a supernatural phenomenon. Holmes believes there is a far more grounded explanation and with the help of a surviving brother, Mortimer Tregennis, tries to determine who would want them dead.—garykmcd"], "genres": "N/A", "imdbID": "0685621", "rating": 8.1, "votes": 992, "number_of_episodes": 13}