{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0428086": "Freddie Jones", "0548440": "Kika Markham", "0161427": "Donald Churchill", "0396013": "Basil Hoskins", "0269123": "Trader Faulkner", "0892992": "Arturo Venegas", "0012389": "Guido Adorni", "0129640": "Sonny Caldinez", "0577701": "Abigail Melia", "0744237": "Lorna Rossi"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["52"],  "plot": ["A bored Holmes eagerly accepts a case involving the disappearance of an amateur Spanish cartographer as well as his servants from his rented country lodge.", "Without a case to occupy his restive mind, Holmes breaks his ennui by agreeing to investigate the story of an amateur cartographer who stayed overnight at the rented lodge of another map enthusiast but awoke in the morning to find his host and servants mysteriously missing. Holmes finds he has a rival in the ambitious and publicity conscious Inspector Barnes, who sees himself as The Great Detective's peer and is reluctant to share information with him. When the Spaniard is found bludgeoned to death, Barnes suspects his mulatto servant, but Holmes directs his efforts in a different direction.—Gabe Taverney (duke1029@aol.com)", "Sherlock Holmes is contacted by an exasperated and frightened Scott Eccles. He was a guest of a Spanish gentleman at Wisteria Lodge in rural Surrey but left when his host and his servant acted weird and then suddenly disappeared. Upon arrival at the lodge Mr Eccles, Holmes and Watson are shocked to discover that the Spaniard has been found dead, murdered.—grantss", "Sherlock Holmes is approached by Mr. Scott-Eccles who recounts strange events. He recently dined with an acquaintance, a Spanish gentleman named Diaz with whom he shared an interest in map making. He spent the night at Mr. Diaz' rented home, Wisteria Lodge, but awoke the next morning to find the house abandoned. Thinking that Diaz might be doing a runner, he contacted the landlord but was told that the man's rent had been paid in full. A somewhat bored Holmes agrees to look into these mysterious circumstances surrounding the case but the local constabulary, in the form of Inspector Baynes, make it very clear that he is out to make a reputation for himself by solving this case without the Great Detective's help.—garykmcd"], "genres": "N/A", "imdbID": "0685630", "rating": 7.3, "votes": 903, "number_of_episodes": 13}