{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0336509": "Charles Gray", "0510317": "Denis Lill", "0769315": "Rosalie Williams", "0628451": "Jonathan Newth", "0001933": "Geoffrey Bayldon", "0912246": "Amanda Waring", "0834443": "Sebastian Stride", "0299481": "Robert Fyfe", "0710766": "John Rapley", "0141940": "Simon Carter", "0912095": "Derek Ware", "0186430": "Stephen Crane", "1521672": "John Laing"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["53"],  "plot": ["Sherlock's brother Mycroft enlists his younger sibling to locate missing patent plans that pertain to a strategically critical state-of-the-art submarine.", "After a civil servant at the Naval Patent Office is found with his head crushed adjacent to the open-air tracks of the London Underground, Holmes' brother Mycroft enlists Sherlock's help on the case. The murdered man has apparently stolen top-secret plans for ten components of a new, state-of-the-art submarine, but only seven of the less important design plans are found on the body. Holmes and Watson are entrusted to find the three critically important missing blueprints.—Gabe Taverney (duke1029@aol.com)", "Sherlock Holmes is urgently contacted by his brother Mycroft. Top secret submarine plans have been stolen and the man believed responsible, Cadogan West, found dead on a train track with some of the plans on his person. The most important parts of the plans of the plans are still missing. Mycroft needs Sherlock to find the missing plans before they land in the hands of a foreign power.—grantss", "Sherlock Holmes' brother Mycroft seeks the great detective's assistance when the plans for the Bruce-Partington submarine are stolen. Three of 10 stolen documents were taken from a now dead junior office clerk, Cadogan West, and their location is now unknown. The man responsible for the plans, Sir James Walter, mysteriously dies following the theft supposedly of shame, according to the dead man's brother, Colonel Valentine Walter. After studying the facts of the case, Holmes isn't convinced that Cadogan West is the real culprit and is more likely the victim of a more elaborate plot.—garykmcd"], "genres": "N/A", "imdbID": "0685620", "rating": 8.0, "votes": 889, "number_of_episodes": 13}