{"cast": {"0107950": "Jeremy Brett", "0362570": "Edward Hardwicke", "0055134": "Peter Barkworth", "0522887": "Barry Lowe", "0185329": "Jonathan Coy", "0769315": "Rosalie Williams", "0832695": "Malcolm Storry", "0063913": "Manda-Jayne Beard", "1050819": "David John", "0269113": "Sally Faulkner", "0403027": "Russell Hunter", "1470417": "Nicholas Teare", "0453845": "Marcus Kimber", "0052159": "Geoffrey Banks", "2175757": "Derek Pykett"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["51"],  "plot": ["Holmes investigates the disappearance of a champion racehorse and the murder of its trainer on a lonely moor.", "Wealthy sportsman Colonel Ross asks Holmes to investigate the disappearance of his prize thoroughbred Silver Blaze, whom he wants to enter in the Wessex Cup Race. On the night in question the stable is visited by a gambler hoping to get some inside information on the race but is turned away by a loyal stable boy. After the boy is drugged by opium, the horse disappears, and the trainer is found bludgeoned on a lonely moor, suspicion falls on the gambler, but if he is guilty, where is Silver Blaze?—Gabe Taverney (duke1029#aol.com)", "Sherlock Holmes and Dr Watson head out to horse training stables in the country, hired by wealthy horse owner Colonel Ross. His trainer has been murdered and his prize racehorse Silver Blaze has disappeared just days before the prestigious Wessex Cup.—grantss", "Sherlock Holmes and Dr. Watson investigate the disappearance of a champion racehorse, Silver Blaze. The horse disappeared in the middle of the night from its stables and with a major race on the horizon its owner, Colonel Ross, is desperate to get his prize possession back. There had been some strange comings and goings the night the horse disappeared including a race tout trying to get inside information on the upcoming race. When the horse's trainer, John Straker, is found dead in a field, this also becomes a murder investigation with the local police less than pleased at Homes' involvement.—garykmcd"], "genres": "N/A", "imdbID": "0685618", "rating": 7.8, "votes": 927, "number_of_episodes": 13}