{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0005042": "Jason Isaacs", "0217529": "Erik Dellums", "0689237": "Jon Polito", "0105011": "Victor Brandt", "1715189": "Johanna Braddy", "0228356": "Ben Diskin", "0308127": "James Garrett", "0000434": "Mark Hamill", "0563902": "Scott McAfee", "0217221": "Grey DeLisle"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"],  "plot": ["While Katara herself becomes a great waterbending master, Commander Zhao plans a siege on the Northern Water Tribe. Meanwhile, Sokka's on a mission to stop this siege while Aang tries to buy them some time.", "Zhao and his army launch a massive attack on the Northern Water Tribe. Sokka readily joins the water tribe warriors to defend the tribe from the invading forces. Sokka is removed from his position after getting into an altercation with Hahn, Yue's arrogant warrior fiancé. Chief Arnook gives Sokka the task of protecting his daughter, Yue, he accepts the task of protecting the princess from any harm. Meanwhile, Zuko infiltrates the Northern Water Tribe to capture Aang. Katara tries her best to protect Aang from the crown prince, but she gets defeated. Zuko makes off with Aang, who is still in the spirit world in hopes of getting guidance from Tui and La.—dawsonpersi", "The Fire Nation is attacking the North Pole and Sokka, Katara, and Yue are looking for Aang. Zuko has Aang, but Aang is in the spirit world, where he meets Avatar Roku. Zuko and Aang are trapped in a cave during a storm, where Zuko shares some inner turmoil with Aang, who is in the Spirit World. At the water tribe, the firebenders are winning. Iroh attacks Zhao when Zhao reveals that he wants to kill the spirits of the moon and the ocean. In the Spirit World, Aang meets Koh the Face Stealer, who tells him that someone is planning on killing the spirits and he needs to stop them. Katara, Sokka, and Yue find Aang and they rescue him, taking Zuko with them. Zhao kills the moon spirit and the waterbenders lose their power. Yue reveals that the spirit once saved her. Iroh and Aang team up against Zhao. Zhao and Zuko escape as Aang turns into a giant spirit and goes to fight the firebenders. Elsewhere, Zuko and Zhao fight desperately. Yue sacrifices her own life to save the moon spirit. The moon returns and Aang turns back to himself. But the spirit still has one more mission. It kills Zhao. In the end, everything is well. Aang and the gang are heading to Ba Sing Sei, Zuko and Iroh have escaped, and in the Fire Nation, Azula is given a mission.—spielburg"], "genres": "N/A", "imdbID": "0516780", "rating": 9.3, "votes": 7331, "number_of_episodes": 62}