{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0005042": "Jason Isaacs", "0217529": "Erik Dellums", "0689237": "Jon Polito", "0105011": "Victor Brandt", "1715189": "Johanna Braddy", "0228356": "Ben Diskin", "0308127": "James Garrett", "0000434": "Mark Hamill"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["24"],  "plot": ["As the Fire Nation continues its assault on the Northern Water Tribe, Sokka, Katara and Yue set out on a search for Aang, being guided by his spirit.", "The Fire Nation continues their assault on the Northern Water Tribe. Zuko has captured Aang and he takes refuge in a cave in the frozen tundra. Sokka, Yue, and Katara are able to locate Aang, they rescue Zuko from dying in the freezing cold. Aang reveals to his friends that Tui and La are in danger, they all make it to the Spirit Oasis to stop Zhao from killing Tui. Aang warns Zhao that killing the moon spirit will only cause the world to be out of balance. Iroh agrees with Aang's statement and he warns Zhao to release Tui, he reluctantly releases the moon spirit back in the pond. In a fit of rage, Zhao kills Tui and Iroh takes down the Fire Nation soldiers, causing Zhao to run away from Iroh's wrath. Iroh notices that Yue has the moon spirit's abilities, she transfers her life into Tui's and she is able to revive the moon spirit. Yue says goodbye to Sokka and they share a final kiss. La condemns Zhao for killing Tui and he is imprisoned in the Fog of Lost Souls. Zuko decides to give up on searching for Aang so that he can recuperate and he leaves with his uncle. Pakku plans on taking the water benders and healers to the Southern Water Tribe, so they can restore their sister tribe. Pakku appoints Katara to be Aang's water bending teacher. Meanwhile, Fire Lord Ozai assigns his daughter, Azula to capture Aang.—dawsonpersi"], "genres": "N/A", "imdbID": "10512638", "rating": 9.6, "votes": 7245, "number_of_episodes": 62}