{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0628170": "Laraine Newman", "0059667": "Derek Basco", "0346410": "Kim Mai Guest", "0329361": "Barbara Goodson", "0352374": "Olivia Hack"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"], "number of episodes": 0, "plot": ["On their way to Omashu, Team Avatar is forced to travel underground to avoid Fire Nation attacks. Iroh and Zuko adjust to life as fugitives.", "Aang, Sokka, and Katara go to the secret cave to avoid being attacked by the Fire Nation, so they can go to Omashu, so that Aang can learn earth bending from King Bumi. Meanwhile, Zuko and Iroh are still adjusting to their lives as fugitives. Iroh accidentally ingests a plant to make tea. Zuko and Iroh decide to go to the Earth Kingdom, so that Iroh can get medical aid after getting a rash from the white jade flower. Aang, Sokka, and Katara finally make it to Omashu, they soon realize that the city has been seized by the Fire Nation.—dawsonpersi", "'The Cave of Two Lovers' is where we first see definite signs of the true nature of the growing love relationship between the main characters Avatar Aang and the water bending master Katara. Sokka is bombarded by a group of free-thinking hippie musical nomads during most of the episode as well making for many humorous moments of head-smacking good fun. Uncle Iroh and Prince Zuko learn about life on the run from the Fire Nation and how not to brew 'White Jade Lily' as a tea ever again. The history of how the Earth city of Omashu came into being is provided as well as a surprise ending about city's current state of being under the hand of the Fire Nation.—lisamarie31468", "On their way to Omashu, Aang, Katara, and Sokka meet a group of nomads who show them a shortcut through the \"Cave of Two Lovers.\" But when the group becomes trapped in the cave, it's up to Aang and Katara to save the group by trusting in love ... and possibly questioning their relationship. Meanwhile, Iroh gets a lethal rash so Zuko and Iroh head to a small Earth Kingdom town for help, hoping their real identities will not be discovered.—Anonymous", "The episode begins with Aang, Katara and Sokka enjoying a few well-deserved moments of much-needed rest and relaxation in a river on the way to the earth city of Omashu. Everyone is in bathing suit attire and this is one of the few occasions where we see Sokka without his hair in the traditional Water Tribe wolf's tail knot. Aang and Katara are making the most of this moment by practicing an 'Octopus' water bending move. From the beginning it is clear that as Katara touches Aang to improve his water bending stance, there is 'love and romance' in the air and definitely a growing chemistry between them. This really sets the theme for the entire episode. 'The Cave of Two Lovers' recounts how the group makes their way to Omashu and the romantic yet tragic history that caused the city to come into being. While splashing about in the river a group of traveling musical nomads tells them of a secret passage way through the mountains to Omashu. It is while they are traveling through this secret passage that Aang and Katara are separated from the group and thus have their moment to allow 'love to lead the way' out of the labyrinth of tunnels. While Avatar creators cleverly leave us to draw our own conclusions there are definitely signs of a first romantic kiss between Aang and Katara. Subplots include catching up with Uncle Iroh and Prince Zuko in their new life as fugitives from the Fire Nation. It is apparent they are not having the best time struggling on their own for food and shelter. Iroh inadvertently brews some poisonous 'White Jade Lily' tea causing him to suffer a terrible reaction. This is perhaps fortuitous because it causes them to seek medical attention with a nearby homeopathic temple. In doing so they are befriended by a young healer who invites them to dinner and she and her mother offer them the hospitality they need most. Prince Zuko in his interactions with the young healer 'Song' begins to intimately see firsthand the suffering and losses experienced by others at the hands of the Fire Nation. The episode ends with a surprise in that the search for King Bumi to teach Aang earth bending takes a terrible turn when emerging from the cave the group discovers that the great Earth city of Omashu has been taken siege by the Fire Nation.—lisamarie31468"], "genres": "N/A", "imdbID": "0766472", "rating": 8.1, "votes": 5916, "number_of_episodes": 62}