{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0482851": "Phil LaMarr", "0000317": "Clancy Brown", "0217221": "Grey Griffin", "1185516": "Cricket Leigh", "0352374": "Olivia Hack", "0313364": "Brian George", "2055652": "Greg Baldwin", "0002350": "Jim Meskimen"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"],  "plot": ["The heroes work together to stop Azula's destructive plans; Zuko finds companionship in an unlikely source and learns the time has come to make an imperative choice about his future.", "Aang, Sokka, and Toph head back to Ba Sing Se to save Katara, they soon discover that Azula and her friends have infiltrated Ba Sing Se, by pretending to be the Kyoshi Warriors. Aang and his friends must rely on Iroh to save Katara and Zuko from Azula and the Dai Li. Meanwhile in the crystal catacombs, Katara angrily calls Zuko out for all of his misdeeds he has caused towards her and her friends. Zuko admits he's done a lot of terrible things. During their search for Katara and Zuko, Iroh gives Aang some advice about choosing love and happiness. Katara and Aang try their best to fight off Azula and the Dai Li, but Zuko begins to side with his sister in hopes of getting his father's approval. Katara becomes dismayed over Zuko's betrayal. Aang realizes that he and Katara are outnumbered, he enters the Avatar state by letting go of the person he loves, but he is severely wounded by Azula. Iroh fights off his niece and nephew, giving Katara time to escape with Aang. Katara, her friends, and the Earth King escape on Appa and she uses her vial of the spirit oasis water to heal Aang's wound. However, Ba Sing Se has fallen and Zuko begins to wonder if he made the right decision."], "genres": "N/A", "imdbID": "0822878", "rating": 9.6, "votes": 8306, "number_of_episodes": 62}