{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0422247": "Peter Jessop", "0793634": "Sab Shimono", "1246394": "Marc Graue", "0861943": "Malachi Throne", "0571908": "Paul McKinney", "0092877": "Bill Bolender", "0861944": "Zachary Throne"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"], "number of episodes": 0, "plot": ["Lost in the desert without Appa, Team Avatar must find a way out. Iroh and Zuko make contact with a secret organization.", "Aang, Katara, Sokka and Toph escape the library to face the desert without the benefit of Aang's flying bison, Appa. The group knows they must get the information they obtained from the library about the upcoming solar eclipse to Earth Kingdom capital of Ba Sing Se, as it could very well make the difference in the ongoing war with the Fire Nation. Aang, who has always felt somewhat isolated by the realization that he is indeed the last Airbender, considers Appa and Momo his only connections to his previous 100-year ago world. When Appa is stolen by Sandbenders, Aang is visibly devastated and without direction or hope. Katara really shines in this episode as she must deal with Aang's despair, Sokka's cactus-induced hallucinations and Toph's lack of support or good ideas to solve their dilemma as she too feels they are just trapped in a 'giant bowl of sand pudding.' The highlight of this episode is when Aang finally confronts the Sandbenders who Toph recognizes as those who stole Appa. A showdown ensues and Sokka, Toph and the Sandbenders flee for their lives in fear of seeing Aang transform his rage and pain into the 'Avatar State.' Despite the apparent danger Katara remains in the whirlwind of sand unshaken. Again, we see the growing 'understanding' between Katara and Aang continue to develop. Katara trusts Aang enough to know he will not hurt her in the 'Avatar State' and Aang trusts Katara enough to let his defenses down to be vulnerable, but only with her. Katara pulls Aang back and he returns sobbing quietly in her arms. Meanwhile, Uncle Iroh and Prince Zuko successfully evade two groups seeking their capture as Fire Nation fugitives. Through Iroh's membership in the \"Order of the White Lotus\", they secure safe passage to Ba Sing Se to 'hide in plain sight' as refugees.—lisamarie31468"], "genres": "N/A", "imdbID": "0829520", "rating": 8.7, "votes": 5825, "number_of_episodes": 62}