{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0217221": "Grey Griffin", "1185516": "Cricket Leigh", "0352374": "Olivia Hack"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"],  "plot": ["Aang and friends are chased by a mysterious machine. Katara and Toph get into a heated argument. Aang realizes the reason why they are being followed by the crown princess and her friends is because of Appa's shedding.", "Team Avatar is getting chased by a mysterious machine, they become sleep deprived when they try to get away from Azula and her two friends. Katara and Toph get into a heated argument, she calls the earth bender out on her unhelpful attitude. Aang realizes the reason why they are being followed by the crown princess and her friends is because of Appa's shedding. Aang and his friends finally clean Appa up and he tries to create a fake decoy trail with the fur to trick Azula and her friends. Aang is finally cornered by the princess, she reveals that she is the younger sister of Zuko. Katara, Toph, Sokka, Iroh, and Zuko arrive to stop Azula, but she pretends to surrender to Aang and everyone else, she shoots lighting at Iroh as a distraction. Katara tries to help Iroh, but Zuko angrily rejects her offer. Team Avatar begins to part ways with Zuko and Iroh, the four friends finally gets some well-deserved sleep after being chased by Azula all day.—dawsonpersi", "Every time they land, Azula and her warriors find Aang, Katara, Sokka, and Toph. Toph refuses to help set up camp, claiming she carries her own weight and no one else's. After a fight between Aang, Katara and Toph, Toph storms off angrily. Aang lays a decoy trail for Azula and Sokka, Katara, Appa, and Momo, flee the other direction. Aang waits for Azula and is fighting her when Zuko and Iroh arrive. Soon, Katara, and Sokka come to the fight, too. Just as all hope of winning is lost, Toph arrives and, together, the six attack Azula. Knowing she is beat, Azula shoots Iroh with lightning and disappears. Zuko leaves with Iroh and Aang, Katara, Sokka, and Toph leave as well. Toph and Katara apologize to each other and the journey continues.—Mistyfoot"], "genres": "N/A", "imdbID": "0805799", "rating": 9.0, "votes": 6293, "number_of_episodes": 62}