{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0538683": "Mako", "0482851": "Phil LaMarr", "0000317": "Clancy Brown", "0217221": "Grey Griffin", "1246394": "Marc Graue", "0002350": "Jim Meskimen", "1788608": "Jen Cohn", "0219336": "Barry Dennen", "0738849": "Andrea Romano", "0861944": "Zachary Throne"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"],  "plot": ["The kids battle Long Feng and the Dai Li when they attempt to show the Earth King the vast conspiracy taking place in his city. Zuko becomes seriously ill and has feverish dreams as he faces a spiritual crisis.", "Aang and his friends try to prove to Earth King Kuei that Long Feng and the Dai Li are covering up the war that is being conducted by the Fire Nation. Aang and his friends try to show the secret passage way that Long Feng has been using, but that's already been destroyed. Aang and his friends go to the walls of Ba Sing Se and they show Kuei the Fire Nation Drill. Kuei soon discovers Long Feng's treachery and he has his traitorous advisor arrested for treason. At the palace, Aang and his friends discover the letters that Long Feng is hiding from them. Aang goes to the Eastern Air Temple to meet Guru Pathik so he can master the Avatar state, Sokka goes off to meet his father, Katara stays at the palace so she can discuss the invasion plan with the Council of Five, and Toph goes off to meet her parents. Unbeknownst to Earth King Kuei or Team Avatar, they don't realize that Azula and her friends are disguised as the Kyoshi Warriors and there is a bigger conspiracy going on. Meanwhile, Zuko has become seriously ill after returning Appa to Aang. Iroh has been nursing Zuko back to health. Zuko has been having a series of strange dreams."], "genres": "N/A", "imdbID": "0876938", "rating": 8.5, "votes": 5451, "number_of_episodes": 62}