{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "0477075": "Jennie Kwan", "0931898": "Wade Williams", "3147036": "Ezekial Rollins", "0741648": "Roger Rose", "1082823": "Eric Bauza", "1057696": "Courtenay Taylor", "0861944": "Zachary Throne"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["23"],  "plot": ["Sokka and Zuko head to the Fire Nation's most heavily guarded prison, the Boiling Rock, in hopes of finding and breaking out the captured invasion force.", "Sokka and Zuko take Zuko's war balloon to The Boiling Rock, described by Zuko as \"the most secure prison in the Fire Nation.\" It is a structure located in the center of a volcano, an island surrounded by a lake of boiling water. Their purpose is to find Sokka's father, Hakoda, and free him. Instead they find Suki, a Kyoshi warrior, and Sokka's girlfriend. She previously helped navigate Aang's group and some refugees through the Serpent's Pass - and actually saved Toph from drowning after Katara's ice bridge was smashed by the serpent. Dressed as Fire Nation Guards, Zuko and Sokka develop a plan to escape from the prison. Working together to a common end, they learn to trust and appreciate each other's viewpoints and judgments. Just as they are about to escape with several prisoners, they learn that Sokka's father might be among a group of prisoners arriving the next day. Sokka, Zuko and Suki abandon their own escape and stay in the prison so they can free Hakoda if the possibility arises. The escaping prisoners are caught, and Hakoda emerges from the cable car gondola as the last prisoner in the transport.—richbh", "Sokka and Zuko go to the Boiling Rock, a heavily guarded Fire Nation Prison, in hopes of freeing Hakoda (Sokka and Katara's father, who was arrested after a failed invasion). Sokka and Zuko disguise themselves as prison guards to avoid being recognized. They don't find Hakoda, to Sokka's joy he finds his girlfriend, Suki (she and the Kyoshi Warriors were previously captured by Azula, Mai, and Ty Lee). Sokka reunites with Suki and they try to think of an escape plan, but their plans of escaping are postponed when Hakoda finally arrives.—dawsonpersi"], "genres": "N/A", "imdbID": "1176477", "rating": 8.6, "votes": 5770, "number_of_episodes": 62}