{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "2055652": "Greg Baldwin", "0000434": "Mark Hamill", "0477075": "Jennie Kwan", "0308127": "James Garrett", "0812220": "André Sogliuzzo", "0105011": "Victor Brandt", "0001598": "Robert Patrick", "0949775": "Keone Young", "0354937": "Jennifer Hale", "0724656": "Kevin Michael Richardson", "0534134": "Tress MacNeille", "0002350": "Jim Meskimen"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["22"],  "plot": ["Aang awakes on a mysterious island and confronts his past lives for advice on how to stop the Fire Lord without killing him. The rest of the group searches for Aang.", "Aang is on a mysterious island and he tries to seek guidance from his past lives, but they tell him to take out the Fire Lord and put an end to the war. Aang is still contemplating on how to stop Ozai and he soon discovers the island is a lion turtle, he gives Aang the forgotten form of energy bending. Meanwhile, June is unable to find Aang with no options left, Zuko decides to find his uncle. Team Avatar meets up with Pakku, Jeong Jeong, Piando, and King Bumi, they are revealed to be members of the Order of the White Lotus, Iroh is the grand member and leader. At the White Lotus Camp, Zuko finally reconciles with Iroh for his past behavior, but Iroh admits to Zuko he was never angry with his nephew and he tells Zuko that he finally followed the right path. Iroh tells Team Avatar that taking down the Fire Lord is Aang's job and he refuses to kill Ozai to gain power. Iroh tells Zuko that he has to be Fire Lord and redeem the honor of the Fire Nation. Zuko and Katara set off to stop Azula from taking the throne, the Order of the White Lotus decides to liberate Ba Sing Se, and Sokka, Suki, and Toph try to prevent the Fire Nation airships from destroying the Earth Kingdom. Sozin's Comet arrives and Aang is ready to face Phoenix King Ozai.—dawsonpersi"], "genres": "N/A", "imdbID": "1204263", "rating": 9.5, "votes": 7825, "number_of_episodes": 62}