{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0217221": "Grey DeLisle", "1185516": "Cricket Leigh", "0352374": "Olivia Hack", "0812220": "André Sogliuzzo", "0477075": "Jennie Kwan", "0931898": "Wade Williams", "3147036": "Ezekial Rollins", "0741648": "Roger Rose", "1082823": "Eric Bauza", "1057696": "Courtenay Taylor", "0861944": "Zachary Throne"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["22"],  "plot": ["The escape is planned and the heroes attempt to break from the prison that very day. But problems come when Azula, Mai and Ty Lee arrive at the prison.", "Mai, Ty Lee and Azula show up in this episode. Mai - who is in love with Zuko - is the warden's niece. The Warden tortures the prisoners who were captured during their escape attempt, and learns that one of his guards is a fake. The prisoner who gave the information does not betray Sokka. Zuko confronts Mai and tells her that he is \"trying to save the Fire Nation\" - she replies that he's a traitor. Sokka and his father think up a plan to escape from the island via the cable car - using the Warden as a hostage. While the tortured prisoner creates a diversion by starting a riot in the prison yard, Sokka, Zuko, Haruto and Suki kidnap the Warden and make their way to the cable car. While the cable car is in motion, Azula and Ty Lee attempt to stop it. A battle ensues. When the guards on the island - ordered by a shout from the Warden - jam the cable car works and attempt to cut the cable so the gondola will fall into the boiling lake, Azula and Ty Lee flee the gondola - but Mai intervenes to save the escapees. She assails the guards jamming the cable car works, saying \"I'm saving the one I love\", and escape is a success. The escapees are still trapped on the volcano, but find Azula's war balloon. They use it to return to Aang and the other young warriors who are hole up in the Northern Air Temple.—Richbh", "Azula, Mai, and Ty Lee arrive at the Boiling Rock. Mai is visibly upset with Zuko about the break up, but Zuko explains to Mai that he is trying to stop the Fire Nation's warmongering and he couldn't bring himself to involve Mai in his dilemma. Sokka reunites with his father in his prison cell and they come up with another way of escaping, they decide to incite a prison riot as a divergence and capture the warden as leverage. However, their escape plan almost fails when the guards try to cut off the wires connected to the gondola. Mai intervenes and she allows Zuko, Sokka, Suki, Hakoda, and Chit Sang to escape. Azula confronts Mai for betraying her, but Mai has no regrets for her actions and she tries to take down the crown princess. Ty Lee prevents Azula from hurting Mai and both of the girls are arrested. Sokka and Zuko return to the Western Air Temple and Katara reunites with her father.—dawsonpersi"], "genres": "N/A", "imdbID": "1194313", "rating": 9.2, "votes": 6346, "number_of_episodes": 62}