{"cast": {"0878940": "Zach Tyler Eisen", "0926165": "Mae Whitman", "1123750": "Jack De Sena", "1402100": "Michaela Jill Murphy", "0002364": "Dante Basco", "0048389": "Dee Bradley Baker", "2055652": "Greg Baldwin", "1526223": "Daniel Samonas", "1023767": "Michael Dow", "2866078": "Nick Swoboda"}, "geners": ["Animation", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "runtimes": ["25"],  "plot": ["The gang hides out in the Western Air Temple. Zuko tries to convince the gang of his change in heart, but they are very hesitant. Combustion Man/Sparky-Sparky Boom Man attacks again.", "Aang and his team (which is now doubled in size) arrive at the Western Air Temple with Zuko on their tail. When Zuko meets up with them, they are hesitant to see him. Zuko tries to convince Aang and the others he's changed.—Tim Hedrick", "Aang and the rest of the team arrive at the Western Air Temple. The Duke, Teo and Haru run off to explore the temple while Aang, Katara, Sokka and Toph discuss their future plans and the need to find a firebending teacher. Meanwhile, Zuko waits outside the temple, rehearsing his apology to Aang and crew. Back at the temple, Aang grows frustrated with the talks of finding a firebending teacher and flies off. Katara, Sokka and Toph follow on Appa and land with Aang in another part of the temple. Toph tells the group that Zuko is there, and the four confront him. Zuko tries to explain himself and when that fails, he offers himself up as a prisoner. Katara tells him to leave. The four then argue about Zuko, with Toph defending him. Toph grows frustrated and storms off to find Zuko. She stumbles into his camp at nighttime and startles Zuko who firebends at her, burning her feet. Toph, now unable to \"see\" with her feet, crawls back to the temple. Katara attempts to heal her feet when Combustion Man attacks. Zuko risks his life trying to distract Combustion Man, giving the four enough time to find cover. Aang and Katara both try unsuccessfully to stop Combustion Man and finally Sokka manages to hit his forehead with the boomerang, causing Combustion Man to blow up and presumably die. Zuko approaches the four and tries again to explain himself. He apologized to Toph stating that he must remember to control his firebending so as not to hurt others. Aang, remembering his own firebending experience, accepts Zuko as his teacher. Toph agrees to this so as to have plenty of time to get back at Zuko for burning her feet. Sokka agrees only because it will help defeat the Firelord. Katara reluctantly agrees only because Aang said yes. Sokka shows Zuko to his room, commenting to Aang that \"this feels weird\". Zuko pulls a portrait of his uncle from his bag and remembers his uncle's lecture about destiny. When he returns to reality, Katara is standing at the door. She threatens that if Zuko makes one slip-up, one reason for her to doubt his intentions, that she will kill him.—Michael E.", "Aang and the rest of the kids from the eclipse siege arrive at the Western Air Temple. Prince Zuko asks the gang if he can join their group, and offers to teach Aang firebending. They say there is no way they can trust him and will never let him join their group. Toph goes to talk to Zuko at night, and he accidentally burns her feet. Combustion Man shows up and tries killing the gang. Zuko tries to stop him, but Combustion Man doesn't listen. Sokka throws his boomerang and hits Combustion Man on his third eye, causing his blast to backfire. Aang realizes that Zuko is good, and accepts him as his firebending teacher.—Mike M."], "genres": "N/A", "imdbID": "1136036", "rating": 8.9, "votes": 6030, "number_of_episodes": 62}