{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "0051394": "David Bamber", "1263986": "Max Pirkis", "0940245": "Nicholas Woodeson", "0078136": "Suzanne Bertish", "1493547": "Chiara Mastalli", "0912012": "Rick Warden", "0006522": "Haydn Gwynne", "2054115": "Coral Amiga", "0355563": "Esther Hall", "0162281": "Enzo Cilenti", "0290693": "Anna Francolini", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0048450": "Frank Baker", "0083162": "Lidia Biondi", "1548720": "Damiani Lorenza Zoe", "0315355": "Peter Gevisser", "0339671": "Simon Gregor", "0377844": "Guy Henry", "0573862": "Ian McNeice", "2101236": "Marco Pollak", "1907551": "Anna Fausta Primiano", "2089850": "David Quinzi", "1446839": "Luigi Santamaria", "0868476": "Pip Torrens", "2120057": "Andrea De Santis", "3652766": "Carlotta Montanari", "1687370": "Simone De Marinis", "0879648": "Massimiliano Ubaldi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["47"],  "plot": ["Vorenus' defense of Caesar lands him in an unexpected position of power within Rome. Meanwhile, Servilia hurls the final obstacle in her ambitious and complex revenge plan against Atia.", "In the aftermath of their arena exploits, both Pullo and Vorenus have become icons and heroes to the people of Rome. As a result, Vorenus' defense of his actions to Caesar lands him in an unexpected position of power when Caesar, after proclaiming himself dictator for life, makes Vorenus a senator. In the meantime, Pullo's unexpected return to Vorenus' household to recover from his injuries away from a medical hospital, is not appreciated by his former slave Eirene who still holds a grudge against Pullo for killing her boyfriend. Elsewhere, Caesar decides to overhaul the senate by adding some surprising new faces, much to the chagrin of the old guard, including Brutus. As Servilia hurdles the final obstacle to her revenge plan against Caesar by secretly organizing the conspirators to assassinate Caesar in the senate on the Ides of March, she finally reveals her revenge and complex scenario to Atia and Octavian, while her servant learns the scandalous truth about Niobe's baby and informs Vorenus who has a fatal confrontation with Niobe.", "Caesar's plan to name 100 new Senators - mostly from the tribes that have been most loyal to Rome - creates consternation among the those plotting against him. Brutus is now firmly on their side but realizes that this must be carefully planned. Caesar keeps both Mark Antony and Lucius Vorenus close to his side. Both are distracted while the plotters assassinate Caesar on the floor of the Senate. Servilia relishes the moment and invites Atia to her home at the appointed hour and happily tells her of Caesar's death and the end of the Julii. She also remembers a secret about Vorenus and Niobe and sends her servant to tell him about his grandson. While Caesar is being assassinated, Vorenus is raging at Niobe over her deceit, leading to tragic consequences. Pullo has left the city looking for forgiveness from his gods and perhaps a reconciliation with Eirene.—garykmcd"], "genres": "N/A", "imdbID": "0688355", "rating": 9.1, "votes": 3055, "number_of_episodes": 22}