{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "0051394": "David Bamber", "1263986": "Max Pirkis", "0940245": "Nicholas Woodeson", "0078136": "Suzanne Bertish", "1493547": "Chiara Mastalli", "0912012": "Rick Warden", "0186475": "Lorcan Cranitch", "0006522": "Haydn Gwynne", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0083162": "Lidia Biondi", "1434772": "Giovanni Calcagno", "0171015": "Dominic Coleman", "0198501": "Peter-Hugo Daly", "1346211": "Abhin Galeya", "0377844": "Guy Henry", "0573862": "Ian McNeice", "2101236": "Marco Pollak", "1907551": "Anna Fausta Primiano", "2089850": "David Quinzi", "0755156": "Hugh Sachs", "0098324": "John Boswall", "2120057": "Andrea De Santis", "3891909": "Tommaso Sacco", "0879648": "Massimiliano Ubaldi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["52"],  "plot": ["The price of Caesar's mercy: Cicero nominates Caesar to an unprecedented ten-year dictatorship and Brutus speaks in support of the motion. With martial authority and Niobe at his side, Vorenus campaigns for magistrate under Posca's advice, but is shocked to learn from Posca that Caesar has already fixed the election in Vorenus's favor. Meanwhile, Atia continues her humiliation of Servilia while denying any involvement in her assault. But Atia becomes troubled by the silent depression of Octavia after Octavian compels her to return home from the cloister where she had fled. As Servilia lies at home shattered by her recent attack, she soon revives and gets her self-confidence back when she takes in the homeless and embittered Quintus Pompey whom she sees as her tool for revenge against Caeser for leaving her. As Caesar prepares for his Triumph involving five days of celebration and games, Antony finds that the dictator has no sense of humor about the trappings of power. The circulation of a denunciation of Caesar, signed by Brutus, fascinates Rome but stuns Brutus, who suspects his mother. Denied permission to march with the Thirteenth in the Triumph, the dejected Pullo resolves to make a new life as a civilian with Eirene, but his dream leads only to horror for the Vorenii and utter wretchedness for himself.—Tom D.", "All of Rome celebrates after the Senate votes in favor of naming Caesar Emperor and dictator for 10 years. Servilia is still recovering from her attack and public humiliation and receives a visit from Atia. She also takes in Quintus Pompey who needs protection and vows to kill Caesar. She also pens a tract lamenting the passing of the Republic but puts her son Brutus' name on it. After all that's happened, Octavia has run off and is living in seclusion. Octavian fetches her and forces her to return home. She is not happy. Vorenus begins his campaign for magistrate but doesn't quite realize how the game is played. Pullo wants to march in Caesar's triumph but is refused as he isn't an active soldier anymore. He's also decided to free his slave Eirene so he can marry her but it all ends in tragedy.—garykmcd"], "genres": "N/A", "imdbID": "0688359", "rating": 8.3, "votes": 2443, "number_of_episodes": 22}