{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0186469": "Kenneth Cranham", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0425490": "Karl Johnson", "0890055": "Indira Varma", "0051394": "David Bamber", "1263986": "Max Pirkis", "0940245": "Nicholas Woodeson", "0078136": "Suzanne Bertish", "0422234": "Paul Jesson", "0162281": "Enzo Cilenti", "0355563": "Esther Hall", "0912012": "Rick Warden", "0186475": "Lorcan Cranitch", "0006522": "Haydn Gwynne", "0290693": "Anna Francolini", "1493547": "Chiara Mastalli", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0019681": "Manfredi Aliquo", "0083162": "Lidia Biondi", "0173399": "Francesca Romana Coluzzi", "0226589": "Kevin Dignam", "0358772": "Roger Hammond", "1050820": "Richard Katz", "2152645": "Paola Lavini", "0551649": "Barbara Marten", "0565236": "Maggie McCarthy", "0573862": "Ian McNeice", "1907551": "Anna Fausta Primiano", "0706634": "Antonio Ragusa", "0708939": "Steve Ramsden", "0728280": "Paolo Risi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["54"],  "plot": ["Atia and her family have stayed behind when Pompey and others fled and she now throws a party for her triumphant uncle, Julius Caesar. She clearly has her sights set on the great leader and is puzzled when he sends her a guest list that includes Servilia of the Junii. She soon finds out why. Pompey wants to find out what happened to the gold from the Roman Treasury and sends his son Quintus to Rome to find out what happened. They go directly to Vorenus' home but he has no idea what they are talking about. Pullo arrives however and Vorenus tells him to go directly to Caesar himself and explain. Octavian meanwhile learns of one of his uncle's secrets.—garykmcd", "Atia throws a party to honor Caesar after he takes control of Rome. There, Caesar asks for auguries to be taken, and Octavian learns about a serious intestinal medical ailment that Caesar has been hiding, as well as his tryst with Servilia. Meanwhile, Quintus Pompey's mission to retrieve stolen gold does not go well when he and his men target Vorenus, who rejects an offer by Mark Antony to return to active duty. Vorenus throws a feast to kick off his new career as a civilian businessman, where Niobe's sister makes a scene. Pullo's good fortune runs out when Vorenus learns of his thievery of the stolen gold. Pullo captures Quintus and delivers him to Caesar, who lets him go with a message and offer of truce to Pompey, knowing he will not accept it.—Anonymous"], "genres": "N/A", "imdbID": "0688354", "rating": 7.9, "votes": 3025, "number_of_episodes": 22}