{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0186469": "Kenneth Cranham", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "1263986": "Max Pirkis", "0940245": "Nicholas Woodeson", "0051394": "David Bamber", "0078136": "Suzanne Bertish", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "1567104": "Shaka Bunsie", "0158264": "Scott Chisholm", "0296492": "Ene Frost", "0346950": "Tony Guilfoyle", "0402898": "Kathryn Hunter", "0447986": "David Kennedy", "0209095": "David de Keyser", "1203457": "Lyndsey Marshal", "0557678": "Grant Masters", "0573862": "Ian McNeice", "1461612": "Axel Schumacher", "5085340": "Riccardo Antuoni", "7736837": "Liliana Mele", "0868370": "Federico Torre", "0879648": "Massimiliano Ubaldi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["53"],  "plot": ["Brutus gets a chilly reception from Servilia when he returns home from Greece. In Egypt, Caesar rebukes the advisers of the boy king, Ptolemy XIII, for their presumption in eliminating Pompey and demands the man who killed him. Caesar decides to intervene in the dispute between Ptolemy and his sister-wife, Cleopatra, to ensure both Rome's grain supply and his own access to Egypt's treasure. Antony, in an unusual show of prudence, advises against this with only half a legion in Alexandria and Cato and Scipio still at large in Africa. Caesar sends Vorenus and Pullo to rescue Cleopatra from house-arrest and escort her to Alexandria. Upon meeting Vorenus and Pullo, the narcissistic, opium-smoking teenage Cleopatra decides that her only hope of survival is to seduce Caesar and she compels Vorenus and Pullo to help smuggle her into the city first by unsuccessfully attempting to seduce Vorenus, but she has better luck with Pullo. Servilia's relationship with Octavia deepens beyond friendship into a passionate lesbian tryst. Caesar is besieged in Alexandra by the Egyptians loyal to Ptolemy. Back in Rome, Antony greets Brutus and Cicero on the floor of the deserted Senate and makes Cicero a promise to kill him if he ever turns against him.—Tom D.", "Caesar pursues Pompey Magnus to Egypt where he finds the boy-king, Ptolemy XIII, who is surrounded by acolytes . Caesar is outraged when he hears what has happened to his old friend Pompey. He orders Mark Antony to return to Rome and take charge there while he plans to remain in Egypt to protect their interest, particularly access to the Egyptian grain supply and the repayment of past debts. He tasks Vorenus to go into the desert and find Ptolemy's sister Cleopatra and with Pullo accompanying him, Vorenus has little difficulty finding her. Pullo once again plays an unexpected role. Brutus, having been spared by Caesar after his surrender, is shocked by his mother's reaction when he returns to Rome.—garykmcd"], "genres": "N/A", "imdbID": "0688350", "rating": 8.4, "votes": 2585, "number_of_episodes": 22}