{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0186469": "Kenneth Cranham", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0425490": "Karl Johnson", "0890055": "Indira Varma", "0051394": "David Bamber", "1263986": "Max Pirkis", "0940245": "Nicholas Woodeson", "0422234": "Paul Jesson", "2054115": "Coral Amiga", "0290693": "Anna Francolini", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0019681": "Manfredi Aliquo", "0048450": "Frank Baker", "0083162": "Lidia Biondi", "0098324": "John Boswall", "1012984": "Alexander Brooks", "0665767": "Matt Patresi", "2045338": "Alessio Di Cesare", "2048410": "Alessandro Inchiappa", "2044334": "Maura Orefici", "0534640": "Sean Madden", "0573862": "Ian McNeice", "0684277": "Francesco Pini", "0224215": "Sergio Di Pinto", "0696531": "Alessandro Prete", "1907551": "Anna Fausta Primiano", "0972330": "Roberto Davide", "1057010": "Bart Ruspoli", "1895420": "Jonathan Readwin", "0750871": "Ted Rusoff", "1182543": "Ilaria Stivali", "2294388": "Sebastiano Vinci", "1880088": "Nico Toffoli", "0879648": "Massimiliano Ubaldi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["50"],  "plot": ["Caesar winters his army in Gaul near the Italian border while his enemies in Rome fear that he will do something no Roman General has done: cross the Rubicon with his army. To counter-balance his opponents, Caesar puts his friend Mark Antony up for office as the people's Consul. Vorenus and Pullo accompany Mark Antony and Octavian to Rome. For Pullo, it's an opportunity to get drunk and ravish every woman in sight. He also loses all of his money in a crooked dice game leading to a major brawl. For Vorenus, he will have a reunion with his wife Niobe who he has not seen for 8 years. He's told that the baby he finds in his home is his grandson but Niobe is hiding a secret. In the Senate, there is a move to have Caesar declared a traitor but when Mark Antony tries to return to the Senate to veto their decision, Pullo is attacked by someone he fought the night before. Antony thinks the attack is against him and Pullo kills the man and Caesar declares Pullo a hero.—garykmcd", "After eight years away at war, Lucius Vorenus returns to an homecoming he wasn't expecting when he learns his eldest daughter has a newborn child and his wife, Niobe, is emotionally barren and distant. Titus Pullo's homecoming from the Gaul War is his care-free lifestyle of drinking and carousing for whores, and getting beat up and nearly killed by scam artists. Later, Pullo's actions soon become trouble for the Republic. Meanwhile, Mark Antony enters public office as a Tribune for the people and Caesar begins his mobilization for his return trip to Rome. Elsewhere, Caesar's niece, the scheming Atia of the Julii, welcomes Octavian home from his adventure with Pullo and Vorenus and makes her play for Antony, to her daughter, Octavia's, chagrin.—Anonymous"], "genres": "N/A", "imdbID": "0688352", "rating": 8.2, "votes": 3015, "number_of_episodes": 22}