{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0425490": "Karl Johnson", "0890055": "Indira Varma", "1263986": "Max Pirkis", "0090196": "Lee Boardman", "0422234": "Paul Jesson", "0186475": "Lorcan Cranitch", "1493547": "Chiara Mastalli", "0355563": "Esther Hall", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0047257": "Ewan Bailey", "0083162": "Lidia Biondi", "0185329": "Jonathan Coy", "0226589": "Kevin Dignam", "0358772": "Roger Hammond", "0381970": "Nicholas Hewetson", "0506314": "Adam Levy", "0573862": "Ian McNeice", "0574615": "Graham McTavish", "2101236": "Marco Pollak", "1907551": "Anna Fausta Primiano", "2089850": "David Quinzi", "1087290": "Dominic Rickhards", "2120057": "Andrea De Santis"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["53"],  "plot": ["The defeated Cato and Scipio fall back on the African city of Utica after the Battle of Thapsus where they decide to end it all. Caesar, after two years of fighting in Greece and Egypt, returns to Rome and receives a hero's welcome. Meanwhile, Servilia's cold rage against the Julii clan makes Brutus's submission to Caesar even more painful. Octavian returns home from military school and Caesar, impressed with his nephew's incisive political acumen, appoints him a pontiff despite his youth. Having opened and operated a profitable butcher shop, Niobe and Lyde get the reluctant Vorenus and Pullo to join the trade, but Vorenus again crosses paths with the thug Erastes, now the crime lord of the Aventine. Learning of Caesar's secret \"affliction,\" Servilia persuades her lover Octavia to cajole her brother into revealing more, but she only learns Niobe's secret instead. Servilia motivates Octavia to try again by other means, with dreadful consequences for both sister and brother. Pullo's affection for his slave Eirene deepens. Enraged at Servilia's manipulation of her children, Atia enlists Timon and his band of thugs to retaliate, thus escalating the term 'catfight' to a very different level.—Tom D.", "Having secured control over Egypt, Caesar then proceeds to defeat Cato and Scipio. He returns to Rome in triumph. Vorenus is reunited with Niobe and his children and learns that Niobe and her sister Lyde have done very well with a butcher shop they've opened. He's now out of the army and doesn't see himself as a butcher but takes up the trade. He soon has an encounter with Erastes Fulmen, who now controls most of the crime in the area. His defiance may carry a heavy price but salvation comes in the form of Caesar himself who asks him to run for public office. Pullo is reunited with his slave girl Eirene and begins to develop feeling for her. Octavian returns to Rome after a two year absence. He makes quite a impression on his uncle Julius Caesar who appoints him to a government post. Servilia is still ashamed of her son Brutus' surrender to Caesar. She tries to get information to use against Caesar and asks Octavia to get more information from Octavian about his secret affliction. When Atia hears of Servilia's scheming, she has her man Timon humiliate her in public.—garykmcd"], "genres": "N/A", "imdbID": "0688360", "rating": 8.2, "votes": 2467, "number_of_episodes": 22}