{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0186469": "Kenneth Cranham", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0425490": "Karl Johnson", "0890055": "Indira Varma", "0051394": "David Bamber", "1263986": "Max Pirkis", "0090196": "Lee Boardman", "0940245": "Nicholas Woodeson", "0078136": "Suzanne Bertish", "0422234": "Paul Jesson", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0019681": "Manfredi Aliquo", "0083162": "Lidia Biondi", "0668880": "Allan Caister Pearce", "1434772": "Giovanni Calcagno", "0137068": "Fabio Carfora", "1012984": "Alexander Brooks", "2045338": "Alessio Di Cesare", "1705083": "Lydia Leonard", "0531076": "Russell Mabey", "2388933": "Steven Matthew", "0573862": "Ian McNeice", "0580244": "Bob Mercer", "1456647": "Gerard Monaco", "0665767": "Matt Patresi", "0665811": "Anna Patrick", "0972330": "Roberto Davide", "1057010": "Bart Ruspoli", "0750871": "Ted Rusoff", "0830906": "Alan Stocks", "1307551": "Steven Blake", "0098324": "John Boswall", "1880088": "Nico Toffoli", "2661064": "Ilir Jacellari", "0492092": "Peter Lavin", "0879648": "Massimiliano Ubaldi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["52"],  "plot": ["In Gaul in 52 B.C., two Roman soldiers, Legionary Titus Pullo and Centurion Lucius Vorenus, are tasked with recovering Julius Caesar's personal Eagle, stolen from his camp in the dead of night. With his campaign in Gaul coming to a successful conclusion, Caesar's popularity is continuing to grow. He's saddened however when he receives news from his good friend Pompey Magnus that his daughter, Pompey's wife, has died in childbirth. In the Senate, Pompey must defend the prolonged absence of his friend and co-Consul Caesar against charges of corruption and of waging an illegal war. It's all a ruse however as he is plotting to eliminate him. Meanwhile, Atia of the Julii sends her son Octavian to Gaul deliver a gift of a beautiful stallion to his great uncle Julius Caesar. He is taken prisoner along the way. Fortunately, Vorenus and Pullo rescue him and as a result, both receive Caesar's favor.—garykmcd", "In 52 BC., Caesar has just conquered Gaul. Two soldiers are enlisted to find the legion's stolen gold standard. The Senate worries about Caesar's popularity and Pompey Magnus conspires with them against Casear. Atia is careful to play both sides of an escalating power struggle.—Anonymous", "In Pagan Rome, 52 B.C., there is a growing divide between the classes: the Patricians (the wealthy) and the Plebeians (the poor). The government is equally balanced between two men: Gaius Julius Caesar, and Gnaeus Pompeius Magnus, but the war in Gaul has made Caesar popular and Pompey is leery of his old friend's fame. In addition to Pompey's suspicions, the Patricians are also concerned about Caesar's growing popularity with the Plebes. On the battlefield, Lucius Vorenus prepares the 13th Legion for combat with the Nevrii warriors. One soldier, Titus Pullo, disobeys orders, breaks ranks, and charges through enemy lines. Pullo is surrounded until Vorenus and a small band of soldiers save him. A drunken Pullo punches Vorenus--who orders a retreat of the rescue party to behind the Roman lines. Back at camp, Pullo is flogged and then condemned to death as Vorenus lectures the troops about discipline. Marc Antony watches the beating, enjoying the show. In a ceremony in front of the 13th Legion, Caesar accepts surrender from the King of the Gauls who must kiss his standard, a gold eagle on top of a staff. With this gesture, the eight years of the Gallic Wars come to a close. Later it is discovered that Caesar's standard has been stolen by Blue Spaniards. To avoid the theft being seen as an portentous sign, Marc Antony sends Vorenus to find it. Vorenus recruits Pullo to join him in his quest since Pullo is already condemned to die. The duo lose their horses when Pullo falls asleep during watch. On foot, they encounter a group of rebellious slaves led by one of Pompey's slaves, and the duo slaughters all of them. They discover that slaves possess the stolen standard, not the Blue Spaniards. Vorenus and Pullo also free Caesar's nephew Octavian, who was kidnapped when his mother, Atia, sent him to deliver a horse to Caesar. Octavian tells Vorenus and Pullo that a civil war is brewing back in Rome due to Caesar's popularity. Triumphant, the trio returns camp and informs Caesar of Pompey's resentment. Caesar sends Pompey the head of his slave, and then makes plans to march on Rome.—Missy"], "genres": "N/A", "imdbID": "0688358", "rating": 8.0, "votes": 3483, "number_of_episodes": 22}