{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0186469": "Kenneth Cranham", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0425490": "Karl Johnson", "0890055": "Indira Varma", "0051394": "David Bamber", "0940245": "Nicholas Woodeson", "0078136": "Suzanne Bertish", "0422234": "Paul Jesson", "0355563": "Esther Hall", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "1389013": "Eliza Darby", "1658382": "Daren Elliott Holmes", "0447986": "David Kennedy", "0573862": "Ian McNeice", "0630405": "Vincenzo Nicoli", "0665811": "Anna Patrick", "2058263": "Michele Pettini", "2056694": "Francesco Sensi", "0842750": "Steve Swinscoe", "2057147": "Franco Troscia"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["56"],  "plot": ["As they try to reach Caesar in Greece, the shipwrecked Vorenus and Pullo confront an unexpected dilemma. Back in Rome, Atia again sends Octavia to beg protection from Servilia, who complies readily to encourage her growing friendship with Octavia. As they prepare their counterattack against Caesar, Pompey's Republicans begin to squabble over both the anticipated spoils and the method of finishing Caesar off. Niobe's sister Lyde comes back to see her and comforts her over Vorenus's disappearance. Badly outnumbered, Caesar and Antony make their stand at Pharsalus. On his arrival in Egypt, Pompey is greeted by a Roman veteran.—Tom D.", "Having decided to join Caesar in Greece, much of Mark Antony's Legion is lost is a terrible storm at sea. He survives and re-joins Caesar and his depleted forces. Despite being outnumbered 3 to 1, Caesar has decided to stand his ground and fight Pompey's superior forces where they are. In the ensuing battle at Pharsalus, Caesar's forces have a decisive victory and Pompey escapes to Egypt. Vorenus and Pullo survive the storm but are marooned. When they finally make it to the mainland, Vorenus has a major decision to make. In Rome the news of Caesar's impending defeat has Atia sending her daughter Octavia back to Servilia in the hope of getting her protection. Servilia agrees to lend her men to protect her and her mother and a close bond develops between her and Octavia. Niobe worries about Vorenus' well-being but her sister comforts her.—garykmcd"], "genres": "N/A", "imdbID": "0688353", "rating": 8.4, "votes": 2563, "number_of_episodes": 22}