{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0186469": "Kenneth Cranham", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "1263986": "Max Pirkis", "0090196": "Lee Boardman", "0940245": "Nicholas Woodeson", "0078136": "Suzanne Bertish", "0355563": "Esther Hall", "0290693": "Anna Francolini", "1493547": "Chiara Mastalli", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0019681": "Manfredi Aliquo", "1850877": "Norma Atallah", "0056271": "Lynda Baron", "2519354": "Francesca Berrettini", "0083162": "Lidia Biondi", "0001003": "Simon Callow", "2045338": "Alessio Di Cesare", "1842417": "Francesca Fowler", "0322510": "Georgie Glen", "0573862": "Ian McNeice", "1907551": "Anna Fausta Primiano", "0728280": "Paolo Risi", "2491451": "Stan Rosen", "0769084": "Andrew Scarborough", "0098324": "John Boswall", "1687370": "Simone De Marinis", "1877331": "Robert Dearle", "0262470": "Silvio Evangelista"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["55"],  "plot": ["Caesar pursued Pompey to Greece but the tide has turned and it's Caesar who is on the run. He contacts Mark Antony, who he left in charge in Rome, to come and join him with the 13th Legion but Antony seems to be in no hurry. Vorenus has re-enlisted in Antony's Legion and he and Niobe have begun to renew their marital relationship. The presence of Niobe's sister is the only sour note in their house. Pullo meanwhile continues to train young Octavian in the use of arms and the boy's mother Atia is so pleased with his development that she decides he should take another step to manhood and orders Pullo to take him to a brothel so he can have his first sexual experience. Atia also continues with her scheming ways and believing that Caesar is done for, decides she had better make friends with Servilia.—garykmcd", "When Caesar finds himself outnumbered by Pompey's legions in Greece, sends a message back to Rome asking Antony to join the fight. Meanwhile, Atia urges Octavian to take another step toward manhood in which Pullo is encouraged to visit a local brothel where the youth meets his first time courtesan, while Octavian and Pullo agree to keep the knowledge about what they know about Niobe's tryst a secret between them. Elsehwere, Vorenus and Niobe try to bring passion back to their marriage. Marc Antony has fun in his new political life in ruling with a certain brashness and intimidation, while he ponders a counter-offer from the seductress Atia.—Anonymous"], "genres": "N/A", "imdbID": "0688351", "rating": 8.0, "votes": 2578, "number_of_episodes": 22}