{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "1263986": "Max Pirkis", "0090196": "Lee Boardman", "0940245": "Nicholas Woodeson", "0186475": "Lorcan Cranitch", "1493547": "Chiara Mastalli", "0290693": "Anna Francolini", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0001354": "Ciarán Hinds", "0019681": "Manfredi Aliquo", "0047257": "Ewan Bailey", "0191410": "Michael Culkin", "0212758": "Douglas Dean", "0264235": "Peter Eyre", "0377844": "Guy Henry", "0477441": "Paul Kynman", "1377178": "Bruce Mackinnon", "1133930": "Cristina Mantis", "0573862": "Ian McNeice", "0574615": "Graham McTavish", "1759307": "Stefano Miceli", "0585661": "Danny Midwinter", "0621382": "Michael Nardone", "2101236": "Marco Pollak", "1907551": "Anna Fausta Primiano", "2089850": "David Quinzi", "0729623": "Julian Rivett", "0745487": "Oreste Rotundo", "1552910": "Tom Shaker", "1528512": "Robin Sneller", "0830544": "Helen Stirling", "2120057": "Andrea De Santis", "1877331": "Robert Dearle"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["48"],  "plot": ["Rejected by Vorenus and Eirene and racked by guilt for the killing of Eirene's fiancé out of a jealous rage, Pullo has sunk to working as an assassin for the gangster Erastes. When Pullo gets arrested for killing one of Caesar's popular opponents, he condemns himself by refusing to name who hired him, despite Octavian's attempts to defend him. Meanwhile, Vorenus finds his new official duties as magistrate tedious, especially when he gets caught between Caesar and the demands made by veterans' spokesman Mascias. Niobe revels in the prestige of Vorenus's office until Caesar invites the Voreni to a symposium at Atia's house. Despite Servilia's surreptitious propaganda depicting Brutus as a tyrant-killer, and the urgings of Cassius and his own doubts, Brutus resists turning against Caesar. Antony makes his move to win back Atia. On the point of death in a gladiator arena, Pullo finds a new reason to live that yet again puts Vorenus in a tight spot. Also, Caesar makes a move that compels the conflicted Brutus to make up his mind to turn against Caesar.—Tom D.", "A dejected Pullo has taken to drinking excessively and smoking opium. He is also working for Erastes Fulmen as an assassin. On his second outing, he's arrested for murder and despite Octavian plea to help him, Caesar refuses since the dead man was one of his severest critics and he doesn't want anyone to think he was in any way involved. Octavian arranges for Pullo to have a lawyer - who proves to be less than competent - and he is sentenced to death in the gladiatorial arena. Brutus meanwhile is under pressure from his mother Servilia and others in her entourage to turn against Caesar. He steadfastly refuses to do so until Caesar himself forces him over to the other side. Vorenus is enjoying his newfound position as a Magistrate and negotiates on Casear's behalf with a former brother in arms, Mascius, who is demanding the dictator follow through on his promise of land grants to ex-soldiers.—garykmcd"], "genres": "N/A", "imdbID": "0688357", "rating": 8.9, "votes": 2821, "number_of_episodes": 22}