{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "0733196": "Zuleikha Robinson", "0051394": "David Bamber", "0377844": "Guy Henry", "1395602": "Allen Leech", "0078136": "Suzanne Bertish", "1969169": "Rafi Gavron", "1493547": "Chiara Mastalli", "0355563": "Esther Hall", "0573862": "Ian McNeice", "0751950": "Camilla Rutherford", "0148738": "Daniel Cerqueira", "0512283": "Nigel Lindsay", "0621382": "Michael Nardone", "2054115": "Coral Amiga", "0090196": "Lee Boardman", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "2532589": "Dominic Atherton", "2747947": "Nadia Baldi", "0083162": "Lidia Biondi", "0082653": "Bruno Bilotta", "0179680": "Allan Corduner", "0187361": "Alessandro Cremona", "2548409": "Alessio Cuna", "0210056": "Emilio De Marchi", "0327347": "Giacomo Gonnella", "0425561": "Kevin Johnson", "0508848": "Julienne Liberto", "0551349": "Amy Marston", "2552508": "Sara Pasqualone", "1907551": "Anna Fausta Primiano", "0724844": "Clive Riche", "1368934": "Rebekah Staton", "1687370": "Simone De Marinis", "3652766": "Carlotta Montanari", "10023401": "Lorenzo Tirittera"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["55"],  "plot": ["Lucius Vorenus, the power-hungry \"Son of Hades\", controls the Aventine but practices a pointless, beastly reign of terror, coming down hard on gang captains for futilities, and nearly ruins his friendship with Pullo, whose efforts to calm things down are mistaken for disrespect and disobedience, even starts a fight once he learns the truth about Niobe; Pullio leaves Rome disgusted. After Atia convinces Marc Antony the governorship of ghastly Macedonia after his consulate would not only be unpleasant but leave him exposed to his dangerous enemies, he puts the heat on senatorial leader Cicero to give him Gaul instead, which once was the base for Julius Caesar's coup d'état. The slave Duro endures male prostitution but most arrogantly demands extra pay and even a kiss from Servilia as it will take more time to commit the planned murder in Atia's home. Marc promises Atia not to hurt Octavian, whose recruiting he calls a joke, after putting down his party's expected plot. Brutus has a hard time controlling himself while soliciting the Bithynian king's financial support to raise an army. Instead of proposing Antony for governor of Gaul, Cicero sends an extremely insulting speech and joins Octavian's growing army.—Anonymous", "After appointing himself a \"Son of Hades,\" Lucius Vorenus takes over the Aventine in place of the late Erasmus Fulman. Still consumed by his dark rage, he explodes when he considers a difference of opinion with Pullo to be a challenge to his authority, and they have a violent falling-out. In their chess game of venomous revenge, Servilia makes her next deadly move on Atia, using a hired assassin, named Duro, the Julii houseboy. Timon grows ever more suspicious of his brother Levi's activities in the city. An angry, dejected Pullo tries to leave Rome, but returns to make peace with Lucius, only to learn some shocking news regarding Lucius' family that his children are alive and have been sold into slavery. Far from Rome in the province of Bithynia (eastern Turkey), the nomadic Brutus finds it rough going trying to raise an army to go against Mark Antony. Back in Rome itself, Antony is angling for the governorship of Gaul, which he will not gain without the support of the Senate or Cicero's coerced compliance. Also, Octavia has a meeting of minds with the dashing Marcus Vipsanius Agrippa, the general of Octavian's new army. The tide turns, but in an unexpected way for Antony, when Cicero finally gives him his answer... leading to Anthony taking matters in his own hands.—Christopher Chase", "Vorenus continues to rule the criminal underworld, but faces challenges to his authority. He and Pullo have a falling out and Pullo leaves Rome with Eirena, only to receive shocking news about Vorenus' children who are not dead at all but alive and that Erasmus in fact lied about killing them and instead sold them into slavery. Atia grows increasingly concerned at the grim prospects of living in Macedonia, Marc Antony's destination as Governor when his Consulship is complete. Servilia continues to plot against Atia by planting an assassin in her household. Word of Octavian's growing army reaches Rome leading to the grim prospect of another civil war.—garykmcd"], "genres": "N/A", "imdbID": "0901371", "rating": 8.1, "votes": 2254, "number_of_episodes": 22}