{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0174403": "Kerry Condon", "0733196": "Zuleikha Robinson", "1263986": "Max Pirkis", "0051394": "David Bamber", "1203457": "Lyndsey Marshal", "1969169": "Rafi Gavron", "1493547": "Chiara Mastalli", "0512283": "Nigel Lindsay", "0355563": "Esther Hall", "0621382": "Michael Nardone", "0148738": "Daniel Cerqueira", "0573862": "Ian McNeice", "0929977": "Alan Williams", "0940245": "Nicholas Woodeson", "0090196": "Lee Boardman", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "2532589": "Dominic Atherton", "0083162": "Lidia Biondi", "2748916": "Nicolo Brecci", "2548409": "Alessio Cuna", "0211767": "Edward de Souza", "0278687": "Federico Firmani", "0299289": "Cosimo Fusco", "0327347": "Giacomo Gonnella", "0402898": "Kathryn Hunter", "0508848": "Julienne Liberto", "0551349": "Amy Marston", "0577568": "Michele Melega", "0655398": "Federico Pacifici", "2552508": "Sara Pasqualone", "1907551": "Anna Fausta Primiano", "0724844": "Clive Riche", "2749612": "Javier Torrecillas", "7736837": "Liliana Mele", "0209922": "Umberto De Luca", "1687370": "Simone De Marinis"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["53"],  "plot": ["Even though his wife and children are avenged by the Erastes killing, Lucius Vorenus keeps mourning for over a month till Pullo gets Marc Antony who scolds him for Caesar's death and the continuing bloody Aventine gang riots that have resulted in the gangs wanting to fill the void left by Erastes sudden demise. Octavian is losing patience with Marc Antony for payment of Caesar's inheritance. Meanwhile, Queen Cleopatra of Egypt arrives in Rome to pay her respects to Caesar and she also negotiates with Antony's military protection for her Pharaonic throne in exchange for valuable grain shipments. But she gets dismissed as a whore when she demands that her four-year-old son, Caesarion, be recognized as Caesar's legal son. Yet the uninvited pair of them is welcomed by Antony at Atia's party. Abusing a truce in the name of the goddess Concord and smashing up her statue, Vorenus imposes as 'son of Hades' on the gang captains a peace, paid off by Antony so trade and politics on and near the Aventine no longer get disrupted. After his mother Atia and sister Octavia tell him to accept Antony denying Caesar's legacy and laugh at his ambition to provide Rome the leadership it needs, Octavian borrows against his vast inheritance to buy popularity by paying for Caesar's lavish bequests to the populace; Antony violently refuses a political deal with him. Octavian then leaves home and retires to Campania with General Agrippa. Cicero and Brutus' mother, Servilia, hope this strife among the Julii clan will allow their party to return to Rome. Also, Timon's long-lost brother, Levi, arrives back in Rome wanting his help to make a new life for himself.—KGF Vissers", "Gangs are now fighting for control of the streets. With the news that his children are dead however, Vorenus is in a deep depression and has taken to his bed. Pullo seeks Marc Antony's assistance and Vorenus decides to take control of the gangs of Rome, describing himself as the son of Hades. Meanwhile, Octavian has yet to receive his inheritance and Marc Antony seems to be in no hurry to pursue it on his behalf. Octavian makes a firm decision to enter public life and decides to borrow the money to pay Caesar's legacies but, following a dispute with his mother Atia and Marc Antony, he leaves Rome.—garykmcd"], "genres": "N/A", "imdbID": "0901369", "rating": 8.4, "votes": 2342, "number_of_episodes": 22}