{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "1373034": "Simon Woods", "2054115": "Coral Amiga", "0090196": "Lee Boardman", "0377844": "Guy Henry", "0751950": "Camilla Rutherford", "0078136": "Suzanne Bertish", "1969169": "Rafi Gavron", "0051394": "David Bamber", "0621382": "Michael Nardone", "0940245": "Nicholas Woodeson", "1395602": "Allen Leech", "2171441": "Alex Wyndham", "0512283": "Nigel Lindsay", "0573862": "Ian McNeice", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "2532589": "Dominic Atherton", "0083162": "Lidia Biondi", "2532608": "Russell Byrne", "2548409": "Alessio Cuna", "0508848": "Julienne Liberto", "0511580": "Andy Linden", "0551349": "Amy Marston", "2552508": "Sara Pasqualone", "1907551": "Anna Fausta Primiano", "0796192": "Nuccio Siano", "2547145": "Simon Smith", "1368934": "Rebekah Staton", "0460037": "Romuald Andrzej Klos"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["51"],  "plot": ["Having learned that Vorenus' children are alive, Pullo sets off to find him in Gaul where he is again a serving soldier in Mark Antony's army. He had hoped to arrive before Octavian and Antony's armies meet in battle. Too late however, he is forced to find what is left of Antony's army in the mountains. He finds Vorenus alive and well, if somewhat battle worn, and they set off to find the children. The victorious Octavian plans his return to Rome. In Western Turkey, Brutus and Cassius amass their own army, now 9 Legions strong. In Rome, Servilia's attempt to kill Atia fails and Atia has her kidnapped tortured beyond what even her henchman Timon can stand.—garykmcd", "Servilia's plan to assassinate Atia backfires, with horrific circumstances when Atia's servant Althea accidentally tastes a bowl of poisoned stew before Atia samples it. Atia has Timon and his men abduct Servilia and subject her to hours of physical and degrading torture. But the brutal punishment Atia desires against her mortal enemy is one too many atrocities for Timon, who finally snaps, frees the physically and emotionally broken Servilia, and ends his contentious relationship with Atia at the advice of his brother Levi. In Gaul, with help from the grown-up Octavian, Titus Pullo seeks out Lucius Vorenus on the bloody battlefields where Octavian's armies have nearly wiped out the rebel Marc Antony's legions. Once he finds Vorenus, Pullo sets off with his friend to find and rescue Vorenus' family, sold into slavery. Charged with hand-delivering a message to Octavia, a love-struck Agrippa jumps at the chance to see her again. Meanwhile, Cicero balks at the news that Octavian is returning with his legions to Rome, and leaving the bloodied, but unbeaten, Antony's forces ready to fight another day. In a remote province in Asia Minor, Brutus continues building his own army to retake Rome and destroy both Octavian and Anthony's forces. Working together again as friends and \"brothers\", Titus and Lucius accomplish their urgent mission with a little intimidation and violence against the slave mine procurator.—Christopher Chase (cchase@onebox.com)"], "genres": "N/A", "imdbID": "0901370", "rating": 8.4, "votes": 2283, "number_of_episodes": 22}