{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0174403": "Kerry Condon", "1373034": "Simon Woods", "0733196": "Zuleikha Robinson", "0890055": "Indira Varma", "1203457": "Lyndsey Marshal", "0940245": "Nicholas Woodeson", "1395602": "Allen Leech", "2171441": "Alex Wyndham", "0573862": "Ian McNeice", "0751950": "Camilla Rutherford", "0148738": "Daniel Cerqueira", "0621382": "Michael Nardone", "0929977": "Alan Williams", "2054115": "Coral Amiga", "0355563": "Esther Hall", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "2360755": "Maxim Baldry", "0083162": "Lidia Biondi", "2772419": "Noa Bodner", "2758603": "Stefan Brown", "0201805": "Kammy Darweish", "0254879": "Jack Ellis", "2466446": "Alice Henley", "0402898": "Kathryn Hunter", "2749612": "Javier Torrecillas", "2756556": "Valery Usai", "7736837": "Liliana Mele"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["60"],  "plot": ["Seven years have passed since Antony's departure from Rome, and the former commander, dissipated and debauched - held in thrall by the charms and sexual prowess of his new bride, Cleopatra, withholds precious shipments of grain from Rome, where people die in the streets from hunger. Unable to incite a war with Antony and Egypt without committing political suicide, Octavian sends Atia and Octavia to Alexandria to mediate and reason with Antony; a strategy which proves predictably unsuccessful. However, former Roman senator Posca and his wife, Jocasta, flee Alexandria with Atia and Octavia to Rome where he provides Octavian with all the ammunition he needs to bring about a war with Antony and Cleopatra. Meanwhile, Pullo has taken over the Avantine gangs of Rome. But later, a fatal blow is stricken to the torrid affair that has continued between Pullo and Gaia, as karmic debt comes to call when she saves him from the sadistic Memmino, but gets fatally wounded, and she lets it slip to Pullo that she was the one who poisoned Eirene. Octavian asks Pullo to join him in the campaign against Egypt, and Pullo agrees without question, hoping to reunite and redeem his blood brother, Vorenus, who continues to stand by Antony's side despite his growing contempt for his commander. Octavian calls for war against Antony in the Senate, and is met with thunderous approval.—Christopher Chase (cchase@onebox.com)", "The people of Rome are starving and there seems to be little anyone can do about it. Pullo is in charge of the Aventine now that Vorenus has accompanied Mark Antony to Egypt and he's doing his best to equitably distribute what little food he has available. He even visits Octavian who can't help him or any of his people. Octavian's biggest problem is that the people blame him for the food shortage and not Mark Antony who has withheld their grain shipments. He decides to send Atia and Octavia to Alexandria to plead with him but Antony - after several years living with Cleopatra - is drug-addled and infatuated with Egyptian queen and he refuses to see them. Just as Octavian had hoped. In Rome, Pullo is attacked by Memmio who he has been keeping caged, like an animal. Gaia comes to his rescue but is seriously wounded in the process. A deathbed confession as she lay dying does her no good however.—garykmcd"], "genres": "N/A", "imdbID": "0901367", "rating": 8.6, "votes": 2222, "number_of_episodes": 22}