{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "1373034": "Simon Woods", "0733196": "Zuleikha Robinson", "0051394": "David Bamber", "0377844": "Guy Henry", "1395602": "Allen Leech", "2171441": "Alex Wyndham", "1493547": "Chiara Mastalli", "0751950": "Camilla Rutherford", "0929977": "Alan Williams", "0090196": "Lee Boardman", "0512283": "Nigel Lindsay", "0940245": "Nicholas Woodeson", "0148738": "Daniel Cerqueira", "0621382": "Michael Nardone", "2054115": "Coral Amiga", "0700856": "James Purefoy", "0355563": "Esther Hall", "2352847": "Chris Anderson", "0031357": "Giorgio Antonini", "2548409": "Alessio Cuna", "0208757": "Adriana De Guilmi", "0229943": "Vernon Dobtcheff", "0278687": "Federico Firmani", "0299289": "Cosimo Fusco", "1745207": "Ian Gunn", "0353184": "Linal Haft", "0411194": "Valerio Isidori", "0551136": "Rocky Marshall", "1294002": "Niko Nicotera", "0724844": "Clive Riche", "0796192": "Nuccio Siano", "2586532": "Julian Stolzenberg", "0851089": "Daniel Tatarsky", "2756556": "Valery Usai", "0895812": "Ronan Vibert", "2661064": "Ilir Jacellari", "2181131": "Marco Pancrazi"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["56"],  "plot": ["Cicero is finally undone by his duplicity in the form of Titus Pullo, acting upon Octavian's request to assassinate all supporters of Brutus in Rome. Pullo and Vorenus enjoy a happy if counterfeit outing with their families in the countryside to hide their assassin mission. Vorena the Elder's dangerous dalliance with one of Mimeo's men continues, and the torrid affair between Octavia and Agrippa escalates. Atia's casual cruelty to ask for the assassination of people she doesn't like results in complete disaster for Octavia's friend Jocasta. Elsewhere, the headstrong Levi engages Timon in a plan to assassinate King Herod by recruiting in the synagogue where they worship. Disastrously out manned, Brutus and Cassius engage the combined legions of Mark Antony and Octavian, and confront their fates in the ferocious battle at Philippi.—Christopher Chase (cchase@onebox.com)", "Cicero realizes that young Octavian has tricked him and he openly sides with Brutus and Cassius who are amassing an army in Greece, inviting them to return to Rome. It presents a very real problem for Octavian whose four Legions are vastly outnumbered. His mother Atia has a solution however: make peace with Mark Antony and unite their forces to attack their enemy in Greece. They do make their peace with one another but also agree there is a need to eliminate their enemies before setting off for battle. Even Atia seizes the opportunity. Octavian specifically tasks Vorenus and Pullo to eliminate Cicero, which is done when they take their families on picnic in the countryside. When the the two armies finally meet at Philippi, Octavian and Antony have a resounding victory. On the Avantine meanwhile, Vorena makes the acquaintance of an attractive man.—garykmcd"], "genres": "N/A", "imdbID": "0836442", "rating": 8.7, "votes": 2364, "number_of_episodes": 22}