{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "0890055": "Indira Varma", "0051394": "David Bamber", "0006522": "Haydn Gwynne", "0377844": "Guy Henry", "0078136": "Suzanne Bertish", "0290693": "Anna Francolini", "1493547": "Chiara Mastalli", "0186475": "Lorcan Cranitch", "0355563": "Esther Hall", "1263986": "Max Pirkis", "0573862": "Ian McNeice", "0912012": "Rick Warden", "0940245": "Nicholas Woodeson", "2054115": "Coral Amiga", "0090196": "Lee Boardman", "0001354": "Ciarán Hinds", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "0055291": "Tim Barlow", "0083162": "Lidia Biondi", "2548409": "Alessio Cuna", "1907551": "Anna Fausta Primiano", "0801043": "Jay Simpson", "2261123": "Roberto Sgarbi", "1953162": "David Toole"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["57"],  "plot": ["In the wake of Caesar's death, Mark Antony considers a move north, while Vorenus issues a curse he soon regrets.", "Picking up exactly where Season One left off on the Ides of March, 44 BC, Caesar has been assassinated, stabbed to death, and his bloody corpse lays in the senate. The rapidly spreading news shocks the city. Even consul Marc Antony must run to the safety of Atia's house where he swears to take bloody revenge on Caesar's murderers, but for the time flees with Caesar's family to the north. But Octavian keeps a cooler head then his mother. Calpurnia insists on the private reading of Caesar's will, which names Gaius Octavian as his adopted son and full heir and makes a gift to each citizen while freeing Posca (the slave who reads it out) with a stipend, but they must fear a rightful tyrannicide will be declared allowing full confiscation. Octavian points out legally declaring Caesar a tyrant would also invalidate all his deeds, including mandates held from him, so Brutus' followers have an interest in a full pardon instead. Hearing about Vorinus accidental killing of Niobe, Pullo rushes to his aid. Meanwhile, Cicero first congratulates Brutus's side, then pays his respects to surprise visitor Marc Antony who presses Octavian's legal logic means elections are necessary, claims Caesar's popular following and offers stability by a deal: Caesar is to be given a state funeral, the republic simply resumes and all terms of office continue. Despite Cicero's suggestion to kill Antony instead, Brutus accepts. Romans massively attend Caesar's funeral pyre; after the speeches, Brutus who was too cerebral is clearly out of popular favor, inspiring retort Marc Antony in. Elsewhere, Vorenus reclaims his children with Pullo, and kills Flavio and his master who admits having raped and killed them.—KGF Vissers", "Caesar has been assassinated and the news spread quickly throughout the city. Marc Antony escapes his attackers, going directly to Atia's house. Antony suggests a general amnesty to Caesar's killers in order to keep the peace. He also urges them to leave the city for their own safety. But Octavian has other plans and suggests that they stay in Rome and sets a cunning plan to turn the tide of public feeling against Brutus and his men. Caesar's last will and testament is read and Octavian is named as his sole heir to the Roman Republic. Meanwhile, Vorenus is grieving in a state of madness at the death of Niobe, but Pullo comes to his aid. But Vorenus issues a curse which leads to further tragedy.—garykmcd"], "genres": "N/A", "imdbID": "0854006", "rating": 8.7, "votes": 2554, "number_of_episodes": 22}