{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0580014": "Tobias Menzies", "0174403": "Kerry Condon", "1373034": "Simon Woods", "0733196": "Zuleikha Robinson", "2054115": "Coral Amiga", "0355563": "Esther Hall", "0051394": "David Bamber", "0377844": "Guy Henry", "0148738": "Daniel Cerqueira", "0090196": "Lee Boardman", "0512283": "Nigel Lindsay", "0895812": "Ronan Vibert", "1395602": "Allen Leech", "0751950": "Camilla Rutherford", "2171441": "Alex Wyndham", "0078136": "Suzanne Bertish", "1493547": "Chiara Mastalli", "0621382": "Michael Nardone", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "0083162": "Lidia Biondi", "2548409": "Alessio Cuna", "0299289": "Cosimo Fusco", "0660080": "Paolo Paoloni", "0724844": "Clive Riche", "2756556": "Valery Usai", "2544665": "Christopher Sciueref", "3102178": "Maurizio Pulina"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["59"],  "plot": ["Vorenus and Pullo return to the Collegium in Rome with Vorenus' family, but some of the \"changes\" that Pullo had warned him about regarding his two daughters Vorena both the Elder and Younger, as well as his wife's son, begin to manifest themselves into hostility and resentment. But Vorenus is completely oblivious to this, and is too blissfully happy to return to the role of 'father'. Meanwhile, Octavian finally returns and manages to negotiate the Senate Consul's seat from a scheming Cicero, but in spite of his promise to 'faithfully follow' the older man's counsel, Octavian proves that he certainly has a mind of his own, vowing to hunt down and kill the assassins of Julius Caesar, much to Cicero's consternation. Elsewhere, Brutus and Cassius receive news that might prove useful in staging a triumphant return to Rome, as well as the ultimate defeat of both Mark Antony and Octavian's forces. Also, Atia has a reunion with her son that is strained to say the least, but there is a tentative reconciliation between them. And another, much less stressful reunion between two lovers, Octavia and Agrippa, who saves her from an attempted date-rape at an orgy party, will bring about an unforeseen alliance between two formerly mortal enemies.—Christopher Chase (cchase@onebox.com)", "Vorenus and Pullo return to Rome having rescued the children from slavery taking up his old post in the Aventine Collegium. He's a changed man however and is happy with his family but does not realize the enmity his children feel towards them. They clearly blame him for their suffering and eldest daughter Vorena plans to run away with her two younger siblings as soon as she has some money. Meanwhile, Octavian has returned to Rome with his army and manages to convince Cicero that they can work together provided Octavian is made Consul. When Octavian's first act as Consul is to declare Brutus and Cassius as enemies of the state, Cicero realizes he has been duped and begins to plot against him. Atia is up to her old tricks and reconciles with her son but clearly has other ends in mind. Daughter Octavia continues to carouse with the wild Jocasta but is rescued from an orgy by the smitten Agrippa.—garykmcd"], "genres": "N/A", "imdbID": "0901368", "rating": 8.2, "votes": 2189, "number_of_episodes": 22}