{"cast": {"0829032": "Ray Stevenson", "0571727": "Kevin McKidd", "0908116": "Polly Walker", "0174403": "Kerry Condon", "1373034": "Simon Woods", "0733196": "Zuleikha Robinson", "1395602": "Allen Leech", "2171441": "Alex Wyndham", "0940245": "Nicholas Woodeson", "0751950": "Camilla Rutherford", "0090196": "Lee Boardman", "0573862": "Ian McNeice", "1493547": "Chiara Mastalli", "0621382": "Michael Nardone", "0148738": "Daniel Cerqueira", "0895812": "Ronan Vibert", "0929977": "Alan Williams", "2054115": "Coral Amiga", "1203457": "Lyndsey Marshal", "0700856": "James Purefoy", "2532589": "Dominic Atherton", "2360755": "Maxim Baldry", "0083162": "Lidia Biondi", "2548409": "Alessio Cuna", "0226589": "Kevin Dignam", "0267003": "Tim Faraday", "0299289": "Cosimo Fusco", "2466446": "Alice Henley", "0483457": "Anne Lambton", "0508848": "Julienne Liberto", "0551136": "Rocky Marshall", "0551349": "Amy Marston", "0601105": "Deborah Moore", "2552508": "Sara Pasqualone", "2756556": "Valery Usai", "7736837": "Liliana Mele"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["57"],  "plot": ["Octavian takes a new bride, Livia, and then introduces her to his family in a startling way... by having her witness the punishment he metes out to Atia and Octavia, for secretly defying the social constraints established through the facade of Octavia's \"marriage\" to Mark Antony. The vengeful Gaia carries out her plan to poison Eirene, which produces most dire consequences for Pullo, and no one else is the wiser. Meanwhile, Octavian, Antony, Maecenas, and their associates barely maintain their relationships of congenial contempt and hypocrisy, as everyone tries to figure out who has duped whom with the disappearance of the gold that was Herod's 'gift.' Now forced by Octavian to leave Rome to serve as an 'ambassador' to Egypt, Antony defies the conditions of Atia's house arrest to bid her a bittersweet farewell. The same can be said of Agrippa, who learns some startling news as he severs his relationship with Octavia. Timon also decides to move with his family to Judia to start a new life over for themselves. With the theft of the gold, Lucius and Pullo suspect and accuse a badly-wounded Mascius of having engineered a double-cross, but the real traitor of Vorenus' gang comes to shocking light which is the eldest Vorena. Now having pinpointed Memmio as the real culprit, Pullo takes the group to meet for a parlay with the devious captain and his cohorts, resulting in swift and bloody retribution for the traitors. A despondent Vorenus, his family fractured once again, begs Antony to allow him to come to Egypt, and finds his offer grudgingly accepted. Antony returns to Egypt and is reunited with the seductive Cleopatra.—Christopher Chase (cchase@onebox.com)", "Vorenus and Pullo are tasked by Octavian to safely deliver a large shipment of gold that will soon arrive in Rome. Octavian specifically asks for Pullo to meet the shipment en route but he is unable to do so when Eirene has a miscarriage and is lying on her death bed. What he doesn't know is that Gaia has poisoned her. Now Vorenus has to decide if Mascius, who replaced Pullo on the job, betrayed them or if there is another leak in his organization. He soon realizes where the leak is and the impact is devastating. Octavian meanwhile is shocked to hear that Mark Antony's marriage to his sister Octavia is a sham and that Antony and his mother are still lovers. He orders Antony to the East and places Atia and Octavia under house arrest. Octavian has also decided the time has come come to take a bride and selects the young Livia.—garykmcd"], "genres": "N/A", "imdbID": "0901364", "rating": 8.6, "votes": 2213, "number_of_episodes": 22}