{"cast": {"0571727": "Kevin McKidd", "0829032": "Ray Stevenson", "0908116": "Polly Walker", "0242026": "Lindsay Duncan", "0174403": "Kerry Condon", "1373034": "Simon Woods", "0733196": "Zuleikha Robinson", "1395602": "Allen Leech", "2171441": "Alex Wyndham", "0078136": "Suzanne Bertish", "1493547": "Chiara Mastalli", "0573862": "Ian McNeice", "0751950": "Camilla Rutherford", "0090196": "Lee Boardman", "0512283": "Nigel Lindsay", "0148738": "Daniel Cerqueira", "0621382": "Michael Nardone", "0940245": "Nicholas Woodeson", "2054115": "Coral Amiga", "0895812": "Ronan Vibert", "0700856": "James Purefoy", "0019681": "Manfredi Aliquo", "2532589": "Dominic Atherton", "0083162": "Lidia Biondi", "2757298": "Stefano Consolini", "1982463": "Mimmo Esposito", "0333868": "Stefano Gragnani", "0400406": "Tyrone Huggins", "0483457": "Anne Lambton", "0508848": "Julienne Liberto", "0551136": "Rocky Marshall", "0551349": "Amy Marston", "2552508": "Sara Pasqualone", "0750369": "Alessandro Ruo", "1968207": "Giannina Salvetti", "2756556": "Valery Usai", "0951843": "René Zagger", "1687370": "Simone De Marinis", "0548020": "Al Mariotti"}, "geners": ["Action", "Drama", "Romance", "War"], "runtimes": ["57"],  "plot": ["Inconsolable at the death of Brutus at Philippi, Servilia makes her final bid to gain the ultimate vengeance against Atia. Meanwhile, Eirene and Gaia have a major falling-out, prompting Eirene to demand that Pullo properly chastise the slave. When he does, the dynamic between the two of them changes in a violent and unexpected fashion. King Herod engages Mark Antony as a reluctant ally by offering a generous gift of 20,000 pounds of gold, and when Posca is excluded from sharing in the windfall, he engineers a move behind-the-scenes that will once again strain the uneasy truce between Octavian and Antony. Vorenus eldest daughter, Vorena, is blackmailed by Mascius into spying on her father after her tryst with one of his men is discovered. The end of two love affairs and a marriage in the house of Julii have major ramifications for life in the city and on the Aventine when Octavian insists on the courtship between Octavia and Mark Antony which irks both Atia and Agrippa. Also, a desperate move to assassinate Herod finishes the relationship between contentious siblings Timon and Levi when they have a falling out, and Levi gets killed by accident.—Christopher Chase (cchase@onebox.com)", "Servilia is despondent over the loss of her son and places a curse on Atia. Timon and his brother Levi plot to kill Herod, who is visiting Rome. Caesar, Antony and Lepidus agree to administratively divide the Empire into three parts, but to share all revenues equally. When Caesar learns that Antony has secretly accepted a huge bribe from King Herod, the future of the triumvirate is threatened. At Atia's suggestion, Caesar agrees that marriage would strengthen the family's bond with Antony, but Caesar's solution isn't quite what Atia had in mind for he offers Octavia's hand to Antony. Vorenus' eldest daughter is blackmailed by Mascius into spying on her father's business activities after her tryst with one of his men is discovered. Pullo meanwhile, is having problems of his own with the pregnant Eirene who wants him to chastise Gaia, who plots revenge... against Eirene.—garykmcd"], "genres": "N/A", "imdbID": "0901366", "rating": 8.1, "votes": 2178, "number_of_episodes": 22}