{"cast": {"2070427": "Tom Mison", "2718512": "Nicole Beharie", "0428963": "Orlando Jones", "2316016": "Katia Winter", "3442405": "Lyndie Greenwood", "0327764": "Nicholas Gonzalez", "2804164": "Marti Matulis", "1092223": "Matt Medrano", "2419686": "Michael Teh", "0055499": "Avis-Marie Barnes", "4744083": "Angela Bond", "0123148": "Pete Burris", "4327510": "Christy Grantham", "1428867": "Mary Kraft", "2909891": "David Kronawitter", "3129928": "Alex Livinalli", "5066378": "D.J. Mifflin", "3827874": "Michelle Rivera", "2301296": "India Scandrick", "4360783": "Jahneé Castro", "5234956": "Steve Baldwin", "5648784": "Kristi Booher", "0000317": "Clancy Brown", "4418826": "Carolyn Foland", "5596902": "Joseph Milton Hodges Jr.", "5596670": "Joseph Milton Hodges Sr.", "5596607": "Nancy Rouse Hodges", "6280394": "Josh Tipis"}, "geners": ["Action", "Adventure", "Crime", "Drama", "Fantasy", "Horror", "Mystery", "Thriller"], "runtimes": ["45"],  "plot": ["Yet another soldier in the army of evil, the Sandman, seeps into the dreams of the residents of Sleepy Hollow. By infiltrating their minds at night, he tortures them to the brink - all because they, at one time, turned a blind eye to justice. When the Sandman seemingly sets his sights on Abbie, she is forced to begin to face her past - and her institutionalized sister, Jenny. With Ichabod by her side, and her life at stake, the duo must try to defeat the Sandman and continue their fight against evil.—FOX", "Several villagers commit mysterious suicides after asking for or blaming Mills, whose presence makes no difference, and say 'we all got it coming' or refer to the sandman. Ichabod works out they all saw the same ghostly male figure as Abbie and her sister Jenny the bloody night they were orphaned. Ichabod has to force Abbie to face her childhood trauma and consult her sister on the spooky sandman. After consulting the late sheriff's notes and general Washington's Bible, they realize it's a mythical Mohawk dream spirit. Only a shaman can help them, if one is still to be found.—KGF Vissers"], "genres": "N/A", "imdbID": "3154436", "rating": 7.6, "votes": 1345, "number_of_episodes": 62}