{"cast": {"2070427": "Tom Mison", "2718512": "Nicole Beharie", "3442405": "Lyndie Greenwood", "1223023": "Nikki Reed", "0815370": "Shannyn Sossamon", "3463736": "Zach Appelman", "2342614": "Lance Gross", "2464250": "Maya Kazan", "5928076": "Alexander Ward", "1006439": "Charlene Amoia", "3750115": "Viviana Chavez", "0346415": "Nicholas Guest", "3332649": "Ethan Henry", "2123551": "Anthony K. Hyatt", "2244220": "Juan-Pablo Veizaga", "7008538": "Stephen Dean", "6354707": "Devan Gerlach", "4995103": "Michael Koske", "5567496": "Chris Matheny", "5009680": "Andrew S. McMillan", "8032520": "Daniel Patrick Shook", "6352932": "Lena Sledge", "2218291": "Onira Tares"}, "geners": ["Action", "Adventure", "Crime", "Drama", "Fantasy", "Horror", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Past deeds return to give Crane, Abbie & Jennie reasons to come clean.", "Abbie understands the tablet has meaning and several past deaths are but a prelude to the second Tribulation. A new player is drawn to secrets and fear like a moth to the flame. Crane moves in with Abbie as he looks for a place but his \"Bedfordshire Clapper\" does not get any applause. The death of Paul Everett, a 30-something guy on his phone with the FBI as he was quite literally, scared into a heart attack, is the first case. Abbie encounters her new FBI boss, Daniel Patrick, an agent with whom Abbie went to the Academy. Even Crane senses there is history between them. Crane deduces several facts which tie the death of Everett and another man to 1776. Using old memories and past manuevers with a very old flame, Betsy Ross, Crane uncovers strategy to defeat \"the wraith,\" as he and Abbie call it. Abbie and Crane try to keep a third victim out of shadows and away from the wraith. Joe Corbin, the son of Sheriff August Corbin, is kidnapped by a thug named Randall. Jenny has to settle Randall's hash, and (claims to) give him the Shard of Anubis to keep Joe safe. Crane puts a name to a wraith and the two put a name and a face to woman and box. Past weaknesses teach the Witnesses the importance of integrity for all centuries.—LA-Lawyer"], "genres": "N/A", "imdbID": "4806140", "rating": 7.3, "votes": 523, "number_of_episodes": 62}