{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0728346": "Michael Rispoli", "0012178": "Jerry Adler", "0893247": "John Ventimiglia", "0621393": "Kathrine Narducci", "0002326": "Al Sapienza", "0220867": "Anthony DeSando", "0522797": "Chuck Low", "0251999": "Ned Eisenberg", "0005576": "Drea de Matteo", "0029512": "Sharon Angela", "0045007": "Oksana Lada", "0213732": "Michele DeCesare", "0508904": "Sig Libowitz", "1478707": "Sasha Nesterov", "0672271": "Bernadette Penotti", "0774833": "Slava Schoot", "0868125": "Angelica Page", "0876101": "Joseph Tudisco", "0934397": "Jennifer Wiltsie", "1477834": "Joshua Benevento", "1477938": "Joanne Caselli", "1016093": "Richard Davis", "1478171": "Steve Ferrara", "1478201": "Margie Freeswick", "1478265": "Scott Greco", "0420872": "Jennifer Jenkins", "1478442": "Caroline Killian", "1478765": "Simone Peart", "1478903": "Kristen Schmalz", "0973822": "Danielle Spezzacatena", "0973823": "Michelle Spezzacatena", "1479090": "Jennifer Vohs"}, "geners": ["Crime", "Drama"], "runtimes": ["45"],  "plot": ["Tony encourages an unwanted son-in-law to divorce, Carmela learns another secret of Tony's, Meadow experiments with speed to study for the SATs, and Chris and Brendan find out the price of disrespecting Junior.", "Christopher and Brendan return the truckload of stolen suits but Uncle Junior wants to send a clear message. Jackie Aprile is continuing with his chemotherapy and Tony has a special present for him. Meadow has been working hard at school and tries to get Christopher to supply her with crystal meth to keep her going while she studies for the SATs. A local hotel owner seeks out Tony's help in dealing with his son-in-law who is refusing to give the man's daughter a divorce unless he gets half of the family business. Silvio and Paulie pay him a visit but he's proving to be just a little hard to convince. Carmela hosts a fund-raiser catered by their friends Artie and Charmaine Bucco, who still haven't been able to collect on the insurance from the restaurant fire. Charmaine has something interesting to tell her.—garykmcd", "Tony accepts a job through Silvio to convince the son-in-law of a Hasidic hotel owner to get a divorce, preventing the son from muscling in on the father-in-law's business. The young man, however, proves difficult to convince. Carmela, meanwhile, hires Artie and Charmaine to cater at an auction being held at the Soprano house. Her disdainful treatment of them angers Charmaine, leading her to reveal a secret past she shared with Tony. As Meadow and Hunter prepare for a choir recital and the SATs, they find the workload overwhelming and turn to Chris to supply them with uppers. Chris agrees, deciding it's better they get it from him than some stranger who'll give them anything. Soon after, however, Chris and Brendan find themselves brought before the Russian mafia to answer for their past actions.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705239", "rating": 8.5, "votes": 11356, "number_of_episodes": 86}