{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0002029": "Maria Grazia Cucinotta", "0002326": "Al Sapienza", "0776584": "Paul Schulze", "0785854": "Matt Servitto", "0045935": "Joseph Badalucco Jr.", "0248847": "John Eddins", "1479051": "Touche", "0314467": "Kareen Germain", "1365083": "Johnathan Mondel", "0640081": "Jack O'Connell", "1020152": "Katalin Pota", "1478845": "Denise Richardson", "0749311": "Sal Ruffino", "0909143": "Bittu Wallia", "0927986": "David Wike", "0299322": "Robin Fusco", "0526986": "Robert LuPone"}, "geners": ["Crime", "Drama"], "runtimes": ["48"],  "plot": ["The stress Tony is going through begins to take its toll, and the hit Junior has ordered doesn't help.", "Tony is highly depressed and can hardly get himself out of bed in the morning leading Dr. Melfi to add to his medication. He practically lives in his bathrobe and the only ray of sunshine is the beautiful and voluptuous Italian dentistry student house-sitting for his next door neighbors, the Cusamanos. He later realizes that the beautiful woman next door is not really as she appeared to be. He drags himself to his sessions with Melfi and it's after one of these that Uncle Junior's less than capable hit men make their try against Tony. He survives and for public consumption, Tony tells the police it was an attempted car-jacking. The attempted hit seems to invigorate Tony who is pretty sure he knows who was behind it all. All he needs is proof to start settling accounts.—garykmcd", "Tony, unable to decide who he can trust, begins feeling more stressed than before. One day, he talks with a beautiful woman in Dr. Cusamano's backyard, and later has a dream about her breastfeeding a baby named Antonio. When it turns out that the woman was just a hallucination, Dr. Melfi theorizes that Tony is creating an ideal mother figure to make up for his less-than-ideal real mother. Meanwhile, the hit men Junior hires to take out Tony carry out their attempt. Tony is injured but survives, and his underlings discuss among themselves whether Junior is the one responsible.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705256", "rating": 9.1, "votes": 11060, "number_of_episodes": 86}