{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0893247": "John Ventimiglia", "0001334": "John Heard", "0621393": "Kathrine Narducci", "0002326": "Al Sapienza", "0677366": "Robyn Peterson", "0642560": "Kevin O'Rourke", "0201700": "Tony Darrow", "0045935": "Joseph Badalucco Jr.", "0692466": "Richard Portnow", "0420045": "Cara Jedell", "1446916": "Candace Bailey", "0865626": "Jackie Tohn", "0714426": "DonnaMarie Recco", "0049319": "Nell Balaban", "1477830": "Moises Belizario", "1478025": "Mary Ellen Cravens", "0215980": "Elaine del Valle", "0272617": "Steve Ferguson", "1478291": "Brian Guzman", "0367102": "Mark Belasco", "0404086": "Patrick Husted", "1478399": "Marissa Jedell", "0640399": "Joyce Lynn O'Connor", "0673674": "Annika Pergament", "0618639": "John Nacco", "0935200": "Bill Winkler", "1636752": "Shashi Balooja", "0762022": "Mark Sandman"}, "geners": ["Crime", "Drama"], "runtimes": ["52"],  "plot": ["The capos discuss what to do about the local soccer coach, who is to be leaving New Jersey for a new job, while Junior's mouth causes him some embarrassment.", "Everyone seems to be under surveillance by the FBI. Uncle Junior decides to take a holiday with a girlfriend Roberta Sanfilipo. His biggest worry is that she might tell anyone about his particular skills when it come to oral sex. When Tony lets him know he knows all about it, Junior retaliates by letting it be known Tony's seeing a psychiatrist. He's also thinking of taking it a step further. Tony and several of the other men take an interest in the girl's soccer coach at their daughter's school. He's a good coach and they like him. They're upset when they read that he's leaving to coach a college team - until they learn he's sleeping with one of his students, Ally Vandermeed, who has attempted suicide. Larry Boy Barese and others are looking to move their moms into the same home as Livia - which is proving to be a great place to hide their money and others incriminating material.—garykmcd", "Meadow's soccer coach becomes popular with the fathers, including Tony and Silvio, because of his success in leading the girls to victory. When they hear that he may be leaving for another school, they start putting pressure on him to stay. Things get turned on their head, however, when it's discovered that he's involved in a relationship he shouldn't be in, and Tony ponders what role he should play in correcting the situation. Junior, meanwhile, warns his mistress not to tell anyone about his particular sexual talent, as he doesn't feel it's manly enough. She's already spilled the beans though, and word soon gets back to Tony. As the pair trade barbs during a golf game, Tony brings up Junior's secret, prompting Junior to bring up Tony's.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705231", "rating": 8.5, "votes": 9970, "number_of_episodes": 86}