{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0739087": "Richard Romanus", "0005576": "Drea de Matteo", "0002326": "Al Sapienza", "0201700": "Tony Darrow", "0521087": "George Loros", "0045935": "Joseph Badalucco Jr.", "0763883": "Frank Santorelli", "0178916": "Sam Coppola", "1310016": "Brian Geraghty", "0566489": "Will McCormack", "0186553": "Ed Crasnick", "0304430": "Joseph R. Gannascoli", "0351910": "Barbara Haas", "1079924": "Timothy Nolen", "1478495": "Barbara Lavalle", "1478496": "Robert Anthony Lavalle", "1169320": "Frank Pando", "0673674": "Annika Pergament", "1390542": "Brooke Marie Procida", "1160171": "Bill Richardone", "0785854": "Matt Servitto", "0810554": "Bruce Smolanoff", "2215590": "Anna Damergis", "0220867": "Anthony DeSando", "1261007": "Lynda Lenet", "0068633": "Vinny Vella"}, "geners": ["Crime", "Drama"], "runtimes": ["49"],  "plot": ["The FBI begins closing in on the DiMeo family. Tony and Carmela are angry over all the attention Italians get from the authorities, while Chris fumes that he's not getting enough attention.", "It's house cleaning time when Tony and his fellow mobsters learn at Larry Boy Barese daughter's wedding that the Feds are about to bring down indictments. Tony gets rid of whatever cash, jewelry and guns he has around the house. Carmela take Livia out for lunch while Tony goes into her room and hides the stuff. Christopher is upset with a number of things. He's having trouble with his movie screenplay and he's upset that his late friend Brendan has been making the local news as a Mafioso but he doesn't get a mention. Jennifer Melfi meanwhile mentions at a family dinner that she has a mobster as a patient. Her ex-husband doesn't like it. Livia tells Junior that Tony is seeing a psychiatrist.—garykmcd", "At the wedding of Larry Boy's daughter, the capos confer over the matter of increasing FBI scrutiny that could mean an impending crackdown. Junior insists that they continue business as usual, but Tony advises that they also get rid of anything incriminating. Soon after Tony sweeps through his house, the FBI shows up, detaining him and searching through his apartment. Chris, meanwhile, is angry that not only is the screenplay he's trying to write not progressing, Brendan is getting more notoriety dead than Chris is alive. His frustration leads to depression, culminating in him shooting a store clerk when the clerk tells him to wait in line everybody else. Elsewhere, Livia passes the word to Junior that Tony is seeing a psychiatrist.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705280", "rating": 8.5, "votes": 10115, "number_of_episodes": 86}