{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0728346": "Michael Rispoli", "0002326": "Al Sapienza", "0220867": "Anthony DeSando", "0005576": "Drea de Matteo", "0763883": "Frank Santorelli", "0137681": "Johann Carlo", "0909037": "Debrah Ellen Waller", "0258402": "Mike Epps", "0034733": "Yancey Arias", "0271127": "Tibor Feldman", "0505608": "Harvey Levin", "0709738": "Steven Randazzo", "0030925": "Kate Anthony", "0143782": "Anthony Caso", "0171470": "Victor Colicchio", "0369253": "Marcia Haufrecht", "2826895": "Desiree Kehoe", "0663332": "Michael Parr", "0711129": "Sharif Rashed", "0764377": "Charles Santy", "0605751": "David Moritt", "0803371": "Manny Siverio", "0412907": "J.D. Williams"}, "geners": ["Crime", "Drama"], "runtimes": ["50"],  "plot": ["Tony is getting fed up with his mother. Brendan Filone acts against Tony's wishes. Salvatore and Paulie try to track down A.J.'s teacher's stolen car.", "Christopher Moltisanti and his friend Brendan Filone hijack a truckload of DVD players but unfortunately the truck and the merchandise belongs to a company that is Uncle Junior's protection. He's not a happy man and it takes a sit down arbitrated by Jackie Aprile to calm things down. Christopher and Brendan don't like the results however. Brendan decides to go off on his own but it leads to a royal mess. Tony's mother has a fire in her kitchen, confirming in the minds of everyone except her that she can no longer live without some type of assisted care. They try a companion but that doesn't work. Tony goes back to plan A but continues to feel guilt over the situation. One of AJ's teacher has his car stolen out of the school parking lot and Tony decides to try and recover it for him. Big Pussy and Paulie are sent out to solve the problem.—garykmcd", "Chris and his friend Brendan hijack a truck carrying DVD players, without realizing that Tony's Uncle Junior has been collecting protection money from the trucking company. Boss Jackie, who's getting weaker from his cancer treatments and looking for a replacement, decides that Chris and Brendan must pay a heavy restitution to Junior, a judgment that does not sit well with the pair. Deciding to buck Tony's authority, they plan another hijacking. Tony's mother, meanwhile, is growing less able to care for herself, almost burning her house down in one incident, and driving over her friend in another. After an angry confrontation, Tony finally faces the decision he's been dreading of finally placing her in a nursing home. At the same time, Tony Jr's teacher has his car stolen, so Tony decides to call in a favor to maybe help his son's sagging grades.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705223", "rating": 8.2, "votes": 11712, "number_of_episodes": 86}