{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0797464": "Jamie-Lynn Sigler", "0012178": "Jerry Adler", "0005576": "Drea de Matteo", "0940158": "Bokeem Woodbine", "0045007": "Oksana Lada", "1156994": "Bryan Hicks", "1747088": "Nick Fowler", "1479103": "Gregg Wattenberg", "10665062": "Chris Gibson", "1478999": "Ned Stroh", "0690975": "Bray Poor", "0526986": "Robert LuPone", "1478064": "Jim DeMarse", "1140422": "James Weston", "0168083": "Phil Coccioletti", "0560198": "Terumi Matthews", "1478680": "Dan Morse", "0624661": "Alexandra Neil", "0699368": "Ken Prymus", "0763639": "Saundra Santiago", "0855843": "Jessy Terrero", "0870117": "Elizabeth Ann Townsend", "0877448": "Cedric Turner", "3892056": "Heather Whittington"}, "geners": ["Crime", "Drama"], "runtimes": ["53"],  "plot": ["Tony tries to branch out into legitimate investments, while Chris and Adriana decide to try their hands at music production.", "Christopher's girlfriend Adriana sees herself having a career in the music industry so a chance meeting with rap star Massive Genius seems to be the opportunity she's been looking for. Christopher is supportive but Genius has other goals in mind: he's out to get money from Hesh who he feels cheated an black artist 40 years ago and he definitely wants to get into Adriana's pants. Adriana has her eye on a group that she thinks is bound for stardom but no one else seems to agree. Tony meanwhile decides he wants to expand his circle of friends and focuses on his next door neighbor, Dr. Cusamano. The experience doesn't prove as interesting as he might have thought.—garykmcd", "After Paulie, Chris and Big Pussy kill a dealer from a rival gang to scare them out of the Sopranos' territory, Tony decides that the money they steal should be put into the stock market to give the family some legitimate income sources. At a barbecue with his neighbor Dr. Cusamano, Tony and Carmela fish for stock tips. Chris, meanwhile, gets into an argument at a restaurant with another customer who turns out to be rap star Massive Genius, but this does lead to an invitation to a party, where Adriana gets an idea to become a record producer. Chris gives her the money to get started producing an album for her ex-boyfriend Rich and his band. The difference of opinion that Hersh and Massive have over Rich's talents leads to accusations of royalty theft and threats of lawsuits, not to mention accusations by Chris that Massive is just interested in getting Adriana into bed.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705224", "rating": 7.8, "votes": 9981, "number_of_episodes": 86}