{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0545408": "Nancy Marchand", "0001334": "John Heard", "0012178": "Jerry Adler", "0002326": "Al Sapienza", "0776584": "Paul Schulze", "0045007": "Oksana Lada", "0201700": "Tony Darrow", "0521087": "George Loros", "0045935": "Joseph Badalucco Jr.", "0192603": "Vincent Curatola", "1477825": "Freddy Bastone", "1478001": "William Conn", "1478012": "Maurizio Corbino", "0441988": "Sylvia Kauders", "0525052": "Salem Ludwig", "1478789": "Prianga Pieris", "0685227": "Salvatore Paul Piro", "0703798": "Christopher J. Quinn", "0758063": "Dave Salerno", "0763883": "Frank Santorelli", "0841410": "Donn Swaby", "0957273": "Sonny Zito", "0214129": "Richard DeDomenico", "1435202": "Kerry Donelli", "4144702": "James M. Palombo"}, "geners": ["Crime", "Drama"], "runtimes": ["50"],  "plot": ["Tony tries to balance Junior against the other capos, while Carmela reasserts herself as the woman in Tony's life.", "Tony gets another report from the cop who's been keeping an eye on Dr. Melfi. He's still having erotic dreams about her but is suffering from erectile dysfunction and a distancing from Carmela. He tells Jennifer Melfi how he feels about her but she has an explanation for his emotions. Uncle Junior is the new boss and he's making his presence felt. He decides to tax Hesh who had a special arrangement with his predecessor. Hesh doesn't mind being taxed, it's the amount that he doesn't like. The other captains are unhappy as well as Junior is stepping in on some of their money earning schemes without even having the courtesy of telling them about it. Tony approaches New York boss Johnny 'Sack' Sacramoni to find a solution to the situation.—garykmcd", "Rather than seeking the top position himself, Tony supports Junior's claim to authority, in the hopes of becoming the power behind the throne. As the new Boss, however, Junior soon begins canceling old deals and claiming a bigger stake of everyone's action, prompting the other capos to pressure Tony to do something about his uncle. Junior's prominent position catches the attention of the FBI, who place him at the head of their watch list. At home, Tony's problems are only increasing, as his growing feelings for Dr. Melfi, combined with his respect for her capabilities, are causing him to be impotent with his wife. Carmela senses that her hold on her husband may be slipping, and insists that Tony let her be his emotional support.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705270", "rating": 8.4, "votes": 10416, "number_of_episodes": 86}