{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0001334": "John Heard", "0798076": "Karen Sillas", "0002326": "Al Sapienza", "0045935": "Joseph Badalucco Jr.", "1478243": "Giancarlo 'John' Giunta", "0521087": "George Loros", "0749311": "Sal Ruffino", "0057658": "Doug Barron", "1157242": "Veronica Bero", "0122988": "Britt Burr", "0137681": "Johann Carlo", "0267009": "Ramsey Faragallah", "0673674": "Annika Pergament", "1387053": "Bobby Rivers", "0763873": "Michele Santopietro", "1143432": "Matthew Lawler", "0446257": "Chance Kelly", "0456761": "Tim Kirkpatrick", "1222217": "Peter Bretz", "3428515": "Peter Austin Noto"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Following the arrest of two of his men, Tony suspects a traitor. Efforts to discover who, however, are stymied.", "Tony is thrown for a loop when the crooked cop on his payroll, Vin Makazian, tells him that Big Pussy has made a deal with the Feds and is wearing a wire. Pussy, Jimmy Altieri and others were recently arrested and Tony knows how much Pussy worries about money and the cost of his son's college education. Tony confides in Paulie but tells him to do nothing until they have absolute proof. A good thing since someone else is the rat. Livia meanwhile continues to moan about Tony's treatment of her and manipulates Junior into thinking Tony is conspiring against him. He tells her he has no choice but to eliminate him and Livia tells him she has no objections.—garykmcd", "Jimmy and Big Pussy get arrested in Jimmy's pool hall. Following the arrest, Tony learns from his crooked cop Vin that Big Pussy is an informant. When Tony hears that Pussy owes Vin a large amount of money, he begins to doubt the accusation, but Vin commits suicide before Tony can get hold of the police report naming the source, leaving the matter unresolved. Tony instructs Jimmy to try to catch Pussy with a wire, but with no success. When Jimmy starts asking rather direct questions about Tony's past, Tony immediately wonders if maybe Jimmy is the actual informant, and is soon lost as to who he can trust. Meanwhile, after having a talk with Livia, Junior decides to have Tony eliminated.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705269", "rating": 8.8, "votes": 9941, "number_of_episodes": 86}