{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0309461": "Michael Gaston", "0514055": "Joe Lisi", "0893247": "John Ventimiglia", "0012178": "Jerry Adler", "1642253": "Alton Clinton", "0168083": "Phil Coccioletti", "0213732": "Michele DeCesare", "0005576": "Drea de Matteo", "0215980": "Elaine del Valle", "1641881": "Giuseppe Delipiano", "0270121": "Siberia M. Federico", "0584049": "Justine Miceli", "0621393": "Kathrine Narducci", "1277079": "Joe Pucillo", "0763913": "Michael Santoro", "0810554": "Bruce Smolanoff", "0682011": "Vito Picone", "1961516": "Craig Zucchero"}, "geners": ["Crime", "Drama"], "runtimes": ["59"],  "plot": ["A mobster passes out at a family barbecue and seeks therapy to understand why.", "Tony Soprano is a New Jersey mobster with a complicated life. He's recently passed out as a result of an anxiety attack and begins to see a psychiatrist, Dr. Jennifer Melfi. Tony's mother is at an age where she should be in a retirement home but she flatly refuses, obviously preferring to nag at her son. His father's brother, Uncle Junior, is planning a hit at a restaurant owned by his high school buddy Artie Bocco. A rival company is edging in on his trash removal business. At home, his teenager daughter Meadow is rebelling against parental authority, especially her mother's. Finally, a family of wild ducks that had taken to living in his backyard pool and who he fed regularly has flown away.—garykmcd", "Tony Soprano, waste disposal consultant, and mobster of growing influence, is under a lot of stress. But, like Gary Cooper, Tony disdains the idea of \"getting in touch\" with his feelings. Tony loses consciousness at his son's birthday but he bristles when the words \"panic attack\" are applied. His MRI and other tests yield no answers, so Tony consults psychiatrist, Dr. Jennifer Melfi. Tony is embarrassed, but he begins telling Dr. Melfi about his work, using metaphors, and he reveals more than he knows. When he tells Dr. Melfi about the family of ducks living in his pool and how they had babies and left, Tony is depressed. Dr. Melfi helps Tony ponder his life, his guilt...and his feelings. Tony has a small epiphany: his life and times are not as fulfilling as those of his late father. No one in the 21st century even understands the concept of Omertà! Can 1 post-Corleone mob boss juggle work and family, without driving himself to Prozac?—LA-Lawyer", "Tony Soprano is sitting in the waiting room of a psychiatrist after having a fainting spell at his son's birthday party. Reluctant to talk at first, he begins describing some of the stresses he has in his business as a \"waste management consultant,\" including collecting on loans and dealing with rival companies. His family life is a source of pain as he deals with escalating fights between his daughter and wife, his wife's relationship with the local priest, his nephew's expectations of immediate wealth and success, his uncle's anger at not being the boss, and his mother's hostility to everyone.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705282", "rating": 8.4, "votes": 14773, "number_of_episodes": 86}