{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0001334": "John Heard", "0012178": "Jerry Adler", "0728346": "Michael Rispoli", "0089685": "Mark Blum", "0002326": "Al Sapienza", "0220867": "Anthony DeSando", "0005576": "Drea de Matteo", "0201700": "Tony Darrow", "0521087": "George Loros", "0045935": "Joseph Badalucco Jr.", "0029512": "Sharon Angela", "0036855": "John Arocho", "0045007": "Oksana Lada", "0123946": "Michael Buscemi", "2635774": "T.J. Coluca", "0213732": "Michele DeCesare", "0246585": "Guillermo Diaz", "1478346": "Daniel Hilt", "0439449": "Raymond Michael Karl", "0528817": "Theresa Lynn", "0572652": "Shawn McLean", "0673674": "Annika Pergament", "0677747": "Sal Petraccione", "1478970": "James Spector", "1478987": "Corrine Stella", "1306773": "Anthony Tavaglione", "0082454": "Dar Billingham", "1255757": "Sean Fredricks"}, "geners": ["Crime", "Drama"], "runtimes": ["54"],  "plot": ["Brendan's death leaves Chris fearing for his life, and Anthony's discovery of what his father really does leaves him confused.", "With Brendan dead, Christopher isn't sure exactly who is after him. When he realizes it was Uncle Junior, he's prepared to start a war. Tony meets his uncle but with Jackie Aprile on his last legs, there is little room for compromise. When Jackie dies, the capos want Tony to take over but he has another idea, one that he thinks will still leave him in charge. At school, AJ has a strange encounter with a classmate. His sister Meadow clues him in to exactly what their father does for a living. Tony begins to have erotic dreams about his psychiatrist, Dr. Melfi, and gets a broken down cop on the take to keep tabs on her. He oversteps, just a little.—garykmcd", "Following his mock execution at the hands of the Russian mob, Chris is fearing for his life, thinking that Tony wants him dead for giving drugs to Meadow. When he learns that not only was it Junior's doing and not Tony's, but that Junior also had Brendan killed, Chris vows revenge and threatens to kill Junior's right-hand man, Mikey. Tony, meanwhile, is starting to have feelings for Dr. Melfi and has one of his men put a tail on her. Thinking Melfi is Tony's mistress, however, the thug dispenses a violent beating to her boyfriend. Against all this, Jackie's passing opens the question of who will be the new boss. Tony has the support of the other capos, but he wants a peaceful resolution with his Uncle Junior.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705263", "rating": 8.5, "votes": 10969, "number_of_episodes": 86}