{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0545408": "Nancy Marchand", "0802759": "Joseph Siravo", "0732309": "Laila Robins", "0803157": "Rocco Sisto", "0063453": "David Beach", "0016351": "Paul Albe", "0076821": "Shirl Bernheim", "0089517": "Madeline Blue", "0096772": "Bobby Boriello", "0191773": "Scott Cumberbatch", "0299284": "Anthony Fusco", "1478275": "Rob Grippa", "0369531": "Jason Hauser", "0430107": "Michael B. Jordan", "0674576": "Gregory Perrelli", "0707178": "Nick Raio", "0764321": "Steve Santosusso", "0931807": "Tim Williams", "0172635": "Rick Collins", "2056982": "Tim Realbuto", "4301102": "Anthony Robles", "0744336": "Tony Ray Rossi"}, "geners": ["Crime", "Drama"], "runtimes": ["52"],  "plot": ["Anthony has disciplinary problems at school, prompting Tony to recount memories of his childhood with Dr. Melfi.", "When AJ gets into trouble at school - he and two other boys steal sacramental wine from the church - Tony and Carmela are told he may have ADD. He's suspended from school for three days and is told to visit his grandmother where he lets it slip that Tony is seeing a psychiatrist. The situation causes Tony to reflect on his own times at that age. It was in 1967 that he learned something about his father when he sees his Dad and his brother Uncle Junior beat someone up to collect a debt. As a child, Tony thought his father also showed favoritism to his sister Janice by taking her to a fun fair every Sunday. He decided to find out what exactly they were doing. In fact, his father was conducting business with other mobsters who were also taking their daughters with them as a cover.—garykmcd", "Anthony and his friends steal sacramental wine from the school chapel, showing up drunk at class later on. When Tony and Carmela speak with the principal, they are told that Anthony may have ADD and is being considered for special education classes as an alternative to expulsion. At Dr. Melfi's office, Tony recounts some of the defining memories of his childhood, including the iron hold his mother held over the family, even Tony's father. He muses on how his life might be different if his father had pursued the plans he had for his family. As part of Anthony's punishment, Tony makes him visit his grandmother at the retirement home every day. As they talk, Anthony gives away the fact that his father is seeing a psychiatrist.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705241", "rating": 8.3, "votes": 10087, "number_of_episodes": 86}