{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0000953": "Peter Bogdanovich", "0697069": "Matthew Sussman", "0379200": "Paul Herman", "0213732": "Michele DeCesare", "0013207": "Diana Agostini", "1477779": "Getchie Argetsinger", "0960536": "Leslie Beatty", "0186553": "Ed Crasnick", "0192603": "Vincent Curatola", "0304289": "Catrina Ganey", "0293270": "Marc Freeman Hamm", "0542857": "Linda Mann", "1478747": "Joe Pacheco", "0759878": "Charles Sammarco", "0777493": "Antonette Schwartzberg", "0820056": "Michael Squicciarini", "1478957": "Donna Smythe", "0838033": "Deirdre Sullivan", "1479146": "Craig Wojcik", "3371955": "John Landolfi"}, "geners": ["Crime", "Drama"], "runtimes": ["51"],  "plot": ["Richie Aprile gets out after ten years in prison and starts reasserting his authority while unaware of the changes made in the crime family's archetype. Meadow gets in trouble after a party gets out of hand.", "Tony gets a call from one of his police sources when they break up a party Meadow had secretly organized at her grandmother's empty house. Tony and Carmella agree that she needs to be punished but Meadow prove to be quite an expert at manipulating them. Jackie Aprile's brother Richie is out of prison after 10 years and he wants things to be like they were before he left. Richie visits Beansie Gaetta, a one-time business associate,and let's him know in no uncertain terms that he's the boss now that he's back. Richie has his eye on Janice, an old high school flame. He even tells Christopher to be careful how he treats his niece Adriana. Dr. Melfi meanwhile meets Tony in a restaurant and embarrasses herself. She tries to talk about her feelings of guilt with her own psychiatrist.—garykmcd", "Richie Aprile, brother of Jackie, gets paroled after spending 10 years behind bars. He first looks up an old partner and demands to be treated with the respect he feels is his due. When the former partner, now a pizzeria owner, balks at his demands, Richie loses his temper. When the old partner then fails to show up for a welcome back party, Richie tracks him down and takes brutal revenge. Meadow, meanwhile, gets busted by the police when a party she holds at Livia's now-empty house gets way out of hand. The cop keeps things quiet to pay back a favor to Tony, but he and Carmela have to come up with a proper punishment that will teach Meadow better self-discipline. Dr. Melfi, meanwhile, feels confused and upset over the degree to which Tony has disrupted her life.—Jean-Marc Rocher <rocher@fiberbit.net>", "The brother of deceased mob boss Jackie Aprile, Richie, is on parole after completing his 10 year prison sentence. Richie is ready for some action after he is back on the street, first he start on Tony's earner, Beansie Gaeta, but when Richie is rejected from what Beansie owes him for putting him in action; Richie has consequences for him. On the other side, Meadow gets into bigger trouble after a party at Livia's house spins out of control.—Emphinix"], "genres": "N/A", "imdbID": "0705288", "rating": 8.4, "votes": 8834, "number_of_episodes": 86}