{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0012178": "Jerry Adler", "0621393": "Kathrine Narducci", "0893247": "John Ventimiglia", "0000953": "Peter Bogdanovich", "0256599": "Linda Emond", "0518385": "Louis Lombardi", "0045007": "Oksana Lada", "0144843": "Federico Castelluccio", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0278468": "John Fiore", "0668436": "Stephen Payne", "1478223": "Lydia Gaston", "1478707": "Sasha Nesterov", "0031299": "Yelena Antonenko", "0483917": "Oni Faida Lampley", "0524811": "Scott Lucy", "0619651": "Ajay Naidu", "0696127": "Robert Prescott", "0813902": "Phyllis Somerville", "1674919": "Todd Carroll", "1020152": "Katalin Pota"}, "geners": ["Crime", "Drama"], "runtimes": ["52"],  "plot": ["Paulie and Silvio get promoted, Furio gets welcomed, Pussy gets pushed aside, and Chris gets frustrated with his Hollywood aspirations while Janice and Richie become romantically involved much to Tony's disapproval.", "Now Back from Italy, Tony decides it's time to re-organize. Silvio is named consigliere and Paulie is promoted to Capo, with Pussy and new arrival Furio reporting to him. Pussy's not too happy with the arrangement and complains to his FBI contact about how he's being treated. Tony and Carmella throw a party to introduce Furio but she refuses to let Uncle Junior in the house when he shows up unexpectedly. Tony is none too pleased when he finds that Richie Aprile and his sister Janice are sleeping together at his mother's vacant house. Adriana pays for Christopher to attend an acting for writers class in the hope that it helps him with his screenplay. His emotions get the better of him. Meanwhile, Dr. Melfi recounts her dreams about Tony to her psychiatrist and, still feeling guilty, decides to take Tony back as a patient.—garykmcd", "Furio comes over from Naples to join Tony's gang, and Artie gives him a job as an immigration cover until his visa can be finalized. To make room for the newcomer, Tony promotes Paulie to capo and Silvio to consigliere. Pussy, however, is upset that he is being pushed aside, as Tony and Paulie are deliberately excluding him from business talks. Chris, meanwhile, is hitting ever bigger stumbling blocks with his scriptwriting, and his emotional problems are only making things worse. After a particularly violent episode, he throws his notes and tapes into the trash. Unable to see Dr. Melfi, Tony unloads some of his problems on Hersh, who reveals that Tony's father also suffered from fainting spells.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705230", "rating": 8.4, "votes": 8724, "number_of_episodes": 86}