{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0698998": "David Proval", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0893247": "John Ventimiglia", "0672242": "Joe Penny", "0000969": "Lillo Brancato", "0518385": "Louis Lombardi", "0144843": "Federico Castelluccio", "0379200": "Paul Herman", "0546868": "David Margulies", "0714634": "Marisa Redanty", "0132092": "Susan Campanaro", "0201075": "Janis Dardaris", "0390936": "Mitch Holleman", "0553440": "Adrian Martinez", "0580646": "Olga Merediz", "0599745": "Chuck Montgomery", "0434560": "Antone Pagán", "1020152": "Katalin Pota", "0716452": "Molly Regan", "0785854": "Matt Servitto", "0900274": "Vince Viverito", "0001598": "Robert Patrick", "0610276": "Josh Mowery", "2502247": "Daria Rumi", "0820056": "Michael Squicciarini"}, "geners": ["Crime", "Drama"], "runtimes": ["60"],  "plot": ["Tony continues putting the squeeze on David, while Richie discusses the possibility with Junior of removing some competition while 'Big Pussy' Bonpensiero continues to be an informant.", "A witness saw Tony dispose of Matthew. Pussy meets his FBI contact who tells him Tony was seen. He also suspects that Pussy is the other man who was seen with him. When Tony learns there's an eyewitness, Paulie and Furio go into action. Richie Aprile isn't happy with his business arrangement in the garbage business but Tony is unsympathetic. He goes to see Uncle Junior. Tony decides he wants to spend more time with AJ but is disappointed when his son would rather go to the mall with his friends. David Scatino still hasn't paid off Tony and Richie and they are driving him into bankruptcy. He considers putting an end to it all. Carmela meets a handsome home decorator.—garykmcd", "David, who still owes thousands of dollars to Tony because of his gambling losses, finds that his sporting goods store is being ground into bankruptcy by Tony and Paulie. Distraught, he contemplates taking the final way out. Ritchie, who has grown more intimate with Tony's sister Janice, is dissatisfied with the cut he gets from his operations, and feels he's not getting enough respect within the family. He goes to Junior to discuss the prospect of taking Tony out of the picture. Junior at first reacts angrily, but Ritchie reminds him that he himself planned to do the same thing not so long ago.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705232", "rating": 8.4, "votes": 8304, "number_of_episodes": 86}