{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0167850": "Bill Cobbs", "0000969": "Lillo Brancato", "0518385": "Louis Lombardi", "0930707": "Gregory Alan Williams", "0692466": "Richard Portnow", "0771993": "Steve Schirripa", "0850387": "Chris Tardio", "0221241": "Robert Desiderio", "0112700": "Michael Broughton", "4966908": "James Collins", "0219748": "Catherine Dent", "0278468": "John Fiore", "0281344": "Elizabeth Flax", "0336935": "Sam Gray", "0997084": "Timothy Huang", "0528469": "Tertia Lynch", "0547128": "John Mariano", "0726797": "Tony Rigo", "0869977": "Laurine Towler", "1479065": "Kellie Turner", "0934656": "Beatrice Winde", "0097631": "Jay Boryea", "0118804": "Paul Bucossi", "0118806": "Vic Bucossi", "0120961": "Nicole Burdette", "0127362": "John Cenatiempo", "0187953": "Michael Criscuolo", "0449712": "Herb Kerr", "0518257": "David S. Lomax", "0528324": "Jalil Jay Lynch", "0579457": "Chazz Menendez", "1648668": "Craig Mitchell", "0681389": "Don Picard", "1315804": "Todo Segalla", "0799734": "Derrick Simmons", "0885885": "Ron Van Clief"}, "geners": ["Crime", "Drama"], "runtimes": ["51"],  "plot": ["Junior leaves prison due to ill health and placed under house arrest, while Livia's health also declines. Pussy begins talking with someone interested in learning more about Tony.", "Livia plays her guilt games on Janice, saying her children have abandoned her in her time of need. Things don't get better when Anthony Jr. tells her Janice has been talking about a DNR order for her. Tony is upset when he finds that Janice has taken down the For Sale sign in front of their mother's house. Janice says she just wants to change real state agents to save money but Tony doesn't trust her. There are problems at one of Uncle Junior's construction site when a civil rights activist begins protests over the few African-Americans on the work site. Tony sends a message to his uncle via Bobby Baccalieri about who is in charge. For his part, Uncle Junior gets bail but is subject to house arrest and has to wear an electronic bracelet. Uncle Junior has a fall in the shower. Big Pussy has a meeting with someone interesting.—garykmcd", "After Tony visits Junior in prison, he informs Junior's assistant that he will be taking over most of Junior's operations, even though Junior is still nominally the Boss. Soon afterward, Junior is allowed to serve his time under house arrest due to his failing health. After his back surgery, Pussy goes to meet with FBI Agent Skip Lipari, who tells him that now that Jimmy Altieri is dead, Pussy needs to start giving more information to the FBI. Livia, meanwhile, continues to be angry at everyone, especially when Anthony inadvertently reveals that Janice is considering giving the hospital staff orders not to save her life.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705240", "rating": 8.0, "votes": 8851, "number_of_episodes": 86}