{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0797464": "Jamie-Lynn Sigler", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0590499": "Sofia Milos", "0518385": "Louis Lombardi", "0144843": "Federico Castelluccio", "0244602": "Vittorio Duse", "0435677": "Toni Kalem", "0578632": "Mike Memphis", "0771993": "Steve Schirripa", "0029512": "Sharon Angela", "0528324": "Jalil Jay Lynch", "1478926": "Emme Shaw", "0888347": "Maureen Van Zandt", "1186950": "Ciro Maggio", "0831814": "Danton Stone", "1479109": "Melissa Weil", "0297229": "Jason Fuchs", "1345177": "Jessica Peters", "0342062": "Gano Grills", "0018143": "Anthony Alessandro", "0128357": "Frankie Caero", "1478041": "Pina Cutolo", "0321342": "Lello Giulivo", "0523980": "Antonio Lubrano", "1478755": "Guido Palliggiano", "1479023": "Alida Tarallo", "0866313": "Alex Toma", "0999147": "Giuseppe Zeno", "0957024": "Riccardo Zinna", "0153740": "David Chase", "0409665": "Giorgio Iovine"}, "geners": ["Crime", "Drama"], "runtimes": ["53"],  "plot": ["Tony, Paulie and Chris travel to Naples to conduct a business deal, while Pussy becomes more stressed over trying to balance his secret lives.", "Tony, Paulie and Christopher go to Italy to discuss business with their counterparts in his recently acquired (from his Uncle Junior) business in exporting stolen cars. Tony pushes to meet the patriarch of his Italian counterparts but finds the man, Zi Vittorio, to be old and feeble-minded. He's even more surprised however when he realizes who is now in charge. As part of the deal, it's agreed that enforcer Furio Giunta will travel to the US and work for Tony's crew. Back in the US meanwhile, Pussy tells FBI Agent Skip Lipari about the trip and the stolen car business. Pussy's wife Angie isn't necessarily happy that he's back and she shocks Carmella and Rosalie Aprile by saying that she wants a divorce.—garykmcd", "Tony announces, much to Carmela's displeasure, that he will going on a business trip to Naples with Paulie and Chris, hopefully to negotiate a deal smuggling stolen cars with Don Vittorio, a distant relative of the Sopranos. When he arrives, he finds that the old Don is too senile to negotiate anything and his operations are being handled by his attractive daughter. Pussy, meanwhile, continues have secret meetings with agent Lipari, which results in violence when one of his friends sees them together. The stress of keeping secrets from everyone is starting to wear on his family life, and his wife begins filing for divorce.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705237", "rating": 8.5, "votes": 9513, "number_of_episodes": 86}