{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0893247": "John Ventimiglia", "0000969": "Lillo Brancato", "0850387": "Chris Tardio", "0144843": "Federico Castelluccio", "0120961": "Nicole Burdette", "0378161": "John Hensley", "0714634": "Marisa Redanty", "0813101": "Felix Solis", "0192603": "Vincent Curatola", "0005196": "Paul Mazursky", "0801535": "Frank Sinatra Jr.", "0821139": "Lewis J. Stadlen", "0018956": "Ana-Sofia Mastroianna", "0114382": "P.J. Brown", "1478022": "Angela Covington", "0304430": "Joseph R. Gannascoli", "0347662": "Barbara Gulan", "0356178": "La Tanya Hall", "0508904": "Sig Libowitz", "1471101": "David McCann", "1478944": "Carmine Sirico", "0006574": "Ed Vassallo", "0001598": "Robert Patrick"}, "geners": ["Crime", "Drama"], "runtimes": ["51"],  "plot": ["Tony's old school friend digs himself into trouble with his gambling, while Tony's family problems only continue to grow.", "An old high school friend of Tony's, David Scatino, talks him into letting him play in a high stakes poker game. David's on a streak of bad luck and he's also in debt to Richie Aprile, who has banned him from his games until he catches up a bit. When Richie sees David at Tony's game there's trouble. David's problems grow when he can't pay Tony back and has no way out but to give him his son's four wheel drive as partial payment. It puts Meadow in an awkward situation. Richie continues to be a problem for Tony who sees him, Janice and his mother together at a family funeral. Janice eggs Richie on adding to the tension with her brother.—garykmcd", "Tony meets up with David, an old school friend at a parent's function at Meadow's high school. David expresses interest in joining a high-stakes poker game that Tony has organized, but Tony isn't so sure that David can handle it. He allows it, but his misgivings turn out to be well-founded when David, now heavily in debt to Tony, reveals that he wanted in the game in order to pay off gambling debts to Richie Aprile. Tony's collection tactics start impacting the lives of Meadow's school friends, and she finds herself isolated at a key moment. Junior, meanwhile, tells Tony about a relative he never knew he had.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705278", "rating": 8.6, "votes": 8885, "number_of_episodes": 86}