{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0665114": "Vincent Pastore", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0269463": "Jon Favreau", "0000928": "Sandra Bernhard", "0000413": "Janeane Garofalo", "0001860": "Alicia Witt", "0518385": "Louis Lombardi", "0435677": "Toni Kalem", "1471037": "Arthur Barnes", "1477851": "Stephen Bienskie", "1471061": "John Devlin", "1047883": "Dominic Fumusa", "0300399": "Andersen Gabrych", "1478600": "Bryan Matzkow", "1478601": "Andrea Maulella", "0591698": "Jason Minter", "1169320": "Frank Pando", "0691682": "Steve Porcelli", "0714147": "Elizabeth Reaser", "1025304": "Asa Somers", "1759449": "Americo Presciutti"}, "geners": ["Crime", "Drama"], "runtimes": ["57"],  "plot": ["Anthony continues to cause problems at home, while Pussy's divided loyalties cause him greater anguish.", "AJ takes his mother's car out without permission and sideswipes a truck causing considerable damage to her car. He's in a rebellious mood, pushing all of his parents' buttons, threatening not to go through with his confirmation and saying that God is dead. Pussy is AJ's confirmation sponsor and Tony asks him to have a talk with the boy. Pussy however is forced by the FBI to wear a wire to a party at Tony's house to celebrate AJ's confirmation and he is deeply conflicted by the situation he finds himself in. Christopher meanwhile starts hanging around movie people, including Jon Favreau. He's decided he wants to be a player rather than a writer in the movie business but when Tony hears about what he's been up to, Christopher has a choice to make.—garykmcd", "Anthony is developing behavior problems in addition to his already dismal grades. He takes Carmela's car for a joyride (causing an accident), and then shocks his parents by announcing that he believes God is dead and doesn't want to be confirmed. Angry at his son's rebelliousness, Tony asks Pussy, Anthony's godfather, to try and straighten him out. Pussy, however, is getting in deeper with the FBI, who force him to wear a wire to Anthony's confirmation party. The stress of his double life causes him to lash out at his wife, and later have a breakdown from his increasing isolation.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705238", "rating": 8.7, "votes": 9206, "number_of_episodes": 86}