{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0763639": "Saundra Santiago", "0000969": "Lillo Brancato", "0850387": "Chris Tardio", "0144843": "Federico Castelluccio", "0379200": "Paul Herman", "0771993": "Steve Schirripa", "0304430": "Joseph R. Gannascoli", "0650374": "Vincent J. Orofino", "0017651": "Tom Aldredge", "0085959": "Susan Blackwell", "1477930": "Joseph Carino", "0291856": "Raymond Franza", "0566478": "Patty McCormack", "1020152": "Katalin Pota", "0699497": "Marek Przystup", "0767445": "Stelio Savante", "0791877": "Suzanne Shepherd", "1478957": "Donna Smythe", "1014668": "Vinny De Vingo", "0231283": "John Doman"}, "geners": ["Crime", "Drama"], "runtimes": ["43"],  "plot": ["Rebellion by some of the lower soldiers ends in bloodshed, while Carmela starts intimidating her neighbors to help Meadow's chances at Georgetown.", "Meadow is getting anxious about college admission and wants to go to Berkely but Carmella considers taking steps to ensure that won't happen. She asks for her neighbor Jeannie Cusamano's help in getting her sister Joan, who went to Georgetown, for a letter of recommendation. When Joan refuses, Carmella pays her a personal visit. Paulie and Silvio visit Richie Aprile to suggest he help out Beansie by building a ramp for his wheelchair. Christopher is having problems with Adriana who has moved out. He asks her to marry him and gives her a gigantic engagement ring. Christopher has two new guys working for him, Matthew and Sean, but they decide they need to get ahead and try to impress Richie. Richie gives Tony a prized leather jacket that he had taken off a hood many years before, but then sees that he has given it away.—garykmcd", "Meadow is applying to college, and her parents worry that her grades aren't good enough for acceptance without using a little pull. When Carmela hears that Jeannie Cusamano's sister went to Georgetown and some influence there, she begins a not-so-subtle campaign to get her to write a letter of recommendation. Chris, meanwhile, is working with two new guys, Matt and Sean. They have aspirations of greatness, but are soon brought down to earth by Tony and Furio. Deciding they need to take charge of their own futures, they stage an ambush to remove some of their competition.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705248", "rating": 8.8, "votes": 9012, "number_of_episodes": 86}