{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0012178": "Jerry Adler", "0000969": "Lillo Brancato", "0850387": "Chris Tardio", "0045007": "Oksana Lada", "0120961": "Nicole Burdette", "0546868": "David Margulies", "0017651": "Tom Aldredge", "0082356": "John Billeci", "1061607": "Darrell Carey", "1071179": "Dan Chen", "0161970": "Robert Cicchini", "0278468": "John Fiore", "0279292": "Mark Fish", "0320338": "Karen Giordano", "1034965": "Bryan Greenberg", "0342106": "Dan Grimaldi", "1239485": "Philipp Karner", "1478491": "Katrina Lantz", "0521087": "George Loros", "0696546": "Wayne Pretlow", "0791877": "Suzanne Shepherd", "0839934": "Kevin Sussman", "1479033": "Roberto Thomas", "0006574": "Ed Vassallo", "1010540": "Terence Winter", "0679357": "Martin Pfefferkorn"}, "geners": ["Crime", "Drama"], "runtimes": ["50"],  "plot": ["Pussy returns after months in hiding, Chris starts a boiler room stock operation, and Tony's long-lost sister shows up on the doorstep.", "With Uncle Junior still in jail, Tony has taken over the family. He's surprised when Big Pussy returns from hiding in Puerto Rico, but after some hesitation he is welcomed back into the fold. Tony begins settling accounts elsewhere however. Dr. Melfi is seeing her patients in a dingy motel and wants nothing to do with Tony Soprano. This is bad news for him as he's starting to have blackouts again. Meanwhile Christopher is operating a boiler room selling cheap or non-existent stocks to unwary investors but some of the men he has working for him lack the finesse you might normally expect. Tony's sister Janice appears out of the blue after many years absence. He's not pleased when he realizes her plans.—garykmcd", "Several months after the last episode ends, Tony seems to be in charge: Junior is in prison, while Livia is hospitalized following a stroke. Chris gets his broker's license (by having someone else take the exam for him), and begins his own company pumping worthless stocks to gullible investors. One morning Tony is surprised by the return of Pussy, who was hiding out in Puerto Rico fearing that Tony had lost trust in him. After some initial misgivings, Pussy is welcomed back by all his associates. Meanwhile Tony's long-lost sister Janice shows up looking for a place to stay. This leads Tony to hold a family reunion, where it becomes clear that nobody is sorry that Livia isn't able to join the party.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705250", "rating": 8.2, "votes": 9132, "number_of_episodes": 86}