{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0545408": "Nancy Marchand", "0672242": "Joe Penny", "0514055": "Joe Lisi", "0518385": "Louis Lombardi", "0692466": "Richard Portnow", "0671023": "Frank Pellegrino", "0045007": "Oksana Lada", "0144843": "Federico Castelluccio", "0771993": "Steve Schirripa", "0459853": "Alla Kliouka", "0029512": "Sharon Angela", "1020152": "Katalin Pota", "0888347": "Maureen Van Zandt", "1477859": "Andy Blankenbuehler", "0148466": "Jason Cerbone", "0539273": "Richard Maldone", "0553440": "Adrian Martinez", "0407615": "Robert Iler", "3428515": "Peter Austin Noto"}, "geners": ["Crime", "Drama"], "runtimes": ["61"],  "plot": ["Richie and Janice get engaged, but Richie's violent temper reaches a fever pitch. Tony, meanwhile, breaks up with Irina, much to her dismay.", "Richie Aprile continues to be a major problem for Tony and now for Uncle Junior as well. Richie knows Junior can't be too happy with the current situation either and pesters him for permission to get rid of his nephew. Junior agrees but quickly realizes that Richie will be a bigger pain than Tony and promptly tells him what Richie has planned. Janice is busy planning her wedding but when an argument erupts at home and Richie hits her, she shows him just what she's prepared to put up with. Tony meanwhile tries to end his relationship with Irina, his Russian girlfriend, but she then tries to make good on her threat to commit suicide if he leaves her.—garykmcd", "Tony, feeling shame that everyone knows about his mistress, decides to break off his relationship with Irina. Irina, however, says she loves Tony and threatens suicide if he leaves her, a threat she attempts to make good on. Richie, meanwhile, continues to pressure Junior to allow a hit on Tony. He finally agrees, but soon realizes that Richie will eventually cause him more problems than Tony. Later, Richie and Janice announce their engagement, but things for them soon turn bloody when Richie's violent temper erupts at home after Janice brings up the delicate topic of Richie's son.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705279", "rating": 9.3, "votes": 10823, "number_of_episodes": 86}