{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0665114": "Vincent Pastore", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0698998": "David Proval", "0878152": "Aida Turturro", "0012178": "Jerry Adler", "0000953": "Peter Bogdanovich", "0000969": "Lillo Brancato", "0518385": "Louis Lombardi", "1477745": "Benny Aguiar", "0057592": "Seth Barrish", "1477926": "Michael Cannis", "0135459": "Tom Cappadona", "0144007": "Nancy Cassaro", "0258540": "Scottie Epstein", "0428421": "John Christopher Jones", "0574513": "Peter McRobbie", "0721332": "Judy Reyes", "0802590": "James Sioutis", "0972605": "Lisa Valens", "0888347": "Maureen Van Zandt", "1347813": "Gameela Wright", "0763873": "Michele Santopietro", "0123334": "Denise Burse"}, "geners": ["Crime", "Drama"], "runtimes": ["56"],  "plot": ["Chris awakens from his coma with a message from the afterlife for Tony and Paulie. Carmela, meanwhile, wants Tony to get a \"cut\", specifically a vasectomy.", "Christopher is in hospital after the shooting but goes into cardiac arrest and must undergo emergency surgery. The surgery goes well but the doctor admits that Christopher was clinically dead for about one minute. When he awakens from his surgery, Christopher believes he had a out of body experience and saw his father and uncle playing cards in hell. They tell him that's where he's headed, and when he awakens he's convinced he's going to hell. After Carmella hears that another gangster's girlfriend gave birth, she decides Tony should have vasectomy. Pussy tells his FBI contact that he thinks Tony is onto him so he sets out to find the man who shot Christopher in the hopes that it will bring them closer together—garykmcd", "Chris recovers from his coma, and tells Tony and Paulie that he had a vision of hell, where he saw Brendan and Mikey. They gave him a cryptic message for the pair: \"Three o' clock.\" Soon after, Tony and Paulie start having anxiety over their immortal souls. Carmela, meanwhile, becomes upset when she learns that another gangster has just had a child with his mistress. Fearing the embarrassment this would cause her and knowing that her husband is sleeping around, she asks Tony to get a vasectomy. While this is going on, Pussy is advised by the FBI to get back into Tony's good graces, so he helps track down Chris' attacker.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705247", "rating": 8.8, "votes": 9023, "number_of_episodes": 86}