{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0797464": "Jamie-Lynn Sigler", "0144843": "Federico Castelluccio", "1168980": "Robert Funaro", "0001592": "Joe Pantoliano", "0148466": "Jason Cerbone", "0205789": "Andy Davoli", "0207218": "Isaach De Bankolé", "0029512": "Sharon Angela", "0435677": "Toni Kalem", "0888347": "Maureen Van Zandt", "0342106": "Dan Grimaldi", "0005196": "Paul Mazursky", "0821139": "Lewis J. Stadlen", "0189965": "Louis Crugnali", "0539273": "Richard Maldone", "1479022": "Nick E. Tarabay", "0874397": "Victor Truro", "1036467": "Joanie Ellen", "0557856": "Anna Mastroianni", "0666325": "Michael Patterson", "0668689": "Stephen Peabody", "0417581": "Kevin Janicelli", "1443611": "Anthony Zayas", "1478594": "Freddy Martinez", "1478076": "Cesar De León", "0001711": "Annabella Sciorra", "0162032": "Paul Cicero", "0521569": "Jack Lotz", "1258387": "Antonio Saillant"}, "geners": ["Crime", "Drama"], "runtimes": ["60"],  "plot": ["Gloria grows increasingly demanding until Tony realizes who she is, and Jackie Jr. ends up in very serious trouble when Chris realizes who he is.", "Meadow tells her mother that it's over with Jackie after she caught him cheating with some bimbo. Carmela is delighted Jackie has flunked out of college and has moved back home. He still wants to be a hood and takes inspiration from Ralph Cifaretto who tells him that his father, Jackie Sr. made his name by hijacking a high stakes card game. He decides to do the same but it all goes wrong leading to a wild shoot-out. Christopher is at the game and recognizes Jackie despite the mask. Ralphie blames himself for what's happened. Gloria meets Tony in a parking lot to apologize for throwing dinner at him. They meet again for sex but she is becoming ever more erratic even making a point of meeting Carmela at the Mercedes dealership. When Gloria calls her at home under the pretense of making a sale, Tony realizes just how crazy she is. Patsy Parisi pays her a visit with a message. Carmela is having a particularly hard time, especially after a psychiatrist tells her she is living a lie. She's also convinced that she's either sick or pregnant but a doctor tells her she's fine.—garykmcd", "Gloria continues to alternate between burning passion and burning rage for Tony, until at last Tony sees that he's involved with a woman just like his mother, and dumps her. When she threatens to go after his family, he sends over one of his men to tell her that if she ever tries anything like that, he (and not Tony, whom she could manipulate) will kill her. Jackie, meanwhile, is dissatisfied with his lot in life, and decides to follow the lead of Tony and his father by robbing a rival gang's poker game. When he and his friends burst in with guns drawn, however, they are confronted by familiar faces, including Chris and Furio. Two of Jackie's friends end up dead, and Chris has recognized Jackie through his mask. With an enraged Chris howling for his head, and a disgusted Tony wanting nothing more to do with him, Jackie must depend on Ralphie's mercy to save his life.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705227", "rating": 9.2, "votes": 9375, "number_of_episodes": 86}