{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0144843": "Federico Castelluccio", "0012178": "Jerry Adler", "0518385": "Louis Lombardi", "0310966": "Ari Graynor", "0278468": "John Fiore", "0342106": "Dan Grimaldi", "0671023": "Frank Pellegrino", "0763639": "Saundra Santiago", "0213732": "Michele DeCesare", "0498713": "Erica Leerhsen", "0538562": "Albert Makhtsier", "1020152": "Katalin Pota", "0091931": "Robert T. Bogue", "0227196": "Anthony DiMaria", "1181966": "David Mogentale", "0615428": "James Murtaugh", "0905860": "David Raymond Wagner", "1169320": "Frank Pando", "0673496": "Gary Perez", "0785854": "Matt Servitto", "0810750": "Brian Smyj", "0006446": "Colleen Werthmann", "0160249": "Jay Alan Christianson", "0311126": "Dennis Gagomiros", "0428925": "Neal Jones", "0262771": "Gary Evans", "0450331": "Glenn Kessler", "1350130": "John DeBlasio", "1151954": "Anthony Indelicato", "0349881": "Murphy Guyer", "1478067": "Frank Deal", "0816925": "Katie C. Sparer", "1477880": "Matthew Breiner", "1478279": "Ian Group", "1469269": "Mark Karafin", "1478577": "Etan Maiti", "1259207": "Tommy Savas"}, "geners": ["Crime", "Drama"], "runtimes": ["50"],  "plot": ["The FBI has trouble finding a new informant, so they attempt to bug the Soprano home.", "With Big Pussy Bonpensiero no longer available to wear a wire, the FBI is desperate to get Tony on tape. They decide that bugging his house - specifically the basement where he would sometimes have conversations with Big Pussy. They obtain a warrant that will allow then to break into the house twice: once to determine where in the basement would be the best place to place the bug and then a second time to plant it. The whole exercise turns into a major operation when they assign teams to each of the occupants - Tony, Carmela, Meadow, Anthony Jr. and the cleaning lady Lilliana - to follow then and ensure they don't return unexpectedly. They decide to rebuild an old desk lamp but their first attempt to plant the bug goes wrong when most of the family members return to deal with a crisis. Meanwhile, Tony is hearing rumors about Patsy Parisi who is still grieving for his dead twin and may be out for revenge.—garykmcd", "Having lost two informants, the FBI decides to take more direct tactics and bug the Soprano house, having learned that Tony often holds his business meetings in the basement. Given a brief window of opportunity to plant the wire, they must act quickly, but water heater problems stymie the would-be planters. Later, Tony meets up with Patsy Parisi, the twin brother of Philly \"Spoons\" Parisi whom Tony ordered Gigi Cestone to kill at the beginning of Season Two. Tony pretends he had no connection with the brother's death, but Patsy already knows the truth.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705266", "rating": 8.6, "votes": 8881, "number_of_episodes": 86}