{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0893247": "John Ventimiglia", "0771993": "Steve Schirripa", "1168980": "Robert Funaro", "0621393": "Kathrine Narducci", "0001592": "Joe Pantoliano", "0949350": "Burt Young", "0726200": "Peter Riegert", "0692466": "Richard Portnow", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0850211": "Brian Tarantina", "0148466": "Jason Cerbone", "0192603": "Vincent Curatola", "0278468": "John Fiore", "0304430": "Joseph R. Gannascoli", "0671023": "Frank Pellegrino", "0776584": "Paul Schulze", "0785854": "Matt Servitto", "1469245": "Marie Donato", "0262771": "Gary Evans", "1089685": "Vanessa Ferlito", "1478233": "Sheila Gibbs", "0450331": "Glenn Kessler", "1478595": "Michael Matera", "0650374": "Vincent J. Orofino", "1100549": "Sheelagh Tellerday", "1196809": "Michael Variano", "0918219": "Erik Weiner", "0001165": "Charles S. Dutton", "3428515": "Peter Austin Noto", "0645290": "David Ojalvo"}, "geners": ["Crime", "Drama"], "runtimes": ["60"],  "plot": ["Tony and Carmela try a therapy session together and ends it angrily. Artie, meanwhile, tries to move in on Adriana. Bobby 'Bacala' Sr. comes out of retirement for one last job much to his son's objection after it ends tragically.", "As Tony requested, Carmela goes with him to one of his sessions with Dr. Melfi. It starts off okay, but suddenly Carmela feels she's the one on the hot seat and it quickly degenerates into name calling and anger.On the way home Tony gets speeding ticket from a no-nonsense policeman who isn't at all impressed that he stopped Tony Soprano. Tony approaches his crooked Assemblyman, Ronald Zellman, to get the ticket fixed but there are unexpected consequences. When one of the Spatafores is beaten by Mustang Sally, who is having a argument with his girlfriend, Gigi Cestone gets the green light from Tony to take action. Tony clears it with Mustang Sally's godfather, Bobby Bacala Senior, who is visiting from Miami. He's not well and Bobby Junior is worried when he hears that it's his Dad who will make the hit. Uncle Junior gets Johnny Sack to talk to Tony but his intervention is not welcome. Now that he's a made man, Christopher insists that Adriana quit her job at Artie Buco's restaurant. It all leads to a bit of a crisis for Artie who has fallen in love with her. The FBI run into a problem with wiretap in Tony's basement.—garykmcd", "Tony takes up Dr. Melfi on her suggestion that Carmela join a therapy session, but things don't go so well and the couple finish the session enraged at each other. Driving home angry, Tony is stopped by a cop and given a speeding ticket, but a phone call to the local assemblyman soon results in a canceled ticket and a fired officer. Artie, meanwhile, becomes upset when Adriana announces she's quitting. He tells Tony that he's in love with her, not caring that her boyfriend Chris is a violent and emotionally disturbed mobster. He later proposes a business deal with Tony, causing his wife Charmaine to announce that their marriage is over.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705228", "rating": 8.6, "votes": 8398, "number_of_episodes": 86}