{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0797464": "Jamie-Lynn Sigler", "0407615": "Robert Iler", "0878152": "Aida Turturro", "0893247": "John Ventimiglia", "0621393": "Kathrine Narducci", "0771993": "Steve Schirripa", "0144843": "Federico Castelluccio", "1168980": "Robert Funaro", "0012178": "Jerry Adler", "0148466": "Jason Cerbone", "0278468": "John Fiore", "0045935": "Joseph Badalucco Jr.", "0342106": "Dan Grimaldi", "0521087": "George Loros", "0162576": "Frank Ciornei", "0046518": "Vitali Baganov", "1478393": "Jana Januskova", "0002399": "Alik Sakharov", "1295682": "Igor Zhivotovsky", "0684992": "Turk Pipkin", "1277079": "Joe Pucillo", "1477953": "Matt Cerbone", "1477927": "Dominick Charles Carbone", "0888347": "Maureen Van Zandt", "0301713": "Domenica Galati", "1478287": "Tyler Gulizio", "0441777": "Loulou Katz", "1478457": "Kelly Madison Kole", "0673674": "Annika Pergament", "1477967": "Rosie Chavolino", "0164868": "Larry Clarke", "1478401": "Capathia Jenkins", "0530069": "Diego López", "0728346": "Michael Rispoli", "0665114": "Vincent Pastore", "1682669": "Frank Delano", "1571761": "Sian Heder", "1478712": "Randi Newton", "0722605": "Tony Rhune", "1035952": "Patrick Riviere", "1119663": "Barry Shurchin"}, "geners": ["Crime", "Drama"], "runtimes": ["46"],  "plot": ["Tony starts having flashbacks about Pussy's betrayal, and then later discovers that Jackie Jr. has been failing in his responsibilities.", "Christmas is coming and it all proves to a stressful time for Tony who has another panic attack. Tony keeps thinking about his old friend Pussy - he usually played Santa at the Christmas party - and recalls a past meeting Pussy missed, perhaps to meet with the FBI. He also begins to wonder about one particular Christmas where Pussy was not himself and thinks he may have been wearing a wire. Janice wants to host Christmas dinner but Carmela ends up doing most of the work because of a sore wrist from her encounter with the Russians. Which reminds Tony of another chore he has to take care of. When Tony sees Jackie Jr. getting a lap dance at a strip club he teaches him a lesson and begins to doubt Jackie Jr.'s reliability. On Christmas day Tony isn't quite prepared for the gift he receives from Meadow.—garykmcd", "This Christmas, Satriale's needs someone to play Santa now that Pussy isn't around anymore. This causes Tony to think back on their past together, to find just when Pussy started working for the FBI. Later, while preparing Christmas dinner, Janice comments that her wrist still hurts from the time the Russians paid her a visit. Tony gets the name of the goon who hurt her and provides his sister with an early Christmas gift. Still later, he catches Jackie Jr. getting a lap dance from one of the girls at the Bada Bing. Enraged that Jackie is cheating on his daughter, Tony beats him up, after which he learns that Jackie is also flunking out of college. The kid promises that he'll still take care of Meadow without getting into mob business, but his excuses ring of desperation.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705287", "rating": 8.5, "votes": 8046, "number_of_episodes": 86}