{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0893247": "John Ventimiglia", "0144843": "Federico Castelluccio", "0771993": "Steve Schirripa", "1168980": "Robert Funaro", "0621393": "Kathrine Narducci", "0545408": "Nancy Marchand", "0001592": "Joe Pantoliano", "0012178": "Jerry Adler", "0726200": "Peter Riegert", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0459853": "Alla Kliouka", "0192603": "Vincent Curatola", "0278468": "John Fiore", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0521087": "George Loros", "0539273": "Richard Maldone", "0665114": "Vincent Pastore", "0930707": "Gregory Alan Williams", "0876442": "Patrick Tully", "0120961": "Nicole Burdette", "1155742": "Ralph Lucarelli", "0574513": "Peter McRobbie", "0029512": "Sharon Angela", "0148466": "Jason Cerbone", "0302941": "Tim Gallin", "0369253": "Marcia Haufrecht", "0888347": "Maureen Van Zandt", "0031610": "Vito Antuofermo", "0214599": "Dimitri DeFresco", "1469245": "Marie Donato", "1020152": "Katalin Pota", "0006574": "Ed Vassallo", "0262771": "Gary Evans", "1169320": "Frank Pando", "1471091": "Carlos Lopez", "0833426": "Michael Strano", "0291856": "Raymond Franza", "0517752": "Gaetano LoGiudice"}, "geners": ["Crime", "Drama"], "runtimes": ["57"],  "plot": ["An unexpected death brings the whole family together one more time, and old tensions resurface while at the funeral.", "Tony is stressed and having to deal with a number of problems. Big garbage collecting contracts are up and several crews want a bigger share of the pie. As well, he's afraid his mother may testify against him in the stolen airline tickets scam. When Meadow comes home with a classmate to get some work done Tony takes an immediate disliking to the young man who describes himself as Jewish and African-American. Tony gets a reprieve on at least one front when they get the news that his mother Livia has died. He's torn between jumping for joy and maintaining a proper sense of loss. He insists that Janice return from Seattle assuring her there will be no problem with the Richie Aprile issue. She comes back reluctantly but soon decides to have a proper funeral for Livia, even though the dead woman specifically requested there be none. When Janice asks people at the wake to say something nice about their dealings with Livia no one has much to say. Carmela lays it on the line however. At school meanwhile, Meadow's roommate is acting strangely.—garykmcd", "While Tony is working in the yard, Carmela gets a call that Livia has died. As they plan the funeral, Janice throws things into disarray by saying she won't be going. Tony convinces her that she's in no danger of arrest for killing Richie, so she agrees to be there. After the funeral, Janice insists that everyone share their memories of Livia, and only Fannie, the friend she accidentally ran over, has anything good to say about her. Earlier, Meadow comes home from college with her new boyfriend, whom Tony sends off once he learns that he's half Black and half Jewish.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705273", "rating": 8.6, "votes": 8829, "number_of_episodes": 86}