{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0797464": "Jamie-Lynn Sigler", "0407615": "Robert Iler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0893247": "John Ventimiglia", "0001592": "Joe Pantoliano", "0012178": "Jerry Adler", "0148466": "Jason Cerbone", "0205789": "Andy Davoli", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0029512": "Sharon Angela", "0143295": "Max Casella", "0189965": "Louis Crugnali", "0566489": "Will McCormack", "0684992": "Turk Pipkin", "0045601": "Joe Bacino", "0094471": "Frank Bongiorno", "1479059": "Charles Trucillo", "0913175": "David Warshofsky", "1479022": "Nick E. Tarabay", "0649729": "Daniel Oreskes", "1469269": "Mark Karafin", "1478455": "Bill Kocis", "1477880": "Matthew Breiner", "1478279": "Ian Group", "1478823": "Cyndi Ramirez", "1259207": "Tommy Savas", "0678061": "Richard Petrocelli", "0177056": "Gregory Russell Cook", "0097631": "Jay Boryea", "1565108": "David Ross", "1475210": "Scout", "1473559": "Ashen Keilyn", "1478830": "Nigel Rawles", "1478835": "Rimas Remeza", "1479111": "David Weintraub", "0001711": "Annabella Sciorra", "0275394": "James Feuer", "3078932": "Lady Gaga", "1426795": "Charlie Sara"}, "geners": ["Crime", "Drama"], "runtimes": ["56"],  "plot": ["Tony continues seeing Gloria, another of Dr. Melfi's patients, while Meadow continues seeing Jackie Jr.", "Thanks to somebody's bad bet, Christopher becomes the owner of a bar and he makes Adriana the owner of record and the manager. She renames the place Crazy Horse. When a drug dealer, Matush, is thrown out of the club for selling drugs in the men's room, he approaches Jackie Jr. for help. Jackie, the would be gangster, tells him he'll take care of it. Christopher flatly refuses permission to sell drugs on the premises but that isn't quite the message Jackie gives Matush. Jackie Jr. and Meadow are seeing a lot of each other and Carmela in particular isn't at all comfortable with the arrangement. Tony speaks to Jackie who assures him that school is going well and that he has nothing to worry about. AJ gets into deep trouble when he and some of his friends vandalize the pool area at his school. Tony begins spending more time with Gloria Trillo.—garykmcd", "Tony makes another date with Gloria, whom he earlier met at Dr. Melfi's office. Though he remains unaware of why Gloria was in therapy, she could be dangerously unstable. Meadow, meanwhile, is growing closer with Jackie Jr., a development that is causing Carmela increasing concern. After Tony has a long talk with Jackie Jr., though, he feels that the boy's intentions are good and that he's not going to get involved in family business. Chris, meanwhile, buys a club for Adriana to manage, which he thinks will be a safe place for him to conduct business. When he catches someone dealing drugs in the toilet, he becomes enraged and throws the dealer, Matush, out. This dealer, however, is friends with Jackie Jr., who tries to talk Chris into letting Matush continue his business. Humiliated by Chris' refusal to budge, Jackie lies to Matush about the outcome of his talk, which has dire consequences when Matush is caught dealing again.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705284", "rating": 8.0, "votes": 7839, "number_of_episodes": 86}