{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0144843": "Federico Castelluccio", "0771993": "Steve Schirripa", "0573481": "Sam McMurray", "0939703": "Frank Wood", "0101604": "Sully Boyar", "0342106": "Dan Grimaldi", "0435677": "Toni Kalem", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0763883": "Frank Santorelli", "0484992": "Ilene S. Landress", "0059779": "Ismail Bashey", "0203897": "Peter Davies", "0279955": "John Fiske", "1478202": "John Freudiger", "2484265": "Lorenzo Gregorio", "0355024": "Tony Hale", "1478454": "Zachary Knower", "1255793": "James Shanklin", "0434360": "Shireen Kadivar", "1537846": "Pete Macnamara", "1317851": "Joe Rosario"}, "geners": ["Crime", "Drama"], "runtimes": ["60"],  "plot": ["Junior continues his cancer treatments, but the prognosis is iffy. Chris, meanwhile, finds himself under suspicion from Paulie.", "Junior undergoes an operation to have his cancerous tumor removed. His doctor tells him it's possible that malignant cells weren't removed and recommends a second round of surgery. Tony feels he should get a second opinion but when Junior's original doctor stops returning his call, Tony pays him a visit on the golf course. Carmella visits Dr. Melfi on her own saying she's worried about Tony's mood swings but really is in need of help herself. Melfi refers her to another psychiatrist who provides her with some realistic advice. Carmela runs into Angie Bompensiero who doesn't seem to be coping well with Big Pussy's sudden disappearance especially on the money front. Tony pays her a visit but is less sympathetic when he sees she has a Cadillac sitting in the driveway. Christopher chafes under Paulie's thumb and the probationary period he has to go through as a newly made man. Paulie makes him undergo a strip search and then visits him at two in the morning to search his apartment.—garykmcd", "Carmela decides to go to a session with Dr. Melfi by herself. Dr. Melfi refers her to another psychiatrist, who immediately advises Carmela to leave Tony once he learns what his occupation is. Later, Carmela encounters Pussy's wife, who mentions that she's being overwhelmed with bills now that her husband has disappeared. Junior goes into surgery to remove a tumor from his stomach, and while under anesthesia sees visions of the FBI giving him the cure for cancer in exchange for his testimony. Chris gets furious at Paulie when senior mobster accuses him of wearing a wire and repeatedly forces Chris to undergo humiliating searches.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705275", "rating": 8.3, "votes": 7949, "number_of_episodes": 86}