{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0893247": "John Ventimiglia", "1168980": "Robert Funaro", "0001592": "Joe Pantoliano", "0012178": "Jerry Adler", "0148466": "Jason Cerbone", "0278468": "John Fiore", "0205789": "Andy Davoli", "0930707": "Gregory Alan Williams", "0029512": "Sharon Angela", "0000953": "Peter Bogdanovich", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0310966": "Ari Graynor", "0192603": "Vincent Curatola", "0342106": "Dan Grimaldi", "0304430": "Joseph R. Gannascoli", "0684992": "Turk Pipkin", "0135406": "Carl Capotorto", "0143295": "Max Casella", "0291856": "Raymond Franza", "1477789": "Anne Assante", "1260202": "Denise Borino-Quinn", "1477925": "Kieran Campion", "0201769": "William DaRuffa", "1236766": "Michael Hogan", "0673674": "Annika Pergament", "1270191": "Margo Singaliese", "1068588": "Ariel Kiley", "0001711": "Annabella Sciorra", "0517752": "Gaetano LoGiudice", "0001505": "Joe Mantegna", "0686236": "Lori Pizzo"}, "geners": ["Crime", "Drama"], "runtimes": ["54"],  "plot": ["Tensions rise between Tony and Ralphie until circumstances demand that they resolve their differences. Meadow gets involved with Jackie's son, and ends up in trouble.", "Meadow and Jackie Aprile Jr. meet at a frat party and start taking an interest in one another. Tony and Ralphie Cifaretto are still feuding with Ralph refusing his offer to buy him a drink. The insult leads Tony to cancel their previous invitation to Thanksgiving dinner but Carmela's story about canceling dinner doesn't hold up for very long when Jackie Jr. shows up at the house to see Meadow. Carmela's not too keen on the two of them seeing each other. Ralph meanwhile goes to Johnny Sack to see if he could possibly switch families. He follows Johnny's advice and goes to Tony to apologize. When Gigi Cestone dies unexpectedly, Tony has to decide whether to make Ralph a capo. At Dr. Melfi's office, Tony runs into another of her patients, Gloria Trillo, a Mercedes salesperson. Tony decides to get himself a new car.—garykmcd", "Still angry at each other for Ralphie's treatment of Tracee and the beating Tony gave him in retaliation, the two continue to simmer at each other. After further insults and disrespect, Ralphie is advised to make amends with Tony before he gets himself in trouble that he can't get out of. Tony, meanwhile, is advised to accept Ralphie's apology. When a high-ranking capo dies from natural causes, Tony finds himself short-handed and realizes that Ralphie, as his most senior man, is the natural choice for the position. Meadow, meanwhile, starts getting involved with Ralphie's nephew Jackie Jr, much to Carmela's concern. Later, Meadow takes Jackie Jr.'s car while drunk and totals it by driving off the road.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705251", "rating": 8.3, "votes": 7848, "number_of_episodes": 86}