{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0001592": "Joe Pantoliano", "0726200": "Peter Riegert", "0739087": "Richard Romanus", "0869467": "Shaun Toub", "0000953": "Peter Bogdanovich", "0192603": "Vincent Curatola", "0278468": "John Fiore", "0029512": "Sharon Angela", "0045007": "Oksana Lada", "0148466": "Jason Cerbone", "0566489": "Will McCormack", "0888347": "Maureen Van Zandt", "1260202": "Denise Borino-Quinn", "0262771": "Gary Evans", "0324036": "Traci Godfrey", "1478285": "Zabryna Guevara", "0450331": "Glenn Kessler", "0475218": "Stephen Kunken", "1036652": "JillMarie Lawrence", "0689205": "Mario Polit", "1020152": "Katalin Pota", "1387053": "Bobby Rivers", "1295682": "Igor Zhivotovsky", "2192913": "Charlie Kevin"}, "geners": ["Crime", "Drama"], "runtimes": ["53"],  "plot": ["Dr. Melfi has a personal crisis. Janice has a dispute with Svetlana. Ralphie gets passed over for a promotion and Jackie Jr. gets involved in the family's crime activities.", "Things are not going well in the garbage wars and Tony decides to put one of his own men in charge Richie Aprile's old crew, ousting Ralphie Cifaretto, who has been in charge temporarily. At least part of the reason he replaces him is that he let Jackie Aprile Jr. help him beat up a client when trying to collect a debt. Dr. Melfi meanwhile is brutally attacked and raped in the stairwell of her office building. When the police are forced to release the suspect due to procedural errors on their part, she is outraged and seriously considers asking Tony for his help. As Tony had warned her, Janice learns there is a price to pay for refusing to return Svetlana's stolen leg.—garykmcd", "After leaving work, Dr. Melfi is attacked, beaten and raped in a parking garage. Later, she learns that although the police caught her attacker, he was released due to bureaucratic incompetence. She has a dream later of a large attack dog that kills the rapist, which her therapist interprets as the justice she could get if she went to Tony with what happened. After giving the matter much anguished thought, she declines to bring him further into her life. Tony, meanwhile, becomes angry at Ralphie Cifaretto for bringing Jackie Aprile's son along on a collection job, as the dying man had asked Tony to keep his son out of the business. Also, Janice receives a visit from the Russian mafia over the matter of a stolen leg.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705243", "rating": 9.1, "votes": 9831, "number_of_episodes": 86}