{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0797464": "Jamie-Lynn Sigler", "0407615": "Robert Iler", "0771993": "Steve Schirripa", "0148466": "Jason Cerbone", "0045007": "Oksana Lada", "0046518": "Vitali Baganov", "0162576": "Frank Ciornei", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0310966": "Ari Graynor", "0288935": "Crystal Fox", "1478245": "Dayna Gizzo", "1137759": "Deepa Purohit", "1478935": "Anya Shetler", "0001711": "Annabella Sciorra"}, "geners": ["Crime", "Drama"], "runtimes": ["60"],  "plot": ["While Silvio has the flu, Chris and Paulie run his collections for him, which results in the pair getting lost in the woods and nearly freezing to death while Tony's affair with Gloria goes sour as does Meadow's relationship with Jackie Jr.", "Christopher and Paulie are out making collections but things get out of hand and they soon have a body to dispose of. They decide to dispose of it in Pine Barrens in South Jersey. They get to the woods only to find that their victim is still alive. He manages to run off on them and in the pursuit, Christopher and Paulie get themselves lost. As darkness falls, the cold takes over, and it's particularly hard on Paulie who has lost one of his shoes. They take refuge in an abandoned truck but have no choice but to call Tony and ask him to rescue them. Tony is still seeing Gloria Trillo, usually at lunch time. He decides to come clean and tell Dr. Melfi that he's seeing another of her patients. Gloria is something of a Jekyll and Hyde however with wide mood swings. Melfi asks Tony if Gloria's behavior reminds him of anyone. When Jackie Jr. fails to call her, Meadow is certain he is cheating on her. She sets out to find out what he's up to.—garykmcd", "Paulie and Chris goes to collect a debt for Silvio, but everything goes terribly wrong and Paulie and Chris ends up lost in the woods of Pine Barrens. At the same time, Tony is having problems keeping both his family and his girlfriend satisfied.—Morty_man91", "Silvio is sick and can't do his rounds, so he asks Chris and Paulie to make his collections. While collecting from a Russian named Valery, they get into an argument that ends in Paulie strangling the man to death. Now with a body to take care of, Chris suggests they go to the Pine Barrens and dump it in the woods. Once they arrive, however, they discover Valery is still alive. After a chase through the woods, the pair realize they're lost in the snow in the middle of the night with no shelter and no way to call for help. Meadow, meanwhile, continues to see Jackie, but becomes distraught when he keeps leaving their dates early. Growing suspicious, she follows him and catches him with another woman. In a similar situation, Tony finds himself facing Gloria's anger when Irina calls him in the middle of one of their dates. After mentioning to Dr. Melfi that Gloria is easily angered and impossible to please, the doctor draws a connection with another woman in Tony's life, but he fails to see it.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705272", "rating": 9.7, "votes": 18670, "number_of_episodes": 86}