{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0144843": "Federico Castelluccio", "0771993": "Steve Schirripa", "0001592": "Joe Pantoliano", "1068588": "Ariel Kiley", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0310966": "Ari Graynor", "0876442": "Patrick Tully", "0029512": "Sharon Angela", "0148466": "Jason Cerbone", "0888347": "Maureen Van Zandt", "0278468": "John Fiore", "0342106": "Dan Grimaldi", "0763883": "Frank Santorelli", "0304430": "Joseph R. Gannascoli", "0307288": "Michael Garfield Levine", "1471930": "Daniel T. Booth", "0580226": "Yvette Mercedes", "2035352": "Richard Verdinio", "1201823": "Michette Ardente", "1478457": "Kelly Madison Kole", "2041863": "Luiza Liccini", "2038229": "Marie Athanasiou", "1682669": "Frank Delano", "3371955": "John Landolfi", "0517752": "Gaetano LoGiudice"}, "geners": ["Crime", "Drama"], "runtimes": ["49"],  "plot": ["Noah's and Meadow's relationship is disrupted by her roommate, while Ralphie starts getting rough with one of the strippers from the Bada Bing causing Tony to intervene and questionably violating one of the mafia codes of conduct.", "Ralph Cifaretto, who is still having a relationship with Rosalie Aprile, is having girlfriend problems with one of the dancers at the Bada Bing, Tracee. She asks Tony for help when she gets pregnant by Ralph since she isn't sure Ralph will take care of her if she has the baby. Ralph has been acting over the top lately and when he kills Tracee in the Bing's parking lot, Tony teaches him a lesson. At Columbia, Meadow and Noah's relationship is moving forward but Meadow's roommate Caitlin Rucker is behaving very oddly. She's not fitting in with university life and reaches out to Meadow who is sympathetic but doesn't appreciate just how serious the problem is. Noah is also sympathetic, at least at first, but eventually gets his entertainment lawyer father to get a restraining order against Caitlin. Meadow gets to meet Noah's Dad but Noah shows his true colors.—garykmcd", "Meadow and Noah start getting more intimate, but problems arise from Meadow's roommate, Caitlin. Extremely insecure and handling the pressures of living on her own very badly, Caitlin becomes increasingly dependent on the pair for emotional and academic support. Meanwhile Tracee, one of the strippers at the Bada Bing, tells Tony that she's pregnant with Ralphie's child. Ralphie, for his part, becomes increasingly belligerent, picking fights with Georgie at the club and getting more violent with Tracee. When he goes too far and beats the girl to death, Tony punishes him brutally. Although he tries to keep an emotional distance from the girls at the club, Tony finds that Tracee's death has left him devastated.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705291", "rating": 8.7, "votes": 8979, "number_of_episodes": 86}