{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0001592": "Joe Pantoliano", "0726200": "Peter Riegert", "0193554": "Vondie Curtis-Hall", "0215682": "Matthew Del Negro", "0045007": "Oksana Lada", "0135406": "Carl Capotorto", "1168980": "Robert Funaro", "0322164": "Lola Glaudini", "0949744": "Karen Young", "0671023": "Frank Pellegrino", "0029512": "Sharon Angela", "0888347": "Maureen Van Zandt", "0510096": "Vanessa Liguori", "0785854": "Matt Servitto", "0304430": "Joseph R. Gannascoli", "0821139": "Lewis J. Stadlen", "0956538": "Richard Ziman", "0342106": "Dan Grimaldi", "0539273": "Richard Maldone", "0143295": "Max Casella", "0763883": "Frank Santorelli", "0057217": "Malcolm Barrett", "1256065": "Anna Mancini", "0502906": "Marianne Leone", "0566478": "Patty McCormack", "1479000": "Messeret Stroman", "0561771": "Melissa Maxwell", "2003781": "Sally Stewart", "1478596": "Geany Masai", "1478347": "Nichelle Hines", "0072924": "Ephraim Benton", "1478510": "Shawn Leggett", "1478731": "Philliph Oden", "0875818": "Chad Tucker", "0915776": "Matthew Weathers", "1477767": "Jay Alvarez", "1478599": "Victor Matamoros", "0741279": "Bonnie Rose", "0205401": "Roy Milton Davis", "1479152": "Ali Wright", "0296837": "Angela Frye", "0517752": "Gaetano LoGiudice", "0004095": "Bobbie Phillips", "0869465": "Lauren Toub"}, "geners": ["Crime", "Drama"], "runtimes": ["53"],  "plot": ["Adriana learns that life is not like TV shows, while Tony discovers that a former girlfriend has moved on, along with Ralphie and others they scam the Department of Housing and Urban Development.", "Paulie's out of jail and his friend's throw him a party at the Bada Bing. He's still not very happy about he's been treated both before and after he went to jail and the fact that Tony did little while he was there. He turns to Johnny Sack who lends a sympathetic ear. Adriana, still under pressure from the FBI to provide more information, learns from a TV show that a wife can't be forced to testify against her husband. Christopher's not having anything to do with it, especially after she tells him she may not be able to have kids. He relents but not before Adriana learns that she could be called to testify after all. Carmela's cousin, financial analyst Brian, tells Tony of a way to scam the Department of Housing and Urban Development. Carmela's feelings for Furio may be mutual but he starts to avoid her. Assemblyman Zellman tells Tony he's seeing his old girlfriend Irina. Tony seems to take it okay but he's obviously irritated. It's all too much for him in the end.—garykmcd", "Adriana is getting put under more pressure by the FBI to collect information about Chris and the rest of the family. One day, she watches a TV show and hears about marital privilege: supposedly husbands and wives can't be forced to testify against their spouses. Eagerly hoping for a way out, she begins pressing Chris to marry her. Her hopes are dashed, however, when the FBI agents actually encourage her to get married, and she learns that marital privilege won't allow her to conceal what she knew before marrying Chris, doesn't apply to anything Chris says in front of anyone else, and most importantly doesn't protect anything Chris says about committing crimes. Meanwhile, at a party to celebrate Paulie's return after a stay in prison, Tony gets involved in a plan with assemblyman Zellman to defraud HUD with a phony housing scam, but then flies into a violent rage when he discovers that Zellman is now seeing Tony's former mistress, Irina.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705292", "rating": 8.1, "votes": 7446, "number_of_episodes": 86}