{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0893247": "John Ventimiglia", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0022883": "Bruce Altman", "0692466": "Richard Portnow", "0135406": "Carl Capotorto", "0488839": "Liz Larsen", "0201435": "Cynthia Darlow", "0534398": "Bruce MacVittie", "0342106": "Dan Grimaldi", "0513401": "Tony Lip", "0143295": "Max Casella", "0949744": "Karen Young", "0459853": "Alla Kliouka", "0045007": "Oksana Lada", "0017651": "Tom Aldredge", "1260202": "Denise Borino-Quinn", "1478007": "Curtiss Cook", "0881265": "Universal", "0785854": "Matt Servitto", "1169320": "Frank Pando", "0201700": "Tony Darrow", "0053326": "Randy N. Barbee", "1477944": "Dan Castleman", "0315275": "Humberto Gettys", "0526986": "Robert LuPone", "1052666": "Will Janowitz", "1277079": "Joe Pucillo", "0545549": "Jeffrey M. Marchetti", "5903330": "Judith Anderson", "0111131": "Diana Brownstone", "1478537": "Emanuel Loarca", "1478368": "Rosemarie Hue", "0743561": "Julie Ross", "3428515": "Peter Austin Noto", "1728156": "Richard Zhuravenko"}, "geners": ["Crime", "Drama"], "runtimes": ["72"],  "plot": ["Junior's trial comes to an end, but Tony's trials are just getting underway. Also, the Sopranos almost purchase a house on the beach.", "Tony is surprised though not displeased when Johnny Sack suggests that eliminating Carmine may be the best way to resolve the differences between the two families. A plan of action is set in motion but is interrupted when Carmine suddenly becomes more flexible. Money is still tight with the Esplanade site shut down, but Tony decides to make an offer on a seaside property. Even Carmela smiles for the first time in ages when she sees the house. All hell breaks loose however when Tony's old girlfriend Irina calls Carmela to tell her he is now having sex with her cousin, the one-legged Svetlana. It's the last straw for Carmela who tells Tony their marriage is finished and she wants him out of the house. Tony is now faced with having to terminate the deal to buy the beach house and uses his own unconventional methods to convince the sellers to return his deposit. Meanwhile, Uncle Junior's trial comes to an end and his men have sought a little bit of extra insurance to get the verdict they want.—garykmcd", "Tony decides that buying a house on the shore may be the thing that can bring the family back together. As things are getting underway, however, Irina calls the house and begins to harass Carmela about her husband's infidelity. When Tony gets home he finds his wife in a rage because of all the humiliation she's had to endure, and that it's now coming into her own home. After a long and bitter fight, Tony agrees to leave. When the owners of the beach house try to prevent Tony from canceling their contract, they discover what happens when you try to squeeze the mob. Junior's trial, meanwhile, ends in a mistrial after one of the jurors refuses to convict because of threats made against his family.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705294", "rating": 9.3, "votes": 10423, "number_of_episodes": 86}