{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0893247": "John Ventimiglia", "0001592": "Joe Pantoliano", "0066664": "Leslie Bega", "0258103": "Frances Ensemplare", "0215682": "Matthew Del Negro", "0135406": "Carl Capotorto", "0029512": "Sharon Angela", "0342106": "Dan Grimaldi", "0776584": "Paul Schulze", "0665414": "Anthony Patellis", "0170239": "Charlotte Colavin", "0034006": "Murielle Arden", "0546868": "David Margulies", "0074105": "Anna Berger", "0030876": "Fran Anthony", "0870385": "Candy Trabuco", "0143295": "Max Casella", "0140433": "Dennis Carrig", "1478075": "Nino DelDuca", "1307682": "Modi", "1478299": "Manon Halliburton", "1435180": "Heidi Dippold", "1373084": "Tone Christensen", "0908933": "Roberta Wallach", "0312217": "Jordan Gelber", "0621292": "Joe Narciso", "0713880": "Rufus Read", "1076709": "Sam Guncler", "1478757": "Marianna Paolo", "1665577": "Maria Bartiromo", "1602671": "Mario Batali", "0072924": "Ephraim Benton", "4240078": "Kathleen Wilce"}, "geners": ["Crime", "Drama"], "runtimes": ["56"],  "plot": ["Paulie has to take care of some rough relationships for his mother, while Tony's fancy for a fellow horse fancier lands him in trouble with Carmela.", "Furio has to return to Italy after his father falls seriously ill. Once there he gets advice from his uncle about his feelings for Carmela. Paulie arranges for his mother to move into Green Grove but is taken aback when some of the ladies there, some of them the mothers of fellow mobsters, won't let her into their circle. With his mother unhappy and in tears, Paulie is forced to go the their sons to get their moms to play nice. At the track visiting Pie-O-My, Tony meets Ralph Cifaretto's new girlfriend Valentina La Paz. She's an art dealer which comes in handy when he decides to have a portrait of himself and the horse painted. It also leads them straight to bed. Tony's uncomfortable seeing another mobster's girl but is intrigued when she tells him about Ralph's weird sexual preferences. Carmela catches him out however and decides to get even by spending some of the money he has stashed in the garden shed.—garykmcd", "Paulie, having just recently left prison, checks his aging mother in the Green Groves retirement home. She is initially thrilled to be with her old friends (also mothers of mob members), but is soon hurt when they ostracize her from their group. To force a reconciliation, Paulie sends some of his men to persuade the son of one of his mother's friends to talk his mom into being more inviting. Tony, meanwhile, meets Ralph's new girlfriend Valentina, who shares Tony's affection for Pie-O-My. Private conversations between the two about horses soon turn more intimate, and Tony returns home unknowingly carrying one of Valentina's false nails in his clothing. When Carmela discovers the nail, she immediately understands what has happened and, naturally furious, goes out to Tony's secret stash of money and makes some personal investments with it.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705265", "rating": 8.1, "votes": 7339, "number_of_episodes": 86}