{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0144843": "Federico Castelluccio", "0001592": "Joe Pantoliano", "0000953": "Peter Bogdanovich", "0135406": "Carl Capotorto", "1168980": "Robert Funaro", "0215682": "Matthew Del Negro", "1260202": "Denise Borino-Quinn", "0513401": "Tony Lip", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0029512": "Sharon Angela", "0888347": "Maureen Van Zandt", "1424150": "Julie Goldman", "0555488": "Joe Maruzzo", "0539273": "Richard Maldone", "0291856": "Raymond Franza", "0109175": "Richard Bright", "0139255": "Stan Carp", "1180264": "Jeff Robins", "0022987": "Lisa Altomare", "1471050": "Joseph Castellana", "1477817": "Soundis Bardu", "1256065": "Anna Mancini", "1208741": "Angelo Massagli", "0754805": "Stephen Sable", "1771714": "Ramon Fernandez", "1408803": "Elena Aaron", "1371419": "Chris Mazzilli"}, "geners": ["Crime", "Drama"], "runtimes": ["59"],  "plot": ["A joke sparks a series of hit contracts, while Carmela finds herself happier than perhaps she should be that Furio will be around for good.", "Johnny Sack is still upset about the wisecracks over his wife's weight and goes on the warpath seriously beating up one of Ralph Cifarello's men. When Ralphie returns from a trip to Miami, Tony tells him to make amends. After Ralph botches it, Johnny goes to Carmine and Junior for permission to get rid of him. When they say no he takes matters into his own hands. As tensions rise, Tony feels he has no choice but to defend one of his captains but there's a risk of an all out war between the two families. Sylvio and Christopher visit Junior's suggestion on outside help but it all proves to be a somewhat surreal experience. Meadow signs up as a volunteer at the law center. Carmela still wants to invest some of their money in a stock portfolio but Tony isn't sure. She also starts flirting with Furio who has bought his own house.—garykmcd", "Johnny Sack, still furious over Ralphie's insulting joke about his wife, first beats one of Ralphie's men savagely, then demands that Junior and Carmine sanction a hit on Ralphie. Unable to get the satisfaction he demands, Johnny takes matters into his own hands and calls in the hit himself. His rash actions are a serious threat to the peace of the families, not to mention the fact that Ralphie is Tony's biggest earner, leading Tony to call in a hit against Johnny to put an end to his vendetta. With the wronged husband come to his senses and forgive? Meanwhile, Carmela is increasingly smitten with Furio's charms and is overjoyed when he moves into the neighborhood permanently.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705286", "rating": 8.4, "votes": 7831, "number_of_episodes": 86}