{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0192603": "Vincent Curatola", "0001592": "Joe Pantoliano", "0000480": "Elias Koteas", "0459853": "Alla Kliouka", "0029512": "Sharon Angela", "0066664": "Leslie Bega", "0135406": "Carl Capotorto", "0949744": "Karen Young", "1213487": "Marissa Matrone", "0888347": "Maureen Van Zandt", "0539273": "Richard Maldone", "0143295": "Max Casella", "0342106": "Dan Grimaldi", "0304430": "Joseph R. Gannascoli", "0621597": "Arthur J. Nascarella", "0763883": "Frank Santorelli", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0502906": "Marianne Leone", "0813503": "Elena Solovey", "0518687": "Daniel London", "1160357": "Gurdeep Singh", "1478038": "Dane Curley", "1352888": "Cristina Ablaza", "0534287": "Heather MacRae", "0931700": "Sidney Williams", "0686165": "Carlos Pizarro", "1156914": "Herman Chavez", "1479070": "Burhan K. Uddin"}, "geners": ["Crime", "Drama"], "runtimes": ["53"],  "plot": ["In the midst of suspicions that he killed Ralph, Tony tries to intervene to get Chris clean and sober.", "Christopher's heroin addiction is now completely out of control. After he accidentally sits on Adriana's dog killing it, she freaks out. Her FBI contact tells her of the need to convince him to get help. Tony is also concerned and when Christopher is car-jacked and beaten up trying to buy heroin - Christopher's reaction when he gets home and Adriana suggests rehab is to slap her around - he decides it's time for him to intervene. Needless to say, not everyone seems to understand how an intervention is supposed to work. Everyone is wondering what's happened to Ralph but some begin to suspect Tony of getting rid of him. Johnny Sack wants a piece of some of Tony's recent scores but Tony won't share. Tony starts a rumor that Johnny Sack may be the one responsible for Ralph Cifarello's disappearance. Furio returns from Italy, his feelings for Carmela still unresolved. She too is still attracted to him and starts finding reasons to stop by his house. Tony opens up about his loss to Dr. Melfi but she knows his reaction to loss is usually rage.—garykmcd", "Disgusted and worried over Chris' deepening addiction and how its causing him to treat Adriana, Tony decides that something has to be done. Ignoring Junior's advice that Chris is more trouble than he's worth, Tony gets his associates together and stages an intervention. Things don't go as well as they hoped and tempers are lost, in Tony's case over the revelation that Chris accidentally killing Adriana's dog while high, and in Silvio's case over Chris' angry accusation that their predicament in the Pine Barrens was all his fault. When Chris goes too far Silvio beats him badly, putting him in the hospital with a skull fracture. Silvio's bad temper may have something to do with the fact that Ralph's disappearance is now public knowledge, and suspicions have all fallen on Tony.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705283", "rating": 8.9, "votes": 8274, "number_of_episodes": 86}