{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0893247": "John Ventimiglia", "0001592": "Joe Pantoliano", "0692466": "Richard Portnow", "1168980": "Robert Funaro", "0029512": "Sharon Angela", "0066664": "Leslie Bega", "0776584": "Paul Schulze", "1213487": "Marissa Matrone", "0194971": "Richard D'Alessandro", "0459853": "Alla Kliouka", "0258103": "Frances Ensemplare", "0813503": "Elena Solovey", "1478299": "Manon Halliburton", "0785854": "Matt Servitto", "0810750": "Brian Smyj", "1277079": "Joe Pucillo", "0304430": "Joseph R. Gannascoli", "1283940": "Rosa Nino", "1478038": "Dane Curley", "1477762": "Samuel Allen", "0034006": "Murielle Arden", "1478405": "Susan Jhun", "0747165": "Rob Leo Roy", "0655129": "Frankie Pace", "1169320": "Frank Pando", "1347232": "Maria Elena Ramirez", "0456705": "Bruce Kirkpatrick", "1214463": "Gene Gabriel", "3489959": "Ellen Orchid", "1085727": "Tim Kang", "1477932": "Ava-Marie Carnevale", "1217827": "Debargo Sanyal", "0201700": "Tony Darrow", "0053326": "Randy N. Barbee", "1477944": "Dan Castleman", "0534398": "Bruce MacVittie", "0743561": "Julie Ross"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Ralph's callous behavior finally steps over the line, while Chris gets deeper into his heroin addiction and Uncle Junior's mental capacity begins to become in question.", "After Uncle Junior falls on the courthouse steps, he's admitted to the hospital and Tony thinks they have the basis of a mistrial on the basis of diminished capacity. They set him up with home care and rehearse him with the questions government doctors will likely ask him. Ralphie thinks he's figured out who told Johnny Sack of the joke he made at his wife's expense and sets out to even the score. Things turn deadly serious when his son Justin is seriously hurt playing with a friend. Tony brings Carmela to the stables to see Pie-O-My for the first time. Tony is devastated however when he learns that the horse was badly injured in a fire at the stables and had to be put down. He suspects Ralphie had the fire set so he could collect on insurance and they get into a fight. Tony needs Christopher's help to clean up the results but soon realizes he's high on drugs.—garykmcd", "A fire at the stable leaves Pie-O-My badly burned, making it necessary to have her put down. When Tony sees the injured horse, he is badly shaken by her suffering, and immediately suspects that Ralph had the fire set into order to kill the horse for insurance money. When he confronts Ralph, Ralph is more concerned over the condition of his son, who was badly injured playing with friends and is now in a coma. Though Ralph denies that he had anything to do with Pie-O-My's death, he mocks Tony for his concern, sending Tony into a rage during which he beats Ralph to death, furious over the death of an innocent creature. Knowing that killing a member of his own gang for personal reasons will turn the rest of the members against him, he calls Chris to help him dispose of the body, telling him that Ralph was already dead and he doesn't know who killed him. Even in his heroin-induced haze, Chris sees the truth but still helps to get rid of the body.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705295", "rating": 9.3, "votes": 10088, "number_of_episodes": 86}