{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0893247": "John Ventimiglia", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0621393": "Kathrine Narducci", "0001592": "Joe Pantoliano", "0012178": "Jerry Adler", "0726200": "Peter Riegert", "0739087": "Richard Romanus", "0692466": "Richard Portnow", "0776584": "Paul Schulze", "0135406": "Carl Capotorto", "1168980": "Robert Funaro", "0887696": "Joyce Van Patten", "0005173": "Roma Maffia", "0029512": "Sharon Angela", "1478766": "Christine Pedi", "0888347": "Maureen Van Zandt", "0342106": "Dan Grimaldi", "0304430": "Joseph R. Gannascoli", "0143295": "Max Casella", "0931354": "Montel Williams", "0796351": "Joseph R. Sicari", "0783353": "Larry Sellers", "0723339": "Alex Rice", "0763883": "Frank Santorelli", "0513401": "Tony Lip", "1260202": "Denise Borino-Quinn", "1477746": "Mary Aguilar", "0337106": "Jerry Grayson", "0891485": "Yul Vazquez", "0084267": "Val Bisoglio", "1277079": "Joe Pucillo", "0228105": "Nick Di Paolo", "1478892": "Robert Salas", "1478479": "Irma-Estel Laguerre", "1478898": "Sami Sargent", "0201700": "Tony Darrow", "0053326": "Randy N. Barbee", "1477944": "Dan Castleman", "0534398": "Bruce MacVittie", "0743561": "Julie Ross", "1208741": "Angelo Massagli", "0818283": "Lexie Sperduto", "0641656": "Michael O'Looney", "1478667": "John Montone", "0593931": "Carmine Mitore", "0144685": "Donna Castellano", "3196367": "Anthony Rocco Cavaleri", "0157915": "Nick Chinlund", "1955608": "Greg D'Agostino", "0457810": "Kaye Kittrell", "1471303": "Philip Ng", "1961516": "Craig Zucchero"}, "geners": ["Crime", "Drama"], "runtimes": ["55"],  "plot": ["Columbus Day ignites tensions between Italians and Native Americans, and Bobby receives devastating news about his wife.", "Paulie gives Johnny Sack a call and tells him about the joke Ralphie made at his wife's expense. Johnny lets his displeasure be known. Ralphie ends his relationship with Rosalie Aprile so he can move in with Janice but Janice's reaction isn't quite what he expected. Many in the crew, especially Sylvio, are upset when they hear that Native Americans are going to disrupt the annual Columbus Day parade. Their first attempt to do something ends up with several of them going to jail. Tony thinks they're over reacting but feeling he has to support his men, he gets in touch with man in charge of a large Native American-owned casino to see what could be done. Uncle Junior's trial starts, the first Soprano trial in 16 years. He's upset because he's learned that the FBI had an undercover agent in his doctor's office. There are problems at the church when a guest speaker insults some of the wives, including Carmela. They are taken aback however when they learn that Karen Baccalieri is killed in a car accident.—garykmcd", "A Native American group plans a protest against Christopher Columbus on Columbus Day. Silvio, intensely proud of his heritage, recruits Patsy, Ralph and Artie to disrupt the parade. The mob wives take offense when a speaker invited by Father Phil talks about the way they live and how they are portrayed by the media. Ralph breaks up with Rosalie to move in with Janice, but he does not get the reaction he expected from her. Bobby suffers an incredibly crippling loss, in which Carmela, Rosalie and Gabriella feel sympathy for him.—Emphinix", "As Columbus Day festivities are being prepared, word gets out that a Native American group is going to stage a protest to raise awareness about the negative results of the famous voyage. Silvio, intensely proud of his heritage, takes this as a personal affront and attempts to break up the protest himself. Carmela, meanwhile, attends a luncheon where she is singled out by a speaker who rails against mob wives perpetuating the stereotype of Italians as criminals. This in turn draws criticism against the priest who organized the event for publicly attacking someone he happily accepts huge donations from in private. Paulie passes on Ralphie's joke to Johnny Sack about Johnny's wife, touching off new tensions between the families. Also, Bobby Bacala learns that his wife has been killed in a car accident. Since Bobby, unlike the rest of the mob husbands, had always been faithful to his wife, the rest of the wives take pity on him. Touched by Bobby's devotion, Janice throws Ralph out of her life, as well as down a flight of stairs.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705234", "rating": 7.8, "votes": 8174, "number_of_episodes": 86}