{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0878152": "Aida Turturro", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0001592": "Joe Pantoliano", "0009410": "Ray Abruzzo", "0000953": "Peter Bogdanovich", "0692466": "Richard Portnow", "1168980": "Robert Funaro", "0513401": "Tony Lip", "0379200": "Paul Herman", "0304430": "Joseph R. Gannascoli", "1085297": "Jessica Dunphy", "1208741": "Angelo Massagli", "0818283": "Lexie Sperduto", "0459853": "Alla Kliouka", "0813503": "Elena Solovey", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "1296597": "Crystal Allen", "0555488": "Joe Maruzzo", "0817234": "George Spaventa", "1155450": "Kevin Interdonato", "0764321": "Steve Santosusso", "0201700": "Tony Darrow", "0053326": "Randy N. Barbee", "1477944": "Dan Castleman", "1277079": "Joe Pucillo", "0743561": "Julie Ross", "0001711": "Annabella Sciorra", "0264328": "Patrick Ezerzer", "1036058": "Ethan S. Smith"}, "geners": ["Crime", "Drama"], "runtimes": ["48"],  "plot": ["Tony's dreams seem to tell him where his life is headed, but he still feels as though he's out of control.", "Tony's been having strange dreams of late but isn't happy with Dr. Melfi's inexact interpretations. He's on the verge of quitting therapy, or so he says. Bobby Bacala is still grieving for his late wife but that doesn't mean Janice has given up her pursuit. She manipulates him quite easily. New York mobsters Carmine Lupertazzi and Johnny Sack want a 40% cut of Tony's HUD scam. Johnny sounds out Paulie on where his loyalties lie should Tony be replaced. They also tell Tony's appraiser that he's working for them now. For his part, Tony decides to approach Carmine Jr. to see if he they could make a deal. Tony makes it clear that he's prepared to go to war if necessary. Uncle Junior is worried about his upcoming competency hearing. AJ scares Bobby's kids when he takes out the Ouija board after dinner and then decides to hold a séance.—garykmcd", "Tony has a very involved dream, in which he imagines himself inside a car that Carmela is driving, with Ralph sitting next to her and Gloria next to Tony in the back. When he discusses the dream with Dr. Melfi, he is dissatisfied with her explanation. Tony meets with Johnny and Carmine later the hear their demands on his new HUD scam, but he walks out of the meeting in disgust after they name a completely disrespectful figure. They don't take kindly to his refusal, and start pushing around members of his crew. Bobby, meanwhile, is still far from over the loss of his wife, and Janice begins taking steps to try and push him forward, including provoking his kids with stories of Ouija boards and ghosts.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705233", "rating": 8.0, "votes": 7346, "number_of_episodes": 86}