{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0771993": "Steve Schirripa", "0893247": "John Ventimiglia", "0001592": "Joe Pantoliano", "0492089": "Linda Lavin", "0135406": "Carl Capotorto", "1168980": "Robert Funaro", "0322164": "Lola Glaudini", "0342106": "Dan Grimaldi", "0304430": "Joseph R. Gannascoli", "0671023": "Frank Pellegrino", "0785854": "Matt Servitto", "0221241": "Robert Desiderio", "0143295": "Max Casella", "0521087": "George Loros", "0539273": "Richard Maldone", "0621597": "Arthur J. Nascarella", "0291856": "Raymond Franza", "0004715": "Will Arnett", "1359549": "Danyelle Freeman", "0389503": "Chris Hogan", "0518257": "David S. Lomax", "1469293": "Jeff E. Surawski", "1469267": "John Clark Jorgensen", "1469268": "Thomas Jorgensen", "3428515": "Peter Austin Noto"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Chris' success earns him some jealousy, Adriana learns the truth about her friend, and Meadow still claims that Jackie Jr.'s death still weighs heavily on her.", "Christopher is named Paulie's replacement but Patsy Parisi is none too pleased. Paulie isn't doing well in prison and his frustration against Tony is growing. He doesn't think Ralphie's latest joke about Johnny Sack's overweight wife is very funny. The crew starts to reap the benefits of the big construction project. Christopher makes a mistake however. Ralph Cifaretto and Janice are seeing each other. Tony and Carmela are frustrated with Meadow who has spent the summer lounging around despite her repeated promises to work. Meadow then announces that she's going to take a year off. Every time her parents try to talk to her about it, her excuse is that she's still traumatized by Jackie Jr.'s death. Carmela wants her to see a counselor Dr. Melfi recommended to Tony. The counselor doesn't help things much however. Chris tells Adriana he thinks her friend is a dyke. When the FBI has break off its undercover operation, they line up the next best person to feed them information.—garykmcd", "Meadow, still upset over Jackie Jr.'s death and angry at the life of deceit her father's profession forces the family to lead, argues with her parents over her goals for school. She threatens to drop out and leave for Europe, then storms out of the house. Chris, meanwhile, receives a plum no-show job, providing him income with no responsibilities other than keeping control of his crew. This bothers Patsy, who feels he should have received the job as the more senior member, and Silvio, who doesn't like that such a young member is now being treated as his equal. Adriana continues her friendship with Danielle, including bringing her to the Crazy Horse where Chris passes out cocaine to his pals. After Chris' attentions drive a wedge between the two friends, Danielle reveals her true identity: FBI agent. Adriana is given a choice of turning informant or facing 25 years in prison for possession and distribution. While all this is going on, Ralphie makes a joke about the weight of Johnny Sack's wife Ginny that will come back to haunt him.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705268", "rating": 8.3, "votes": 7653, "number_of_episodes": 86}