{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0893247": "John Ventimiglia", "0621393": "Kathrine Narducci", "0144843": "Federico Castelluccio", "0001592": "Joe Pantoliano", "0000767": "Jean-Hugues Anglade", "0215682": "Matthew Del Negro", "0200452": "Paul Dano", "1085297": "Jessica Dunphy", "0101722": "Cameron Boyd", "1478353": "Ryan Hoffman", "0034006": "Murielle Arden", "0869465": "Lauren Toub", "0304430": "Joseph R. Gannascoli", "1435180": "Heidi Dippold", "1478814": "Vanessa Quijas", "0518687": "Daniel London", "0396272": "Tony Hoty", "1373084": "Tone Christensen", "0780172": "Omar Scroggins", "0481573": "Ronobir Lahiri", "1445418": "Jason Furlani", "0001711": "Annabella Sciorra"}, "geners": ["Crime", "Drama"], "runtimes": ["55"],  "plot": ["Tony feels depressed over the negative impact he has on people who don't deserve it, while Carmela tries to set up Furio with a friend, AJ is uncomfortable with his girlfriend's wealth, Artie attempts a new business venture.", "Tony wants to reduce the risk of being caught on a wiretap and tells Christopher that in future he will be giving more and more orders through him. He sees Christopher replacing him some day. Christopher's drug habit is growing and it's beginning to affect his work however. Tony is upset and blames himself when he leans that Gloria Trillo committed suicide. Artie Bucco's new hostess Elodi introduces him to her brother Jean-Philippe who tells him that he needs $50,000 to secure North American distribution rights for a French liqueur. Artie sees an opportunity to make some quick cash and borrows the money from Tony with a promise to repay it all in two weeks. When it all goes sour and the money disappears, Tony proves to be a good friend no matter how difficult Artie makes it. AJ's friends, especially his rich girlfriend Devon, are impressed with his family's mob ties. He's embarrassed however when he sees just how rich her family is.—garykmcd", "Tony learns that his ex-mistress Gloria, perhaps despondent over his leaving her, has committed suicide. At first he blames Dr. Melfi, but soon comes to accept that he most likely played a bigger role in what happened. Tony also informs Chris that he wants to make the nephew his successor to bring the mob into the future, but Chris has been sliding even deeper into heroin addiction. Artie, meanwhile, strikes up a relationship with a new hostess as his marriage slides irrevocably to its finish. The waitress has a brother who presents Artie with a business deal: back him in becoming the main importer of armagnac, a drink he claims will become the next big hit in America. Artie attempts to borrow money from Ralph and Tony, but they are reluctant to do so as they could not bring themselves to collect on their friend if the business fell through, as it soon does. At home, Anthony is starting to feel his way around being the son of a mob boss, attempting to bring his friends to the Bada Bing to show off.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705244", "rating": 8.4, "votes": 7658, "number_of_episodes": 86}