{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0144843": "Federico Castelluccio", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0001592": "Joe Pantoliano", "0726200": "Peter Riegert", "0556985": "Tom Mason", "0322164": "Lola Glaudini", "0502906": "Marianne Leone", "0513401": "Tony Lip", "0304430": "Joseph R. Gannascoli", "0621597": "Arthur J. Nascarella", "0763883": "Frank Santorelli", "0084267": "Val Bisoglio", "0029512": "Sharon Angela", "1478766": "Christine Pedi", "0697069": "Matthew Sussman", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0435677": "Toni Kalem", "0858858": "Gay Thomas Wilson", "0539273": "Richard Maldone", "0521087": "George Loros", "0004715": "Will Arnett", "1373084": "Tone Christensen", "1208741": "Angelo Massagli", "0818283": "Lexie Sperduto", "2523918": "Matt Unger", "0308753": "Bill Garvey", "1296263": "Paul Messina", "0673674": "Annika Pergament", "1650029": "Sølje Bergman", "0161859": "Andrea Ciannavei", "0992587": "James Lawrence", "1039808": "Gráinne de Buitléar", "3428515": "Peter Austin Noto", "1790974": "Elizabeth Wood"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Chris puts a ghost from his past to rest, while Carmela grows uneasy about her future.", "Tony's income is down thanks to a slowing economy but it's having an effect on everyone. He makes sure his capos know they're supposed to be earners. Uncle Junior meets Tony and he's worried about his trial that's starting in just over a week. He's also going broke because of lawyers fees and wants Tony to give him a bigger cut of the pie. Tony won't hear of it. Carmela is shocked to see Angie Bompiensero working in a grocery store and begins to worry about her own future should anything happen to Tony. She wants him to do a little estate planning. Tony however wants to start investing in property. FBI agent Deborah Ciccerone is still undercover working as Adriana's BFF. Christoper isn't keen on driving Tony around instead of Furio. He's also taken to using hard drugs. Tony has an important piece of information for him. Janice takes an interest in Ralph Cifarello. Junior puts Bobby Bacala in charge of his business affairs during the trial. Paulie is in jail on a gun charge but still angry with Tony, he reaches out to Johnny Sack.—garykmcd", "Junior's medical and legal bills are piling up faster than his operations can generate income, but when he turns to Tony for help, his nephew informs him that money is tight for everyone. Later however, Tony learns that a city development project will raise the value of a neighborhood where Junior owns some property, so he offers to buy it from him. Tony and Carmela host a dinner at home with Ralph and Rosalie, as well as some old friends. Meanwhile, Chris has been growing more troubled as he gets hooked deeper into his heroin addiction, despite his assurances to Adriana that his use is just casual. He gets paranoid that his past mistakes are costing him his position within Tony's organization, but then Tony hands him some information about the death of his father, allowing Chris to settle a very old score. Adriana has been hanging around with a new friend, Danielle, but is unaware that Danielle is not at all who she seems to be.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705245", "rating": 8.2, "votes": 7862, "number_of_episodes": 86}