{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0144843": "Federico Castelluccio", "0192603": "Vincent Curatola", "0771993": "Steve Schirripa", "0009410": "Ray Abruzzo", "0692466": "Richard Portnow", "0215682": "Matthew Del Negro", "1168980": "Robert Funaro", "0135406": "Carl Capotorto", "0657760": "Aleksa Palladino", "0029512": "Sharon Angela", "0534398": "Bruce MacVittie", "0304430": "Joseph R. Gannascoli", "0513401": "Tony Lip", "0342106": "Dan Grimaldi", "0030876": "Fran Anthony", "0258103": "Frances Ensemplare", "0074105": "Anna Berger", "0143295": "Max Casella", "1052666": "Will Janowitz", "0627041": "Evan Neumann", "0111328": "Elaine Bromka", "0337106": "Jerry Grayson", "0521481": "Mark Lotito", "0507912": "Chuck Lewkowicz", "1155450": "Kevin Interdonato", "0324233": "Michael Godere", "0545549": "Jeffrey M. Marchetti", "1105832": "Marilyn Matarrese", "0566420": "Brian McCormack", "1478756": "Mario Pane", "0593931": "Carmine Mitore", "0431225": "Natalie Light", "1477865": "Jolan Boockvor", "0280496": "Buddy Fitzpatrick", "0858858": "Gay Thomas Wilson", "1477944": "Dan Castleman", "1277079": "Joe Pucillo", "2369613": "Jon Lonoff", "1255825": "Deirdre Lorenz"}, "geners": ["Crime", "Drama"], "runtimes": ["57"],  "plot": ["Carmela and Furio grow too close for safety, while Paulie discovers that he's not as big a fish as he thought he was.", "Tony's not happy with Carmine and Johnny's new proposal and he retaliates by trashing Johnny's soon to open restaurant. Carmine responds by sicking the laborers union on the Esplanade site, which is shut down. With everybody hurting financially, Paulie takes it on himself to speak to Carmine and try to settle the dispute. He has a rude awakening when he realizes Carmine has no idea who he is. Out on the town with Tony and a few women, Furio is disgusted and very nearly takes a fatal step. He leaves suddenly for Italy without saying goodbye to anyone and Carmela is depressed over his sudden disappearance. Meadow hosts a dinner at her new apartment for her parents but it's apparent that Carmela is not happy. Meanwhile, an outing with his mother and two of her friends drives Paulie to extremes.—garykmcd", "Carmela and Furio continue to flirt with each other. Each time they meet, Carmela feels herself wanting to go further, but Furio holds back either from respect or fear of Tony. Carmela confesses her feelings to Meadow, which puts her daughter in an awkward position when Tony later goes to her asking if her mother is concerned about anything. Paulie, meanwhile, is falling behind in his payments to the gang. He brushes off Silvio's warnings, saying he's an important enough member of the gang that his long history with Tony will smooth over any shortcomings in payments. He gets a shock, however, when he tries to help Tony by talking with Carmine, and finds that Carmine doesn't even know who he is. Realizing that his position may not be as stable as he thought, he gets desperate to come up with his needed cash.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705242", "rating": 8.2, "votes": 7336, "number_of_episodes": 86}