{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0893247": "John Ventimiglia", "0621393": "Kathrine Narducci", "0000114": "Steve Buscemi", "0885110": "Frankie Valli", "0764134": "Joe Santos", "0009410": "Ray Abruzzo", "0898634": "Frank Vincent", "0017651": "Tom Aldredge", "0020922": "Rae Allen", "0215682": "Matthew Del Negro", "0116483": "Bruce Kirby", "0791877": "Suzanne Shepherd", "0555488": "Joe Maruzzo", "0029512": "Sharon Angela", "0776584": "Paul Schulze", "0435677": "Toni Kalem", "1605077": "Philip Larocca", "1052666": "Will Janowitz", "0058772": "Alison Bartlett", "0025072": "Frank Ammirati", "0992787": "Vince Stefani", "1604905": "Dennis Aloia", "1580871": "Kevin Aloia", "0142279": "Barbara Caruso", "0665101": "Garry Pastore", "1288572": "Tony Siragusa", "0502906": "Marianne Leone", "1085297": "Jessica Dunphy", "0241815": "Allison Dunbar", "1589782": "Samrat Chakrabarti", "1600095": "Erin Stutland", "0553945": "Vic Martino", "1600073": "Sammy Semenza", "0770154": "Erik Schark", "1405645": "Pablo Hernandez", "1600113": "Rolando J. Vargas", "1446918": "Stefanie Barbato", "0615992": "Louis Mustillo", "0751665": "Larry Russo", "1701581": "Michalina Scorzelli", "1368116": "Stewart Summers", "1123558": "David Von Roehm"}, "geners": ["Crime", "Drama"], "runtimes": ["54"],  "plot": ["An uncomfortable party leads Tony and Carmela to a partial reconciliation, while cousin Tony gets an offer he decides not to refuse.", "Carmela is planning a surprise 75th birthday party for her father. Carmela's snooty mother doesn't think it would be appropriate for Tony to attend but when her father hears of it - Uncle Junior gives away the surprise - he says he won't be there if Tony isn't. Tony is still waiting for Phil Leotardo to pay up from the sale of a racetrack and they have a run-in. At Johnny Sack's urging, Tony agrees to pay for the damage to Phil Leotardo's car. Phil is obviously going to be very fussy about the repairs however. Tony Blundetto is approached by some of Carmine Lupertazzi Jr.'s associate to make a hit on one of Johnny Sack's hookers. He declines but after deciding he's being treated badly, decides to take the job. There's more than one victim unfortunately.—garykmcd", "Carmela plans a surprise party for her father's birthday. At the party, her father is overjoyed to see Tony, but her mother doesn't even bother to hide her contempt for her son-in-law. The abuse Tony puts up with makes Carmela see him in a slightly better light than she had before, and she invites Tony to spend the night after the party is over. Cousin Tony, meanwhile, has been approached with a job offer from Little Carmine: carry out a hit on Johnny Sack's main man Joe Peeps in retaliation for an earlier hit that Joe and Phil did on one of Carmine's loan sharks. Although Tony turns down the job at first, the party at his cousin's house makes him reconsider his options. Feeling dissatisfied with the speed at which he's advancing within the Soprano crew, and jealous of the good life his cousin seems to be leading, Tony goes back to Carmine and agrees to do the job.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705262", "rating": 8.7, "votes": 7742, "number_of_episodes": 86}