{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0000114": "Steve Buscemi", "0000657": "David Strathairn", "0898634": "Frank Vincent", "0016268": "Frank Albanese", "0215573": "Judy Del Giudice", "0029512": "Sharon Angela", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0143295": "Max Casella", "0621597": "Arthur J. Nascarella", "0763883": "Frank Santorelli", "1141096": "Miryam Coppersmith", "1208741": "Angelo Massagli", "1071621": "Dawn Evans", "0041280": "Remy Auberjonois", "0933156": "Chandra Wilson", "0144712": "Ron Castellano", "0129651": "Chris Caldovino", "1035211": "Michelle Christian Corp", "1621041": "Jim Wisniewski", "1507810": "James Flaherty", "0224060": "Angelo Di Mascio Jr.", "1351974": "Finnerty Steeves", "0432003": "Chris Juell", "1230580": "Richard Byrne", "1029834": "Adam Grupper", "1620878": "Gabby Pineo", "0658152": "Carl Palmer", "1648424": "Andrew Siff", "1648368": "Jennifer Rainville", "1388699": "Gino Cafarelli", "1304275": "Bonkers", "2026243": "Peter Cavnoudias"}, "geners": ["Crime", "Drama"], "runtimes": ["52"],  "plot": ["Chris and cousin Tony do some digging to make sure old secrets stay buried, while Janice puts her marriage in jeopardy with her fierce temper.", "Tony sends Christopher and his cousin Tony Blundetto upstate to his uncle Pat's farm. There are several bodies buried there that now have to be relocated since the farm has been sold to a housing developer. Christopher resents Tony B.'s rapid rise and the fact that he is now the boss' favorite. Tony B. has a lot of stories and Chris reassesses his opinion of him. Things are heating up between Johnny Sack and Tony Soprano. A shipment of Vespa scooters that one of Tony's crews was going to hijack off the New Jersey docks vanishes and he later learns Johnny's men simply took it. Johnny suspects Tony Blundetto of shooting Joe Peeps despite Tony's assurances to the contrary. As if he doesn't have enough on his plate, Tony has to deal with his sister Janice whose violent temper landed her on the evening news after she attacked another mom at her step-daughter's soccer game. She takes an anger management class that has an obvious effect on her. Until Tony decides to do something about it, of course.—garykmcd", "When Johnny Sack hijacks a load of stolen goods that was bound for Tony, the resulting confrontation between the two produces some not-very veiled accusations about the murder of Joe Peeps. Johnny seems fairly sure he knows who did it, and that Tony is lying about his cousin's alibi. Later, Tony learns that a farm where his crew has hidden bodies over the years is being sold, necessitating a nighttime trip (which he assigns to Chris and cousin Tony) to dig up the bodies and deposit them elsewhere. Later at the Bada Bing, Tony loses his temper once more at George the bouncer, beating him badly enough to put him in the hospital. Meanwhile, Janice is getting into trouble because of her own temper, and Bobby threatens her with divorce if she doesn't do anything about it. When Tony joins them for dinner after Janice has had some anger management sessions, he becomes uneasy at the success she has in keeping herself calm, and begins deliberately needling her to make her explode.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705235", "rating": 8.6, "votes": 7606, "number_of_episodes": 86}