{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0621393": "Kathrine Narducci", "0000114": "Steve Buscemi", "0012178": "Jerry Adler", "0004991": "Hill Harper", "0898634": "Frank Vincent", "0020922": "Rae Allen", "0135406": "Carl Capotorto", "0322164": "Lola Glaudini", "0949744": "Karen Young", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "1168980": "Robert Funaro", "0143295": "Max Casella", "0671023": "Frank Pellegrino", "1169320": "Frank Pando", "1052666": "Will Janowitz", "0555488": "Joe Maruzzo", "0213446": "David Deblinger", "1476381": "Joseph Costa", "1035211": "Michelle Christian Corp", "0723040": "Anthony J. Ribustello", "0884113": "Duke Valenti", "0218318": "William DeMeo", "1166819": "Paolo Pagliacolo", "0888347": "Maureen Van Zandt", "1288572": "Tony Siragusa", "1587453": "Mia Troche", "0590036": "Jamie Sorrentini", "1584122": "Andy Babiuk", "1584313": "Mike Boise", "1605124": "Paul Morabito", "1586697": "Greg Prevost", "1522570": "Krystal Browning", "3469515": "Michael Christaldi", "0996655": "Scott Addison Clay", "1770534": "Jennifer Rapp"}, "geners": ["Crime", "Drama"], "runtimes": ["52"],  "plot": ["A car crash puts Tony and Adriana in a compromising position, and Cousin Tony tries to keep Chris from getting the wrong impression and the wrong information.", "With Christopher out of town for a few days Adriana and Tony spend some time together at the Crazy Horse. Tony develops feelings for her but he does his best to resist his urges. He feels quite guilty about it all, which sends him back to see Dr. Melfi after a long break. After the club's closing early one morning they set off together to find Adriana's coke dealer but have a car accident when Tony swerves to avoid an animal on the road. They're not seriously injured but it doesn't take long for rumors to surface, all to the effect that they were having sex in his car. When Christopher returns from an out of town business trip and hears what's happened, he goes berserk, forcing Tony to take a drastic and near-fatal step. It's Tony Blundetto who comes up with the evidence needed to convince Christopher that everything is above board. Carmela meanwhile is now sleeping with AJ's school guidance counselor.—garykmcd", "Tony begins hanging out at The Crazy Horse, Adriana's club, where he and Adriana spend time together. The two begin bonding over mutual worries and doing drugs together, which leads to rumors of a sexual dalliance when they get into a car wreck together in Tony's SUV. When Chris hears the rumors he beats up Adriana, despite her protests of innocence, and comes gunning for Tony. As Tony takes his hot-headed nephew out to an abandoned road, it looks like Chris has finally thrown his last tantrum. But then Cousin Tony, using his massage-therapist credentials, convinces a doctor to tell Chris that Adriana was wearing her seat belt at the time of the crash, and therefore couldn't have been in the position she was rumored to be in when Tony rolled the car. Convinced that Adriana and Tony aren't involved with each other, Chris calms down, but is still upset about the rumors that continue to spread behind his back.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705255", "rating": 9.3, "votes": 9441, "number_of_episodes": 86}