{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0893247": "John Ventimiglia", "0621393": "Kathrine Narducci", "0000114": "Steve Buscemi", "0012178": "Jerry Adler", "0004857": "Tim Daly", "0000917": "Polly Bergen", "0802759": "Joseph Siravo", "0692466": "Richard Portnow", "0898634": "Frank Vincent", "0931135": "Laurie Williams", "1574708": "Danny Petrillo", "0020922": "Rae Allen", "0135406": "Carl Capotorto", "0066664": "Leslie Bega", "0304430": "Joseph R. Gannascoli", "0143295": "Max Casella", "0621597": "Arthur J. Nascarella", "0353234": "Kevin Hagan", "0776584": "Paul Schulze", "1208741": "Angelo Massagli", "1141096": "Miryam Coppersmith", "1000726": "Danielle Di Vecchio", "0763883": "Frank Santorelli", "0545549": "Jeffrey M. Marchetti", "1514052": "Allen Enlow", "0764377": "Charles Santy", "1605105": "John Marinacci", "0818818": "Anthony Spina", "1589891": "Artie Pasquale", "1589775": "Carolyn C. Buccino", "1589778": "Fred Caiaccia", "0129651": "Chris Caldovino", "1155742": "Ralph Lucarelli", "1235599": "Joanna Bonaro", "0123944": "Lucian Buscemi", "1372632": "Mike Caravella", "1955608": "Greg D'Agostino", "1675207": "Keith Leonard"}, "geners": ["Crime", "Drama"], "runtimes": ["55"],  "plot": ["Tony learns about his father through the man's mistress, while Chris' friend learns that there are habits more harmful to your health than heroin. Junior becomes obsessed in attending funerals but that leads to a change in his mood.", "While attending a family funeral Tony decides to visit his father's grave and there meets Fran Felstein, his father's mistress. She has many stories to tell him - she claims to have been one of JFK's girlfriends - and Tony takes an interest in her welfare. She claims that her father had promised her his share of a track he owned but that Hesh had cheated her out of her inheritance. When Hesh decides to sell the track, Tony makes sure she gets her share. The sale causes friction with Phil Leotardo, Johnny Sack's right hand man. As for funerals, Uncle Junior has decided that going to funerals is a good way to get out his house arrest, at least for 5 hours on each occasion. He's taken to scanning obituaries to see what might be available. Christopher has been helping a friend he made in rehab, J.T. Dolan, a TV writer. While J.T. has successfully stayed away from drugs and alcohol, he is quickly developing a new addiction - gambling. Christopher arranges for him to play in their high stakes game and after losing a hefty sum, borrows money from Chris to pay it off. J.T. doesn't seem to understand that Christopher is deadly serious when he says he will be paid on time - or else.—garykmcd", "While at a funeral for an aunt, Tony sees an elderly woman at his father's grave. When he goes over to talk with her, he discovers that she was his father's mistress long ago. They begin spending time together as Tony enjoys hearing her recollections of his father's life, as well as learning more about the behind-the-scenes deals and conflicts of his parents' generation that he was never privy to as a youngster. He rejects Dr. Melfi's suggestion that he has some sort of feelings for the woman, although he does try to help her collect money that his father left for her, but which another gangster cheated her out of. Chris, meanwhile, is hanging out with J.T., a friend from his days in rehab. He gets J.T. involved in gambling, but doesn't hesitate to administer a beating when his friend ends up heavily in debt and falls behind on repayments.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705254", "rating": 7.9, "votes": 7492, "number_of_episodes": 86}