{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0000114": "Steve Buscemi", "0005162": "Robert Loggia", "0000953": "Peter Bogdanovich", "0009410": "Ray Abruzzo", "0764134": "Joe Santos", "0066664": "Leslie Bega", "0135406": "Carl Capotorto", "0121559": "Robert John Burke", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0143295": "Max Casella", "0521087": "George Loros", "0621597": "Arthur J. Nascarella", "0513401": "Tony Lip", "0736051": "Omar Chagall", "0255623": "John Elsen", "1572741": "Sukanya Krishnan", "1980806": "Matthew Weiner", "1141096": "Miryam Coppersmith", "1260202": "Denise Borino-Quinn", "0241815": "Allison Dunbar", "0545549": "Jeffrey M. Marchetti", "1604917": "Maria Baan", "1605178": "Lisa Regina", "1359255": "Barbara Christabella", "1190216": "Anna Maniscalco", "1605169": "Bill Quigley", "2237139": "Laurie Rosenwald", "1605064": "Ginger Kearns", "1099154": "Jason Ongoco", "0590036": "Jamie Sorrentini", "1304275": "Bonkers", "1522570": "Krystal Browning", "2016031": "Roseanne D'Emidio", "1641214": "Maureena Galindo", "0769358": "Richard Lounello", "0000560": "Nick Nolte", "0000659": "Barbra Streisand"}, "geners": ["Crime", "Drama"], "runtimes": ["54"],  "plot": ["Some of the old guards are released from prison and want to get back in the action. Chris and Paulie are at each other's throats over matters of money and respect, and Tony decides to tell Dr. Melfi what's really on his mind.", "Several old-time mobsters are coming out of prison soon having completed their sentences. Tony is particularly looking forward to seeing his cousin Tony Blundetto, who in their youth was like a brother to him. Also being released is Feech La Manna who is looking to start earning again after being away for 20 years. Chris and Paulie are constantly arguing. Paulie feels that the young Chris doesn't pay him enough respect but Chris is frustrated by the rules that always put him at the bottom of the ladder. He's particularly tired of always having to pick up the dinner tab. Tony and Carmela are still separated but he's sent someone around to stand guard after he learns there was a bear in the backyard. Tony hasn't see Dr. Melfi for some and decides once again to try and pursue a romance with her.—garykmcd", "Two years have passed since the last episode when Tony and Carmela separated. They are still apart, although Carmela asks Tony for help when a bear is spotted nosing about the backyard. Several of the old guard who have been in prison since the 80's are just now being paroled, a cause for celebration but also a cause for concern now that the next generation has long since filled the vacuum they left behind. Among the released is Tony Blundetto, who is a cousin of Tony Soprano, and Feech La Manna, a former capo of a rival gang known for his violent temper. Chris and Paulie are still not getting along, with Paulie jealous of the favoritism he thinks Tony shows for his nephew, and Chris chafing at the lack of respect he thinks the older gangster shows him. Meanwhile, Tony goes back to see Dr. Melfi and confesses his feelings for her. He tries to convince her that he's a changed man, but she knows better than most the turmoil that's still inside him.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705289", "rating": 8.6, "votes": 7834, "number_of_episodes": 86}