{"cast": {"0001254": "James Gandolfini", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0000114": "Steve Buscemi", "0000657": "David Strathairn", "0950794": "Henry Yuk", "0776584": "Paul Schulze", "0058772": "Alison Bartlett", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "1168980": "Robert Funaro", "0017651": "Tom Aldredge", "0029512": "Sharon Angela", "0123838": "Karl Bury", "0487594": "Liza Lapira", "0621597": "Arthur J. Nascarella", "0121331": "Mitchell Burgess", "1208741": "Angelo Massagli", "1141096": "Miryam Coppersmith", "1604905": "Dennis Aloia", "1580871": "Kevin Aloia", "1000726": "Danielle Di Vecchio", "0006574": "Ed Vassallo", "1581157": "Fran Gennuso", "1605038": "Michelle Huber", "0120128": "Angela Bullock", "0635846": "Kimberly Guerrero", "0818818": "Anthony Spina", "1198632": "Julian Wells", "1522570": "Krystal Browning", "1317850": "Bruce Roberts"}, "geners": ["Crime", "Drama"], "runtimes": ["55"],  "plot": ["Carmela has another furtive romance collapse, while Tony B. throws away a chance to turn his life around.", "Tony Blundetto is working hard preparing for his masseur exams. He's also proving to be pretty lucky as well. His current employer, Sungyon Kim, is impressed with his dedication and offers to front the cost of opening a massage parlor with Tony in charge. Then while out for a walk with his wife, he sees a bag thrown from a speeding car in which he finds $12,000. Setting up a business however is proving to be more of a challenge than he expected. He turns to Tony. Carmela's relationship with Wegler has gone to the next step but she is shocked when he breaks it off suddenly accusing her of just using him to get better grades for AJ.—garykmcd", "Carmela's relationship with Anthony's teacher Mr. Wegler grows more intimate. She goes to Father Phil for advice, but despite his admonishments that she and Tony are still married in the eyes of the church, Carmela is overwhelmed by her passion and loneliness, and ends up in bed with Mr. Wegler. Wegler enters the relationship wholeheartedly, but experiences strong misgivings after he pressures another teacher to cut Anthony some slack, and later takes out his frustrations on Carmela. Cousin Tony, meanwhile, is finding civilian life difficult to adjust to, and feels that his new boss is standing between him and the success he's entitled to. An apparently chance finding of a large amount of cash gives him the chance to take charge of his professional aspirations, but his old self-destructive tendencies reassert themselves and he is soon drinking away his windfall. Depressed about where he has ended up, he begins asking his cousin if there are any jobs he can join in.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705276", "rating": 8.1, "votes": 7214, "number_of_episodes": 86}