{"cast": {"0001254": "James Gandolfini", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0005576": "Drea de Matteo", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0893247": "John Ventimiglia", "0621393": "Kathrine Narducci", "0000114": "Steve Buscemi", "0005162": "Robert Loggia", "0764134": "Joe Santos", "0692466": "Richard Portnow", "0898634": "Frank Vincent", "0001091": "Patti D'Arbanville", "0949744": "Karen Young", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "1168980": "Robert Funaro", "0615992": "Louis Mustillo", "1155285": "Anna-Maria Gottfried", "0786085": "Ed Setrakian", "0555488": "Joe Maruzzo", "1514052": "Allen Enlow", "1208741": "Angelo Massagli", "1141096": "Miryam Coppersmith", "1000726": "Danielle Di Vecchio", "0006574": "Ed Vassallo", "0763883": "Frank Santorelli", "1570768": "Hilda Evans", "0644131": "George T. Odom", "0249931": "Dean Edwards", "0746478": "Bill Rowe", "1605056": "Michael Isaiah Johnson", "0258103": "Frances Ensemplare", "0146798": "Michael Cavalieri", "0372890": "Rich Hebert", "0287399": "Frank Fortunato", "0129651": "Chris Caldovino", "0914223": "Myk Watford", "1190050": "DeVone Lawson Jr.", "1443325": "Anthony Desio", "1569958": "Madison Connolly", "1416636": "Anthony Piccolo", "2161791": "Silverio Avellino", "4197984": "Justiin Davis", "0296837": "Angela Frye", "0730288": "Anthony Robbins"}, "geners": ["Crime", "Drama"], "runtimes": ["55"],  "plot": ["With Carmine's passing and Feech's arrival, turf wars are breaking out around New Jersey. Junior's mental health, meanwhile, starts to decline.", "Tony is having all kinds of business problems. Carmine Lupertazzi died without naming a successor and it's everything short of open warfare between his son Little Carmine and Johnny Sack over who is going to run the New York family. Johnny strong arms one of Carmine's loan sharks leading her to turn to Tony for help. It's puts him in something of a bind however. Closer to home, Feetch La Manna is stepping on several toes moving in on people's territory, including Paulie's. Uncle Junior has been giving Tony a hard time about almost everything he does. Tony has had it and decides the old man isn't worth his time. Junior may be suffering from dementia however and disappears. It turns out he went back to the old neighborhood to locate Tony's father, Johnny Soprano.—garykmcd", "With Carmine's passing, Little Carmine and Johnny Sack begin making moves on each other's business, with Johnny sending over two of his men to one of Carmine's loan sharks to tell her that all her payments will be to Johnny instead. She goes to Tony to ask for help in the matter. While the discussion is going on, Junior berates Tony as a weak nothing who isn't fit to be leading a gang. Later, when Tony presents his ideas to Johnny, Chris butts into the discussion, earning Tony's wrath later in the car. After Junior manages to drive Tony away with his continuous insults, he wanders out of the house in his bathrobe and ends up at a church that used to be Soprano hangout long ago. Unable to remember where he is, he wanders around until the police find him and bring him home. Tony then learns that Junior's behavior, including the insults, may be the result of approaching Alzheimer's. Meanwhile, Feech La Manna, one of the old mobsters just out of prison, begins making trouble by demanding that his nephew be handed the neighborhood gardening business, shoving out local landscaper Sal. Paulie attempts to help Sal out, but the final compromise is to nobody's satisfaction.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705293", "rating": 8.6, "votes": 7662, "number_of_episodes": 86}