{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0005576": "Drea de Matteo", "0192603": "Vincent Curatola", "0893247": "John Ventimiglia", "0000114": "Steve Buscemi", "0885110": "Frankie Valli", "0764134": "Joe Santos", "0009410": "Ray Abruzzo", "0898634": "Frank Vincent", "0135406": "Carl Capotorto", "1052666": "Will Janowitz", "0304430": "Joseph R. Gannascoli", "1168980": "Robert Funaro", "0342106": "Dan Grimaldi", "0143295": "Max Casella", "0657760": "Aleksa Palladino", "0305519": "Paula Garcés", "0888347": "Maureen Van Zandt", "0949744": "Karen Young", "0621597": "Arthur J. Nascarella", "0129651": "Chris Caldovino", "0241815": "Allison Dunbar", "0472152": "Bruce Kronenberg", "1599824": "Sid Davidoff", "1260202": "Denise Borino-Quinn", "0218318": "William DeMeo", "0545549": "Jeffrey M. Marchetti", "1288572": "Tony Siragusa", "1599947": "Jackson Loo", "0030442": "Nick Annunziata", "0127485": "Angel Caban", "1604989": "Hilary Flynn", "0604322": "Joe Moretti", "1604981": "Andrew Eisenman", "0089665": "Joel Blum", "1498916": "Demo DiMartile", "1600109": "Colby Trane", "1446918": "Stefanie Barbato", "1304275": "Bonkers", "0244709": "Stéphanye Dussud", "2852906": "Beth Laufer"}, "geners": ["Crime", "Drama"], "runtimes": ["59"],  "plot": ["Tony finds out that his cousin wants a bigger share of responsibilities, while Finn makes an embarrassing discovery about Vito.", "New York mob boss Johnny Sack is upset that that one of his young hoods, Joe Peeps, has been shot. He assumes that Carmine Lupertazzi Jr. ordered the hit but has no idea who the actual shooter was. All he has is that a man with a severe limp was seen leaving the area. He mentions that fact to Tony when they're out golfing and Tony promptly has a panic attack: he knows the shooter was his cousin, Tony Blundetto. Above all, Tony wanted his men to stay out of the New York gang war. Carmela decides the time has come to go to the next step and get a divorce. She's having a hard time finding a lawyer who will take her case however. Meadow and her boyfriend Finn are going through a bit of a hard patch. He doesn't have a job for the summer and is thinking of returning to California. Tony gets him a job on the Esplanade construction site and he gets a look at some of the mobsters up close. He also learns something about Vito that he would rather not know.—garykmcd", "Despite their spending the night together earlier, Carmela decides to push forward with divorce proceedings. The only problem is that as soon as the lawyers find out who her husband is, they refuse to take her case. Meanwhile, Tony hears about the hit on Joe Peeps; according to witnesses, the shooter walked with a limp. Cousin Tony shows up while Tony is golfing, and the capo quickly notices that his cousin has a foot injury. Quickly surmising the truth about what his cousin has done, Tony has another panic attack. Despite cousin Tony's alibi, Tony makes up an excuse for Johnny Sack about where his cousin was the night of the shooting, then begins taking steps to give Tony more responsibility within the crew, possibly even bringing him in as a full member. Meadow's boyfriend Finn takes a job at a construction site where some of Tony's crew are stationed. While there, he witnesses a violent fight between two of the gangsters, then later catches Vito performing oral sex on a security guard.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705290", "rating": 8.8, "votes": 7677, "number_of_episodes": 86}