{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0156940": "Dominic Chianese", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0898634": "Frank Vincent", "0893247": "John Ventimiglia", "0009410": "Ray Abruzzo", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0000114": "Steve Buscemi", "0004857": "Tim Daly", "0500038": "Ron Leibman", "0642912": "Henry O", "0029512": "Sharon Angela", "0135406": "Carl Capotorto", "0201700": "Tony Darrow", "0143295": "Max Casella", "0893120": "Lenny Venito", "0159456": "Ho Chow", "0802469": "Simon Sinn", "0475997": "Bill Kurtis", "0001968": "Elizabeth Bracco", "0888347": "Maureen Van Zandt", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0776584": "Paul Schulze", "0508909": "Geraldine LiBrandi", "1052666": "Will Janowitz", "0006574": "Ed Vassallo", "1000726": "Danielle Di Vecchio", "0738897": "James Vincent Romano", "0218318": "William DeMeo", "0454260": "Traci Kindell", "0749847": "Luis Ruiz", "2156887": "David Francis Calderazzo", "1933443": "Luz Lor", "0080401": "Anjali Bhimani", "0530043": "Carmen López", "2200010": "Edward Watts", "1763034": "Mueen Jahan", "1406362": "Joe Delafield", "0496934": "C.S. Lee", "1478993": "Matthew Stocke", "2648651": "Angel Fajardo", "0173039": "Chris Colombo", "1938383": "David Benaroya", "1956775": "Loukas Papas", "1993363": "Paula Rittie", "2838320": "Morgan Saylor", "1991213": "Dared Wright"}, "geners": ["Crime", "Drama"], "runtimes": ["57"],  "plot": ["While the gang begins to turn on itself, Tony finds himself at the threshold, while Christopher gives another try to enter the movie business, however this time as a producer rather than a screenwriter.", "Tony is still comatose and if anything, his condition is deteriorating. The doctor's are trying to control a fever-causing infection and Carmela is increasingly worried, if that's possible. The strain of leading the family and constantly settling disputes among the captains is affecting Syl whose asthma is acting up. He orders Paulie and Vito to each give Carmela $100,000 as Tony's share of a recent big score. They both hold off waiting to see if Tony lives or dies. Vito sees himself as Tony natural successor and starts to prepare the way. Bobby Bacala and Christopher learn what AJ has been planning. As for Tony, his dream continues where he is mistaken for someone by the name of Finnerty. When he sees a poster announcing a Finnerty family reunion, he drops by only to find a familiar face as the doorman who urges him to go inside the brightly lit house where everyone is waiting for him.—garykmcd", "Silvio divides the spoils from Paulie's latest score, and heads off a territorial impasse between Bobby and Vito. Carmela turns to an unexpected source for help with AJ; Christopher turns to an old writing acquaintance, JT Dolan, for help in a new venture.—Jiah Peck", "While Tony languishes in the hospital, Paulie goes out with one of his crew to steal a Colombian drug ring's money stash. They find the place is more heavily guarded than they anticipated, but still manage to get away with a haul of over a million dollars. Good news, but Tony's gang still is not happy: Silvio's leadership abilities have fallen short of Tony's example, and the other members are jockeying for position to take over if their leader doesn't recover. Chris and Bobby find out about Anthony's plan to kill Junior and try to talk him out of it, telling him it's a foolish idea that his father wouldn't have wanted. Tony, meanwhile, still in his dreamworld as Kevin Finnerty, is led to a house where a family reunion is going on. His dead cousin Tony Blundetto is waiting at the door to greet him, saying that he's welcome to join everyone only if he leaves his briefcase behind. A voice comes from the nearby bushes, however, pleading with Tony not to leave.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0763238", "rating": 8.8, "votes": 8406, "number_of_episodes": 86}