{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0797464": "Jamie-Lynn Sigler", "0878152": "Aida Turturro", "0771993": "Steve Schirripa", "0192603": "Vincent Curatola", "0898634": "Frank Vincent", "0304430": "Joseph R. Gannascoli", "0435677": "Toni Kalem", "0120648": "Cara Buono", "0182569": "John Costelloe", "0750916": "William Russ", "0135406": "Carl Capotorto", "0029512": "Sharon Angela", "0621597": "Arthur J. Nascarella", "0888347": "Maureen Van Zandt", "1052666": "Will Janowitz", "1036260": "Brad Zimmerman", "1372757": "Patrick Holder", "0553778": "Lou Martini Jr.", "0615992": "Louis Mustillo", "0080729": "John Bianco", "0161885": "John 'Cha Cha' Ciarcia", "1260202": "Denise Borino-Quinn", "2129662": "Cristin Milioti", "1422079": "Caitlin Van Zandt", "1364079": "Adam Mucci", "0013898": "Daniel Ahearn", "1510136": "Chris McGarry", "0353807": "Antony Hagopian", "1022300": "Eldon Thiele", "1525890": "Rick Gifford", "0331186": "Karen Lynn Gorney", "0936607": "Rebecca Wisocky", "1994165": "Louis Gross", "1208741": "Angelo Massagli", "1141096": "Miryam Coppersmith", "1000726": "Danielle Di Vecchio", "0006574": "Ed Vassallo", "0190962": "Tony Cucci", "0118942": "Kate Buddeke", "0666848": "Guy Paul", "2651293": "Qadir Forbes", "2060886": "Daveed Ramsay", "1414409": "Alex Mitchell", "2060738": "Matlok", "2652804": "Brian Gilbert", "1714842": "Sal Di Piazza", "0285431": "Joe Forbrich", "0545549": "Jeffrey M. Marchetti", "2006322": "Christopher Maggi", "2259109": "Kimberly Laughlin", "2259141": "Brianna Laughlin", "2007000": "Jim Ford", "1950010": "Megan O'Leary"}, "geners": ["Crime", "Drama"], "runtimes": ["54"],  "plot": ["Tony reflects on how growing up with Janice colors his attitudes now, while Vito tries to make a new life for himself in New Hampshire.", "Johnny Sack is in jail and the Feds seem to have a pretty strong case against him. His lawyer is trying to get the best deal possible but he's definitely going to get a long jail sentence and lose most of his assets. In the end, he agrees to 15 years and his his wife gets to keep the house and her pension account. He also has to admit in open court that he was a member of La Cosa Nostra, something that doesn't sit well with some of his fellow mobsters. Johnny turns to Tony to get cash from some of the investments the Feds don't know about. Tony takes his cut, as expected. Tony recounts to Dr. Melfi the difficulty he had growing up with his sister Janice. Despite all of that, he still arranges a great deal for her on a house. Vito is still living in New Hampshire with his friend Jim. He finally admits to Jim that he's not a writer but doesn't quite come clean about his past. He tries working at a regular job but that's not quite his style and in the end, he packs it in and returns to New Jersey.—garykmcd", "Johnny Sack, after turning down the idea of becoming an informant, accepts a plea bargain in the face of mounting evidence against him and has all his assets frozen. Tony, meanwhile, talks with Dr. Melfi about the relationship he has with his sister Janice. When they were little, Janice would frequently torment Tony and extort favors from him, while later on other boys would try to be friends with Tony so they could be around his attractive sister. He admits that because she left him to look after Livia and then came back after Livia's death to enjoy the benefits of Tony's success, he feels pleasure when misfortunes befall her and her husband. Meanwhile, Vito comes clean to Jim about his past, and to himself about his identity, but after living the fast life for so long New Hampshire just doesn't feel like home to him. He packs up his belongings and heads back to New Jersey.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0756404", "rating": 8.0, "votes": 7032, "number_of_episodes": 86}