{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0771993": "Steve Schirripa", "0898634": "Frank Vincent", "0893247": "John Ventimiglia", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0435677": "Toni Kalem", "0029512": "Sharon Angela", "0893120": "Lenny Venito", "0143295": "Max Casella", "0621597": "Arthur J. Nascarella", "0050737": "Edoardo Ballerini", "0001968": "Elizabeth Bracco", "0888347": "Maureen Van Zandt", "0017651": "Tom Aldredge", "0791877": "Suzanne Shepherd", "0182569": "John Costelloe", "1052666": "Will Janowitz", "0872242": "Adam Trese", "2650434": "Donna Villella", "0088964": "Susan Blommaert", "0723040": "Anthony J. Ribustello", "2184608": "Frank Borrelli", "1105207": "Paulina Gerzon", "1994165": "Louis Gross", "0144712": "Ron Castellano", "1821298": "Laith Nakli", "0030751": "Jacqueline Antaramian", "2419324": "Afeefa Ayube", "0557850": "Danny Mastrogiorgio", "1159218": "James Hindman", "0907467": "Georgianne Walken", "0859403": "Raymond Anthony Thomas", "2418274": "Amanda Magnavita", "0508139": "Selenis Leyva", "0197289": "Leo Daignault", "0113932": "Julia Montgomery Brown", "1034134": "Michael Malone", "0970809": "Cal Crenshaw", "0030442": "Nick Annunziata", "0080729": "John Bianco", "1207962": "Robert Feeley", "2148793": "Ted Lewinski", "2810926": "Nancy Otero", "1728080": "Sonny Vellozzi", "4198808": "Gerrold Vincent"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Tony hires help from overseas to fulfill a favor he was asked for by Johnny Sack and decides if one of his top earners deserves a second chance as he acknowledges to Dr. Melfi he was given a second chance when he survived his gun shot wound.", "The news about Vito's extracurricular activities at a gay bar in New York is spreading quickly. Christopher hears it from an acquaintance at an AA meeting and soon passes it on to the other members of the family. Most are disgusted with him but Tony isn't about to rush to judgment where a man's reputation is at stake. It all seems like it's true when Benny Fazio approaches him and Vito takes off in his car. When Meadow overhears her mother and Rosalie Aprile talking about it, she tells them - and eventually her father - what Finn saw the morning he got to work early. As for Vito, he is in hiding in a small New Hampshire town hoping to track down his cousin who lives somewhere in the state. Vito begins to notice that there are obviously other gay men living in the town.—garykmcd", "The two gang members who saw Vito in a gay bar are spreading their story around. When word reaches Tony, he is initially skeptical of the tale and insists that more evidence is needed to make a conclusive decision. However, after hearing about Vito fleeing when some of Tony's men go to talk with him, as well as learning of what Finn witnessed at the construction site, Tony becomes convinced. Knowing that the conservative mobsters will probably have him killed for his perceived betrayal, Vito packs his things and flees north, eventually getting stuck in a small town in New Hampshire. Far from his familiar territory, Vito begins exploring and meeting people. Meadow, meanwhile, is angry at her father for his attitude toward gays, as well as to his flippant dismissal of an Afghan family her law firm is representing.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0705259", "rating": 8.5, "votes": 7362, "number_of_episodes": 86}