{"cast": {"0001254": "James Gandolfini", "0000966": "Lorraine Bracco", "0004908": "Edie Falco", "0408284": "Michael Imperioli", "0005523": "Steven Van Zandt", "0802831": "Tony Sirico", "0407615": "Robert Iler", "0797464": "Jamie-Lynn Sigler", "0771993": "Steve Schirripa", "0898634": "Frank Vincent", "0029512": "Sharon Angela", "0304430": "Joseph R. Gannascoli", "0342106": "Dan Grimaldi", "0005576": "Drea de Matteo", "0621597": "Arthur J. Nascarella", "0001968": "Elizabeth Bracco", "0893120": "Lenny Venito", "0182569": "John Costelloe", "0508909": "Geraldine LiBrandi", "0080729": "John Bianco", "0190962": "Tony Cucci", "0144712": "Ron Castellano", "2184608": "Frank Borrelli", "1105207": "Paulina Gerzon", "1994165": "Louis Gross", "1842344": "Vincent Piazza", "2278978": "Emily Wickersham", "0650374": "Vincent J. Orofino", "1477789": "Anne Assante", "2219627": "Nathalie Walker", "0545549": "Jeffrey M. Marchetti", "1341852": "Clyde Baldo", "1650460": "Melissa Schneider", "1495427": "Alexandre Varga", "0935435": "Michel Winogradoff", "0709455": "Doug Rand", "0814519": "Luc Sonzogni", "1442406": "Marni Penning", "2474746": "Gérald Hubert", "2500473": "Chaouki El Ofir", "0814525": "Stéphane Soo Mongo", "2071484": "Christian Julien", "1775603": "Mamadou Sall", "4455935": "Michael E. Bell", "2101761": "Rick Collum", "1890146": "Luke Rosen"}, "geners": ["Crime", "Drama"], "runtimes": ["57"],  "plot": ["Phil takes out his revenge, while Tony grows frustrated with Anthony Jr's lack of ambition or work ethic.", "Vito approaches Tony in a shopping mall and asks if he can have back in and suggests he might be able to set himself up in Atlantic City. Tony is non-committal and they arrange to meet again. Before that happens, Phil Leotardo learns Vito is back in town and exacts his revenge. Tony sees this as Phil's attempt to exert some control over the New Jersey family. Tony's about had it with AJ loafing around and gets him a regular construction job at the Esplanade work site. Carmela and Rosalie Aprile go off to Paris for a holiday. They are just in awe of the city and Carmela begins to wonder about their place in the world. Sil and Carlo have a run-in with one of Phil Leotardo's men that gets just a bit out of hand.—garykmcd", "When Vito returns to New Jersey, Tony and his capos discuss what is to be done with him. While Tony is willing to just let Vito leave quietly, Phil is still out for blood. Pretending to set up a meeting with Vito to discuss his future, Phil ambushes him in his hotel room and has him beaten to death. Tony later expresses his concern to Silvio that that the killing of Vito was Phil's way of challenging Tony's authority. Meanwhile, Carmela and Rosalie go on a trip to Paris together, where Rosalie becomes philosophical about the loss of her husband and son. Back at home, Anthony earns his father's wrath by getting fired from yet another job for stealing, then trying to pass off his actions as purely motivated. Tony informs his son that he will now be working in construction, and threatens to destroy all of Anthony's prized belongings (which were gifts from Tony) if he doesn't straighten out.—Jean-Marc Rocher <rocher@fiberbit.net>"], "genres": "N/A", "imdbID": "0790351", "rating": 8.7, "votes": 7492, "number_of_episodes": 86}