{"cast": {"1669772": "Patrick Brammall", "0642444": "Genevieve O'Reilly", "1134439": "Emma Booth", "1120593": "Emily Barclay", "0219329": "Ned Dennehy", "2407067": "Sean Keenan", "0568791": "Andrew McFarlane", "0267475": "Daniela Farinacci", "6684586": "Hannah Monson", "5096350": "Aaron L. McGrath", "1122123": "Rodger Corser", "1048007": "John Leary", "0946527": "Stan Yarramunua", "4130421": "Ray Chong Nee", "0278354": "Anni Finsterer", "7444762": "Antonio Kapusi-Starow", "7444763": "Phoebe Gorozidis"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["After revisiting the cemetery, James confirms that the group have all risen from the dead and he confronts a mysterious and dangerous John Doe. Meanwhile Kate gets an unexpected surprise when she goes back home.", "Kate remembers that she underwent a mastectomy, but now she has her breasts again. Dr McKellar runs some tests on her and does not find any irregularities, meaning that her cancer seems to have gone. The man seen emerging from his grave at the end of the previous episode runs into a female change room. The Risen try to work out who they are and why they have returned. Kirsten starts to experience bleeding as she and James approach the bridge where Carlos died, and James stops the car. Meanwhile, James is torn between his two loves and turns to Vic for help. Fearing for their safety, Elishia hides the Risen from Vic. Kate and Maria run to the cemetery, where Maria realizes that her daughter Anna is also dead. They then go to Kate and James' house, and Kate is devastated to learn that James has a new wife, her old friend Sarah. Vic has an accident while driving his car, but he seems to be left with only a gash on his forehead. Elishia takes the Risen to an unknown location and will not tell James where they are.", "It's the morning after, and everyone is laying low at Elishia's surgery, struggling to remember who they are and what happened to them. Meanwhile in town, Irishman Paddy is happily breaking into a shop while, at the local high school, the last to emerge and dangerous \"John Doe\" is on the loose and roaming the corridors. James confirms that the group have all risen from the dead and Kate gets an unexpected surprise when she goes back home."], "genres": "N/A", "imdbID": "4201878", "rating": 7.5, "votes": 689, "number_of_episodes": 18}