{"cast": {"1669772": "Patrick Brammall", "0642444": "Genevieve O'Reilly", "1134439": "Emma Booth", "1120593": "Emily Barclay", "0219329": "Ned Dennehy", "2407067": "Sean Keenan", "0568791": "Andrew McFarlane", "0267475": "Daniela Farinacci", "6684586": "Hannah Monson", "5096350": "Aaron L. McGrath", "1122123": "Rodger Corser", "1048007": "John Leary", "1013376": "Lisa Flanagan", "5323286": "Tessa Rose", "0448047": "Gerard Kennedy", "4753860": "Jacob Collins-Levy", "5565313": "Matt Testro", "6622872": "Leila Gurruwiwi", "8884507": "Phoebe Roberts", "7444779": "Sermsah Pepi Bin Saad", "0751231": "Jim Russell", "2222438": "Phil Taylor", "4783603": "Pauline Grace", "6358477": "Xavier Gouault", "5343716": "Karl Robinson"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["Vic finds Maria and convinces her to take him to the group, James spends an intimate night with Kate and Kirstie remembers how she died.", "Bored at the hideout, teenager Kirstie recklessly leads Charlie to a wild paddock party that has started up near the property. Kirstie drinks and flirts and wanders off with a boy, trying to recapture the life of a normal teenager. Charlie worries for her and, when she disappears from his view, he runs to find James for help. They locate a visibly shaken Kirstie by the lake - she now remembers she was murdered. Vic finds Maria and convinces her to take him to the group.", "Vic convinces Maria that Elishia is not really trying to help them, but that she is trying to use them for her own professional gain. He convinces her to take him to the Risen by making her believe that they can bring her daughter back to life. She realises that he is not really trying to help her; she tries to get away from him but he kills her. Kirstie gets restless and sets off to find some answers for herself, and James helps her discover that she was murdered and her boyfriend was convicted-but she realises that he did not do it. John leaves the group due to his unpredictable and aggressive behaviour and ends up assaulting a store clerk. He later attempts suicide due to his inability to remember anything about his past. Elishia helps him uncover his past as a murderer. James gets a tip on Paddy and finds him in the woods and takes him to the others. After much effort, Paddy finally opens the box that he took from his house. Kate reveals herself to James' new wife Sarah."], "genres": "N/A", "imdbID": "4201886", "rating": 7.7, "votes": 601, "number_of_episodes": 18}