{"cast": {"1669772": "Patrick Brammall", "0642444": "Genevieve O'Reilly", "1134439": "Emma Booth", "1120593": "Emily Barclay", "0219329": "Ned Dennehy", "2407067": "Sean Keenan", "6684586": "Hannah Monson", "5096350": "Aaron L. McGrath", "1048007": "John Leary", "2315197": "Luke Arnold", "7592245": "Rob Collins", "0565883": "Belinda McClory", "0000278": "Pernilla August", "1122123": "Rodger Corser", "5323286": "Tessa Rose", "0415513": "Melissa Jaffer", "6284745": "William Prescott", "0580005": "Robert Menzies", "5485987": "Nicholas Denton", "6703710": "Connor Crawford", "5211193": "Max Brown", "8128066": "Jana Zvedeniuk", "3699929": "Alex Rowe", "5279966": "Thomas Hatchman", "8622094": "Luke Van Os", "5840232": "Dushan Philips"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["56"],  "plot": ["Realising that someone is out to kill them, Kirstie seeks to solve the mystery surrounding her death, while Paddy attempts to reconnect with the Fitzgeralds. Meanwhile William vows to bring Elishia back from the dead.", "A bloodied Phil arrives unannounced at Sarah's house pressuring her to finish the mission. But Sarah is caught between her mission and the new responsibilities motherhood has brought her. Distraught by Elishia's death, William vows to bring Elishia back to life as she did to him. But first he needs to understand Elishia's work and to do that he has to get back into Noregard. Realising that someone is out to kill them and that she could be next, Kirstie wastes no time, continuing to uncover the mystery surrounding her death. While Kate finds comfort and respite in her new relationship with Owen. As their intimacy and trust grows, they find themselves revealing long held secrets to each other. Meanwhile, Paddy attempts to reconnect with the Fitzgeralds, but he discovers he's being played by the powerful family matriarch, Adeline Fitzgerald. She abandons Paddy to the ruthless tactics of her grandsons, who turn up at Corona Hill to take their revenge on him and reclaim the will.—AnonymousB", "James and William bury Elishia. Phil comes to Sarah's house to clean up from his injury and he leaves his bloody clothes at her house. The two talk about their purpose. He has fulfilled his by killing Elishia but says that Sarah has not fulfilled hers yet. Heysen reveals she knows about Vic and his crash where he died but thinks he brought himself back. James still does not trust Heysen. Kirstie tries to get info out of her old friend Vicky who lied to the police. Sarah takes a gun to the house where the Risen are staying. James realizes that Owen has a previous conviction for manslaughter and goes after him. William discovers that his fingers are growing back and takes Elishia's research folder for Heysen. Paddy's persistence to get his estate returned causes him to encounter some issues. Sarah finds Charlie and tries to kill him but suffers a haemorrhage. Sarah tells James to take Nia home, but he goes to Heysen's house and discovers she has gone with William. He then gets home and finds Phil's bloody clothes. He confronts Sarah with them. Meanwhile, it is revealed that Chris's brother is the one that killed Kirstie."], "genres": "N/A", "imdbID": "7252892", "rating": 7.3, "votes": 413, "number_of_episodes": 18}