{"cast": {"1669772": "Patrick Brammall", "0642444": "Genevieve O'Reilly", "1134439": "Emma Booth", "1120593": "Emily Barclay", "0219329": "Ned Dennehy", "2407067": "Sean Keenan", "6684586": "Hannah Monson", "5096350": "Aaron L. McGrath", "1048007": "John Leary", "2315197": "Luke Arnold", "7592245": "Rob Collins", "0000278": "Pernilla August", "1122123": "Rodger Corser", "1319592": "Katrina Milosevic", "0580005": "Robert Menzies", "1013376": "Lisa Flanagan", "5323286": "Tessa Rose", "0434227": "Marta Kaczmarek", "6222687": "Maggie Naouri", "0547876": "Lex Marinos", "5485987": "Nicholas Denton", "6703710": "Connor Crawford", "0278354": "Anni Finsterer", "8128066": "Jana Zvedeniuk", "4001753": "Salim Fayad", "8186714": "Jed Sender", "9274080": "Mitchell Kennedy", "1976899": "Jarrah Cocks", "3699593": "Neil Solomano", "9274081": "Ngartari Roach", "6358477": "Xavier Gouault"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["59"],  "plot": ["James continues to help the Risen unravel the mystery of how and why they have returned, and a deadly new threat arrives in Yoorana.", "Four years ago, Elishia wakes up in a morgue. In the present, James remains suspicious of Sarah, who seems to be recovering quickly, has memory loss, and is acting erratic. James asks to see Vic's grave and it is revealed that the Risen cannot get to his grave due to the invisible barrier blocking them. The barrier appears to be moving or shrinking. John breaks into a house and is approached by a woman, Dr. Nicola Heysen, who knows exactly who he is. She says that Elishia used to work for her and offers him information on how Elishia brought the Risen back. Elishia reveals to John that his real name is William Blackburn. James investigates Elishia and talks to her former partner and discovers she was researching cell regeneration before she died of a stroke four years ago. Caroline tells Chris that Vic is missing. Chris asks James to help him track down his phone at the property where the Risen are. Kate gets close with a local named Owen. Beau's step-dad Phil returns after an explosion on his oil rig. Elishia comes to James' house to ask for help saving John, as Sarah watches through the window.", "Season two picks up with James dealing with his recovering wife, Sarah, and a new-born baby daughter. He continues to be committed to helping the remaining Risen unravel the mystery of how and why they have returned. John Doe crosses paths with the mysterious Nicola Heysen head of Noregard Pharmaceuticals, she shares some explosive information with him. While a new and lethal threat has arrived in Yoorana. With deeper memories returning and the mysteries of their lives and deaths being revealed, the Risen are desperate to hang on to this second chance at life at all costs. But how long do they have?"], "genres": "N/A", "imdbID": "7074870", "rating": 7.3, "votes": 490, "number_of_episodes": 18}