{"cast": {"1669772": "Patrick Brammall", "0642444": "Genevieve O'Reilly", "1134439": "Emma Booth", "1120593": "Emily Barclay", "0219329": "Ned Dennehy", "2407067": "Sean Keenan", "6684586": "Hannah Monson", "5096350": "Aaron L. McGrath", "1048007": "John Leary", "2315197": "Luke Arnold", "7592245": "Rob Collins", "0000278": "Pernilla August", "1122123": "Rodger Corser", "1319592": "Katrina Milosevic", "0580005": "Robert Menzies", "0415513": "Melissa Jaffer", "0831898": "Greg Stone", "5485987": "Nicholas Denton", "6703710": "Connor Crawford", "6622872": "Leila Gurruwiwi", "0946527": "Stan Yarramunua", "8032962": "Darcy Brown", "6771520": "Alice Chaston", "1070592": "Janet Watson Kruse", "2180471": "Caleb Wentworth", "8342244": "Joe Klocek", "8615663": "Jeffrey Bryant Jones", "2222438": "Phil Taylor", "4446985": "Graham Murray", "9295122": "Adrian Lambert", "3172607": "Michael Barlow", "4117770": "Justine Jones"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["55"],  "plot": ["With an unknown killer hunting them and the boundary continuing to shrink, tensions are running high as time looks to be running out for the Risen.", "With an unknown killer hunting them and the boundary continuing to shrink, tensions are running high as time looks to be running out for the Risen. Kirstie confronts her killer but is left frustrated and angry now that justice seems no longer achievable. Charlie also finally learns what happened to him after the war and how he eventually met his death. Paddy's gone missing so James travels to Corona Hill to find him. While Kate remembers a promise Sarah made to her when she was dying, she heads off to find Sarah and hopefully the truth. At Noregard, Nicola and William continue to work together to try and solve the secrets behind Elishia's research. Although still suspicious of Nicola, William will risk anything to try and bring Elishia back. Phil, still tracking the Risen, visits Sarah at the hospital, and continues to pressure her to complete the mission.", "Kirstie tells Chris that his brother Peter killed her. Sarah distracts James from asking her questions about Phil's bloody clothes by telling him about the haemorrhage. The Fitzgerald boys attack Paddy and tie him to his house that is about to be demolished, and they take his will. James finds out from Beau that Phil is in town and suspects him of Elishia's murder. Adeline frees Paddy. Heysen and William replicate the vibration that Elishia was using in her research. Kate thinks she asked Sarah to help her die and asks Sarah for the truth. Sarah tells her that she stole the drugs for Kate's suicide but could not give them to her. Sarah apologises for not helping her then reaches for her gun but is interrupted by a car pulling up. Sarah tells Phil that James knows who he is. Chris runs into Kirstie at the lake house and is attacked by Phil who is there to kill the Risen. James arrives and subdues Phil with Chris and Kirstie's help. He takes him back to town and places him in a holding cell. Meanwhile, Charlie remembers that he committed suicide to avoid dying slowly of TB, and Paddy is killed by Sarah."], "genres": "N/A", "imdbID": "7252894", "rating": 7.5, "votes": 414, "number_of_episodes": 18}