{"cast": {"1669772": "Patrick Brammall", "0642444": "Genevieve O'Reilly", "1134439": "Emma Booth", "1120593": "Emily Barclay", "0219329": "Ned Dennehy", "2407067": "Sean Keenan", "6684586": "Hannah Monson", "5096350": "Aaron L. McGrath", "1048007": "John Leary", "2315197": "Luke Arnold", "7592245": "Rob Collins", "0568791": "Andrew McFarlane", "0000278": "Pernilla August", "1122123": "Rodger Corser", "1013376": "Lisa Flanagan", "6622872": "Leila Gurruwiwi", "0547876": "Lex Marinos", "8128066": "Jana Zvedeniuk", "3699929": "Alex Rowe", "5279966": "Thomas Hatchman", "8622094": "Luke Van Os", "2382507": "Alicia Pavlis", "9346118": "Mace Williams"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["54"],  "plot": ["William and Elisha rekindle their love while James finally tells Sarah the truth, but all is not what it seems. At the Fitzgerald estate, Paddy is determined to right the wrongs of the past.", "Remembering more from his past, William finds Elishia and once again they share the love that they have for each other. Relieved to have her lover back, Elishia confesses the truth to him. While on the other side of town, James finally tells Sarah the truth about the other Risen and Vic's death. Sarah persuades him to tell Chris, so together, the three of them can protect the Risen. But later on, when Phil and Sarah cross paths in the park, Sarah's shocking mission is revealed. All is definitely not what it seems. At the Fitzgerald estate, with a clear sense of purpose, Paddy is determined to right the wrongs of the past. He meets a lawyer who believes that he might have a case that supports the Macrae's claim on the mansion. However, Paddy will need to find proof of his own murder. Meanwhile, knife in hand, a determined Phil is hunting his human target.—AnonymousB", "James admits to Sarah that he killed Vic. She tries to persuade James to tell Chris everything. Phil enters the house where the Risen are sleeping and absorbs info from them without waking them. He is looking for Elishia but she and William have left. Elishia tries to help William understand how they are connected. She tells him that she brought him back on purpose and the others were just an accident. They discover the boundary is contracting even further. Sarah admits she has had a headache since Nia was born. Later she continues to communicate with Phil to help him find Elishia. They meet in the park and Phil absorbs info from her about Dr Heysen. He asks her if she knows why she is here and if she knows what she needs to do, and she says she does now. She later reveals her headache is gone and she wants to help find Elishia. Elishia reveals to William they used to be lovers. She vows to fix the boundary. Phil follows Dr. Heysen to the cemetery where Elishia is. He chases Elishia down and stabs her in the neck, leaving her in the river where James and William find her dead."], "genres": "N/A", "imdbID": "7252890", "rating": 7.3, "votes": 419, "number_of_episodes": 18}