{"cast": {"1669772": "Patrick Brammall", "1134439": "Emma Booth", "2407067": "Sean Keenan", "6684586": "Hannah Monson", "1048007": "John Leary", "5815337": "Harry Tseng", "7511877": "Jessica Faulkner", "1967109": "Dustin Clare", "6574485": "Dalip Sondhi", "0697960": "Susan Prior", "3370453": "Jackson Gallagher", "0593672": "Rhys Mitchell", "3732586": "Brenna Harding", "1010852": "Richard Cawthorne", "1652405": "Samantha Tolj", "1122123": "Rodger Corser", "1074308": "Simon Maiden", "3581307": "Reef Ireland", "4177551": "Taylor Ferguson", "4950625": "Ruby Duncan", "10940214": "Henry Lawson", "5462671": "Laura Dunemann", "3238614": "Ravi Chand", "5410850": "Peter Lazar", "7444790": "Denise Kallenberger", "10939928": "Ava Cumming", "10939933": "Chanel Cumming"}, "geners": ["Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": 0,  "plot": ["Chris confronts James over his plan, but as catastrophe closes in, the Risen discover their true nature and their fate.", "Kate shoots William after what she witnessed with Phil. Kate, Kirstie and Charlie seek refuge with Chris. Chris arrests James for Vic's murder and locks him up. Kirstie goes to Noregard. Belle and Chi go to warn her sister about the coming fire. Chi experiences a startling flashback involving Paddy that shakes him to the core. Two of Noregard's staff tase Kate, Charlie and Raf, and then Chris and Kirstie, but James and William take back control of the situation. Mark manages to capture Belle and Chi at a separate point. They all rendezvous at the cemetery while the fire blazes around them.", "As catastrophic bushfires approach Yoorana, the Risen confront their fears of life and death. With Noregard's forces threatening them, the Risen must return to the cemetery with James and William before it's too late. With: Simon Maiden as Duncan, Reef Ireland as Luke, Taylor Ferguson as Judith, Ruby Duncan as Molly, Henry Lawson as Chi's Baby Son, Laura Dunemann as Policeman #1, Ravi Chand as Policeman #2, Peter Lazar as Local TV Reporter, Denise Kallenberger as Bev, Ava and Chanel Cumming as Grace."], "genres": "N/A", "imdbID": "9658156", "rating": 6.1, "votes": 398, "number_of_episodes": 18}