{"cast": {"2857778": "Janet Montgomery", "0922342": "Shane West", "0181787": "Seth Gabel", "1708957": "Tamzin Merchant", "0534772": "Ashley Madekwe", "2195169": "Elise Eberle", "0325221": "Iddo Goldberg", "6965680": "Joe Doyle", "5407311": "Oliver Bell", "0005128": "Lucy Lawless", "0190190": "Jeremy Crutchley", "0140161": "Allyn Carrell", "0380188": "Thomas Herod Jr.", "6782102": "John R. Bennett II", "7395820": "Angie Russo", "2050436": "Nathaniel Holt", "7347403": "Floyd Knight", "5187259": "Jeremy Summers", "7415857": "Rorie Vogel", "1922853": "Kalisa Wade"}, "geners": ["Drama", "Fantasy", "Horror", "Thriller"], "runtimes": ["45"],  "plot": ["Mary makes a last ditch effort to stop Countess Marburg's attempts while alliances shift as surprising truths are revealed.", "Badly wounded, captain John Alden senior is saved from Sebastian's ghostly attack party and nursed by Cotton Maher, who gave John junior to his bride Anne Hale and refuses to believe she's a witch until he sees her practice magic to hide the boy, promising falsely reunion with his mother. Magistrate Hathorne frees Isaac 'the fornicator' from the stocks, just punishment for impudence, but praises his honesty and fully rehabilitates him in the post-Sibley era. Baron Sebastian is not amused that Mercy Lewis offers herself as bed playmate, proving Mary's point previously: she's just a Marburg tool, to be discarded at will. Anne is unwilling to do countess Marburg's bidding, even told she's herd daughter, and betray Mary, but shown Tituba's ingrate fate and warned, ends up bringing boy John to the moor for the comet passing. Mary risks everything by magically entering her Essex coven's stronghold under a tree, yielding little support, but can warn captain Alden their son is in danger at the ceremony as diabolically possessed main instrument. The Marburgs trick Mary into refusing cooperation out of parental love, which gets expressed, which was the real requirement for the sacrifice to work, and the captain shoots too late: John junior incarnates the hellish master.—KGF Vissers"], "genres": "N/A", "imdbID": "4687982", "rating": 7.8, "votes": 291, "number_of_episodes": 36}