{"cast": {"0000092": "John Cleese", "0768795": "Prunella Scales", "0755133": "Andrew Sachs", "0095665": "Connie Booth", "0350372": "Michael Gwynn", "0255065": "Robin Ellis", "0075326": "Ballard Berkeley", "0943713": "Martin Wyldeck", "0799454": "David Simeon", "0175560": "Terence Conoley", "1086873": "Lionel Wheeler", "1746410": "Ian Elliot", "0283148": "Gilly Flower", "4004927": "Julie Mellon", "0590407": "Patrick Milner", "0669698": "Oscar Peck", "0676325": "Annet Peters", "1553846": "Dennis Plenty", "0723649": "Gary Rich", "0731513": "Renee Roberts", "0751082": "Claire Russell", "1753869": "Pat Symons", "1726120": "David Waterman"}, "geners": ["Comedy"], "runtimes": ["30"],  "plot": ["Basil is delighted when a member of the aristocracy chooses to stay at the Fawlty Towers, snubbing the normal guests who frequent the hotel. What Basil does not know, however, is that the man is not a Lord but a confidence trickster who attempts to steal his collection of rare coins. As Basil's desperation to keep such an 'upstanding' guest increases, he becomes increasingly tolerant towards the man's behavior, only to have the guest arrested in a police raid on the hotel.—t", "Basil Fawlty and his wife Sybil own a small hotel. The staff include Manuel, a Spanish waiter who cannot speak English and Polly Sherman, cook-waitress. Basil decides to advertise for additional customers but Sybil disagrees arguing the benefits outweigh the costs. Basil is a bit of a snob and would like to attract a better class of clientèle. When Lord Melbury arrives, Basil is moving dining room guest to lesser tables and basically doing anything he can to accommodate the peer. This is in contrast with Mr. Danny Brown who seems to be a bit too working class for his taste. When Basil agrees to cash his Lordship's check for £200 and entrust him with a collection of coins needing a new valuation, he learns not only that his snobbery has a price but that Mr. Brown may in fact be of assistance. It also doesn't help trade.—garykmcd", "Basil Fawlty wants to upgrade his hotel giving a touch of class and spends 40 pounds on an expensive advertisement in the newspaper to attract the upper class - under the protest of his wife Sybil. While having trouble communicating with his Spanish employee Manuel and hanging a picture for Sybil, the aristocratic Lord Melbury checks in - to the delight of Basil. Basil dedicates his full attention to the lord, ignoring his usual guests. When Lord Melbury asks to cash a 200 pound check and to evaluate his collection of coins, Basil's employee Polly Sherman goes to the bank and meets MI5 undercover agent Brown that tells her the truth about Lord Melbury, for the disappointment of Basil.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0578584", "rating": 8.4, "votes": 2698, "number_of_episodes": 12}