{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0383022": "Noriko Hidaka", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0586003": "Vic Mignogna", "0605451": "Toshiyuki Morikawa", "1797140": "Tamotsu Nishiwaki", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "0853301": "Veronica Taylor", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Nojiko continues her story, explaining how their life was ruined when the Arlong Pirates first took over the village.", "Bellemere was cooking a meal for her foster daughters. But when Arlong enters the home it appeared to be empty. Then Bellemere surprises him with a marine rifle directly into his mouth. Nami and Nojiko ran towards their home, only to be stop by the town doctor who tells them that they need to escape while they can, before Arlong discovers them to be the foster daughters of Bellemere. Bellemere thinks she has the whole thing taken care of only when Arlong bite and damaged the barrel of the gun. Then he continuously stomp on Bellemere's arm demanding her to pay for her soul. Arlong presumed that a family lived in this home. But one of his mermen looked at the stolen town records that Bellemere was never married or had any children. Gen came to tell them that she lives by herself and will pay the fine. Arlong leaved only when Bellemere announced that she has 2 foster children. And will use her money for their lives instead of hers. Nami and Nojiko came running towards her and begged her not to do it. But she's made up her mind and she doesn't want her only family to be killed at all. She told them to live on and stay strong. Nami didn't want her to die, not when she's yet to make her map of the world. Bellemere told her that that's her goal to fulfill. Arlong now knows the whole truth and will gladly kill Bellemere instead. Gen tries to stop him, but got injured by one of the mermen. Then all of Cocoyashi's locals came in a rampage to stop them from harming Bellemere. Arlong told his crew to fight them off but not to kill. He'll kill Bellemere as an example to those who don't have money. Her last words to Nojiko and Nami were \"I love you\". And she was shot by Arlong in front of their eyes. All the villagers were feeling guilty for not saving a friend of theirs. Arlong felt great after killing Bellemere told them all that, that's a prime example to those who refuse to pay their monthly fees. The crew found Nami's drawn map in Bellemere's back pocket. Nami told her to give it back. Which made Arlong amazed that a girl like Nami can draw up a map that good. So he takes Nami with them by force as she'll be useful to them. Gen tried to stop them but he was in no condition to fight at all. The once peaceful town was trashed and all the boats were destroyed by the mermen. Escaping is futile and not even the marines or government can help them now. Gen, Nojiko, and the villagers were worried about what will become of Nami. Then Nami came to the village with some money in her hands. They were all glad that she was safe. But they noticed that she has some bruises and she announced that she joined them as their navigator to draw maps. They all couldn't believe it, not even Nojiko who tried to tell her that she's with the one who killed their mother. But Nami said that they'll let her live, because she's being paid for making maps. When she turned around they noticed Arlong's symbol was on her left arm. Which means she's part of their crew now. Gen couldn't bare to look at her. And told her to leave the village, and she did. Later that night Nojiko finds Nami visiting Bellemere's newly buried grave. She told Nojiko that she'll save up 100 million to buy the village back from Arlong. That way everyone of the village will be free again. She must do it on her own, and advice both Nojiko and the villagers to not help, because Arlong will know. And over the years she became a pirate thief so she can steal even more money. Nami placed all that stolen treasure in a secret spot near Bellemere's home. And will use it until she has enough. After hearing the story both Usopp and Sanji are stun by the tale. Nojiko said that she's worked so hard to receive that must money. And if the Straw Hat Pirates keep claiming to be her friend, then she'll lose loyalty to Arlong and her plan will be ruined. Which is why they shouldn't interfere at all. It's too much for a girl to be working for the one who killed her own foster mother. In the bushes Johnny and Yosaku, who didn't left the island heard the whole thing and felt terrible for what they've said about Nami. Nami got up from her seat at Bellemere's house and mentions that she only need 7 million to buy back the village. But will her 8 year plan succeed?—J LeGault"], "genres": "N/A", "imdbID": "0965144", "rating": 8.9, "votes": 4259, "number_of_episodes": 1147}