{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0031844": "Takeshi Aono", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "0340162": "John Gremillion", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0605451": "Toshiyuki Morikawa", "0648866": "Masaya Onosaka", "1754270": "Brina Palencia", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0881585": "Megumi Urawa", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["Arlong has trapped Luffy in the ocean and Zoro faces the six-sword wielding octopus Hatchan.", "Luffy is drowning in the water, and it's a matter of minutes until he's ran out of oxygen. While Zoro and Sanji were busy dealing with their opponents. Hatchi the Octopus Merman shows off more of his moves on Zoro. While Sanji is trying to take down Kurobi the Level 40 Marshal Arts Merman. After Zoro cut Hatchi's hair, he got mad and went to retrieve his 6 swords. He tells Zoro that he has a bigger advantage over human swordsmen with his 6 sword attacks. But Zoro is suffering from a fever and hasn't fully recover from the wounds he got when battling MiHawk. Johnny and Yosaku watched in horror as their friend is suffering during a battle. They were also worried that Luffy can't save himself from his watery grave. And attempt to save him, but their in no condition to dive in and save him. So Gen and Nojiko instead went to aid Luffy some help. Usopp is still running from Chu, as it's merely impossible to catch up to the speedy long nose pirate. Nami fixed her arm up with bandages and decides to not blame herself anymore and heads over to Arlong Park to help everyone win the battle. Zoro got up and told Johnny and Yosaku to give him their swords so he can perform his 3 sword attack. Hatchi bluffs that with more swords he can beat Zoro easily. Zoro remembered what MiHawk told him about swordsmanship and the day he made a promise in becoming the world's greatest swordsman. And in order to do that he must over come the impossible sword fight, even if he's wounded. He gave out quite a performance. As Hatchi's 6 swords were broken and Hatchi was in no condition to fight. Zoro corrects Hatchi that the number of swords doesn't matter in swordsmanship. Nojiko and Gen did all they could to try to free Luffy from the concrete he's stuck in, but the sludge hammer Gen is using won't work under water. So Nojiko had to stretch Luffy's head out in the surface, to try to get him to breathe again. Zoro wanted to help his friend, but he's too weak to swim. So Sanji dive in instead. But that's what the mermen wanted them to do, because they have a bigger advantage underwater than regular humans. Arlong is enjoying all of this like a show. Will Luffy be able to become conscience again? And will Nami make it there in time?—J LeGault"], "genres": "N/A", "imdbID": "0967036", "rating": 8.0, "votes": 2208, "number_of_episodes": 1147}