{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0605451": "Toshiyuki Morikawa", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["With Arlong's officers defeated Zoro and Sanji take on Arlong but prove that they aren't a match for him. However, with Luffy finally free, he takes on Arlong himself.", "Nami tells Arlong that she's here to kill him. Arlong however laughed and told her that over the past 8 years, she was never able to kill him before. If she's truly a traitor of his crew, then he'll kill all the villagers, otherwise he'll keep her as his navigator. Either way there's no escape options from him. She was afraid to put everyone at risk. But after Luffy told her, he'll help her. She gain confidences and chooses to fight along with the villagers. Zoro had some strength left in him. He told Sanji to give him 30 seconds to stall Arlong. Sanji went to set Luffy's feet free from the concrete chunk. Usopp made it back and brag that he beaten Chew all by himself. And is ready keep Zoro covered. Hachi got back on his feet, and dives in to eliminate Luffy. Zoro does all he can to fight Arlong with his swords, only to discover that Arlong's skin is really tough. He pierced Zoro and opened his bandages. Arlong was shocked to see that Zoro is still living from the wound he's got. Arlong thinks that this fight is already over. But Zoro told Arlong that Hachi shouldn't rush himself otherwise his injuries would reopen. And he was right as Hachi's injuries got worst and bleed in the ocean. Sanji used his kick to break the concrete. And Luffy's body was finally free. He spring ed out of the water stretched for Zoro. Threw him out of the way so he can give Arlong a Gomu Gomu Bell attack. Then he started to beat him up real bad. But it takes more than that to defeat Arlong, as he tries to bite Luffy. And his teeth as strong enough to break a bone. How will Luffy defeat Arlong?—J LeGault"], "genres": "N/A", "imdbID": "0967037", "rating": 8.1, "votes": 2146, "number_of_episodes": 1147}