{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "0552575": "Josh Martin", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy returns to the fight, and the battle with Arlong versus Luffy begins.", "As the fight begins to warm up, Arlong asks Luffy if he knew what the difference is between them. Luffy thinks it's the noses, chins, and web hands. Arlong corrected him that it's their nationalities. As he uses his shark bite attacks on Luffy, he monologues that they were put on this plant with their own differences. And since then Arlong believes that Mermen deserve to be the dominate creatures on the plant, because of what they could do and what humans can't do. He finds Luffy to be a lousy captain and can't even swim making him weak. Luffy didn't care if his teeth can crush stone, because he can do the same with his fists. And having friends on his side makes him powerful than he is. He grabbed Johnny and Yasuko's swords and swing them around. Arlong thinks he's toying with him and broke the swords with his teeth. But it was a distraction as Luffy knocked Arlong out with his punch. Then Arlong's teeth broke, thinking he'll be useless with out them. But he grew a new set of teeth which surprised everyone who's watching the fight. Arlong says that mermen can grow their teeth back like sharks can do. Every new set of teeth becomes stronger than the previous one. So he took 2 pairs of teeth out and shows off his Shark Gum attack. Luffy dodges all the attacks, got one of Arlong's teeth and uses it as false teeth. But it'll take more than Merman teeth to win this fight. As it soon became brutal and murderous. Everytime, Luffy thinks he beaten Arlong, he'd just come back up. Arlong dives into the water to regain some energy for his Shark on a Dart attack, which makes him shoot out of the water like a torpedo. Sanji, Usopp, Johnny, Yosaku and the Villagers try to tell Luffy to go hide. But he remained where he is, and shows off his net attack that prevented Arlong from piercing him. Then he gave Arlong a powerful body drop from the air. Presuming he won the fight, till long got up with a rage in his eyes. And gets out his Giant Saw Sword to strike Luffy. Luffy kept dodging the sword as the whole park is being destroyed by Arlong's Saw Sword. Soon they were both in the Left top floor. Which is Nami's room, Luffy learns from Arlong that Nami has been making maps for him for 8 years. Without her, the Mermen Crew wouldn't of known their destinations off hand. Nami's skills were so impressive, she's became more worthy of being part of the Merman crew than any ordinary human being. Luffy told Arlong he's wrong, because Nami is his Navigator.—J LeGault"], "genres": "N/A", "imdbID": "0967034", "rating": 8.0, "votes": 2109, "number_of_episodes": 1147}