{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0157133": "Shigeru Chiba", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "3435683": "Cris George", "1708798": "Caitlin Glass", "1782579": "Jason Grundy", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "0559640": "Youko Matsuoka", "0568772": "Mike McFarland", "0651682": "Jonathan C. Osborne", "1754270": "Brina Palencia", "0722676": "Monica Rial", "0754526": "Christopher Sabat", "1041619": "Laurie Steele", "0833185": "Sonny Strait", "3485265": "Kenneth Thompson", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0959984": "Tôru Ôhira"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["After his fight with Luffy, Buggy was sent flying to another island with several body parts missing. Thus, Buggy begins his journey to find his crew and his body parts, making some unlikely friends.", "It's morning, and the Straw Hat Pirates are enjoying their breakfast. Nami remembered when she and Luffy first meet, back when they encountered Buggy the Clown. Nami asked Luffy, if he'd know what had happen to Buggy. Luffy doesn't have a slight clue, but figures he's somewhere far away. Meanwhile on an island, the clown of terror himself, Buggy has spent his time wisely on the island Luffy punched him to the last time they met. He's shorter because he lost his parts from the last time. So he is now the height of a circus midget. He built a raft, and heads off to find Luffy. But he got attacked by a bunch of piranhas. And only made it to the next island. He finds a flight less bird(same size as him). So he decides to eat it. When he has it in his grasp, a much larger bird comes by to scare Buggy off. It attempts to eat him, but he's not that good to eat. And send him flying in the air and landed on another island. The island he landed on is Legendary Treasure Island(the same one the Straw Hat Pirates went to in Episode 18). Buggy hear's the voice of the Guardian God and tells him to get off the island. The voice was in fact Gaimon(the Bush haired guy in the box). Is protecting his mixed up animal friends from poachers. He presumes Buggy is one, and tries to shoot him. They both come face to face and it becomes an unusual battle. Specially when they are both the same height. When Gaimon has his gun pointed at Buggy, Buggy told him he's not at all interested in his animals. Just a regular pirate, which made Gaimon lowered his gun and told Buggy, that he was also a pirate. They apologized to one another, and soon became friends. Later that night, Gaimon, Buggy, and the mixed up animals drank sake around an open camp fire. Gaimon told Buggy about the 20 years he spent on the island. And how he protected a treasure that wasn't there. He offered him a chance in being part of his new crew(which he's yet to accomplished). But Gaimon prefers to stay on the island to look after his animal friends. Buggy reminded Gaimon of Luffy(but referred to him as a helpful young man). While Buggy mentioned a young man he despises(but doesn't use Luffy's name). They both presume they're talking about 2 completely different people they've encountered. And throughout the night they drank. The next day, Buggy's raft was made for his departure and said goodbye to Gaimon and his animals. But he encounters a large crab which destroyed the raft. Then a ship came by and killed the giant crab. Gaimon was relieved that his friend is safe and sound. The one who saved him is a slender/attractive woman who knows he's Buggy the Clown. She shows him the wanted sign of Luffy, which made Buggy shout with anger. Buggy got acquainted with the hot woman, as they're both after the same guy. And decide to team up, and who is this mysterious woman?—J LeGault"], "genres": "N/A", "imdbID": "0967035", "rating": 6.3, "votes": 1972, "number_of_episodes": 1147}