{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0586003": "Vic Mignogna", "0605451": "Toshiyuki Morikawa", "1797140": "Tamotsu Nishiwaki", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "0853301": "Veronica Taylor", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["When marine officers under Arlong confiscate Nami's money, the villagers start a rebelion. Desperate, Nami asks Luffy for help.", "Nami remembered 8 years ago, when Arlong noticed her being depressed. And to make it worth her while, he made a deal with her, that if she saved up 100 million. Then he'll give her back Cocoyashi's village. He doesn't care how long it takes, as long as she's still loyal to him. She then sees Gen guided by Commander Nezumi of the Marine's 16th fleet. He knows that Nami has stolen a great amount of pirate treasure. And his marine buddies are here to confiscate it for the government. Nami tries to fight them off as they search for it in the orange orchard. She couldn't believe that the Marines would be more interested in money than the lives of the island's locals. Nesumi guessed correctly that the amount was 100 million. And Nami already knew that Arlong told him about their deal. Nami was about to get shout by Nesumi as she was running. When Gen and Nojiko stopped her any further. Nojiko got shot in the shoulder, and the marines uncovered the money that Nami worked so hard on. Gen revealed to her that he and the villagers knew that She was planning to use that money to save the village. They all pretended to not be aware of it. And since then they waited till Nami has saved enough. They had to take Nojiko to the town doctor. While Nami felt bad that her foster sister had to get the shot instead of her. Luffy found her and was glad to see her, but Nami was still angry that Luffy didn't bother to leave the island when he was told to. She ran towards Arlong Park, to have a word with Arlong. She knows that he broke their promise, but Arlong acted as if he didn't know what was going on. And told her that if the Marines have her money then she'll have to save it all up again. She got even more mad and left. While she's gone, Arlong tells his crew that he tends to keep her with their crew a lot longer, and won't be off his back till she makes maps of the entire world. Gen tells all the villagers what had happened and they decide that now is the time to fight them off. Nami refused for any of them to fight when they know it's suicidal. She tries to convince them that she'll save up the money all over again. Gen hugged Nami and told her that she's suffered enough, and they must show the mermen that they all have pride and the right to be free. They set off to Arlong Park while Nami slump with the vision of Arlong's evil laugh. She gazed at her tattoo and start to stab it, as she wants it to come off. Luffy stopped her from doing any more damage to her arm. She tells him that none of this is his business and doesn't know the whole tragic story to it. Luffy knows and gave her his hat. She remembered that he never lets anyone touch his hat at all. And knows he's up to something. The villagers came to the front of Arlong Park but Johnny and Yasuko were blocking the way. They told them after learning about the truth, they tried to fight Arlong, but it was no use. So their waiting for some help to come. And that help is Luffy, Usopp, Zoro, and Sanji, all 4 of them decided to put an end to Arlong's 8 year rule.—J LeGault"], "genres": "N/A", "imdbID": "0965142", "rating": 9.3, "votes": 5629, "number_of_episodes": 1147}