{"cast": {"0849028": "Mayumi Tanaka", "0049319": "Nell Balaban", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "1708798": "Caitlin Glass", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "1489841": "Jamie Marchi", "0612818": "Rob Mungle", "0620017": "Kazuya Nakai", "0645500": "Akemi Okamura", "1046347": "Fumiko Orikasa", "0722676": "Monica Rial", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0814470": "Keiichi Sonobe", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0853301": "Veronica Taylor", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0913842": "Misa Watanabe", "1075553": "Kerry Williams", "0932637": "David Wills", "0945322": "Kappei Yamaguchi", "0945372": "Yuriko Yamaguchi", "1943661": "Stephanie Young", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["23"],  "plot": ["Luffy agrees to take Vivi with them.", "Luffy and Zoro defeated Miss Valentine and Mr. 5 while they fight their pointless battle. Nami came by and put an end to it. Luffy soon learned what really happened and forgive Zoro for thinking he killed the locals for nothing. Nami tells Vivi that they'll do it only for a matter of money. Vivi however doesn't have anything in return, she just wants to be returned to her home land safely. Nami didn't get why a princess wouldn't have any money. Vivi explained that her kingdom was wealthy long ago. Right until it got into a civil war. Which was caused by the Baroque Works Organization. She & Igaram joined it as Mr. 8 & Miss Wednesday in attempt to know who was responsible for it. Mr. 0 the leader has plans to create an ideal nation. But it's all a lie. And Vivi must get back to Arabasta to prevent her people from thinking that Ideal Nation is all good. They asked who Mr. 0 really is. Vivi wasn't suppose to reveal the true name of Mr. 0. But accidentally said Crocodile. The Unluckies were there and know that Nami, Luffy, & Zoro know the secret and are put on the death list for Mr. 0. Now that they're faces are known, Nami got angry at Vivi for spilling the beans and thinks that all hope is lost. Igaram comes by in a less convincing disguise as Vivi and 3 Straw Hat pirate decoys. He plans to distract the hunters who'll be after them. Nami finds this all to be a stupid plan and Crocodile will try to kill them. Luffy asked about Crocodile's statics. Igaram explained that Crocodile is one of the Shichibukai, a government sanctioned pirate, who's no-longer on the wanted lists. His bounty before was 80 million Belli, 4 times more than Arlong's bounty. He asked Luffy if he'll accept to protect Vivi, and he did. Igaram in his Vivi costume is about to depart, and got the eternal pose from Vivi. Unlike the log pose, the eternal pose never forgets the magnetic field of one island it's set to. Which can give a person a better chance in getting to Arabasta. He tells Vivi to get to Arabasta as soon as possible under the care of the Straw Hat Pirates. Vivi wasn't sure if it was all right for Igaram to go by himself, but accepted the plan. Everything seem to work out fine as Igaram sailed his ship off from Catcus Island, right till the ship was destroyed with a large blast. Luffy didn't show a sign of emotion, but just shouted that igaram was a great man. Which was their cue in leaving the island as the one who destroyed that ship is one of Baroque Work's hunters. Vivi was shock to see her friend gone so sudden. Nami tells her that they need to leave, and will be sure to get her home. Luffy went to grab the sleeping Usopp and Sanji, who still don't know what has happened since the party. Zoro prepared the ship to cast off & Vivi's pet duck Carue made it to the ship. And they departed from Whiskey Peak. Zoro asked Vivi how many are employed to Baroque Works. Vivi said there are 2000 at least. And there are other towns like Whiskey Peak that have hunters on the job. Nami finds that the force of Baroque Works is greater than imagined. Usopp and Sanji woke up and are angry that they're leaving what they thought was a fun town. Nami knocked them out to shut them up. It was morning already and they're no longer in the Cactus Island territory. Only they discovered that some strode away on board the \"Going Merry\". It was a woman who they discover is an agent for Baroque Works and the one who killed Igaram. Miss All-Sunday, a partner of Mr. 0, and the only one who knows Crocodile's true identity. And she finds it foolish for a princess to make enemies with Baroque Works in order to save a kingdom. Usopp, Sanji(who both don't know what is going on but know it's bad news), Zoro, and Nami were about to kill All-Sunday. But soon discovered that she has Devil's Fruit powers. As she made them put down their weapons without doing anything. She then said she wasn't under any orders to kill them at the moment. She grabbed Luffy's Strawhat without moving an inch, Luffy got mad, and Miss All-Sunday knows that he's wanted. But finds it sad that they're taking care of a princess who's wanted by Baroque Works. And they're only a small number in protecting her. And notes that they're worst luck of all is, that the direction they're heading to Little Garden, a much more dangerous island. They won't be able to make it to Arabasta if they go through Little Garden. Luffy didn't want to hear anymore and demanded to have his hat back. She did give it back, as well as the eternal pose, that Igaram had before. Which can lead them to an alternate route that'll avoid a trip in going to Little Garden. According to All-Sunday the eternal pose's needle points to Nanimonia Island, a near by island to Arabasta. None of Baroque Works' employees know about the route. Nami didn't get why All-Sunday is helping them. Zoro knows it's a trap, while Vivi was about to decide to take the safest route to her kingdom. Right till Luffy destroyed it in his hands. Nami kicked him in the face for breaking the eternal pose and their chances in getting to Arabasta quicker. Luffy however doesn't let anyone except him to decide on where they're going. And he doesn't take take directions from the one who killed Igaram. All-Sunday didn't bother to ask, but said if they survive, they'll meet again. She got off the ship and rode on her giant turtle, Banchi. Leaving Vivi clueless on what Miss Sunday's real intentions are. While Sanji and Usopp demand to know what is happening. After the whole story on what happened in Whiskey Peak, Sanji agreed to help protect Princess Vivi like a true knight in armor. While Usopp was glad that he slept from all the danger that occurred. Vivi wonder if it be alright to be on board their ship and putting them all in danger. Nami corrected her that they're all marked for death thanks to her. So now their next stop in the Grand Line is going to be Little Garden. And they're soon to find out that something big will await for them there.—J LeGault"], "genres": "N/A", "imdbID": "0976910", "rating": 7.8, "votes": 1567, "number_of_episodes": 1147}