{"cast": {"0849028": "Mayumi Tanaka", "0386286": "Hiroaki Hirata", "0649026": "Ikue Ôtani", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1020018": "Christine M. Auten", "0065292": "Tony Beck", "0132285": "Charles C. Campbell", "1513684": "Colleen Clinkenbeard", "0969901": "Wayne Grayson", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0416532": "Grant James", "0421004": "Bill Jenkins", "0552575": "Josh Martin", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "0853301": "Veronica Taylor", "0860443": "Marc Thompson", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Sanji tearfully parts with Zeff and the kitchen crew, joins the Straw Hats as chef, and the team heads toward Nami's troubled hometown--next stop, Arlong Park.", "Don Krieg is finally defeated after Luffy gave him a twirling kick as they were falling to the sea. Luffy fell into the ocean and couldn't move a muscle. Sanji dive in to save him, and brought him back up to safety. Don tries to get up as he won't accept to loose. But Gin came by to knock him out cold. He tells the other pirates that they'll accept this defeat and leave. Patty and Carne provided them with a small ship that barley holds all 100 men. Gin told Sanji thanks for everything. He also tells Sanji to tell Luffy(who is asleep) that they'll meet again at the Grand Line. Instead of being protected by Don, Gin will do what he wants to do. And he'll from now on follow his own instincts. So that way he won't have anything to run from. Gin carried Don to the small ship with the crowded crew and set departed. After the Krieg Pirates left Luffy awakes in Sanji's room. Sanji told everything Gin told him to. After getting rid of Don Krieg, Luffy is no longer hold responsible for the damages he made at the restaurant. Luffy asked Sanji if he still wants to be part of his crew. But Sanji still refuses as he feels he's still needed for the Baratie Restraunt. During meal time, Sanji and Luffy had to sit on the floor because no one save them their own seats. While the crew members ate the soup, they burst out insults that the soup tasted awful. Sanji noted that he worked hard on making that soup. But even Zeff says that it's taste is no where close to being good. Sanji walk outside feeling disgusted by the way they described his soup. Luffy took a taste of the soup and said it was pretty good. They all know that, it was an act to discourage his cooking. Zeff notes that Sanji has a lot to learn about preparing meals. He needs to travel outside of the restaurant to learn various ways in cooking. Zeff told Luffy that he'll let him take Sanji along on his quest to the Grand Line. But Luffy doesn't think he'll be able to convince Sanji to go. Meanwhile Sanji was eavesdropping, right till a shark came out of the water dragging a man inside it's mouth. It crash landed on top of Sanji. The crew went to see what was happening. Luffy recognize the dragged man as Yosaku. After getting rid of the shark, Luffy asked where the others are. Yosaku said that they found out where Nami is heading to. But according to the map, she's heading towards a dangerous place. And they need Luffy's help. Sanji who has the same dream as Luffy will be his crew's chef. He wants to find the All Blue he's always wanted to see. And become as experienced of a chef as Zeff. So they soon prepared a boat Sanji own. Luffy gathered up some food for their trip. Zeff was going to offer Luffy the Grand Line Logbook(that Don wanted so badly), but Luffy didn't take the offer, as he wants to go to the Grand Line his way. Sanji packed up all his things and spent a few moments glancing at the place that was like a home to him. And remembered how Zeff save his life and the day the first opened the Baratie. As he was about to go on board the boat. He suddenly feels emotional about what Zeff has done for him. He cried and told Zeff thanks for everything they've been though. He said it as if Zeff was his own father. The crew also cried and it was hard to see him go. Even if they didn't get along over the years. After some drama here and there. Luffy, Yosaku, and Sanji set sail to find the others. Meanwhile Nami is guiding the Going Merry to what Yosuka describe as a dangerous island. Why does she want to go there? And what business did she had with the place?—J LeGault"], "genres": "N/A", "imdbID": "0963014", "rating": 8.4, "votes": 2799, "number_of_episodes": 1147}