{"cast": {"0849028": "Mayumi Tanaka", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "1708798": "Caitlin Glass", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "0620017": "Kazuya Nakai", "0623214": "Gorô Naya", "0645500": "Akemi Okamura", "0666547": "Chris Patton", "2925410": "Jerry Russell", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0847416": "Yasuhiro Takato", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0913842": "Misa Watanabe", "1075553": "Kerry Williams", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["As the Straw Hats ride down Reverse Mountain into the Grand Line, a huge whale appears in front of them.", "The Grand Line, the greatest ocean in the world according to Luffy. As our heroes slide down the water current slope of the Red Line, it was much like a ride. As they approach to the bottom, Zoro hears a strange noise, which Nami thinks was just the wind. Usopp used his goggle to see what was up ahead, Sanji thinks it's a mountain, but Nami knows that there isn't suppose to be one. But as they approach to what looked like a mountain turned out to be a whale. The whole crew panicked as the whale is blocking their path, and the Going Merry is going at top speed. The whale's eyes aren't pointing towards their direction so it doesn't see them yet. Zoro sees an opening of the port towards the left. Only problem is they don't have a helm to turn. Sanji, Zoro, and Usopp struggle to make the ship turn with a broken helm. Luffy got an idea and went downstairs on the ship. It all looked like they're going to crash from Nami's view. Right until a cannon ball was fired at the whale. Which was Luffy's plan on slowing down the ship. They did stop, but it broke Luffy's favorite seat on the front of the of the Going Merry. Luffy got upset that his favorite seat was damaged. As for the whale, it made no sudden movement. Which seemed like the right moment to get out of here. So they rowed the ship quietly past the whale. Then the whale gave a large moan. As the Going Merry gets near the eye, Luffy shouted and punched the whale right in the eye. Which was a stupid move over a broken seat. The whale noticed them, and Luffy continued to yell out insults. Then the whale opened it's mouth and got the ship to entered it's mouth. Luffy escaped from being eaten, and climbed on top of the whale as his friends are now trapped inside the whale. He punches the whale on the head several times as a demand in returning his friends. But it began to dive into the water. Luffy found a door(which is where the spout hole is located). Meanwhile the Straw Hat Pirates, all 4 of them are speechless as they find themselves inside the whale. But it doesn't even look like they're inside one. All they see is a house on an island. All of it seemed to be an illusion. Then a giant squid came out of the water, which maybe an illusion too. As Zoro and Sanji prepared themselves to fight it, it was speared by 3 spears coming from the house on the island. After being frighten Nami and Usopp wondered what happened to Luffy. Luffy in fact is lost and confused that he's inside a crafted mine instead of a whale. The one who fired the spears is an old man with a flower shape head. Sanji didn't know if he was just fishing or saved their lives from the squid. The old man paid no attention to our heroes and sat down on his chair to read a newspaper. Sanji got angry to be incredibly ignored. Usopp called out the old man and thinks that he's plotting a fight. And mentioned they have a cannon for defense. The old guy held a long pause for a while and just said \"Don't. Or someone will die.\" They weren't getting any answers from from him. Zoro asked where they are, which he got for an answer: to introduce yourself first before asking questions. Zoro understood and introduced himself, while the old guy introduced himself as Crocus. Keeper of the Twin Capes Lighthouses, 71 years old, Gemini, Blood Type AB. Zoro got angry himself for not finishing his own introduction. Crocus tells them that they're at his one-man resort inside a whale. Usopp and the others now know for sure that they're inside a whale. And the water is actually the stomach acid, which made Nami worried. Crocus pointed out the big door, if they want to leave. But Nami was confused on why there's a door in mid air, inside a whale. Ussop pointed out that what appeared to be the sky is actually an alternate illusion. The whole stomach is painted to look like the sky. They were about to leave Crocus to his one man resort, only when the whole place shook. Crocus explained that Larboon(the whale they're in) is ramming himself against the Red Line. The whale is in pain, which the Straw Hat Pirates presume that Crocus's plan is to kill the whale from the inside. And the waves are too strong to depart to the big door. Meanwhile Luffy is bouncing up and down as the whale rams itself to the Red Line. Then encounters a man(Mr. 9) and woman(Miss Wednesday) with large guns, infiltrated the whale and planning to eliminate it as well as Crocus. Luffy runs towards them right before they could proceed to their plan. And all 3 of them are flying out into the stomach. Crocus used some sedative to calm Laboon down. The Straw Hat Pirates saved Luffy, Mr. 9, & Miss Wednesday from drowning in the stomach acid. Zoro demands to know what their up to. While Wednesday can tell that she and Mr. 9 are dealing with pirates. Crocus however knows them and orders them to not harm Laboon in any way. Mr. 9 and Wednesday's plan is to kill the whale and they fired out their guns against the outer layer of the stomach. Crocus prevented the bullets from hitting Laboon. Which shows he's planning on protecting Laboon. While the whale hunting duo laugh at how pathetic Crocus tries in protecting Laboon. Nami is clueless on what is going on, till Luffy hit both of 9 and Wednesday in the head. Crocus wanted to know why Luffy helped him. Luffy just says he didn't want to see the 2 whale hunters laugh in attempting to kill a whale. Everyone wanted to know what the whole story is. Crocus explained that Mr. 9 and Miss Wednesday are from a town in need for whale meat, that'll last for 2 to 3 years. Laboon is an Island Whale, inhabitant from the West Blue, largest whale species on the planet. Crocus doesn't want to see a whale like Laboon to be turn into food. And stated that for 50 years, Laboon is kind hearted and been waiting for a group of pirates to comes straight from Reverse Mountain on the Red Line. How will this issue be resolved over Laboon?—J LeGault"], "genres": "N/A", "imdbID": "0975812", "rating": 7.5, "votes": 1555, "number_of_episodes": 1147}