{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "1716724": "Cole Brown", "0121423": "John Burgmeier", "0132285": "Charles C. Campbell", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1711418": "Kevin Connolly", "1827148": "Marc Diraison", "1462031": "Jason Griffith", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0411050": "Hideo Ishikawa", "0416532": "Grant James", "0421004": "Bill Jenkins", "3138799": "Jessica Killough", "3966409": "David Moo", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "1487947": "Jacob Preissinger", "0754526": "Christopher Sabat", "0766339": "Shinobu Satouchi", "1387237": "Carrie Savage", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "0860443": "Marc Thompson", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["Gin returns leading a ravaged but ruthless Don Krieg, who demands supplies and control of Baratie, forcing Luffy and the cooks to defend their galley against an armada.", "When Sanji sees Nami he starts to flirt with her with a rose, his boss was very unpleased with the way he acts as a chef. Sanji has always had fights with the customers, and all the other chefs dislike his attitude. And for that Chef Zeff decides to lay him off. But Sanji denies his pink slip and will continue to cook no matter what. 4 days later Luffy is still working for Zeff, and his crew won't leave until Luffy convinces Zeff to let him go. Then out in the opening a ship sailed towards the restaurant. The customers were all in an uproar as it was owned by THE Captain Don Kreig. The King of the East Blue, leader of 5000 pirates, strong pirate of them all, and a real snake in the grass. When he entered the restaurant, the customers and chefs discovered that he's starved to death and is being helped by Gin who telling them that his captain needs food. But no one wanted to help the one who's responsible for killing many marines and victims. Don bowed and states he'll leave when he's done eating. Still none of the chefs would help him. Sanji however offered Don, a platter of food. Patty and the chefs couldn't believe that Sanji would help a pirate like Don. Danji states to his role of being a chef is to serve food. He has no care about anything else, except to satisfy those who are hungry. When Don finished he knocked Sanji out and orders the chefs to feeds his remaining men on board his damaged ship. Gin couldn't believe that his captain wasn't true to his word. But like they say, Don is known for being a real snake in the grass. And he plans to use the Baratie as his new ship. What will happen to the Baratie chef crew next?—J LeGault"], "genres": "N/A", "imdbID": "0961580", "rating": 7.5, "votes": 2137, "number_of_episodes": 1147}