{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "3435683": "Cris George", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0605451": "Toshiyuki Morikawa", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["The Straw Hats face the Fishmen themselves as the villagers watch from the sidelines.", "Luffy destroyed the front entrance to Arlong Park, and demands to know which one is Arlong. Arlong addresses himself and gets punched by Luffy with his Gomu Gomu Pistol punch. Arlong hit the wall, which made a hole in it. Luffy told him that was for making his navigator cry. All the mermen and the villagers were surprised that Luffy is a rubber man who ate the Devil's Fruit. Hatchi called out Mohmoo, the sea cow monster that Luffy, Sanji and Yasuko encountered on their way here. Mohmoo remembered how they pulverized him and left cowardly. Arlong was disappointed that Mohmoo has became soft. And for that, Mohmoo showed it's rage and attacked Luffy. Who implanted his feet to the concrete and used his new ability the Gomu Gomu Windmill and used the sea cow to take out the Mermen Crew. Half the park was destroyed and most of the mermen are wounded and unconscious. Only to soon discover that he's stuck in the ground. 3 of Arlong's strongest mermen told him they'll handle them. As Hatchi was angry for what Luffy did to his Mohmoo and showed off his oil squirting attack. Which blinded him momentarily. So Sanji and Zoro had to cover him. Usopp tried to get him of the ground but his rubber legs just stretch out and hit Chu. Who went chasing after Usopp out of the park. Arlong got bored of just see his crew getting beaten by a bunch of inferior humans, so he lifted the concrete Luffy was stuck in and threw him into the water. As he knows those with Devil's Fruit powers can't do a thing in a body of water. Sanji plans to save him, but Zoro told him that the Mermen will just take him out while underwater if he tried to save him. Sanji and Zoro must fight their way to save Luffy. Johnny and Yasuko and the villagers watched in fear. How will Luffy escape his watery grave again?—J LeGault"], "genres": "N/A", "imdbID": "0965143", "rating": 8.2, "votes": 2409, "number_of_episodes": 1147}