{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1889973": "Charles Baker", "0065292": "Tony Beck", "1215197": "Christopher Bevins", "0157133": "Shigeru Chiba", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1711418": "Kevin Connolly", "1827148": "Marc Diraison", "9133372": "Cleo Hayden", "0377365": "Sean Hennigan", "0399321": "Chuck Huber", "1132505": "Tetsu Inada", "0421004": "Bill Jenkins", "0442953": "Yasuhiko Kawazu", "3009388": "Johnny Bruce Lewis", "0514775": "Gary Littman", "0568772": "Mike McFarland", "2692811": "Chieko Otarashi", "3009719": "Ben Phillips", "2925410": "Jerry Russell", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0999118": "Michael Sinterniklaas", "0831008": "Mark Stoddard", "0835688": "Eric Stuart", "1176685": "Shigenori Sôya", "5719834": "Laurent Vernin", "2252123": "Adam Whittington", "1075553": "Kerry Williams", "0932637": "David Wills", "0945881": "Jôji Yanami"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["To save Orange Town, Luffy faces beast-tamer Mohji and his giant lion Richie, while Nami slips off with Buggy's loot and an injured Zoro shields the townsfolk.", "Zoro came just in time to save Naomi & Luffy from Buggy's crew. After pulling off a good fight with Buggy, they learn that Buggy also ate one of the legendary Devil's Fruit. His special ability is \"Splitting Body\". Which makes it impossible for Zoro to cut him up. He got injured and had to make a retreat by caring Luffy's cage with Naomi following behind. After a blast from the \"Buggy Bomb\", Luffy & Zoro find themselves in front of a pet shop guarded by a dog. Luffy(who's still locked in the cage) couldn't figure out what the dog's problem is. The dog ate the key to the cage which made Luffy mad and violent. Right until the Mayor came by to tell them not to bother ShuShu(the dog's name) as his previous owner has given him the duty to watch over the shop. ShuShu has been through a lot of heart warming moments with his owner in the past. While Zoro went to get healed, Luffy soon became friends with ShuShu. Then out of nowhere Mohji the Beast Tammer and his pet Lion: Ritchie were hired by Buggy to eliminate them. They start by beating up ShuShu and sabotaging the pet shop. This made Luffy angry, and won't let them get away with it without a fight.—J LeGault"], "genres": "N/A", "imdbID": "0949128", "rating": 7.6, "votes": 3706, "number_of_episodes": 1147}