{"cast": {"0849028": "Mayumi Tanaka", "0386286": "Hiroaki Hirata", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0132285": "Charles C. Campbell", "1513684": "Colleen Clinkenbeard", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0416532": "Grant James", "0421004": "Bill Jenkins", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "0860443": "Marc Thompson", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy smashes through Krieg's spiked armor and poison gas, declaring guts trump weapons, while Sanji vows to seek All Blue aboard the Going Merry.", "As the NH5 cannon came striking towards the ship. Don and all of his men have their own masks. The chefs swam away from the area. While Patty and Carne grabbed Zeff into the restaurant for safety. Luffy found a gas mask and was able to avoid the smoke screen of NH5 gas. When the gas cleared he found out that the gas mask he found was meant to be Gin's. But Gin forced Sanji to wear his and has breathe gas entirely. It poisoned Gin real badly. all of Don's men couldn't believe Don would let his own battling commander suffer like that. But Don didn't give a care as he finds it sad for his own commander to betray him when he knew what the costs will be. While Patty and Carne took Gin to recover, Luffy challenges Don Krieg in a one on one fight. He knock out Don 2 times in the row. Which amazed the pirate crew, because no one's ever knock out Don before. That caused him to unleash his most powerful weapon: a giant battle spear. The entire match was explosive from Don's Giant Battle Spear which causes explosions. It appeared that Don is winning, but Luffy won't let this battle be his own grave. So who's grave will it be after it's all over?—J LeGault"], "genres": "N/A", "imdbID": "0961574", "rating": 7.6, "votes": 2062, "number_of_episodes": 1147}