{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "1235109": "Ed Blaylock", "0143801": "Chris Cason", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "1037430": "Justin Cook", "1682698": "Jerome Fifty-Seven", "2969903": "Scott Freeman", "3435683": "Cris George", "2405252": "Ray Gestaut", "2173713": "Kenny Green", "0370085": "Brad Hawkins", "0377365": "Sean Hennigan", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "3009388": "Johnny Bruce Lewis", "0552575": "Josh Martin", "0620333": "Ryûsei Nakao", "1446036": "Mark Orvik", "1503776": "Phil Parsons", "3009166": "Eric Pulido", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "1056120": "Tak Sakaguchi", "2996243": "Greg Silva", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "1631578": "Masaya Takatsuka", "0847664": "Junpei Takiguchi", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["After arriving at what seemed to be Lost Island, the Straw Hats find an old Temple with paintings that might indicate where the Lost Island really is.", "The Straw Hat Pirates and Apis are now taking Ryuuji back to Dragon's Nest, Lost Island. The marines back at Gunkan Island are busy repairing the damages they've caused. Erik informs the major, that he has a hunch on where they'll find the millennium dragon. And insists they head straight to where the Straw Head Pirates are going. Erik made sure that a report to Admiral Nelson won't go through. As he reveals to himself that he plans on getting the elixir of eternal life for him, to become an invincible mercenary. Admiral Nelson however got the report from a marine about Erik's intentions, and is aware of what he's planning to do. Luffy was hoping that Ryuuji would help them on where the island is, but he doesn't show any sign of help. Sanji prepares some food for the dragon, Luffy helped out but burned his hand and the pot landed on Ryuuji's head. Causing it to turn red. Apis and Luffy hurried to take it off his head, but Ryuuji visioned the flying fish as his species. And Apis heard Ryuuji saying that Lost Island is located to the East. So they head east now that they know where to go. Erik got word from the marines that the Going Merry has changed course. So Major ordered the whole fleet to go east as well. Luffy sat on the front end of the Going Merry wondering what Lost Island is like. Usopp and Nami took watch on top of the crow's nest, while Apis accompanied Ryuuji till they make it to the island. Luffy saw what appeared to be a smoking image. And when they got closer it was the shape of a ship, Luffy touched it which became a reflection of the Going Merry. They were all amazed that they're entering an invisible barrier. The Marine fleet was terrified to see the Going Merry disappeared. Major ordered the whole fleet to stop until they confirm about what they've seen. Again Erik finds the Major's attitude to be cowardly and insists on using a lifeboat for him to go after the Straw Hat Pirates alone, since the marines are too afraid to face danger. After going through the barrier, Nami explain it was a mirage that can be created when warm and cold water are mixed. Then they entered a storm all of a sudden. Apis tries to keep Ryuuji calm till they get through the storm. But right till the rope to the cart started to loosen up. Apis got hold of the rope, and Zoro came to help her pull the rope back. Then Luffy used his stretched arm to support the cart. They eventually got out of the storm, which is like a defense wall surrounding the island. And they finally made it to lost island, which is filled with ruins and jungles. Apis tried to wake up Ryuuji, who's still laying on the cart doing nothing. Apis has a feeling that they're not on Lost Island. But they don't think so, unless they explore the island to know so. So they proceed towards the summit of the island. On their way, the Straw Hat Pirates discovered a town in ruins. Telling them that there was once a civilization here on the island. When they finally made it to the top, it appeared to be the entrance to Dragon's Nest. Only problem is there is no door of any kind. Apis however noticed a missing claw on the drawing of the dragon, and believes that the dragon claw that Ryuuji gave her will open it. She was about to put it in, but discovers that she can't reach. So Luffy does the honor of opening the entrance. Before he touched the claw slot, the whole ground shook and they all fell down as it collapsed. They were all OK, and finds themselves inside what they believe to be is Dragon's Nest. Now they must explore the mysterious temple of the millennium dragons. Will they find Ryuuji's species? And what will they do when Erik comes to try to cause trouble?—J LeGault"], "genres": "N/A", "imdbID": "0971060", "rating": 6.5, "votes": 1325, "number_of_episodes": 1147}