{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0407454": "Shûichi Ikeda", "0230674": "Mika Doi", "0031844": "Takeshi Aono", "0065292": "Tony Beck", "0121423": "John Burgmeier", "0157133": "Shigeru Chiba", "0160049": "Luci Christian", "1799368": "Leah Clark", "1513684": "Colleen Clinkenbeard", "1711631": "Kathleen Delaney", "1827148": "Marc Diraison", "1495107": "Jin Domon", "1229511": "Darren Dunstan", "0969901": "Wayne Grayson", "0340162": "John Gremillion", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0411050": "Hideo Ishikawa", "0421004": "Bill Jenkins", "1235266": "Jerry Jewell", "0463813": "Mariko Kôda", "1515089": "Gwendolyn Lau", "0514775": "Gary Littman", "3966409": "David Moo", "2743770": "Brandon Potter", "0722676": "Monica Rial", "0754526": "Christopher Sabat", "0766493": "Masaharu Satô", "1387237": "Carrie Savage", "1724747": "Erica Schroeder", "0805550": "J. Paul Slavens", "1958922": "Tom Souhrada", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0841748": "John Swasey", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0945264": "Shinichi Yamada", "1846338": "Barry Yandell", "1659668": "Makiko Ômoto"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["With Buggy, Krieg and Arlong defeated, Luffy now has the highest bounty in East Blue.", "On board the Going Merry ship, Nami paid the Newspaper Delivery Seagull. And complained how expensive reading the daily news is. A flier came falling out of the paper, which is a wanted paper with Luffy's face on it(Special thanks to Commander Nezumi for filing the report). Luffy finds it great that he's becoming more well known. Sanji was disappointed that he's not in the picture. While Usopp feels worthy because his head is in the background. Meanwhile the government has been discussing how tough Monkey D. Luffy is. After reports of him defeating Captain \"Axe Hand\" Morgan, Buggy the Clown, Don Krieg, and Arlong. For that they issued his bounty to be worth 30,000,000. More than any current bounty on any pirate. Marines and Bountyhunters alike are aware of Luffy's reputation as a pirate. The flier was soon posted everywhere, Meri showed Kaya the news. She noticed Usopp's head in the background, and is proud that he's fulfilling his dream. While she's continuing in becoming a doctor. The Kuroneko Pirates heard the news and Captain Kuro still hasn't forgotten his last encounter with Luffy. At the Naval Base Island, we find Coby and Helmeppo sweeping the floor. Coby was excited to find out that his friend is already pursuing his dream in becoming a pirate. A marine official shows the imprisoned Morgan the wanted sign, which made him twitch with anger. At the Baratie, the wanted sign is posted in the restaurant. Zeff and the chef crew cooked and prepared the meals. Zeff remembered Sanji's dream in finding the All Blue. And knows he'll succeed as a cook. On a shaggy boat IronFist Fullbody(same marine captain from the Baratie restaurant) has been demoted to a lower rank. He's drunk and lost his reputation with the women all thanks to Sanji. A marine official came to show him the wanted flier of Luffy. And he remembered the last time seeing him on the way to Baratie. He never suspected that he'd become a big bounty head. With 30,000,000 Belli for the reward money. Ironfist plans to take him down to gain his rank back. He orders his crew to search for Luffy, only they don't know where to head off to. And speak of the devil they past by the Going Merry. He order his crew to turn around and attack their ship. Zoro however sliced their cannon ball in half. So instead of using cannons, they attack. Ironfist thinks Luffy will be an easy target, but Luffy uses his Gomu Gomu Bell attack after he punched him in the face. Then Sanji appears, and Ironfist is afraid to see Sanji again. So he and his Marines retreated. Making it a short and worthless battle. On a deserted island, MiHawk landed there and came face to face with a pirate crew, that's settling there. He tells the captain that it's someone he knew long ago. The captain was Shanks, and he feels proud that his friend Luffy is successfully becoming a pirate. And it reveals that Shanks and MiHawk are friends as they enjoy a round of drinks. At Luffy's hometown, all the locals are bragging how great it is for someone from their town to be famous. The elder however didn't find it good news for their town to be known as a birthplace of a pirate. At Makino's Bar, the Elder sat, and Makino thinks it's good that Luffy is becoming a pirate like Shanks is. Back on the Going Merry, Nami discusses on how they should enter the Grandline. They must do it by the mountain range and not by sea. Before doing that, they'll stop off at an island with a town called: LougeTown. Which is the place where Pirate King Gold Roger was born in, and executed. Which is a place Luffy would love to check out. To see where the original holder of the One Piece once lived. But little do they know is that danger is awaiting for them there.—J LeGault"], "genres": "N/A", "imdbID": "0967033", "rating": 7.7, "votes": 2084, "number_of_episodes": 1147}