{"cast": {"0849028": "Mayumi Tanaka", "0065292": "Tony Beck", "1235109": "Ed Blaylock", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "1899375": "Craig Dvorak", "1682698": "Jerome Fifty-Seven", "2969903": "Scott Freeman", "3435683": "Cris George", "2405252": "Ray Gestaut", "2173713": "Kenny Green", "1782579": "Jason Grundy", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "3009388": "Johnny Bruce Lewis", "0620017": "Kazuya Nakai", "0620333": "Ryûsei Nakao", "0645500": "Akemi Okamura", "1503776": "Phil Parsons", "3009166": "Eric Pulido", "0754526": "Christopher Sabat", "2996243": "Greg Silva", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "1631578": "Masaya Takatsuka", "0847664": "Junpei Takiguchi", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Admiral Nelson has mobilized the full extent of the 8th fleet.", "The Going Merry is avoiding the line of fire from the Marine Ships of the 8th Divison. Admiral Nelson is entertained by the whole thing, and tells a marine official to send out a flag signal telling Major that they have it under control. Erik however isn't going to let the Admiral get the Sennenryuu for himself. And asks the Major for 3 capable men and a rowboat. Luffy, Sanji, and Zoro took Usopp's idea of cutting the steal chains seriously and will use that for their plan in getting out of here. So Luffy used his Gomu Gomu Bridge, so he, Sanji, and Zoro can get on board one of the ships. They find themselves surrounded by armed marines. Which wasn't a problem for them, as they beat the hell out of all of them. Admiral Nelson couldn't believe that they're winning. While Apis was surprised on how strong her friends are. Zoro cut down the steal chain barriers, while Nami and Usopp guide the Going Merry to their soon to be exit. But the were stopped by Erik, who's on a rowboat with 3 marine officials. He heads for Ryuuji's cart, where Apis tried to protect him, but failed. He warned Usopp and Nami not to interfere, otherwise he'll use his Scythe Weasel attack for real. Luffy, Sanji, and Zoro couldn't do a thing about it, as Erik took hold of the floating cart. Admiral Nelson thanked Erik for the job he's fore filled. But Erik revealed to the Admiral that he's not planning to give the dragon to him as promised. Nelson called Erik a traitor and ordered the whole fleet to open fire on them. Apis tried to convince Erik to leave Ryuuji alone. But reasoning won't work on a guy like Erik. He plans on using the elixir for himself, while having Apis as his hostage on the way out. Apis bit Erik's hand, which made him throw Apis onto the rowboat with violence. Ryuuji saw the whole thing, and realized that his friend is in danger. And for the first time ever, he got up, scared the marines and Erik, and get rid of them with his powerful wings. Ryuuji looked down to the out cold Apis, and remembered how she would always took care of him back at Gunkan Island. He gave out a high pinch roar, which woke Apis up. She was glad to see Ryuuji standing up by himself, and he told her telepathically that he'll try to fly. And he managed to fly into the air again. While the Admiral, doesn't want his prized possession to get away, he ordered the fleet to shoot down the dragon. Zoro, Luffy, and Sanji took out most of the cannons as Ryuuji flew towards the Admiral's ship. Before getting a piece of the Admiral, Ryuuji fell into the ocean, & remained floating on the surface. Luffy stretched out his arm, and stood on Ryuuji and told him that he needs to get up again. Luffy could sense the Ryuuji has chosen to give up and will let Luffy protect apis from now. But Luffy tries to encourage the dragon not to give up. While Apis cried with tears, that Ryuuji is at a dying state. Will they be able to get rid of Admiral Nelson for good & find Lost Island?—J LeGault"], "genres": "N/A", "imdbID": "0971910", "rating": 6.9, "votes": 1290, "number_of_episodes": 1147}