{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1889973": "Charles Baker", "0065292": "Tony Beck", "0157133": "Shigeru Chiba", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "9133372": "Cleo Hayden", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "3009388": "Johnny Bruce Lewis", "0568772": "Mike McFarland", "3009719": "Ben Phillips", "3009343": "James Rivera", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "2057312": "J. Michael Tatum", "5719834": "Laurent Vernin", "3009142": "Viktor Walker", "2252123": "Adam Whittington", "1075553": "Kerry Williams", "0932637": "David Wills"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy and Zoro arrive in Orange Town, reluctantly ally with thief Nami, and clash with body-splitting clown captain Buggy, whose devastating Buggy Balls threaten to level the city along with their Grand Line dreams.", "Luffy got his head caught in the break of a giant bird who took him all the way to a seaport town. He was finally free and made a crash landing on the street. Where he encounters Naomi(a pirate hating female thief who only steals from pirates) and a group of pirates who were chasing her. Naomi pretended that Luffy was her boss, so that way the pirates can beat him up instead of her. But Luffy took them down with no problem at all. Naomi was impressed that Luffy handled the fight pretty well. So she gives him info that those pirates who were chasing her, work for Captain Buggy, a twisted clown pirate who's taken over the entire seaport town. She asks him to do her a favor which is a plan in getting Buggy's treasure & a map to the \"Grand Line\". And Luffy will need to be tied up for part of Naomi's scheme in getting close to both the map & treasure. After convincing the pirates that she wants to be part of their crew in exchange for putting the blame on her \"boss\". Buggy excepts her as one of them. But Naomi is going to be tested on her loyalty by blasting a \"Buggy Bomb\" canon at Luffy(who is imprisoned in a small cage). Naomi doesn't want to hurt Luffy, but doesn't want to miss the chance in getting what she wants. As for Luffy, he finds Naomi: a self-professed master thief that may make a great comrade of his crew.—J LeGault"], "genres": "N/A", "imdbID": "0948320", "rating": 7.4, "votes": 3817, "number_of_episodes": 1147}