{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "1732501": "Rika Komatsu", "0467558": "Jûrôta Kosugi", "0552575": "Josh Martin", "0651682": "Jonathan C. Osborne", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1516108": "Alison Viktorin", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy, Sanji, and Yosaku wrangle sea-cow Momoo toward Arlong Park while, in Cocoyasi, Arlong terrorizes Genzo until Usopp's slingshot and Zoro's jailbreak sow chaos and further test Nami's divided loyalties.", "Zoro is tied up by wrist to ankle. Arlong keeps asking him on what is his true plan. And Zoro kept telling him he's looking for a woman and called him half fish. Arlong let the insult went by and told Zoro that he hates man kind so much. He believes that mermen should be the superior species on the planet. As mermen are stronger and have the ability to live underwater as well as land. He's taken over the entire island he owns, and is powerful with the money he's inherited from the marines and villagers. Then a woman came out and criticize Arlong's monologuing on his theory about Mermen being dominate species. Zoro recognized the girl as Nami. And she's wearing a tank top instead of her usual shirt. Nami shows off a tattoo that symbolizes Arlong's flag. She reveals to him that she's been part of the merman crew from the very beginning. As she's the only human officer of the Merman crew. While enjoying their meal, a sea monster cow comes charging to Luffy, Yosuka, and Sanji's boat. Luffy punches it to protect the food from being eaten. Sanji told him not to beat up hungry animals. He offers the monstrous sea cow a piece of meat, but it was an act and gave the huge cow monster a big kick. They used the sea monster to toll their way towards Arlong Park. Meanwhile Usopp wakes up and finds himself inside a house. The woman who he saw earlier saved him from the merman. Her name is Nojiko and she has her own orange orchard. The boy who attempted to go up against the mermen is still disappointed that he didn't get to kill one. His father was killed by Arlong and since then the boy wants to get rid of them. Nojiko told the kid that he has a life ahead of him, and shouldn't risk it. He was sent home, and Usopp learned that Nojiko is Nami's foster sister and this is their home. After telling Usopp that Nami betrayed Nojiko and their foster mother. Usopp couldn't believe that Nami would of been that cruel. Zoro who also couldn't believe for himself after learning that Nami betrayed her own mother and his homeland for the sake of money. He goes into the water to pretend a suicide. The other mermen didn't bother to save him, because he's all tide up and won't have a chance to escape. Nami who's consciences is coming up dive in to save him. But beaten him up to make it look like they had no relationship. And told Arlong to take him to the prison cell. Later Nami went into the prison cell and untied him and told Zoro to escape quietly. At Cocoyashi village, Arlong came to confront Gen, who's in possession of a weapon. And Arlong doesn't let any rebellion start under his nose. Those who did so end up failing. Arlong owns 20 villages and has a goal in creating an empire out of the entire East Blue sea. So that way he can prove that humans are inferior to mermen. He was about to kill Gen, but the villager tried to convince Arlong that Gen never had a weapon at all. But Gen told them all to don't start a fight, even if it cost his life. Any uproar to them, and the whole village will end up like Gosha(the destroyed village from the previous episode). Usopp hit Arlong with a Panchiko ball. Which made Arlong angry and his mermen henchmen had to hold him down and say to forget about Usopp. After they left, Nami came to the village. But no one except Nojiko and Gen wanted to see her. See came to pay her respects to her foster mother. And has a scheme in buying back this village from Arlong. What is Nami's true plan? And will she prove to the villagers that she's still on their side?—J LeGault"], "genres": "N/A", "imdbID": "0963016", "rating": 7.7, "votes": 1946, "number_of_episodes": 1147}