{"cast": {"0849028": "Mayumi Tanaka", "0065292": "Tony Beck", "0160049": "Luci Christian", "1799368": "Leah Clark", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "2173713": "Kenny Green", "1462031": "Jason Griffith", "1782579": "Jason Grundy", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "0399321": "Chuck Huber", "0421004": "Bill Jenkins", "3238576": "Kristi Kang", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "3009388": "Johnny Bruce Lewis", "0620017": "Kazuya Nakai", "0620333": "Ryûsei Nakao", "0997645": "Robert O'Gorman", "0645500": "Akemi Okamura", "1503776": "Phil Parsons", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0840632": "Masami Suzuki", "0851311": "Naoki Tatsuta", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington", "1075553": "Kerry Williams", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["The Straw Hats depart for the Grand Line.", "Erik the Whirlwind is still around, and would of drown if the the ocean level didn't drain. He still has the idea that the Ryuukotsu has the elixir of life. Nami corrected him, that the Ryuukotsu is calcified and is merely impossible to create elixir out of. Erik however has his eyes set on the living dragons. Instead of killing them, he offer them all a deal in sharing the Ryuukotsu. Luffy wasn't interested in the offer. Which made Erik think that Luffy isn't seeing this through. Then he finally sees it's useless to convince them that getting eternal life is good. So he plans on getting it all for himself. Apis went up to stop him. Erik used his scythe weasel, which missed thanks to Usopp who helped Apis dodge it. She thanked him, and realizes that her new goal is to protect the Sennenryuu and the Dragon's Nest. Erik knows that he's being threaten, and for that he's going to kill them all for real. He gave out a scythe whirlwind, which Luffy used himself to shield Usopp and Apis. And tends to fight Erik himself. Because he made a promise to Ryuuji, and isn't planning to break it. He runs towards Erik and they both used their own Devil's Fruit attacks. Only the Scythe whirlwinds injure and slow down Luffy's punch attacks. Erik has high hopes in winning this fight, and plans to show off his most powerful Scythe attack ever. Apis and the others believe Luffy won't be able to succeed this battle. Erik sends out his Scythe Wind Chaos attack, but Luffy isn't planning to forfeit this fight. He ran and went through the wave of the attack, and grabbed the surprised Erik with his stretched hands, and gave him a Gomu Gomu Bell. Which broke his shades, and for the final climax, a Gomu Gomu Bazooka attack, sending Erik into the air. That fight was easier than anyone could imagine it to be. And finally the whole conflict over the Sennenryuu is over. The villagers came to see what has happened, and were all amazed to see living Sennenryuu dragons. They all watch the dragons grazing with peace, and know that the Dragon's Nest will sink into the ocean again until the next migration period. While the newly born Sennenryuu will grow up to be a strong millennium dragon. Bokuden offered the Straw Hat Pirates some of his Butaman on the house. But they told him that they need to get going on their quest, now that their job here is finished. They offered Apis to come along, but her place is here on Gunkan Island. She would just be interfering their journey if she did came along. Apis decided to stay on her island to learn more about her ancestor, protect the Sennenryuu, and Dragon's Nest. They departed from Gunkan Island, and said their farewells to their friend Apis. Leaving her with hopes and confidences in her new goal in protecting her own island for the years to come. On their original route, they're about to head towards the Red Line, the entrance to the Grand Line. Luffy is more than excited to be heading towards the place he's been dreaming about ever since he wanted to become a pirate. According to Nami's knowledge on the Red Line, it's a mountain with canals made to travel through it. Zoro was confused about these details as it is. And finds it impossible for a ship to climb up a current on a mountain. Usopp was having trouble with the ship's helm, so Sanji helped only to discover that the ocean's current is becoming fast. Then Nami know for sure that they do climb over the mountain without leaving the ship. She explains in plain words that Red Line is known as the Reverse Mountain. If 4 currents from all 4 oceans flow towards it, then it would go up to the top and create a flowing current straight towards the Grand Line. But they must be careful while doing this, as the currents are strong and fast. If they hit the mountain side of the Red Line, then they'll crash instantly. Sanji has heard of this before at the Baratie, that half of the pirate wannabes die trying to enter the Grand Line. And already knows that it won't be easy entering indeed. As they approach more, a storm broke, and Luffy had to close up the sails. The mountain range is so huge, you can't see the peak of the top. Then the waves started to react faster, and the current was at an abnormal pace. They started to drift to the left more, which is bad if they prevent getting the ship from crashing. Sanji and Usopp tried with all their might to turn the helm to the right. But the helm broke making the situation at a suicidal state. They were about to hit the front entrance to the Red Line, when Luffy used his Gomu Gomu Balloon move to cushion the Going Merry from crashing in. It worked and they were continuing their course at a straight pace. Now they're traveling up the mountain, like a stair way to heaven. Our heroes were all happy to be cherishing this moment. But their moment of happiness was broken by Erik, he strode away on the ship. And is more than angry, after they've been crossing his path, and making him fail in getting the Ryuukotsu. So instead he'll take Luffy's bounty of 30,000,000 Belli. And won't hesitate to kill them on the very spot. They all don't know what to do, if Erik uses his Scythe attacks here, there's no telling what he'll cut. Erik laughs and knows that this time there's no way they could win. Then Nami called out the name Ryuukotsu, Erik looked the other way as if she really meant it. And kicked Erik off the ship, and he skid on the way down the mountain toward the ocean. With that Devil's Fruit power he holds, there's no way he'll be able to survive. Making this the last time they'll have to deal with him. Sanji, Usopp, Zoro, and Luffy all feel dumb that they should of thought of that trick in the first place. As they continue to travel up the mountain, they finally see the peak of Red Line, and it was all like a dream to witness. They flew off the peak and started to slide down the current that leads to the Grand Line. They were all looking forward in fulfilling their goals in life. And the One Pice treasure is somewhere at the greatest ocean in the world. And it's all waiting for Luffy to obtain it!—J LeGault"], "genres": "N/A", "imdbID": "0973526", "rating": 7.5, "votes": 1414, "number_of_episodes": 1147}