{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "0552575": "Josh Martin", "0586003": "Vic Mignogna", "1797140": "Tamotsu Nishiwaki", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "1724747": "Erica Schroeder", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["The battle spreads into Arlong Park itself and Arlong is no longer holding back.", "After saying that Nami is his Navigator. Arlong thinks he's joking, because a navigator like Nami doesn't deserve to be with a pirate like Luffy. He claims that Nami enjoys being with him and his crew. Luffy found a pen that was dropped from a desk. It had blood stains on it. He already knows that Nami was forced to draw maps. Luffy then hold on to the blade of the Saw Sword, which prevented Arlong to move it. It broke, and Luffy tells him that there was no way Nami could of been happy while working for the mermen in the first place. He starts to wreck the room, throw out the desk, and the maps. Everyone outside were clue less on what is happening up there. Nami however had flashbacks of the day Arlong gave her, her own room to draw maps for them. And the times she was beaten up for not drawing actual maps. This made her cry with tears of joy, as Luffy's doing all this for her. Arlong got a hold of Luffy, and is tick off that he destroyed 8 years worth of work. He goes on that Nami will continue to make him maps, so that way he can take over the East blue, as well as the rest of the world. To fulfill the mermen desire in being superior species. Luffy was tired of hearing how great Arlong thinks his nationality is. So he bent his nose, and gave out a stretching high kick to finish this fight. His foot came down, and the whole place started to collapse. Everyone had to evacuate, because of the building crumbling down. Sanji, Nojiko, and Gen had to dive into the water to save themselves. After the smoke cleared, Arlong Park was in ruins. No one was sure on who won the fight. Nami was worried about Luffy. Then someone came out of the wreckage, it was Luffy. And he shout out to Nami's name that she's his friend. Nami was glad to see him alive, and gave a smile for the first time in awhile. Then everyone cheered that Arlong is finally defeated. Johnny and Yasuko cried with joy, and the villagers honored Luffy as their island's hero. Nami gave him his straw hat back, and this time they're officially friends. Then Nesumi of the 16th fleet has come to tell them all that he'll take Arlong's place on the island. And all the riches go to the Marines immediately. But Zoro grabbed him, and told him not to interrupt when people are about to celebrate. He beat Nezumi up and the marines, then Nami told him to keep out of this island, leave Arlong's riches to the villagers, and she wants the money they took from her earlier. Then she hit him hard with her Bo staff, for shooting Nojiko in the shoulder. Nojiko was satisfied that the Marine Commander got what he deserved. Nezumi however didn't took any of this abuse on him likely, and will report this to HQ. All the Cocoyashi Villagers decided to inform everyone else on the island about Arlong's defeat. Luffy, Sanji, Usopp, Zoro, and Nami all laughed on what had happened recently. The Straw Hat Pirates are now made up of 5(including Nami and Sanji). Meanwhile Nezumi sends a snail radio report on Luffy and his crew. And demands there to be a bounty placed on him. This will make Luffy infamous as the pirate he is now.—J LeGault"], "genres": "N/A", "imdbID": "0967040", "rating": 8.7, "votes": 3096, "number_of_episodes": 1147}