{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0132285": "Charles C. Campbell", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0416532": "Grant James", "0421004": "Bill Jenkins", "0552575": "Josh Martin", "3966409": "David Moo", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "0754526": "Christopher Sabat", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "1631578": "Masaya Takatsuka", "0860443": "Marc Thompson", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Krieg's siege exposes Zeff's past as legendary Red-Leg Zeff; Luffy vows to safeguard the restaurant, repaying his debt with bare-knuckle resolve instead of broken dishes.", "Chef Zeff gives Don Krieg enough food to feed a hundred men. Don however recognized Zeff as the \"Red Leg\" Pirate who was famous for killing his enemies with his right legs. Got the nickname \"Red Leg\" because his leg would be dyed in blood after killing a group of men. Unfornately he lost his leg for sometime now. And over the years Zeff has been making a living as a chef. Don finds this a riot that the lethal Reg Leg Zeff is no longer capable of fighting. Don also mentions that Zeff has a logbook on the Grand Line. Which is needed for his return to the Grand Line. He tells them all to leave the ship before his crew revives, otherwise they'll all suffer the consequences. Zeff tells his crew, that they must leave, but Patty and the others refuse to leave the boat they call their very home. And will fight till the very end. Luffy asks Gin if he really did went to the Grand Line. Gin in fact did but it was too gruesome to describe. As their fleet was wipe out within 7 days by one mysterious being. Who has the power of the Hawk's Eye. This however made Luffy more excited to go to the Grand Line, and Zoro(who knows who the being is with the Hawk's Eye) is also looking forward in going there to confront and defeat the other swordsman who's seeking in becoming the world's best. But now how will they deal with Don Krieg's crew?—J LeGault"], "genres": "N/A", "imdbID": "0961576", "rating": 7.8, "votes": 2267, "number_of_episodes": 1147}