{"cast": {"0849028": "Mayumi Tanaka", "0065292": "Tony Beck", "1115778": "Bob Carter", "3524993": "Patrice Cavalier", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "1899375": "Craig Dvorak", "1682698": "Jerome Fifty-Seven", "2969903": "Scott Freeman", "3435683": "Cris George", "2405252": "Ray Gestaut", "2173713": "Kenny Green", "1782579": "Jason Grundy", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "0421004": "Bill Jenkins", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "0620017": "Kazuya Nakai", "0620333": "Ryûsei Nakao", "0645500": "Akemi Okamura", "1503776": "Phil Parsons", "3009166": "Eric Pulido", "0754526": "Christopher Sabat", "2996243": "Greg Silva", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "0847664": "Junpei Takiguchi", "0851311": "Naoki Tatsuta", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy talks to Ryuuji in his final moments and comes to understand just what is going on. The flock of dragons returns just as Lost Island begins to re-surface.", "Luffy tells Ryuuji to not give up hope, but he remained in the water and began to sank. Admiral Nelson orders the marines to reel in the dragon with a gun spear cannon. Luffy however prevented the spear from piercing into Ryuuji. Luffy asked him on why he's doing this. Nelson just says that the only thing he wants from the dragon is eternal youth and nothing more. Luffy got angry after hearing that and threw the spear towards the Admiral's ship which missed the Admiral completely. Luffy talks some sense to Ryuuji to forget about the whole giving up thing, and think for himself instead of Apis. Then he gave out a different roar, which Luffy can tell is a good sign. Then an earthquake occurred out of no where. Apis already knows that Ryuuji is saying \"The time has come\". A call for all of his friends from around the globe to come. Nami and Usopp didn't know what it meant till they saw in the distance a flock of Sennenryuu Dragons coming. Everyone was surprised to see the dragons coming here. Even Admiral Nelson is looking forward to getting more Ryuukotsu for himself. Ryuuji fell into the ocean again, and Luffy understands what to do now. He stretched out his arm to grab one of the Dragons from above, and gave out a Gomu Gomu Axe attack to slip the Admiral Ship in half. The Admiral drowned into the ocean. The rest of the fleet flees from the sight of Luffy, which was Zoro and Sanji's cue in getting back to the Going Merry. Luffy made it back on the ship with the others, only to find Apis crying over the drown Ryuuji. She thinks she failed in bring her friend back to Dragon's Rock, but Luffy told her that his wish has been fulfilled. The Sennenryuu started to circle around Gunkan Island. Then another earthquake occurred, and the whole ocean started to drain, and Gunkan Island began to rise. Lost Island was underneath them the whole time. Nami realized what the pictures from the temple meant now. That the Sennenryuu don't refer to their eternal life, but there 1000 year migration. The flock that's circling them comes to the lost island every 1000 years. It's called Lost Island, because no one would remember it being real or not during the thousand year lifespan. After it was all over, they find themselves at Dragon's Nest. Where all the Dragons are enjoying themselves. The very place where Ryuuji wanted to go to. Apis found Ryuuji lying in the water, she ran towards him and called out his name, but no response from Ryuuji at all. The Straw Hat Pirates know that he's past on. Usopp noticed all the dragon shape rocks in the area. Sanji can tell they were once living dragons. While Nami explained that when a living thing is underwater for a 1000 year period can make the body calcified. Nami learns that Dragon's Nest is also a graveyard. But Apis denied that it is, and wanted Ryuuji to get better when he got to Dragon's Nest. Luffy express to Apis seriously that Ryuuji was a lost dragon, and has been alone during the past 1000 years. When Apis first found him, he wasn't alone any more. Having her for a friend made him feel less lonely than before. But Apis still wanted Ryuuji to stand up and become better. But that won't help at all. Luffy also told her, that Ryuuji said that dragons come to Dragon's Nest to be reborn. And one of the eggs hatched and a newly born Sennenryuu Dragon is born. The adult Sennenryuu surround it and welcomed it to the new world. The baby Sennenryuu looked at her just like Ryuuji did, this made Apis cried with tears, but it glad that her friend has been reborn into a younger dragon to live on in a different life. She went back to her friends, and now understands everything about her ancestors, why the temple was built, why Ryuuji wanted to go back here, & what kind of place dragon's Nest really is. She thanked Luffy for everything that happened thanks to him. And decided to go back to the village. The Ryuukotsu turns out to be a myth all along. And the marines were waisting their time on find an elixir that can't possibly be made. Admiral Nelson surprisingly enough has survived and plans to get all the Ryuukotsu he can get from the Sennenryuu, then he came face to face with Erik. He tried to make a deal in splitting the elixir, but Erik didn't want to hear another word out of the Admiral and killed him with his Scythe Weasel Attack. Just when our heroes were about to go on celebrating, they find Erik, who's looking forward in killing them all.—J LeGault"], "genres": "N/A", "imdbID": "0971911", "rating": 7.0, "votes": 1285, "number_of_episodes": 1147}