{"cast": {"0849028": "Mayumi Tanaka", "1889973": "Charles Baker", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "1682698": "Jerome Fifty-Seven", "1708798": "Caitlin Glass", "1782579": "Jason Grundy", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "0620017": "Kazuya Nakai", "0623214": "Gorô Naya", "0645500": "Akemi Okamura", "1503776": "Phil Parsons", "0666547": "Chris Patton", "2925410": "Jerry Russell", "0754526": "Christopher Sabat", "0833185": "Sonny Strait", "0847416": "Yasuhiro Takato", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0913842": "Misa Watanabe", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["While guiding them out of the giant whale, Laboon, its caretaker, Crocus, tells the whale's story to the Straw Hats.", "Crocus told the Straw Hat Pirates the reason why Laboon is ramming against the Red Line. Long ago, when Crocus was looking after the lighthouses, a group of pirates entered the Grand Line, from Reverse Mountain. A little island whale(a young Laboon) had followed them all the way from the West Blue. Normally Island Whales travel with their own species, but not this one. Laboon made friends with the pirates he followed. After a few months, they repaired their ship and got acquainted with Crocus. The next day, the pirates left, and the captain told Crocus to look after Laboon as they depart to travel the world in the Grand Line. The captain promised Laboon, that they'll come back within 2 to 3 years. The Grand Line is too dangerous for a little whale. So it be safe to remain here near Reverse Island. Those pirates left Laboon to the care of Crocus. 50 years have past since then. And Laboon never saw his friends again. Everyone was surprised to hear that, and now know why Laboon waits in front of the entrance to the Grand Line. Hoping one day that they'll come back. The Straw Hat Pirates guided by Crocus on his portable island travel through the water pipe system in Laboon. It was amazing that the whale is still alive from all of this. Crocus mentioned that he's Laboon's doctor, ran a clinic once, and an ex-ship doctor years ago. After hearing that Luffy asked if Crocus would become the Going Merry's doctor. Crocus didn't took his offer too seriously, because he wouldn't have the energy to keep up with them on their journey. He got up to the main crank for the exit, opened it up and they were finally outside. Miss Wednesday and Mr. 9 woke up from their unconsciousness and crypt away. Usopp was upset that Laboon has been waiting for a long time for his friends to come. Sanji and the others know that those pirates are already dead. Usopp was out raged on how cruel they're talking about Laboon. Crocus told Usopp that the truth can be crueler than imagined. That the pirates weren't Laboon's friend from the start and just made up that coming back promise to abandon it. Usopp finds that to be awful. Nami presumes that those pirates escaped the Grand Line by entering the Calm Belt in order to avoid running into Laboon again. Crocus mentions that even if they're alive, those pirates would never come back. Specially with the unexpected changes in weather and wind currents. Nami asked if Crocus told Laboon the truth. He did, but Laboon refused that it were truth. That was when Laboon start ramming himself into the Reverse Mountain. As he still believes his friend will return from that entrance. Laboon attempts to break through the mountain to find his friends and return to the West Blue. But there is no way he can go there again. Sanji suggested that Crocus shouldn't continue to help a poor stated whale, if he can't promise him that those pirates will return. Making it not his responsibility anymore. But Crocus pointed out the scars on Laboon, and if he continues to ram into the mountain, he'll die. Luffy ran up the whale again, with the Going Merry's mast. Luffy pierced the already bleeding wound on the top. The others got made at Luffy for damaging the ship more. Then Laboon went mad and rammed Luffy into the port. Then they began to fight each, one at a time. No one knew why he's doing this. Laboon came charging till Luffy told him that the fight is a draw. And told him that they're both strong & will finish their fight someday. And will make him a new promise to keep, to determine which one of them is stronger. When Luffy is done traveling the Grand Line, he'll come back to finish the fight. Everyone was pleased that Luffy made Laboon more satisfied than before. Luffy patched up the wounds and painted a sloppy doodle of their Straw Hat Jolly Roger. Which is Laboon and Luffy's fight promise, until Luffy gets back, Laboon won't ram into the walls otherwise it'll rub off. Laboon agreed, and everything was at peace again near the Reverse Mountain. Miss Wednesday and Mr. 9 try to escape, but couldn't because Mr. 9 dropped the Log Pose(which is their key in returning to their island). Nami looks at the map to determine what the crew's next destination is at the Grand Line. Sanji got the Blue fin Elephant tuna(that he won at the LogueTown Cook Contest) from the freezer to cook for their meal. Usopp was stuck repairing the mast and damages on the Going Merry. Zoro was snoozing like he normally does. They all hear Nami scream, who discovered that the compass isn't working properly. And she was right as the needle kept spinning in all directions. Crocus explained to them that they have no idea on what their getting into here at the Grand Line. And finds it stupid for them to risk their own lives. The Grand Line's ocean has no common logic to it. The compass is useless because of the magnetic field in which the ocean is located. And the winds and currents are unstable. Not even the best navigator can witness these circumstances. The only way to navigate the Grand Line is with a Log Pose. Unlike a regular compass, it memorizes the magnetic field. Luffy asked if the device he found on the Going Merry was one, and it is. Nami observes it and notices that there aren't any markings on it. According to Crocus, the islands here obey the rules created by the magnetic fields. In order to travel from island to island, the log pose must re adapt to the magnetism at each island. Which will point you to the right course. There's no way to determine your exact position on this ocean. You are depended on the magnetic field memorized by the log pose. There are 7 magnetic fields emanating from Reverse Mountain Regardless on what island to choose from the route will join the others into one final route. The named of the island at the end of the route is \"Raftel\". The final island of the Grand Line. Only one person known in history has ever confirm it's existence. And that was Pirate King Gold Rodger. After a long lecture on the Grand Line, our friends know for sure that the One Piece treasure is there on that island. But Crocus note that it's all legend, and no one has ever reached to that island alive. But Luffy is looking forward to seeing what the danger is for himself. Laboon brought up ashore the nearly drowned Mr. 9 and Miss Wednesday. They both have a request to go back to Whiskey Peak. Which is their home, and they have no way in returning without the guide of a log pose. But the Straw Hat Pirates aren't too sure in helping the weird duo out. Not after they tried to kill Laboon. Usopp asked who they are really. They didn't want to reveal what their roles are and just said that their organization does underhand work. Secrecy is their motto. Bow down on their knees for help and will repay the favor somehow. Crocus advised them to not help them at all. Luffy however agreed to help them return to Whiskey Peak. Introduced them as Monkey D. Luffy, the next pirate king. Mr. 9 and Miss Wednesday don't think he was talking serious about becoming the next pirate king. The next day, Nami re adapt the log pose, which is pointing to their next destination to Whiskey Peak. They depart and said farewell to Crocus and Laboon. Leaving Laboon with a new promise that won't be broken by Luffy. Now to see what this Whiskey Peak is, and who does Mr. 9 and Miss Wednesday work for?—J LeGault"], "genres": "N/A", "imdbID": "0976906", "rating": 7.5, "votes": 1538, "number_of_episodes": 1147}