{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0377365": "Sean Hennigan", "0383022": "Noriko Hidaka", "0421004": "Bill Jenkins", "1732501": "Rika Komatsu", "0467558": "Jûrôta Kosugi", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1516108": "Alison Viktorin", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Arlong's reign of terror is over, and no one has anything on their mind except to party. As the crew celebrates, Nami reflects on her hometown and decides to officially join the Straw Hat Pirates.", "Arlong is gone for good, the whole merman crew has been eliminated. After 8 years of being slaves for the mermen. Cocoyashi Village, and the whole island is free. And for that they're going to celebrate like never before. Nami visited her Bellemere's grave, feeling happier than before. Nojiko and Gen found her and told her that her friends are all waiting for her. Nami wondered if Bellemere would of let her become a pirate. Gen highly doubt that she would let her daughter become one. But Nojiko thinks she wouldn't mind. Gen laughed and remembered how reckless Bellemere was. And accepted the thought that Nami does take a resemblance to her foster mother's aggressiveness. Drinks, Food, Dancing, and Music was performed. Nojiko found Chabo, who heard what happened, and wanted to know who defeated Arlong. Nojiko pointed out Luffy, who is scarfing down food. Chabo, didn't believe that Arlong was defeated by someone like Luffy. Neither did Nojiko, at first, but the whole town owes him for what he's done. Chabo has drop the whole avenging his father's death, and finally admits that his life is more valuable than risking it. Nojiko was glad that Chabo finally accepted that. Meanwhile Johnny & Yosuka recover at the village hospital. While the doctor takes care of Zoro's wounds. And tells him not to be so harsh with injuries like these. Luufy came to check on how Zoro is doing. The doctor asked if Luffy's crew has a doctor. They don't, but Luffy will keep that in mind, as well as finding a musician for his crew. The party lasted for 3 days straight, Usopp makes up songs about himself, Sanji finds some girls, and Luffy eats like never before. Nami got the doctor to remove her Arlong tattoo at the hospital. He told her that it'll leave a scar, but she doesn't mind that at all. She remembered the day she got it, and hate having it. Which is why her foster sister got some tattoos as well, to make her feel better. Nami then asks the doctor for a request in having a different tattoo to replace the one she had for 8 years. Gen, the town sheriff paid his respects to Bellemere's grave. Luffy found him, and learn that it's Nami's foster mother's grave. Gen told Luffy that he knows that Nami will be joining his crew. But Luffy must swore to him, that he'll never hurt Nami at all. Luffy promised and continued to eat the meat he was carrying around. While everyone was worn out and fast to sleep. Nami visits her home for one last time. She leaves a big bag of fortune for the villagers to use to rebuild the island. Then she thinks back to the good times she had with Bellemere. It felt as if she was in the same room with her foster mother. Nami told Bellemere that she'll be going with some great friends of hers. And from now on you'll be able to make maps for herself instead of by force. The next day, the Straw Hat Pirates gathered up supplies on their Going Merry Ship. Johnny and Yosaku told Zoro that they'll continue their jobs as Pirate hunters. They hope to meet him again someday. Sanji wondered where Nami is, Zoro told him that she never wanted to become a pirate in the first place. For that Sanji blamed Zoro for doubting her, and won't be part of this crew if she's not coming. After all the villagers wondered where she could be. Nami appears with a serious look on her face. She tells them to depart. Luffy did as she told them to. And she starts to run. Sanji wasn't sure what Nami is thinking, but Luffy says it's her choice. Everyone including Nojiko, Gen, and the Doctor think she's gone insane for trying to get on the ship while it departs from the dock. Nami however continued to run, made a leap from the dock, and made it on the ship. Then she loosen her shirt and wallets started to fall to the floor. Then they all realized she pick pocketed everyone she past by. They called her a thief, and said farewell to her. She waved to them goodbye as well. Usopp and Zoro were shocked that she accomplished something like that. While Sanji and Luffy were impressed by her thievery skills. Gen said his farewell too, and knows that Nami will be happy with the crew she's join. Nojiko noticed that Gen doesn't have his pinwheel on his hat anymore. He told her that he doesn't need it any more. Since it was used to make Nami happy when she was young. The doctor revealed to Gen that the tattoo Nami requested is a pin wheel shape design. That made Gen feel proud of himself for making Nami feel good about herself. Now that the whole crew is united once more, they continue their journey to the Grand Line. And find the One Piece treasure!—J LeGault"], "genres": "N/A", "imdbID": "0967039", "rating": 7.9, "votes": 2145, "number_of_episodes": 1147}