{"cast": {"0849028": "Mayumi Tanaka", "0386286": "Hiroaki Hirata", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0132285": "Charles C. Campbell", "1513684": "Colleen Clinkenbeard", "0337751": "Dan Green", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0416532": "Grant James", "0421004": "Bill Jenkins", "2703026": "Hiroyuki Kawamoto", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "2057312": "J. Michael Tatum", "0860443": "Marc Thompson", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["Obeying Krieg, Gin brutalizes Sanji yet can't finish the man who once fed him, proving kindness infectious and enraging his war-lord captain.", "Luffy used his Gomu Gomu Axe attack to destroy the battle platform of the Baratie. Everyone including Sanji think he's lost it. But Luffy states that if they were to destroy the ship, then Don Krieg's crew won't have a ship to go after. Sanji finds the idea to be stupid. While Luffy finds dying to be stupid too. Pearl was about to take both of them out, until Gin let go of Zeff and destroyed Pearl's iron wall body armor with his swirling maces. Pearl was no longer able to fight. Gin then said he'll fight Sanji instead. It's revealed that Gin is Don's Battling Commander who obtain the nickname Devil man for showing no mercy to the enemy. Sanji and Gin went through a violent fight. But when Gin had the opportunity to finish Sanji, he had the change of thought and didn't. Don Krieg yells at Gin for betraying him and for showing mercy. Gin tells Don that Sanji helped him from starving to death. And doesn't care if he betrays his own captain just for being sympathetic. And for that, Don brings out his Poison Gas MH5 Cannon. Those who breathe it will parish. Will our friends be able to avoid being killed by gas?—J LeGault"], "genres": "N/A", "imdbID": "0961577", "rating": 7.5, "votes": 2085, "number_of_episodes": 1147}