{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "1039515": "Duncan Brannan", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1827148": "Marc Diraison", "1495107": "Jin Domon", "2542294": "Matthew Elkins", "1462031": "Jason Griffith", "0368060": "Kôichi Hashimoto", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "1235266": "Jerry Jewell", "0463828": "Kevin Kolack", "0463813": "Mariko Kôda", "0473873": "Cherami Leigh", "0507793": "Ted Lewis", "0514775": "Gary Littman", "0552575": "Josh Martin", "0562641": "Julie Mayfield", "12428251": "Morteza Moradifard", "0855377": "Haruhi Nanao", "2874420": "Kate Oxley", "3009719": "Ben Phillips", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "1387237": "Carrie Savage", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "5719834": "Laurent Vernin", "0931060": "Kent Williams", "1075553": "Kerry Williams", "0943849": "Oliver Wyman", "1133514": "Noriko Yoshitake", "1659668": "Makiko Ômoto"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Usopp discovers Kaya's mild-mannered butler is the infamous Captain Kuro, who plans to murder her at dawn; ignored by the villagers, he rushes to enlist Luffy, Zoro, and Nami to ambush the incoming Black Cat Pirates.", "Klahadore a.k.a Captain Kuro who was suppose to be executed by the Marines 3 years ago. Is planning to use Jango to hypnotize Kaya in signing a will for all of her fortune to go straight to Kuro himself. And make her death look like an accident. As his pirate crew is plotting to destroy the entire village. Usopp heard every word that Kuro said. But Kuro knows no one will believe after all that lying he's done in the past. The scared Usopp dashed to town to warn the villagers. But as Kuro predicted, none of them believed him, because they all think it's only another lie. Usopp tries all he can to convince him that he serious this time. But that only made the locals more angry and chased him away. So Usopp went to tell Kaya the whole thing. As he thinks that she will believe him. But Kaya thinks it's just another lie that Usopp would make up. And still believes that Klahadore is a good person. He tries to take her away from her manor to protect her. But Kaya refused and smacked Usopp, as she's lost faith in him completely. Even if it was the truth. Even his kid trio pirate crew lost faith in him. He found Luffy(who he thought was dead from falling off the cliff earlier), Zoro, and Nami and told them all what he heard. They believe him and will help him fight off the pirates. But will they succeed and redeem Usopp's reputation?—J LeGault"], "genres": "N/A", "imdbID": "0957058", "rating": 7.2, "votes": 2604, "number_of_episodes": 1147}