{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0230674": "Mika Doi", "0319980": "Banjô Ginga", "0619122": "Kôichi Nagano", "0882650": "Emi Uwagawa", "2685930": "Yukari Hikida", "0870325": "Machiko Toyoshima", "1013182": "Akira Murakami", "1625828": "Munehiro Tokita", "1728037": "Yasuhiko Tokuyama", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0969153": "Gregory Abbey", "1684869": "Troy Baker", "0065292": "Tony Beck", "3009415": "Anthony Brownrigg", "3009201": "James Cave", "0160049": "Luci Christian", "1799368": "Leah Clark", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1711631": "Kathleen Delaney", "1827148": "Marc Diraison", "2921248": "Greg Dulcie", "1708767": "Priscilla Everett", "9133372": "Cleo Hayden", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "0651184": "Lisa Ortiz", "0654361": "Frederick B. Owens", "2874420": "Kate Oxley", "1574776": "Orion Pitts", "3009166": "Eric Pulido", "0710330": "Andrew Rannells", "0722676": "Monica Rial", "0736994": "Kayzie Rogers", "0754526": "Christopher Sabat", "2747283": "Samual Vincent", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "5719834": "Laurent Vernin", "0915818": "Brett Weaver", "1075553": "Kerry Williams", "0600421": "J. David Brimmer"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["In Shells Town, Luffy frees feared bounty hunter Roronoa Zoro from corrupt Marine Captain Morgan's clutches, gaining a swordsman crewmate and drawing Navy fire.", "After defeating Lady Alvida, Luffy and Koby escaped on a lifeboat. As Luffy's been telling Koby that his goal is to search for the \"One Piece\" treasure in order to become the Pirate King. And he'll be needing a big crew if he wants his dream to become a reality. Koby also has a dream, and that's becoming a marine so he could capture ruthless pirates like Lady Alvida. Luffy understands Koby's dream pretty well, and will make sure that he'll become a marine. So they head for Naval Base Island, which is where the infamous pirate hunter: Roronoa Zoro is being held at. Luffy knows that Zoro will be perfect for his first mate of his crew. But Koby thinks that Luffy isn't thinking right, as Zoro is famous for hunting down and killing pirates with his sword abilities. They went to the Marine Base where Zoro is being held at. Luffy offers him a chance to escape, but Zoro isn't interested as he only has 10 more days till they release him from his 1 month sentence. Later Luffy and Koby found out from the marine captain's son: Helmeppo, that Zoro will be executed tomorrow. Luffy got mad that he punched Helmeppo in the face, which made him angry and is going to report this back to his father. Luffy and Koby were met by a little girl(who offered Zorro 2 rice cakes, but Helmeppo ate, spitted it out, and stomp on the other one). The only reason that Zoro was imprisoned is because he punched Helmeppo in the face and was put under dubious charges. This proves that Zoro is indeed innocent. So they head back to the Marine Base to free Zoro and deal with Helmeppo's father: Captain Morgan.—J LeGault"], "genres": "N/A", "imdbID": "0947176", "rating": 8.4, "votes": 22171, "number_of_episodes": 1147}