{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1684869": "Troy Baker", "0065292": "Tony Beck", "1384240": "Kate Bristol", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1827148": "Marc Diraison", "2173713": "Kenny Green", "1462031": "Jason Griffith", "0368060": "Kôichi Hashimoto", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "2569958": "Jeff Johnson", "0463828": "Kevin Kolack", "0463813": "Mariko Kôda", "1515089": "Gwendolyn Lau", "0473873": "Cherami Leigh", "0507793": "Ted Lewis", "0514775": "Gary Littman", "0552575": "Josh Martin", "12428251": "Morteza Moradifard", "0855377": "Haruhi Nanao", "2874420": "Kate Oxley", "0736994": "Kayzie Rogers", "0754526": "Christopher Sabat", "1387237": "Carrie Savage", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "2057312": "J. Michael Tatum", "5719834": "Laurent Vernin", "0931060": "Kent Williams", "1075553": "Kerry Williams", "0943849": "Oliver Wyman", "0946295": "Kazuki Yao", "1133514": "Noriko Yoshitake", "1659668": "Makiko Ômoto"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Usopp's hypnotist guardian Jango conspires with ex-butler Kuro to kill Kaya; his trance turns the Straw Hats into accidental strongmen until Luffy snaps free to foil the plot.", "Luffy, Zoro, Naomi, and the 3 kids find Usopp telling his random stories to Kaya the rich girl. Ever since her father past away she's been very depressed and rarely goes outside. So Usopp cheers her up with his lying. After Luffy and the others dropped in, they hope for Kaya to help them out on their journey, but Kaya's well mattered butler: Klahadore denies their favor. And tells Usopp that he's trespassing and despises a liar. Klahadore forbids Kaya to be chatting with a poor liar like Usopp. And starts to insult his father Yasopp by describing him to be a low class pirate with no pride. This made Usopp angry and punched Klahadore in the face. Usopp states that he's proud to be a son of a pirate and left. Luffy and the rest were ordered to leave as well. Kaya was upset at how Klahadore treated them. But Klahadore simply told her that it's for her own good in protecting her. As it's been 3 years since he was found poor and starved and was being treated with hospitality thanks to Kaya's late father. Klahadore is honored to be where he is today. Meanwhile an unusual looking guy is moon walking through the village and was noticed by Naomi, Zoro, and the 3 kids. The weirdo's name is Jango the hypnotist. He gave the 3 kids a sample of his trick. But he always ends up being hypnotized with the victims. Luffy finds Usopp who's still upset so he gives him company only when they found Klahadore talking with Jango who are both plotting to assassinate Kaya and inherit her fortune. As Klahadore reveals that he's actually Captain Kuro.—J LeGault"], "genres": "N/A", "imdbID": "0952147", "rating": 7.3, "votes": 2719, "number_of_episodes": 1147}