{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0039603": "Tomohisa Asô", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0254602": "R. Bruce Elliott", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0383022": "Noriko Hidaka", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0605451": "Toshiyuki Morikawa", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0853301": "Veronica Taylor", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki", "0949825": "Linda Young"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Flashbacks show ex-Marine Bellemere rescuing war orphans Nami and Nojiko and raising them in Cocoyasi until Arlong's brutal takeover forces villagers to pay tribute, setting the stage for Nami's desperate bargain.", "3 of Arlong's strongest mermen investigated the damaged boat that crashed in the plains. They have a hunch that the one who sailed the boat is somewhere on the island. They spot Luffy, and already know that he's not from around here. The mermen stand in the middle of the road, but Luffy passed them without saying anything. Hatchi asked him who he is and what his business is here on the island. Luffy says his name and just says he's going on a walk. And nothing more after that. While Zoro is snoozing Sanji and Usopp listen to Nojiko's story on Nami's past. It began 8 years ago, before Arlong took over the island. Nami and Nojiko were both foster sisters who lived with Bellemere, a tough female orange farmer. Nami had the interest and skills of a navigator at an early age. She would draw maps, including one of the island they live on. All 3 of them are have no relationship, but they lived happily together. Despite Bellemere only making small fortunes with every orange harvest. All 3 of them couldn't afford much. Nami was upset that she couldn't get what she wants. And wished that she lived in a rich family, having the idea that her and Nojiko are in the way for Bellemere. Bellemere however didn't like the way Nami talked to her, and Nami ran away feeling depressed(while it was raining). Bellemere told Nojiko to find Nami, as their still family no matter what. Nami was found by Gen and taken to the police outlet to keep her dry from the rain. Gen finds out why Nami is so depressed, and told her that Bellemere really cared for her. And revealed to her that her foster mother was part of the Marines a few years back. After a brutal battle between the marines and the pirates. She found 2 orphans who lost their parents during the battle. Those two were Nami and Nojiko, and they gave Bellemere a new leap in her life. And decided to take care of them like a mother would. after learning about that Nami felt bad for yelling at her foster mother for not having the same blood line. Nojiko found Nami and told her that Bellemere is worried about her. So the 2 of them head home. Only until the Arlong Pirates invaded the island and gathered up the villagers of Cocoyashi Village. Arlong himself has announced that from today every person on the island must pay him money for their souls, one month from now. Those who are unable to pay, will die. When they were finished collecting the fees, one of the mermen noticed smoke coming from outside the village. That smoke is coming from Bellemere's home who's unaware of what is happening. Arlong and his crew head that way to collect more money. Nojiko and Nami watched the whole thing and headed back home to warn Bellemre. How will this sad tale end?—J LeGault"], "genres": "N/A", "imdbID": "0965145", "rating": 8.1, "votes": 2359, "number_of_episodes": 1147}