{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "1503539": "Rebecca Honig", "0421004": "Bill Jenkins", "1732501": "Rika Komatsu", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0586003": "Vic Mignogna", "0605451": "Toshiyuki Morikawa", "1797140": "Tamotsu Nishiwaki", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1516108": "Alison Viktorin", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy's crew races to Arlong Park after Nami steals the Going Merry, but fish-man tyrant Arlong seizes Zoro and shocks everyone by revealing that Nami is one of his officers.", "On their voyage to finding Nami. Sanji and Luffy learn from Yosaku that she's heading towards Arlong Park. Sanji couldn't wait to see Nami again, as he had a crush on her when he first saw her at the restaurant. Johnny and him presume she's planning to go after Arlong because he has a bounty on his head. But taking down Arlong is not a one man job. Arlong is a merman who leads his merman only pirate crew. Mermen are 10 times stronger than average human beings. His crew has turn 12 villages upside down. Plus Arlong is one of the 7 most deadly pirates of the 3 forces from the Grand Line. Hihawk is one of those 7. And their protected by the government and the Marines. This won't be an easy task to attempt. Luffy wasn't taking any of this serious and kept thinking that mermen are fish with human limbs. Sanji prepares them some lunch while they travel to their destination. Meanwhile Johnny, Zoro, and Usopp are outside of the Arlong Park territory. They both believe she's somewhere inside there. Zoro(who's covered with bandages because of the fight he had with Mihawk) suggests they go in and do the job fast. As he wants to be the one to fulfill Luffy's request in saving Nami. But Johnny and Usopp find that idea to be suicidal. So they tied him up and decided to land at the town next to the park. Usopp then brags that he'll be the hero in saving Nami. As they drift to the left of the shore line, Usopp spotted the Going Merry. But there are 3 mermen at the docks, which made Usopp & Johnny panic. They went by quietly went pass them, but the merman trio noticed the boat and 2 of them dive and swam to see who's running it. Usopp and Johnny swam to shore and left Zoro to the 2 mermen, who are going to take him to be questioned by Arlong. Usopp and Johnny find the nearby town to be destroyed and deserted. The other merman finds Usopp and chases after him. While Johnny hides behind one the buildings. Usopp runs into a kid who mistaken him for a Merman because of his long nose. A woman who's accompanied by the boy tells Usopp not to mess with a merman. The merman comes charging at them, so Usopp uses his slingshot to fight back. But the woman knocked him out, hid him, and lied to the merman that he went the other direction. Who is the mysterious boy and woman who hate the Mermen? What will become of Zoro? Will Luffy, Sanji, and Yosuka make it in time? And what is Nami's connection with Arlong?—J LeGault"], "genres": "N/A", "imdbID": "0963015", "rating": 7.6, "votes": 1984, "number_of_episodes": 1147}