{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "1235109": "Ed Blaylock", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1682698": "Jerome Fifty-Seven", "3435683": "Cris George", "2405252": "Ray Gestaut", "2173713": "Kenny Green", "0370085": "Brad Hawkins", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "0552575": "Josh Martin", "0620333": "Ryûsei Nakao", "1503776": "Phil Parsons", "3009166": "Eric Pulido", "0722676": "Monica Rial", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "2996243": "Greg Silva", "0831008": "Mark Stoddard", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "1631578": "Masaya Takatsuka", "0847664": "Junpei Takiguchi", "0851311": "Naoki Tatsuta", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["The Calm Belt is revealed to have no winds or currents as well as being the home of many giant sea kings.", "The Staw Hat Pirates find themselves stranded in the Calm Belt. A place where ships never come out alive. They all don't find it to be dangerous, but Nami had to explain to them on why it is an issue. The Calm Belt is a current of calm water that guards the entrance to the Grand Line. Wind and waves never occur in the Calm Belt, which makes the sails on a ship useless. Not only that but it's also home to many sea beasts. Then a huge sea monster comes out from below lifting the Going Merry. As well as a whole bunch of sea beasts came out of the water. Apis fell out of the ship and was about to get eaten by a giant frog. Luffy had to use his stretching arm to save her. Apis learned that Luffy ate a Devil's Fruit. She spotted the nostrils of the sea monster that's under the Going Merry. And told Luffy to take her down there. No one knew what she was up to till, she pulled out a nose hair, which made the sea monster give out a big sneeze. Then the Going Merry flew into the air and made it out of the Calm Belt. Now they continue their journey to Gunkan Island. It was foggy as they proceeded to their destination. Apis wasn't sure if they're anywhere near her island. Right until Luffy saw what appeared to be a battleship, but was actually Gunkan Island. As Apis mentioned earlier, the island is the shape of a battle ship. A local spotted the Going Merry coming to shore, and alarmed the island that pirates are coming. They all got out their spears, thinking the Straw Hat Pirates are here to raid them. But Apis came off the ship first and was glad to be back home. Everyone was surprised to see her back safe and sound. But they were confused on why a group of pirates would help save a girl like Apis. Apis had to explain to them that the Straw Hat Pirates are good souls. Then an elderly man came who Apis was happy to see it. It was her grandfather, Bokuden. He thanked Luffy and the others for saving his granddaughter, and for the thanks he'll treat them to Butaman pork filled buns. A marine ship, spotted the Going Merry on the of Gunkan Island. Admiral Nelson, got the news and told Erik to recapture Apis there. Bokuden finished preparing the Butaman and set it off to cook. Usopp and Luffy were looking forward in having some, only to find out that it takes 4-5 hours to cook. While they're waiting they asked Bokuden why the Marines kidnapped Apis. Bokuden didn't know the answer to himself, but explained that their island was a decedent to a lost island from a millennium ago. It was home to the Sennenryuu Millennium Dragons. Who have the Ryuukotsu, the elixir of eternal life. The marines believe in this legend to obtain a way in getting eternal youth. Then Bokuden went on about the ancestry of the island. Apis already knows how long these stories go so she sneaked out. Luffy was getting hungry and couldn't take any of more of this story as it is. So he snug out to go eat some Butaman. But he past out before finding Apis with a bag of all the Butaman. She left Luffy a piece and dragged the bag on her way out. The story on the generations of Gunkan were still going. So Nami snug out as well to see about getting a Butaman. She found Luffy and think-ed he ate it all. But discovered a trail made by the bag. They followed it to the mountain side of the island. And found a cave which Apis entered. She was talking to someone, but didn't know who or what till they approached to her. Luffy and Nami discovered that Apis's friend is a live dragon, Ryuuji. Luffy found it cool to be looking at a real dragon. But then noticed that Ryuuji has a sad look in it's eye. And understands that it misses being with it's kind. Apis was surprised that Luffy was able to guess that correctly. And revealed to them that she ate the Whispering Fruit, which gives her the ability to hear Animals. Which explained to Nami on why Apis knew that gust of wind was coming, because of the seagulls. One day Apis heard Ryuuji's voice, and found it in this cave their standing in. And since then she's been keeping it a secret from the locals. And would do anything to get it back home to Dragon's Nest, Lost Island. The island said to be gone from the face of the map. Ryuuji knows that his island will rise again, but doesn't know when. Apis would like to help find the island but couldn't help there. She asked the Marines about the possible location of the island. But they noticed the dragon claw she had in her possession and presumed that she knows where the island is, and kidnapped her. And no matter what, she'll find a way to return Ryuuji to it's home island. Luffy & Nami agreed to help Apis out, even though they don't even know where the island is either. Meanwhile Erik and the Marines are heading towards the island, still presuming that Apis knows where Lost Island is. And he looks forward to capturing her, in his own way.—J LeGault"], "genres": "N/A", "imdbID": "0971061", "rating": 6.7, "votes": 1373, "number_of_episodes": 1147}