{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "1418843": "Bill Flynn", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "1132505": "Tetsu Inada", "0421004": "Bill Jenkins", "1732501": "Rika Komatsu", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0586003": "Vic Mignogna", "0605451": "Toshiyuki Morikawa", "1797140": "Tamotsu Nishiwaki", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "1516108": "Alison Viktorin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki", "1846338": "Barry Yandell"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["Arlong's officers sink a Marine rescue ship as Usopp reunites with the crew and Nojiko starts unveiling Nami's painful past; Luffy plants himself in the road, vowing not to leave without his navigator.", "Luffy, Sanji, and Yosaku made a crash landing in the plains of the island. Zoro(who got ran over by their boat) tells them that he needs to go rescue Usopp from the mermen. Only when Johnny came by all depressed and told them that Usopp has been killed by Nami. Either one of them, including Luffy couldn't believe it. Luffy declined that it's a lie, but Johnny wished that was true. Then Nami comes by and just told them all solemnly that the only reason she was with Luffy was for the money and nothing more. Sanji admired the way Nami acted serious, but Zoro corrects him that he has no idea what is going on. Nami told them to leave the island and don't get involved with the mermen in anyway. Because they'll get killed by the mermen if they were to go up against them. Luffy, however laid on the road and said he's not going anywhere. Nami got mad and told them all that she won't care what the mermen will do to them. And ran off without any other word. Johnny & Yosaku took her advice wisely and told Zoro that they've done their job in bring the \"Starw Hat Pirates\" to this island. And won't get killed by a crew of mermen. In the distance, the 77th Marine fleet lead by General Purin Purin are planning to rescue the Cocoyashi villagers from Arlong's rule. But Arlong didn't allow that to happen and sent out 3 of his strongest mermen to destroy the marine ship. After it was destroyed Nojiko, Gen, and the other locals find it impossible to escape the wrath of Arlong. Arlong plans to use the map he got from Nami to locate a possible treasure on the island. As Nami and his deal was back 8 years ago, that she'd be their navigator on maps and locations. Meanwhile Nojiko finds Nami breaking things in their childhood home. Nojiko told her that she met her friends. And found out that she enjoyed being with them. Becuase Nojiko knows the her foster sister hasn't been happy in all these years. Nami expresses that when she was with Luffy, she completely forgot about what her promise was. And after the adventures she had with him, she now doesn't know what to do. Sanji and Zoro argue about whether it's real necessary to stay on the island for nothing. Then out in the distance a Usopp was running. And he's more alive then they imagined. He told them that Nami saved his life from being killed by Arlong. And she had to pierce her hand to make it look like she stabbed him. And believes that there's a reason why she joined the mermen crew if she's not really that cruel. Nojiko found them and is about to tell them the story on why Nami did it in the first place. Luffy however won't bother to learn about Nami's past and Zoro went for a nap, as he doesn't think it'll change their minds in leaving the island. But Sanji and Usopp remained interested in the story on why Nami betrayed her family and home for Mermen.—J LeGault"], "genres": "N/A", "imdbID": "0964362", "rating": 7.4, "votes": 2051, "number_of_episodes": 1147}