{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0146097": "James Carter Cathcart", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1827148": "Marc Diraison", "0319980": "Banjô Ginga", "2173713": "Kenny Green", "1462031": "Jason Griffith", "1920556": "Todd Haberkorn", "0368060": "Kôichi Hashimoto", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "0463828": "Kevin Kolack", "0463813": "Mariko Kôda", "0473873": "Cherami Leigh", "0514775": "Gary Littman", "0855377": "Haruhi Nanao", "0648866": "Masaya Onosaka", "2874420": "Kate Oxley", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "1387237": "Carrie Savage", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0847416": "Yasuhiro Takato", "5719834": "Laurent Vernin", "0915818": "Brett Weaver", "0931060": "Kent Williams", "1075553": "Kerry Williams", "0943849": "Oliver Wyman", "0946295": "Kazuki Yao", "1133514": "Noriko Yoshitake", "1659668": "Makiko Ômoto"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Luffy pummels Kuro into defeat, exposing the butler's plot; a grateful Kaya promises reparations, and a tearful Usopp parts with his village's disbelief, accepting Luffy's invitation to chase pirate dreams on the high seas.", "Luffy punched Kuro in the face before he had the chance to slice up Usopp. Then Usopp's kid trio pirate crew show up and beat up Kuro with a shovel. Usopp told them to stop as it's just making Kuro more ticked off than he was before. He gave them orders to protect/guide Kaya out of the battle. They obeyed and guided Kaya out of here (to repay their doubts on thinking their captain was lying about the pirates attacking for real). Jango followed them, while Zoro is busy with the \"hypnotized\" Buchi. After Zoro finally defeated Buchi, he took the unconscious Usopp to catch up to where Jango, Kaya, and the three kids are. Luffy keeps Kuro busy by pulling off a fight against him. Only to discover that Kuro isn't as easy of an opponent to defeat with his stealth foot step technique. We soon learn about how Kuro avoided his execution by the Marines. As he got Jango to hypnotize a decoy into thinking he's Kuro and the Marines took the fake and executed him. While Kuro laid a low profile by going by the name of Klahadore. And gave Jango the role of captain of the Black Cat Pirates. And after 3 years of portraying as a simple minded caretaker, he wants more than to return as \"Captain Kuro\". Will Luffy be able to defeat him? And will Zoro & Usopp be able to catch up before Jango kills Kaya and the kids?—J LeGault"], "genres": "N/A", "imdbID": "0957055", "rating": 7.4, "votes": 2375, "number_of_episodes": 1147}