{"cast": {"0849028": "Mayumi Tanaka", "0386286": "Hiroaki Hirata", "0649026": "Ikue Ôtani", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1020018": "Christine M. Auten", "0065292": "Tony Beck", "1716724": "Cole Brown", "0132285": "Charles C. Campbell", "1513684": "Colleen Clinkenbeard", "1899375": "Craig Dvorak", "1682698": "Jerome Fifty-Seven", "3213942": "Casey Green", "0337751": "Dan Green", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0416532": "Grant James", "0421004": "Bill Jenkins", "2703026": "Hiroyuki Kawamoto", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "2057312": "J. Michael Tatum", "0853301": "Veronica Taylor", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Flashbacks show Zeff losing a leg saving shipwrecked Sanji; their shared dream of the mythical All Blue steels the chef's resolve as Don Krieg circles Baratie.", "Gin showed his true colors and has a gun pointed at Zeff's head. He figures he can end the old pirate's life easier, so that way his crew can take over the ship. Sanji told Gin that he's worth killing more than Zeff is. As Sanji find Zeff to be acting pathetic than he normally is. Pearl got up and gave Sanji a beating of a lifetime for pay back on the nose bleed. This made Sanji remember the day he first met Zeff. Back when he was a boy chef who doesn't know the importance of not waisting food. He worked on a voyage ship with a few other chefs. He lechers that his dream is to find the Big Blue, which has all 4 corners of the ocean. But his friend explained to him that that's just a daydream that all chefs think of. One day their voyage ship was attacked by a group of pirates lead by Red Leg Zeff(back when he had both legs and still a pirate). Sanji didn't want them to get away with it, so he tried to fight them off, but it was no good. Then a wave came to wash Sanji off of the boat. Zeff went to save him, but his right foot got stuck. So he had to cut it off in order to save Sanji from drowning. Then they end up on a desert rock isle. Sanji kept blaming Zeff for this mess. But Zeff didn't care and told Sanji to go on the other side of the island to keep an eye out for any rescue ship. He was given five days worth of food. And he can't steal any of Zeff's portion. After several days and nights of no sign of any ship, both Sanji & Zeff start to starve to death. This gave Zeff an idea on starting a business in a restaurant that would travel out in sea so that way no one would ever starve with hunger in the open sea again. After that experience, Sanji is hoping to repay Zeff somehow for the leg he lost in order to save him.—J LeGault"], "genres": "N/A", "imdbID": "0961582", "rating": 8.7, "votes": 3501, "number_of_episodes": 1147}