{"cast": {"0849028": "Mayumi Tanaka", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0031844": "Takeshi Aono", "1828143": "Andrew Auten", "1889973": "Charles Baker", "0065292": "Tony Beck", "0132285": "Charles C. Campbell", "1513684": "Colleen Clinkenbeard", "1711418": "Kevin Connolly", "1827148": "Marc Diraison", "0969901": "Wayne Grayson", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0416532": "Grant James", "0421004": "Bill Jenkins", "2703026": "Hiroyuki Kawamoto", "1495204": "Brian Maillard", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "0754526": "Christopher Sabat", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "2057312": "J. Michael Tatum", "0860443": "Marc Thompson", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["With Zoro wounded, pearl-plated bruiser Pearl sets Baratie ablaze; Sanji's blistering kicks ignite, shielding Zeff's dream restaurant from Krieg's relentless assault.", "After a violent defeat by Mihawk. Zoro made a pledge to never loose like this again. Mihawk liked how tough Zoro was able to live through his attacks. The next time they meet, he'll expect Zoro to be stronger next time. Mihawk left, which was the right time for Don Krieg's men to take the Baratie by force. Luffy told Usopp, Johnny, and Yosaku to take care of Zoro and find Nami and the Going Merry. While he remains here to help fight along with the chefs who'll protect their restaurant to the very end. As Patty & Carne mentioned 10 years ago, they couldn't find their places a chefs because they'd always start up a fight. When they came across with Zeff, he accepted them, as long as they could cook. While Sanji has been a cook for Zeff ever since he was a kid. And to this day, he knows that loosing the restaurant is not an option. But Don Krieg is determined to obtain the Baratie so that way his crew can use it for surprise attacks. And he wants the logbook that Zeff has been keeping even since his last visit to the Grand Line. As Don believe that book contains strategies on how to over come the dangers of the Grand Line. And possibly where the One Piece treasure is located. Sanji puts up a good fight with his kicking skills. As he notes that he never uses his fists as it'll ruin his hands, which he needs for cooking. That remark made Luffy more impress and now really wants Sanji to be part of his crew. Then out of the water is Pearl the Iron Wall. Who is Don Krieg's strongest shipmate. After 61 wins, he's consider himself invincible as no ones ever made him bleed. How will our friends be able to beat Pearl?—J LeGault"], "genres": "N/A", "imdbID": "0961578", "rating": 7.5, "votes": 2138, "number_of_episodes": 1147}