{"cast": {"0849028": "Mayumi Tanaka", "0065292": "Tony Beck", "1235109": "Ed Blaylock", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1682698": "Jerome Fifty-Seven", "2969903": "Scott Freeman", "2405252": "Ray Gestaut", "2173713": "Kenny Green", "0370085": "Brad Hawkins", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "0552575": "Josh Martin", "0620017": "Kazuya Nakai", "0620333": "Ryûsei Nakao", "0645500": "Akemi Okamura", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "2996243": "Greg Silva", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "1631578": "Masaya Takatsuka", "0847664": "Junpei Takiguchi", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Zoro tries to fight Erik, but Erik is more interested in chasing the dragon.", "The Straw Hat Pirates. Apis and Ryuuji find themselves in a temple on what believed to be the Dragon's Nest. But all they found was a high ceiling with pictures of dragons and people. It didn't look like a place where dragons once roam. Apis asked Ryuuji, but he doesn't even know what this place is either. Usopp complained that the dragon isn't too helpful at all. While Apis started to argue with him that he's not at all helpful either. Luffy found a large piece of the ceiling that was once part of the ceiling. As well as other pieces that collapsed and caved in most of the areas. Usopp thinks it's wise to get out of here while they can. But Apis still thinks that the real Dragon's Nest is here. But Usopp doesn't think so because they haven't seen a single dragon besides Ryuuji so far. While Nami buts in, and believes that the island they're on couldn't be Lost Island. They all wondered why she'd think that, so she pointed out to the ceiling's pictures. And said that it's like a map pointing to Lost Island. And the people who are surrounding the dome in the picture prove that people have once lived here. Possibly the ancestors of Gunkan Island. And recalled Grandpa Bokuden saying that their people came from a different island long ago. And noted all the dragon statues and drawings on the island, show that the people of this island worshiped the Sennenryuu as Gods. After Usopp listened to Nami's hypothesis, he starts to believe for sure that Dragon's Nest isn't here at all. Apis wondered where the real one could be. Zoro thinks according to the map that it's located on the one with a dragon drawing on it. And it looked like he's right about that. But the island looks exactly like Gunkan Island. Which made everyone confused because they were told Gunkan Island isn't Lost Island or home of the Dragon's Nest. Sanji agreed with Nami's hypothesis and thinks they'll know once they get back there. Nami however doesn't think she's 100 percent right about all this. And Lost Island could of sank to the sea, explaining why no one knows where it is. Apis went to Ryuuji, and tries to get him to remember where Dragon's Nest really is. And told him to look at the pictures and think hard. ryuuji is their only hope in finding what they're searching for. Ryuuji looked up, and the birds that flew from the dome window, made him envisioned his species again. And he finally remembers that Dragon's Nest is located near Gunkan Island. Apis was glad that Ryuuji remembered, but felt sorry for dragging the Straw Hat Pirates all the way to this island ofr nothing. But they told her not to take it so hard. Zoro sense someone spying on them, and it is Erik who learned that Gunkan Island is where Dragon Nest is. Luffy made an exit, by running into the wall, which crumbled and created an escape route. Sanji told Zoro and Usopp that Erik has a Devil's Fruit power, and need to be careful about it. Zoro kept Erik busy, while Usopp, Sanji, Luffy, Nami, and Apis get Ryuuji out of the temple and straight to the Going Merry. They slide down on a large tree root, and continued to slide down the mountain slope. Erik told Zoro that he has no time to fight him, and went to go after the others. Zoro was on Erik's tail, and tried to prevent him from proceeding. Erik through dirt at Zoro's face, and explained that he's only interested in the Sennenryuu dragon. And will kill those who interfere. The others made it back to the Going Merry ship. They tied Ryuuji's cart to the ship, right till Apis learned from the birds that Zoro is in danger. Luffy stretched out his arm to grab where Zoro is. Before Erik had the chance to kill him. Soon they were reunited and departed from the island. The marines saw the Going Merry come out from the mirage barrier. Major finds Erik to return safely from the trip. Erik just told Major to follow the Going Merry, as he knows for sure where Dragon's Island is. As our heroes have a head start from the marines who followed. Their next destination is back on Gunkan Island. But they come face to face with another marine ship, much different from the others. It's lead by Admiral Nelson Royale himself, and he has the whole 8th Division fleet on his side. And all the ships formed a steel chain barrier to prevent the Going Merry from escaping. Admiral Nelson knows that they have a dragon, and wants that elixir more than everything. Erik on the other hand is angry that the Admiral has a greater advantage on capturing the dragon before him. How will the Straw Hat Pirates get out of this mess? And will they succeed in finding Dragon's Nest and Lost Island?—J LeGault"], "genres": "N/A", "imdbID": "0971909", "rating": 6.6, "votes": 1303, "number_of_episodes": 1147}