{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1591151": "Chris Ayres", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "0250752": "Hisao Egawa", "0335674": "Tiffany Grant", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0382735": "Jay Hickman", "0421004": "Bill Jenkins", "0467558": "Jûrôta Kosugi", "1386148": "George Manley", "0552575": "Josh Martin", "0605451": "Toshiyuki Morikawa", "0648866": "Masaya Onosaka", "1042624": "Chris Rager", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "1365137": "Patrick Seitz", "0794052": "Kôzô Shioya", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0932637": "David Wills", "0906722": "Wakana Yamazaki"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["To prove her \"loyalty,\" Nami appears to kill Usopp before Arlong; Zoro unknowingly hitches a ride with octopus Hatchan; Luffy's party finally lands, unaware Usopp survived and Nami's act masks a deeper plan.", "Nami has worked for Arlong for 8 years. She's betrayed her home and her diciest foster mother. But during all those years she has a good reason why she did so. Usopp was chased after 3 of Arlong's henchmen, he managed to get rid of them by using his running and camouflage skills. But he got caught by Chu, another merman henchman. Zoro killed and knocked out several guards. He was waiting patiently to confront with Arlong, but he's not back yet. Zoro decides to find him and exits out of the park. He meets Hatchi(an octopus merman) who he presumes Zoro to be a guest of Arlong and guided him to the Cocoyashi village to find Arlong. Only to discover that Arlong has already headed back to his park and Usopp has been capture. So Zoro made a dash for it, hoping he's not too late. Arlong finds all his mermen killed and wounded and found out that Zoro has escape. But becomes questionable in who helped him escaped. Chu brings in Usopp and Arlong knows that he's a friend of Zoro. One of the merman had a suspicion that Nami did it. But when she came back, she tells them to not doubt her, specially when she's been trusted by Arlong for 8 years. To prevent her scheme to be toiled with, Nami will have to \"kill\" Usopp in order to remain her post as Merman officer. But Usopp doesn't believe that Nami would do such a thing to him. Luffy, Sanji, and Yosaku made it to land, where their sea cow monster made a crash landing. And cause their ship to fly across the island's plains. Their looking foreword to save Nami, but how will Luffy react when he finds out that his navigator friend has been playing a crooked game with him?—J LeGault"], "genres": "N/A", "imdbID": "0963615", "rating": 7.8, "votes": 2059, "number_of_episodes": 1147}