{"cast": {"0849028": "Mayumi Tanaka", "1889973": "Charles Baker", "0049319": "Nell Balaban", "0065292": "Tony Beck", "1115778": "Bob Carter", "0160049": "Luci Christian", "1799368": "Leah Clark", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "1037430": "Justin Cook", "1827148": "Marc Diraison", "1682698": "Jerome Fifty-Seven", "3435683": "Cris George", "1708798": "Caitlin Glass", "1462031": "Jason Griffith", "1782579": "Jason Grundy", "1514495": "Clarine Harp", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "0399321": "Chuck Huber", "3238576": "Kristi Kang", "0522275": "Andrew Love", "1396500": "Neal Malley", "1489841": "Jamie Marchi", "0612818": "Rob Mungle", "0620017": "Kazuya Nakai", "0645500": "Akemi Okamura", "1046347": "Fumiko Orikasa", "2874420": "Kate Oxley", "1284009": "Amy Palant", "1503776": "Phil Parsons", "0666547": "Chris Patton", "3009719": "Ben Phillips", "0712996": "Scott Rayow", "0722676": "Monica Rial", "2925410": "Jerry Russell", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "1230837": "Ian Sinclair", "0999118": "Michael Sinterniklaas", "0814470": "Keiichi Sonobe", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0847416": "Yasuhiro Takato", "1631578": "Masaya Takatsuka", "2418125": "Andrew Tipps", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0913842": "Misa Watanabe", "1075553": "Kerry Williams", "0932637": "David Wills", "0945322": "Kappei Yamaguchi", "1659668": "Makiko Ômoto", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Zoro lets loose on the bounty hunters.", "Zoro knows about the Baroque Works organization. And for that he must die. But he disappear off the roof. And reappeared in the crowd of bounty hunters. They got out their guns to shoot him, but they all missed and shoot each other. Mr. 8 discovers that Zoro is no ordinary swordsman. As Zoro drew his sword behind Mr. 8 before he could blink. Soon Zoro is chased by the Whiskey Peak civilians, and decides to try out the swords he got from Loguetown. And they all didn't stand a chance against Zoro's sword techniques and stealth moves. Usopp, Sanji, and Luffy were still worn out from the party. Nami in fact wasn't worn out and also knows about Whiskey Peak's secret. So she looks around to see if there's any treasure to steal. The Baroque Works agents think Zoro is the real captain, because of his skills. And used Luffy to cover his image. Zoro goes up against Miss Monday(who has a pair of brass knuckles). But Zoro easily defeated her by pushing her down with a single hand after a slight bruise from the brass knuckles. Then Mr. 9 comes to show off his \"Acro Bat\" weapons. But was also easily defeat when Zoro forced him off the roof by using his swords. Next was Miss Wednesday and her giant duck: Carue's turn to fight him. She used her \"Aluring Perfume Dance\" which paralyzed Zoro's body. She was about to attack him with a wire, but Carue was too stupid to go straight and feel off the roof. These guys were all embarrassing, even those Mr. 9 said that the ones with the lowest numbers for names are the strongest. Then Mr. 8 uses his Saxophone shotgun which made Zoro run for it. Then Mr. 9 got hold of Zoro and told him not to move unless he wants to see Miss Wednesday finish off the sleeping Luffy. Mr. 8 shows off his hidden cannons in his curled hair. And was ready to fire on Zoro, right till he blocked the attack by using Mr. 9 as a shield and threw towards Miss Wednesday and Carue. Zoro used Luzzy's gut as a trampoline to get to Mr. 8. Zoro slash Mr. 8, and was defeated. Now the night seemed peaceful once more for Zoro. Right till the wounded Mr. 8,9, Miss Monday,Wednesday, and Carue are met by Mr. 5 and Miss Valentine. Who know that someone has the knowledge of Baroque Works' secret. That and they know that Igarappoi a.k.a. Mr. 8 is actually Igaram, Captain of the Royal of the Arabasta Kingdom. And he's hiding Princess Nefertari Vivi of Arabasta. Both Zoro and Nami(who is hiding at a near by alleyway) wonder what this is all about.—J LeGault"], "genres": "N/A", "imdbID": "0976911", "rating": 8.1, "votes": 1640, "number_of_episodes": 1147}