{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "0186528": "Cynthia Cranz", "1827148": "Marc Diraison", "1495107": "Jin Domon", "1846658": "Charlet Dupar", "3139597": "Shawn Gann", "2173713": "Kenny Green", "1462031": "Jason Griffith", "1514495": "Clarine Harp", "0368060": "Kôichi Hashimoto", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "1235266": "Jerry Jewell", "0463828": "Kevin Kolack", "0463813": "Mariko Kôda", "0473873": "Cherami Leigh", "0507793": "Ted Lewis", "0514775": "Gary Littman", "0855377": "Haruhi Nanao", "2874420": "Kate Oxley", "3009719": "Ben Phillips", "0754526": "Christopher Sabat", "0419760": "Tara Sands", "1387237": "Carrie Savage", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "5719834": "Laurent Vernin", "0931060": "Kent Williams", "1075553": "Kerry Williams", "0943849": "Oliver Wyman", "0946295": "Kazuki Yao", "1133514": "Noriko Yoshitake", "1659668": "Makiko Ômoto"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["A grateful Kaya gifts Luffy's crew their first ship, the Going Merry; Usopp tearfully leaves Syrup Village, joins the Straw Hats, and they chart a course for new horizons.", "Luffy managed to get a hold of Kuro and finished him off with his Gum Gum Headbut attack. He threw Kuro towards the Black Cat Crew and told them to never return to this island again. That remark scared them so they scattered to their ship and fled. Luffy collapsed after the rough fight, while Nami reclaim the bag of Buggy's treasure. Zoro and Usopp managed to defeat Jango with Usopp's sling shot ability. Jango was no longer a threat to them. Kaya is finally safe, and everything's back to normal. The Kid Trio were all amazed by Usopp's heroism, but Usopp wants to them to keep it a secret, as he prefers the villagers to see him as the liar he's always been. We learn more about Usopp's past, and the reason why he always spends hoaxes to the locals. As well as the formation of the Usopp Pirate Crew. At their club base, Usopp announces to his young crew, that he'll be leaving in order to fulfill his dream in becoming a great pirate like his own father. But his friends, don't want him to leave not from all they've been through during the past 5 years. But this isn't another lie of his. He wants them to promise him that they'll fulfill their dreams as well. And from this day, the Usopp Pirate Crew is now disbanded. Meanwhile Kaya & Meri(who's fully recovered) give Luffy, Zoro, and Nami a ship: \"The Going Merry\". As promised Kaya return their favor in giving them their own ship to sail the ocean. They were excited to be owning their very own pirate ship. The Usopp came rolling down with a large backpack for his departure off the island. Kaya thanked Usopp for all he's done for her. She'll miss him dearly, but won't force him to stay as it's his new bound destiny. Usopp officially becomes Luffy's third mate of the \"Straw Hat Pirates\". As our heroes set sail, they all celebrate over their achievement in gaining their own ship.—J LeGault"], "genres": "N/A", "imdbID": "0957054", "rating": 8.1, "votes": 2567, "number_of_episodes": 1147}