{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0143801": "Chris Cason", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "3139597": "Shawn Gann", "2171329": "Jessie James Grelle", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0421004": "Bill Jenkins", "0568772": "Mike McFarland", "0651682": "Jonathan C. Osborne", "0654361": "Frederick B. Owens", "3009719": "Ben Phillips", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "5719834": "Laurent Vernin", "3009142": "Viktor Walker", "0915818": "Brett Weaver", "1075553": "Kerry Williams", "0959984": "Tôru Ôhira"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["On a lonely cliff-isle, the crew meets Gaimon, a castaway fused to a treasure chest who protects quirky animal pals and empty chests; Luffy's empathy rekindles his hope before they sail on.", "After Usopp joined our heroes journey, they set sail on \"Going Merry\" across the ocean. Luffy designs the crew's own pirate flag, since they now own a pirate ship. His design was rather sloppy, so Usopp(who happens to be good at painting) re-did it into a more professional look. They now have their own pirate flag logo: A Skull with a straw hat. Since they're the \"Straw Hat Pirates\". Nami sees an island up ahead, which is called \"Legendary Treasure Island\". Many pirates visited the island, but never found the treasure. They say that a Guardian God protects the island from those who try to steal it. When they went ashore on the island, it all seemed quiet right until they're surrounded by mixed up animals. More weirded out than before, the voice of the so called Guardian God was heard. Only when Luffy discovered that it's actually a bush-haired boxed man who's been marooned on the island for 20 years. His name is Gaiman, and he was once a regular crew member of a pirate crew who came to this island, 20 years ago. Only to find a empty box. Gaiman noticed a mountain that wasn't checked by the crew, so he climbed up to the top to find a stash of treasure chests. But then he slipped and got stuck in the box he's in today. His crew left without him leaving Gaiman miserable. To this day he's been protecting the treasure from other pirates with the help of his animal friends. After hearing this sad story, Luffy and the others decided to help Gaiman out.—J LeGault"], "genres": "N/A", "imdbID": "0960523", "rating": 6.8, "votes": 2382, "number_of_episodes": 1147}