{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "1235109": "Ed Blaylock", "0143801": "Chris Cason", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "1682698": "Jerome Fifty-Seven", "2969903": "Scott Freeman", "3435683": "Cris George", "2173713": "Kenny Green", "0370085": "Brad Hawkins", "0377365": "Sean Hennigan", "0399321": "Chuck Huber", "0421004": "Bill Jenkins", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "3009388": "Johnny Bruce Lewis", "0552575": "Josh Martin", "0620333": "Ryûsei Nakao", "1446036": "Mark Orvik", "1503776": "Phil Parsons", "3009166": "Eric Pulido", "1042624": "Chris Rager", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "1056120": "Tak Sakaguchi", "2996243": "Greg Silva", "0831008": "Mark Stoddard", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "1631578": "Masaya Takatsuka", "0851311": "Naoki Tatsuta", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Now that the crew understand why Apis was followed, they hurry to escape the island so Ryuuji can be saved.", "Nami and Luffy went to tell Usopp, Zoro, and Sanji on what they've witnessed. Only to find them all asleep, while the half asleep Bokuden is still talking about Gunkan Island's ancestry. They woke, and heard from a village local that a group of marine ships are coming ashore. Nami told the him that if Bokuden wakes up, just tell him that they'll protect Apis at all costs. When they got back to the cave, both Usopp, Sanji, and Zoro couldn't believe it for their own eyes. Apis explained to them that Ryuuji is a Ryuukotsu Dragon. Who has lost of his strength, and believes he'll regain it back at Lost Island. Usopp start acting enthusiastic that there's no way they could find an island that doesn't exist on the map. Sanji and Zoro however agreed to help Ryuuji get back home. In order to do this they'll need to make a cart big enough for the dragon. Usopp finds this all to be pointless. Sanji, Luffy, and Zoro used their skills to cut down the trees for lumber. Usopp was impress at all this effort. That made him convince to help built it. And soon they were finished. Since the marines are heading towards the harbor, the Straw Hat Pirates can't risk to put Ryuuji in any danger. So they'll escort the dragon to the back side of the island(which has a cape the size of Usopp's nose) while Usopp and Zoro go get the Going Merry. A group of Marines entered Bokuden's home and was questioned by Major. But Bokuden was still half asleep with his story. Outside, Erik discovered the trail left by Apis's bag, and tells the marines that Apis is somewhere in the mountain range. Zoro and Usopp made it to the harbor, only to discover that the Going Merry is heavily guarded by the Marines. Usopp suggested that they'd do this at nightfall, but Zoro has an idea & made a breathing tube for Usopp and Zoro. They snuck into the ship by swimming underwater. Usopp had trouble getting his tube out of his mouth, and drew attention to the guards, who open fired at him. Zoro got the sails down and cast off. They were about to ram into a marine ship, but nearly avoided a fatal accident. And now the Going Merry has the Marine fleet on it's tail. Luffy, Nami, Apis, Sanji, and Ryuuji wait for the Going Merry to show up at the cape. A seagull flew by and told Apis that the marines are coming. Erik, Major, and several Marines found them and were surprised to see them accompanied by a millennium dragon. Erik was more pleased to come across with the very thing they were looking for. Which made Apis no longer a value to them. Now it's Ryuuji they're after now. The Marines used their rifles on the dragon, but Luffy used his rubber body to deploy them. And reveals to them that he's a rubber man who ate the devil's fruit. Erik ordered the Marines to use their swords instead. But Sanji came in to kick them out, while Luffy used his Gomu Gomu Grappling Punch. Soon they were all defeated on the ground. So Erik steps in and tells them that he's \"Erik the Whirlwind\" a mercenary hired by Admiral Nelson Royale. He has no time to toil with them, and is only interested in the dragon behind them. And reveals that he too has ate a devil's fruit and has the ability of a scythe weasel. Luffy made fun of his nickname which made Erik angry. He gave out his scythe whirlwind attack, which is a whirlwind sharp as a katana. Nami saw the Going Merry coming to the cape, which is their cue to escape. Sanji and Luffy joined Nami, Apis, and Ryuuji on the wooden cart, and went down the mountain till they went over a slope which knocked out the marine ship's main sail and land afloat on the water. Usopp and Zoro were surprised on how well the plan went. They tied the wooden cart to the Going Merry and set sail to Lost Island. Even though they don't know exactly where it is.—J LeGault"], "genres": "N/A", "imdbID": "0971059", "rating": 6.6, "votes": 1344, "number_of_episodes": 1147}