{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka", "0559604": "Ginzô Matsuo", "0633788": "Junko Noda", "1364905": "Greg Ayres", "0065292": "Tony Beck", "0157133": "Shigeru Chiba", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1711631": "Kathleen Delaney", "1827148": "Marc Diraison", "2921248": "Greg Dulcie", "1727206": "Moriya Endo", "1708767": "Priscilla Everett", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "0399321": "Chuck Huber", "1132505": "Tetsu Inada", "0557287": "Bryan Massey", "0559640": "Youko Matsuoka", "0568772": "Mike McFarland", "3966409": "David Moo", "2850169": "J. Ward Regan", "0722676": "Monica Rial", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0793073": "Hidekatsu Shibata", "1958922": "Tom Souhrada", "1041619": "Laurie Steele", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1176685": "Shigenori Sôya", "0870325": "Machiko Toyoshima", "0425061": "Eric Vale", "0892831": "Russell Velázquez", "5719834": "Laurent Vernin", "1075553": "Kerry Williams", "0932637": "David Wills"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["Miraculously saved from death by an unnatural green gust and a lightning bolt to Buggy, the Straw Hats rush out of Loguetown.", "After Luffy escaped his execution, he, Zoro, and Sanji are heading back to the harbor. The storm that just occurred is like no other. But it will give the Straw Hat Pirates the advantage to use the ocean's current to head straight to the Grand Line. Meanwhile Cabaji, Buggy, and Alvida fight their way through the line of marines. They decide to retreat, so Buggy uses his special Baka Baka Car move while Alvida uses her Zero Fricition sliding move to make a get away. But Smoker used his devil's fruit power to stop them all, so that way the marines can use their own metal net cannons which can make those who have the devil's fruit become trap. After catching one group of pirates, Smoker orders one marine to get his Billower Bike. So he can go after the Straw Hat Pirates. Usopp and Nami made it to the harbor, only to find Mohji and Richie, who failed to burn the Going Merry because of the rain. Mohji sends Richie to attack them, but was busy eating an egg, special thanks to Usopp. They head towards the ship, right until the marines came to shoot them down. Zoro, Sanji, and Luffy are yet to reunite with Usopp and Nami. Right till they came across Tashigi, who this time knows who Zoro is. And as she mentioned earlier to him, that she attempts to take back any katanas that are used by those who are evil. But Zoro won't give up his katana from Kunia. They fought with their katanas, Zoro used 2 of his to knock Tashigi's katana out of her hands. He instead of finishing her off, he let her lived. But Tashigi called Zoro soft for letting her live in failure. She thinks he spared her life because she's a woman. Then as she talked, it almost sounded exactly the same statement, that Kunia used. Zoro back talked her that she is talking just like his friend. But Kunia thinks Zoro is acting too naive that she'd be imitating someone he'd know. And thinks it was his friend who copied her. He left with Luffy and Sanji, only they came across with Smoker. Luffy told them that he'll catch up later. Smoker reminded Luffy that he must pass him in order to get to the Grand Line. Nami and Usopp managed to cast off the shore. Usopp told Nami that they still need to wait for Zoro, Sanji, and Luffy. But Nami can't do a thing about it with all the Marines shooting at them with rifles and cannons too. Sanji made it, but he's too busy fighting off the army of marines. Since it was too dangerous to go to shore, due to the storm. Usopp jumps out, and helps out Sanji with his slingshot skills. So Smoker and Luffy fought again. Only Luffy discovers that not only is Smoker quick on his feet, but is also untouchable. Everytime he tries to attack him, it would go through him like smoke. Smoker got hold of Luffy and still finds him to be a sorry excuse for attempting to become the next pirate king. He was about to withdraw his Bo ton, till he was stopped by a mysterious figure, who told him not to. Smoker recognized the figure, who is a man in a cloak with a marking on his face. But before Luffy knew what is happening, a large green gust of wind came and separated Luffy from Smoker. Buggy, Alvida, Cabaji, and the Buggy Pirates were free from their metal nets and head back towards their ship. The cannons and marines were all wiped out too. Luffy got up from the place he was blown to and found Zoro, Usopp, and Sanji again. Nami and Going Merry were too far off shore. So Luffy used his Gomu Gomu Kick to get on board. And they finally escaped from Loguetown. The mysterious figure, who had helped them all stood on a platform and wished them all a safe trip. A marine official questioned the man(who is revealed to be named Dragon) on why he helped Luffy. He just smiled and said that there is no reason to stop a man from sailing. Smoker ordered his men to get him a ship to hunt down the Straw Hat Pirates to the Grand Line. But one of the marines reminded him that his jurisdiction is still Loguetown. Smoker however didn't care what his jurisdiction was anymore. Tashigi will accompany Smoker, as what Zoro did to her was unforgivable, and will catch him with her own hands. The Buggy Pirates escaped too, and Buggy finds it to be a struck of luck to escape. Aldiva asked what their destination is. Buggy tells them it's the Grand Line. And knows they'll have a good chance in finding the Straw Hat Pirates there. While our friends, are following their path to the Grand Line. Where the One Piece treasure is located. All 5 of them performed a little launching ceremony to mark their importance of the voyage. Sanji: to find the All Blue; Luffy: to become the Pirate King; Zoro: to become the greatest swordsman; Nami: to draw a map of the world; & Usopp: to become a brave warrior of the sea. After giving out their greatest desires, their next stop is the Grand Line! What adventures will await for our heroes?—J LeGault"], "genres": "N/A", "imdbID": "0969499", "rating": 8.4, "votes": 2491, "number_of_episodes": 1147}