{"cast": {"0849028": "Mayumi Tanaka", "0049319": "Nell Balaban", "0065292": "Tony Beck", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1037430": "Justin Cook", "1827148": "Marc Diraison", "1708798": "Caitlin Glass", "1514495": "Clarine Harp", "0377365": "Sean Hennigan", "0386286": "Hiroaki Hirata", "0522275": "Andrew Love", "1489841": "Jamie Marchi", "0612818": "Rob Mungle", "0620017": "Kazuya Nakai", "0645500": "Akemi Okamura", "1046347": "Fumiko Orikasa", "0666547": "Chris Patton", "0712996": "Scott Rayow", "0722676": "Monica Rial", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0999118": "Michael Sinterniklaas", "0814470": "Keiichi Sonobe", "0835688": "Eric Stuart", "0847416": "Yasuhiro Takato", "1631578": "Masaya Takatsuka", "5719834": "Laurent Vernin", "0913842": "Misa Watanabe", "1075553": "Kerry Williams", "0932637": "David Wills", "1659668": "Makiko Ômoto", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["Mr. 5 and Miss Valentine follow after Vivi; Luffy wants to fight Zoro.", "Mr. 5 and Miss Valentine were informed by the boss that one of their agents knows some secrets that can't be leaked out. They know Mr. 8 and Miss Wednesday's true identities are were placed orders to eliminate them. Mr. 8 tries to kill them with his canons. But discovers that there's not a scratch on them. Igaram tried all he could to stop them but got hurt badly. And told Miss Wednesday(Princess Vivi) to run for it. She didn't want to leave Igaram like this. But he didn't want her to worry about him. Just remain alive for the sake of their kingdom. Mr. 9 battles Mr. 5 while Vivi escapes with Carue. Mr. 9 got defeated easily by Mr. 5's Nose Fancy Bomb. As they attempt to chase and kill Vivi. Igaram insisted that Zoro should protect the princess. Zoro didn't think so, not when they were trying to kill them off earlier. There is in fact a reward involved for the ones who bring back the princess safe to Arabasta. Nami was interested in the reward, and told Zoro to look after the princess. Zoro wanted to know why he'd take orders from her. Nami noted that he owes her 200,000 Belli from their last trip to Loguetown. Do his part, and they'll be even. Vivi and Carue run towards their way to escape the island. Only to find that Mr. 5 and Miss Valentine aren't too easy to get rid of. According to Igaram, they both have Devil's Fruit abilities. Mr. 5 is a Bomb Man who can made the simplest things into a bomb. While Miss Valentine is a Kilo person, who can dive down on her umbrella at high kilos to create a deadly shock on the ground. Vivi finds Miss Monday who told her that the escape boat is just a little ways away. And will fight them off while she escapes. But the strong Miss Monday couldn't defeat the explosive Mr. 5. He gave out another Nose Fancy which was deflected by Zoro's sword. Vivi thinks Zoro is after her, but he tells her, that he was given a request in protecting her. Meanwhile Nami learns from Igaram that Baroque Works is a criminal organization that verifies espionage,assassinations,theft, and bounty hunting. Al the members don't know the identity or face of the leader of the group: Mr. 0. His main goal is to create an Ideal Nation. Those who the strongest get pride and respect for Mr. 0's Ideal Nation involved. Those who are stronger than Mr. 5 are unnatural and dangerous. Zoro protects the Princess at all costs. Only to see Luffy(who is still full from the 20 servings of food) finally up and came by. He thinks he's here to help him, only to discover that he wants to fight him. For hurting all those people who gave them the hospitality. Zoro tried to explained to him on what really happened. But Luffy was too pigheaded to understand what really is going on. They fought each other, fist and sword. Mr. 5 and Valentine were about to eliminate Vivi but got knocked out by Luffy who was punched by Zoro. After an explosion, Mr. 5 was found her from his own explosion, and Luffy finally thin out his gut from what he ate. He and Zoro continued to fight. While Vivi and Carue are confused over why they're both fighting when they're on the same side. Mr. 5 and Miss Valentine were going to get rid them both for interfering their plan. But Zoro and Luffy punched them out of their fight. Will Luffy & Zoro be able to settle this useless fight properly?—J LeGault"], "genres": "N/A", "imdbID": "0976915", "rating": 8.0, "votes": 1566, "number_of_episodes": 1147}