{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "1364905": "Greg Ayres", "0065292": "Tony Beck", "0157133": "Shigeru Chiba", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1727206": "Moriya Endo", "0377365": "Sean Hennigan", "0399321": "Chuck Huber", "1132505": "Tetsu Inada", "0421004": "Bill Jenkins", "0559640": "Youko Matsuoka", "0568772": "Mike McFarland", "0754526": "Christopher Sabat", "1041619": "Laurie Steele", "0833185": "Sonny Strait", "1176685": "Shigenori Sôya", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0645212": "Chikao Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["With Buggy assumed to be dead, his crew fights over who will be the new captain.", "Buggy tells the mystery woman he's accompanied with. That he's planning to find his old crew. Meanwhile we learn that that the Buggy Crew had escaped from the angry mob of villagers and had to cat off cowardly. Mohji and Cabaji both were worried on what became of their captain. As the only thing they have left of him are his parts(which were all gathered and tied up thanks to Nami). Mohji blamed Nami for Buggy to loose his parts. While Cabaji has a grudge for being defeated by Zoro. The crew heads for a tropical island and made a memorial for Buggy. As they presume that he's dead. Cabaji then announces to the crew, that he'll be the new captain. But Mohji denies that and insisted that he becomes the captain. So the Sword Swinging Acrobat and the Beast Tamer went into a fight to determine who's more worthy of being the new captain. Their skills were both equal so they went into a fist fight instead. The fight went on from day to night. Richie the lion, was dreaming about him being the captain. Then he sleep walked and knocked both Mohji and Cabaji out. Richie was then honored by the crew as their new captain. Then out of nowhere a tribe surrounded them. The leader told them they're the Kumate Tribe, and they're trespassing their island. Richie showed himself as the captain, and attacked one of the tribes men. But the Kumate were too tough to beat. And the whole crew was found unconscious. Buggy used his binoculars to search for any signs of his crew. he spotted his flagship. And headed for the island. Buggy and the woman found his memorial, which made Buggy a bit confused on why there's a grave for him. He found Mohji and Cabaji, and they were glad to see Buggy safe and sound. Buggy wanted to know what happened. The woman explained to them that this island is home to the Kumate Tribe, and they're known for being cannibals. The tribe was making soup out of the Buggy Crew. They untied Buggy's parts, and don't know what they are. Buggy called out his parts, used them to fight off the tribesmen. Then his parts went towards him, and he starts to rebuild himself into his full scale body again. His crew was happy to see their own captain again. Buggy uses his Buggy Bombs to attack the tribe village. And soon he, Mohji, and Cabaji fight the tribesmen without any mercy. After the fight, Buggy tells his crew, that the reason for them all to be in this mess in the first place. Was all Luffy's fault to begin with. And they new plan is to hunt him down, and get their revenge. So they head off to search for the Straw Hat Pirates. Meanwhile, our friends are heading towards Loguetown. Also known as the \"Town of the Beginning & No End\". Sanji looks forward to checking out the town's way of cooking. Zoro wants to get himself 2 new swords to replace the ones that were destroyed by MiHawk. Nami, Usopp, and Luffy are more than excited to see the place, where Gold Roger once lived and died.—J LeGault"], "genres": "N/A", "imdbID": "0967042", "rating": 6.2, "votes": 1950, "number_of_episodes": 1147}