{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "1591151": "Chris Ayres", "0065292": "Tony Beck", "1716724": "Cole Brown", "0121423": "John Burgmeier", "0146097": "James Carter Cathcart", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "1682698": "Jerome Fifty-Seven", "0969901": "Wayne Grayson", "0337751": "Dan Green", "1462031": "Jason Griffith", "0377365": "Sean Hennigan", "3137402": "Bradford Hutson", "0411050": "Hideo Ishikawa", "0416532": "Grant James", "0421004": "Bill Jenkins", "1489841": "Jamie Marchi", "0552575": "Josh Martin", "3966409": "David Moo", "0997645": "Robert O'Gorman", "2929126": "Tony Patterson", "1487947": "Jacob Preissinger", "0710330": "Andrew Rannells", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "1631578": "Masaya Takatsuka", "1728037": "Yasuhiko Tokuyama", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "3138790": "Billy Wilson", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["At the Baratie ocean-restaurant, suave chef Sanji knocks out pompous Marine Fullbody and feeds the Straw Hats--until Luffy smashes a mast into the galley and must work off the damage.", "A Pirate Hunter comes on board the Going Merry, and thinks that Luffy has captive on board. He starts to trash the place, but Luffy prevented him from damaging anything else. Zoro recognizes the Pirate Hunter, it was Johnny an old friend he knew. Zoro asked where Yosaku(his other friend) is. Yosaku isn't himself as he's just laying down feeling terrible. Johnny doesn't know what is wrong with him at all. Nami examines Yosaku and tells Luffy and Usopp to gets some fruit. They start to squeeze fresh fruit and poured it into Yosaku's mouth. Nami explains that Johnny's friend is just suffering from scurvy. And Vitamin C is the best medicine to treat it. Soon Yosaku is back to his old self. Him and Johnny dance with relief. the Pirate Hunter Duo are both rather surprised that their own friend Zoro would join a pirate crew. But they didn't mind it at all, since Yosaku is all better. Later that night in the mess hall, the crew and the 2 guests had some dinner. Johnny tells Luffy what he can find a chef for his crew. Since Luffy was hoping to find a chef for the ship, so that way the crew can eat professionally made meals. Soon they come across with a floating restaurant called \"Baratie\". According to Johnny, Luffy should be able to find a chef there. Only when a Marine boat came along to pick up a fight. The owner of the boat is Marine Lt. Iron Fist Fullbody. And finds the Straw Hat Pirate Crew to be a real joke. And orders his Marine gunmen to sink the ship. The fire a cannon ball at them. But Luffy managed to use his Gomu powers to reflect the cannon ball out of their way. Only it ended up landing straight to the roof of the floating restaurant. The owner of the Baratie: Zeff was hurt and angry at the same time. He ordered his chef crew to bring the one responsible for the damage. The chefs brought Luffy to Zeff, and the punishment is to work for him for an entire year. This Luffy can't do, as there's no way he can repay the damages for that long. And he's too busy in traveling to the Grand Line than to work for a chef. Meanwhile Iron Fist and his girlfriend were dining inside the floating restaurant. Iron Fist liked the taste of the wine served by a smoking waiter. And guess that it's brand is Wurzburger Stein. But the waiter told him that he's wrong. And corrected him that he's not a waiter. He's The assistant head chef, Sanji. Leaves them to enjoy their soup, while Iron Fist felt as if Sanji made a fool out of him. Luffy tries all he could to convince Zeff that he'll work for him for 1 week. But that won't repay all the damages. And the only other option is for Luffy to give up his own leg. Iron Fist tells Sanji that that's a bug in his soup. But Sanji knows there wasn't a bug there in the first place. And makes a joke out of it by saying he's no expert in bug soup. This made the other customers laugh around them. And it also made Iron Fist full of rage and used his brass knuckles to destroy the table in front of him. As well as the bowl of soup, that Sanji worked on for 3 days. Sanji picks up a fight with Iron Fist. Only Iron Fist discovers that Sanji isn't you're average chef. What will become of this fight? And will Luffy be able to get of the mess he's in with Zeff?—J LeGault"], "genres": "N/A", "imdbID": "0961579", "rating": 7.6, "votes": 2285, "number_of_episodes": 1147}