{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "1042062": "Mahito Ôba", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "0121423": "John Burgmeier", "0132285": "Charles C. Campbell", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "1827148": "Marc Diraison", "1462031": "Jason Griffith", "1000963": "Illich Guardiola", "0377365": "Sean Hennigan", "3137402": "Bradford Hutson", "1132505": "Tetsu Inada", "0409130": "Jeremy Inman", "0411050": "Hideo Ishikawa", "0416532": "Grant James", "0421004": "Bill Jenkins", "3138799": "Jessica Killough", "3966409": "David Moo", "1756131": "Andy Mullins", "0997645": "Robert O'Gorman", "0648758": "Ken'ichi Ono", "1487947": "Jacob Preissinger", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "0766339": "Shinobu Satouchi", "0770832": "Sean Schemmel", "1724747": "Erica Schroeder", "0833185": "Sonny Strait", "0835688": "Eric Stuart", "0846192": "Fumihiko Tachiki", "0860443": "Marc Thompson", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "0915487": "Tom Wayland", "1075553": "Kerry Williams", "0946692": "Kôji Yada"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["24"],  "plot": ["Starving pirate Gin collapses in Baratie, and soft-hearted chef Sanji risks Marine wrath to feed him--an act that soon lures fearsome warlord Don Krieg to the floating restaurant.", "Zoro, Nami, and Usopp went into the restaurant to see what's taking Luffy so long. Only to find an aftermath of a brutal fight. Sanji, who gave Iron Fist a real good kick. Is holding him with his grasp. And tells him that money won't repay the hard work he's put himself through in making that soup. Patty, a buff cook came out from the men's room saw what Sanji is doing and tries to stop him. Then Zeff and Luffy came falling through the ceiling and landed on the floor. Zeff sorted this out, as Sanji's had a long history in fighting with costumers who criticize his cooking. A group of chef had to take hold of Sanji as he's not done with Iron Fist. Zeff also disliked the way Iron Fist has criticize the way he acted. And for that, Iron Fist made a run for it, scared and fragile. A Marine Gunman appeared and informed Fullbody that their prison(who works for a pirate crew) has escaped and took out several of their men. They disappeared, and the prisoner appeared. He sits down and expects a meal after being force to starve during his imprisonment. Patty refused to serve the prisoner any meals as the guy has no money to pay it. Patty threw the guy out as he doesn't take any orders from freeloaders. Sanji went out at the dock and gave the starved individual a meal and drink. He was thankful that Sanji is giving it to him for free of charge. Luffy saw the whole thing and figures that Sanji is perfect for the ship's chef he's been looking for. But Sanji refused the offer, while Luffy refuses Sanji to deny the offer. Then Gin(the starved prisoner) buts in, and told Sanji that he's very thankful for the food. Sanji feels pleased that someone appreciates his cooking. Gin learns that Luffy is a pirate and has a goal in finding the One Piece treasure. Gin informs Luffy not to go to the Grand Line, as he's still young and still developing his pirate crew. Luffy asked if Gin knows more about the Grand Line. But he doesn't know much about it, just rumors about it being a hellish place for pirates to visit. Gin set sail on his boat and told Luffy he won't stop him from going to the Grand Line, as they're strangers from now on. Zeff saw the whole thing and ordered both Sanji and Luffy to get to work. Luffy is now stuck as a chore boy, but does a horrible job in attending the kitchen, so the chefs told him to take orders from the customers. Luffy saw his friends dining with food, which makes him very jealous. Will Luffy be able to get out of the chore boy job he's in, will he convince Sanji to join him? And what is the pirate gang that Gin works for?—J LeGault"], "genres": "N/A", "imdbID": "0961572", "rating": 7.5, "votes": 2198, "number_of_episodes": 1147}