{"cast": {"0849028": "Mayumi Tanaka", "0645500": "Akemi Okamura", "0620017": "Kazuya Nakai", "0386286": "Hiroaki Hirata", "0945322": "Kappei Yamaguchi", "0645212": "Chikao Ôtsuka", "0065292": "Tony Beck", "1235109": "Ed Blaylock", "0160049": "Luci Christian", "1513684": "Colleen Clinkenbeard", "2995527": "Robert Colin", "2969903": "Scott Freeman", "3435683": "Cris George", "2405252": "Ray Gestaut", "2173713": "Kenny Green", "0370085": "Brad Hawkins", "0377365": "Sean Hennigan", "2569958": "Jeff Johnson", "1931870": "Brittney Karbowski", "1489267": "Daniel Katsuk", "3009388": "Johnny Bruce Lewis", "0552575": "Josh Martin", "0620333": "Ryûsei Nakao", "1503776": "Phil Parsons", "3009166": "Eric Pulido", "2879558": "Jaime Rivera", "0754526": "Christopher Sabat", "2996243": "Greg Silva", "0831008": "Mark Stoddard", "0833185": "Sonny Strait", "0840632": "Masami Suzuki", "1631578": "Masaya Takatsuka", "0847664": "Junpei Takiguchi", "3485265": "Kenneth Thompson", "1798400": "Dave Trosko", "0425061": "Eric Vale", "5719834": "Laurent Vernin", "2252123": "Adam Whittington"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["25"],  "plot": ["On a stormy night, a girl called Apis escapes from the Marines and is found drifting by the Straw hats.", "During the storm, a girl escaped from a Marine ship. The report was sent to Admiral Nelson Royale, who is very disappointed that the marines had made this mistake. And explained to them that the girl is the key to obtaining Ryuukotsu, the elixir of eternal life. His servant Erik was given a task to search and find the girl at all costs. It's been 2 days since the Straw Hat Pirates left Loguetown. Usopp spotted a flock of bird surrounding an object at sea. Sanji explained that normally birds would do that, when a school of fish are around. Luffy got excited and used his Gomu Gomu Net to reach out and grab what he thinks is a fish. But it turned out to be a girl who is all worn out. She woke up and accidentally hit Usopp in the chin, and found herself in the mess hall. Nami was glad that she came through, and told her that Sanji is preparing her some soup. The girl finds herself lucky to be saved. Nami asked for the girl's name, but she insists to know their names. So Nami introduced everyone, and right until she mentioned Luffy being captain of the pirate ship. The girl became scared and paralyzed. She didn't eat any of the meals that were offered and sat in a corner thinking that she's in for the worst. Her stomach moaned, so she crept to the mess hall to see what was in the fridge. Only to find a trap being set off. Sanji turn on the light and found the girl and Luffy(who was caught in a large mouse trap). The trap was set, for security measures on protecting the food from thievery, especially when Luffy is the only one on board who tries to steal a snack. Sanji prepared the girl some soup, but she didn't want any of it. Sanji told her that he's not trying to poison her. So she tried it, and found it to be delicious. The girl started to trust the Straw Hat Pirates more. The next morning, the girl tried to make breakfast. But it was all burnt with too much seasoning. Sanji cheered the girl up, that all cooks make mistakes in cooking. He told everyone to eat it all up to encourage her. They all learned that the girl's name is Apis. And she's been adrift on the life boat for 3 days. And escaped from a marine ship. And she wasn't on board it as a guest. As Zoro states that Marines don't take regulars on board like a cruise would. Luffy wondered why the Marines would take a girl like Apis. Apis didn't want to tell them why, so she told them where she's from: Gunkan Island. Located near the Grand Line, and has the silhouette of a battle ship. Since Apis's home island is close to their destination, the Straw Hat Pirates will gladly help Apis get home. Meanwhile a fleet of Marine ships has spotted the Going Merry. The recognized it as a pirate ship because of their jolly roger of the straw skull. The Major of the ship, found the ship's appearance to be weak, so they'll ignore them. But Erik(who is also on board)told the Major that the jolly roger of that ship belongs to the Straw Hat Pirates lead by Monkey D. Luffy, the 30,000,000 Belli bounty head pirate. And for that Erik finds ignoring a wanted pirate to be unwise-able. And insists they seize the ship. Usopp(who's taking watch on the crow nest) saw the Marine fleet coming their way. Apis recognize the division as the one she escaped from. Luffy and the crew learned that fleet is after Apis. A marine spotted Apis with his binoculars, and told the Major that the Going Merry has Apis on board. Erik was pleased to found out that Apis is with the Straw Hat Pirates. And told Major, on how upset Admiral Nelson would of been if he'd ignore the Going Merry without knowing that Apis was on board. The Major got scared for thinking about what would of happened. He orders his men to fire the cannons. The cannons missed, and Major used his megaphone to tell the Going Merry that was only a warning shot, while the next one will hit them. Zoro and Luffy plan to fight off the fleet, while Usopp finds that to be crazy. Apis on the other hand noticed that all the seagulls are parched on ship. And knows that a gust of wind is about to come. So Nami told Zoro to face the sails south. Then the gust of wind came by and gave them a jump start towards south. Leaving the marines behind who are too slow to catch up. Erik finds it pathetic for a small ship to get away from a whole fleet. One of the Marines told the Major that the Going Merry is headed to the one place that is dangerous. So Major ordered the whole fleet to halt and reverse course. Erik wanted to know why the Major would stop the ships from pursuing the Straw Hat Pirates. The Major mentions that if they continued to proceed, they'll get trapped at the Calm Belt. Erik remained Major that if they don't rescue Apis, Major will have to face the consequences from Admiral Nelson. The Major however didn't care what his punishment will be. And won't risk his men to be harmed. Usopp and Luffy cheered that they got away from the Marines in sheer luck. Nami noticed Zoro looking serious and wanted to know why. Zoro couldn't help but feels as if they're not moving at all. It's true as there's no gust of wind at all. Then Nami gave out a scream and realized that they've entered the Calm Belt!—J LeGault"], "genres": "N/A", "imdbID": "0970336", "rating": 7.0, "votes": 1377, "number_of_episodes": 1147}