{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0167850": "Bill Cobbs", "0000893": "Ed Begley Jr.", "0420955": "Richard Jenkins", "0642522": "Ed O'Ross", "0534380": "Tim Maculan", "0005457": "Dina Spybey-Waters", "0476094": "Shishir Kurup", "0179167": "Jeff Corbett", "0212498": "Tim DeZarn", "0903946": "Lorinne Vozoff", "0830125": "David Stifel", "0612820": "Howard Mungo", "0831921": "Jessica D. Stone"}, "geners": ["Comedy", "Drama"], "runtimes": ["58"],  "plot": ["After a woman passes away in her sleep, her husband proves to be a very demanding client.", "Mildred Effinger \"Hattie\" Jones passes away in her sleep, leaving behind her gruff, crusty husband of 56 years who forcibly stays at the Fishers' even before the brothers can see him, and stubbornly insists they can't embalm his wife despite a 2-day wait on the service. Claire falls for Billy before learning of his odd nature, and gets some interesting news about Brenda. Ruth introduces David to Hiram, which naturally doesn't go well, and is pursued by the family florist, Nikolai. David is forced to admit to Tracy Montrose Blair his engagement is actually over without giving anything away in front of Ruth, and must forcibly reject her later. Nate looks through old business records and discovers Nathaniel respected his decision to leave, and took pay for certain funerals in odd ways - like purchasing drugs, or renting an apartment for free.—brainybrailler@comcast.net", "While going through his father's things, Nate comes across some odd entries in the family books and follows up with clients to see what it all means. It turns out his father was providing free funerals in return for services such oil changes for the vehicles or marijuana from someone who owns a garden store. Most interesting to him is that his father also had a run-down apartment where he used to spend time alone. Ruth is approached by Hiram, her former lover, but she says she doesn't want to resume their relationship. She also thinks that Nikolai the flower vendor is leering at her. Claire and Brenda's brother Billy spend a interesting together but is confused when he brushes her off the next day. When Hattie Jones dies in her sleep, her husband of 56 years proves to be a very demanding client for the Fishers.—garykmcd"], "genres": "N/A", "imdbID": "0702025", "rating": 8.6, "votes": 3017, "number_of_episodes": 63}