{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0000893": "Ed Begley Jr.", "0642522": "Ed O'Ross", "0085413": "Marina Black", "1018679": "Steven Pasquale", "0278000": "Stewart Finlay-McLennan", "0191044": "Michael Cudlitz", "0380912": "Gary Hershberger", "0532461": "Justina Machado", "1519675": "Giancarlo Rodriguez", "0943566": "Lisa K. Wyatt", "0425670": "Lori Harmon", "0221845": "Pat Destro", "6506194": "Jules Tearle", "0112890": "Jordan Brower", "6234273": "LaPamela Avant", "1465683": "Pamela Rickard", "0726939": "Robin Riker", "3467500": "Larry Ward"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["A divorced woman meets an unfortunate end while partying with her friends, and the family discusses renting out the home to a seniors' dancing group.", "Celebrating her divorce with wine and a limo ride, Chloe Margaret Bryant [formerly Yorkin] runs into a cherry-picker while hanging out of the sunroof. Rico, working at Kroehner's for extra money, earns fame for embalming her. Failing to realize he's been lying to them, or taking their supplies, Nate decides to hold square-dancing lessons to raise money in a slow time, and the instructor has an interesting reaction to David. Claire's outreach trip turns out to be a disappointment. Ruth is torn between Hiram and a jealous Nikolai. Nate has to deal with one of Brenda's old friends visiting, Just as business begins to rise again, Rico is convinced by his wife to leave Fisher & Sons for Kroehner's superior offer.—brainybrailler@comcast.net", "Business has been excruciatingly slow and Nate comes up with the idea of renting out their showing room to a Seniors' dancing group. Dave is lukewarm about the idea but changes his mind pretty quickly when he meets the instructor, who he is soon dating. Ruth is enjoying her new job at Nikolai's flower shop but it's apparent that he a bit jealous of her relationship with Hiram. Claire convinces her mother to let her go on an outward bound-type of camping week with other students but it doesn't quite go as planned. Nate and Brenda hit a rocky patch when she lets an old friend, Australian Connor Thompson stays with her. Rico accepts a one-off offer from Gillardi at Kroehner to prepare the remains of Chloe Yorkin who had an unfortunate encounter while standing upright through the sunroof of a limousine while partying with her friends. He also gets a permanent job offer from them.—garykmcd"], "genres": "N/A", "imdbID": "0701982", "rating": 8.0, "votes": 2587, "number_of_episodes": 63}