{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0000893": "Ed Begley Jr.", "0420955": "Richard Jenkins", "0642522": "Ed O'Ross", "0005457": "Dina Spybey-Waters", "0050156": "Eric Balfour", "0534380": "Tim Maculan", "0085413": "Marina Black", "0789171": "Timm Sharp", "0380912": "Gary Hershberger", "0693090": "Brian Poth", "0532461": "Justina Machado", "0083712": "Frank Birney", "0153108": "Nancy Linehan Charles", "1519675": "Giancarlo Rodriguez", "0500159": "Aaron Leigh", "0165760": "Terrell Clayton", "0914534": "Cameron Watson", "0187843": "Frank Crim", "0574535": "Jamie McShane", "0849522": "Hayden Tank", "1055669": "Maximillian Kesmodel", "0319831": "Sandra Lee Gimpel", "1098160": "Darren Le Gallo", "1307769": "Marty West", "0925033": "Julie White"}, "geners": ["Comedy", "Drama"], "runtimes": ["60"],  "plot": ["A simple game of golf results in the death of a woman.", "Matthew Gilardi discusses the difficulties of convincing the Fishers to sell to Kroehner's with his superior Mitzi Dalton Huntley while golfing, and one of the balls hits Tracy Montrose Blair's aunt Lillian Grace Montrose. Tracy is her usual difficult self while refusing to sign the Fishers' service contract, changing her mind completely about what kind of service to have, and being finicky over the only coffin available of the chosen kind, but shows a different side of herself when revealing why she's so devoted to keeping this funeral perfect. Claire is unaware that Gabe robs a convenience store, but still fears for him when she dreams that her father predicts his life won't last much longer. Father Jack is reprimanded for presiding over a lesbian marriage, and when the deacons get to an argument over this David is forced to voice his opinion as a tie-breaking vote, so his secret is revealed and he is dismissed quietly in order to keep Fr. Jack there. Ruth and Hiram decide their relationship has lost its original touch and each have found a partner; in Ruth's case, it's Nikolai. Brenda is troubled by Billy's unhappiness with institutional life and argues with Nate about him - and they're involved in a car accident that may have dangerous consequences for at least one of them.—brainybrailler@comcast.net", "Hiram has some news for Ruth when they go out dinner but it's Hiram who is left surprised at the outcome. Claire and Gabe go to a party at her friend Parker's house. While Gabe seems to have turned over a new leaf, it soon becomes apparent that he is not only falling into his old ways but actually heading into even more dangerous territory. Claire is unaware of what he is up to. At his church, Dave is forced to take a stand when Father Jack is under threat of dismissal for having married a lesbian couple. Dave reveals his homosexuality and Father Jack keeps his job but he is surprised when someone he trusted asks to resign as Deacon. At the funeral home, ditsy Tracy Montrose Blair asks David to make arrangements for her aunt, Mitzi Huntley, who was recently killed when hit by a golf ball. Despite repeated requests, he is unable to get to actually sign the contract and she is constantly changing her mind about the arrangements. Brenda meanwhile continues to feel ongoing guilt about committing her brother Billy leading to yet another fight with Nate. This time however, they argue in the car leading to an accident. The resulting medical tests reveal something serious.—garykmcd"], "genres": "N/A", "imdbID": "0701999", "rating": 8.7, "votes": 2696, "number_of_episodes": 63}