{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0001026": "Joanna Cassidy", "0289343": "Robert Foxworth", "0366573": "Veronica Hart", "0644897": "Sandra Oh", "0534380": "Tim Maculan", "0004284": "Cristine Rose", "0480465": "Jordan Ladd", "0005457": "Dina Spybey-Waters", "0635728": "David Norona", "1478267": "Joyce Greenleaf", "0461679": "Terence Knox", "0831921": "Jessica D. Stone", "6502543": "Timothy Lynn Greer"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["An adult film star electrocutes to death in her bathtub, which leads to a memorial service that is anything but ordinary.", "Nate finally gets to meet some of Brenda's family. he's invited to dinner but gets there to find that he is the only guest. He learns a lot about Brenda and gains some insight into her history and background. He also gets to meet her brother Billy who has moved in with her for a while. Dave is pleased when his Minister asks him to become a Deacon at the church, a post his father occupied prior to his death. His refusal to reveal that he is gay leads to a break-up with Keith however. Ruth is worried about Claire and attends a counseling session at school with Claire. She would like the two of them to be closer, as was the case when Claire was younger. She decides to visit a relative to show Claire what a close mother-daughter relationship can be like. At the funeral home, Rico is faced with a unique problem when Jean Louise MacArthur aka porn star Viveca St. John is brought in after being electrocuted in her bath tub. The memorial service is anything but ordinary.—garykmcd", "Jean Louise McArthur, better known as adult film star Viveca St. John, is electrocuted in the tub by her cat. This makes it difficult for David to recommend the funeral home over the Episcopal church the family attends, where he now accepts the role of deacon...and loses Keith for not wanting to let anyone at church know that he's gay after Nate finds out. Claire has sessions with a guidance counselor and, in a chance to become closer to Ruth, is literally taken to Ruth's cousins', where the visit is nothing either of them expect. And Nate gets to meet Brenda's weird brother and dines with her parents (without Brenda), where he learns what her tattoo signifies and more secrets.—brainybrailler@comcast.net"], "genres": "N/A", "imdbID": "0701976", "rating": 8.3, "votes": 2902, "number_of_episodes": 63}