{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0420955": "Richard Jenkins", "0050156": "Eric Balfour", "0380912": "Gary Hershberger", "0005457": "Dina Spybey-Waters", "0534642": "Sharon Madden", "0849522": "Hayden Tank", "1055669": "Maximillian Kesmodel", "0026617": "Dennis Anderson", "0737700": "Harper Roisman", "0481683": "Dennis Lau", "0312302": "Audrey Gelfund", "0341227": "Jennifer Griffin", "3464299": "Nasi Glekas", "1760145": "Annabella Gutman", "0630369": "Tara Nicole Hughes", "1024584": "Ralph Kampshoff", "0534380": "Tim Maculan", "0005438": "Jeremy Sisto", "1751142": "Warren Stearns", "0863462": "Theresa Tilly", "0951838": "Lynnanne Zager"}, "geners": ["Comedy", "Drama"], "runtimes": ["63"],  "plot": ["When the funeral director is killed in an accident, the family comes together to mourn and decide the fate of the funeral home.", "On Christmas Eve, 2000, funeral-director Nathaniel Samuel Fisher is involved in a hearse-accident with a bus and is killed. Ruth Fisher has a hard time coping, so can't bring herself to identify her husband's body at the morgue. David, the secretly gay younger son who remained at home to help with the family business, feels nothing but dismay at the prospect of now continuing his hated job for good, and focuses on keeping everything in order for the newest funeral. Claire Fisher gets the news just after smoking crystal at a party, and is forced to hide it. Nate Fisher returns home just in time to learn of the death after making out with fellow plane passenger Brenda Chenowith in an airport supply closet, and is forced to keep Claire's secret, console Ruth when she confesses she'd been cheating on Nathaniel, and take abuse from David for conversing with embalmer Federico Diaz, not helping him or forcing the others to swallow their grief, and insisting that David unleash his own. Then, before before Nathaniel Fisher is cold in his grave, David gets an invitation from funeral-home chain Kroehner Services to join.—brainybrailler@comcast.net", "Long-absent Nate Fisher returns home for Christmas but arrives to learn that his father Nathaniel, who was to meet him at the airport, was involved in a car accident en route and was killed. Nathaniel Fisher was the head of the family business, Fisher and Sons Funeral Home and the family is, to say the least, dysfunctional. Mother Ruth is an up tight perfectionist as his her younger son, David, who joined the family business but had dreams of going to law school and hates what he does. Daughter Claire is rebellious, exploring her sexuality and smokes crack for the first time just as she learns of her father's death. Nate can find little time for himself nor can he easily relate to his mother or his siblings. He has met a woman at the airport, Brenda Chenowith, with whom he has sex in a closet but they too seem unable to connect very easily. Nate must decide is he is to stay or leave.—garykmcd", "When a man dies, the family comes together to mourn and decide the fate of the family funeral home. Nate, who works for an organic grocery store in Seattle, has to deal with more than just the death of his father. His mother, Ruth, is taking the death especially hard because she had been having an affair with her hairdresser, Hiram. David, the closeted homosexual who has helped with the business, has a difficult transition running things. Claire, the youngest of the clan, is a teenager in high school trying to get comfortable in her own skin. On top of everything the family is already going through, they have a corporate funeral company hounding them to sell out.—Anonymous"], "genres": "N/A", "imdbID": "0702006", "rating": 8.7, "votes": 4836, "number_of_episodes": 63}