{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000893": "Ed Begley Jr.", "0420955": "Richard Jenkins", "0585429": "Tracy Middendorf", "0944886": "Missy Yager", "0222647": "Mark Devine", "0050156": "Eric Balfour", "0380912": "Gary Hershberger", "0532461": "Justina Machado", "0669254": "Daniel Zacapa", "1055669": "Maximillian Kesmodel", "0672005": "Richard Penn", "2512921": "Melissa Egan", "1510153": "Chip O'Neil", "0258371": "Van Epperson", "1024584": "Ralph Kampshoff", "0849522": "Hayden Tank"}, "geners": ["Comedy", "Drama"], "runtimes": ["52"],  "plot": ["The family attends the reading of Nathaniel's will. A widow is unable to pay the funeral bill after her late husband leaves her with a mountain of debt.", "Chandler James Swanson dives too sharply into his pool and drowns...and leaves his family not with the multi-million-dollar pyramid scheme business they thought he had, but a mountain of debt. Nathaniel's will gives Ruth all his money, Claire an unwanted trust fund, and David and Nate the funeral business. Nate tries to give it to David or Ruth, but neither will take it, so he's glad to get Matthew Gilardi's offer to join Kroehner, but first has to convince David. With their client having too little money to even buy the $9000 casket already ordered and David and Rico unavailable, Nate decides to help her out by temporarily using the coffin at Swanson's funeral, then cheaply cremating him and selling the casket to another client...before learning he can neither reuse nor resell it legally. Meanwhile, David's ex-fiancée Jennifer Mason comes with belated sympathy for his father, and says Nathaniel hinted that he realized David was gay. Ruth goes hiking with her boyfriend Hiram again, but this time chooses to make it the last. Nate is bewildered by David's lack of emotion toward their father's loss - even seeing his totaled, bloody hearse makes him feel nothing (except betrayal), until Brenda makes a shocking move with surprising results.—brainybrailler@comcast.net", "The family attends the reading of the will and not much is as expected. While Ruth gets the proceeds of a hefty insurance policy, Nate and David finds themselves as the co-owners of the business. Dughter Claire finds out that her father left her a trust fund to pay for her college education but if chooses not to continue her education, she won't have access to the money until she is 25 years old. The business is also having to face financial difficulties when the wife of the recently deceased Chandler Swanson is unable to pay the funeral bill. Nate agrees to speak to Mrs. Swanson about her financial situation. Ruth meets her lover who wants to take her away from it all and David's former fiancée drops by to pay her respects.—garykmcd", "While discussing a franchise pyramid scheme at a get-together around a pool, Chandler James Swanson dives in but doesn't come back up. Nathaniel Fisher's will is read and Ruth gets money, stocks and insurance money. Nate and David are both given the funeral business. Claire receives college tuition, but she considers trading it in for cash. In an effort to help Swanson's widow, Nate starts learning a few things about the funeral business. First up, caskets cannot be rented. By law, a used casket cannot be resold.—Anonymous"], "genres": "N/A", "imdbID": "0702031", "rating": 8.0, "votes": 3295, "number_of_episodes": 63}