{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0642522": "Ed O'Ross", "0343444": "Mary Gross", "0050156": "Eric Balfour", "0532461": "Justina Machado", "1026427": "Michelle Ruben", "0380912": "Gary Hershberger", "0769446": "Wendy Schaal", "0010772": "Blake Adams", "0146941": "Patrick Cavanaugh", "0491085": "Veronica Lauren", "0001280": "Jenette Goldstein", "0112063": "Joel Brooks", "0614299": "Harry S. Murphy", "0458868": "Linda Klein", "0882139": "David Ursin", "0234606": "David Doty", "0389468": "Steve Hofvendahl", "0107582": "Jonathan Brent"}, "geners": ["Comedy", "Drama"], "runtimes": ["60"],  "plot": ["Nate and Dave travel to Vegas in order to attend a convention for funeral directors. A newborn child dies from a case of SIDS.", "3-week-old Dillon Michael Cooper suffers SIDS - an extremely uncomfortable charge for the Fishers as far as comforting the family but even more so for Rico, since his wife is currently pregnant for a second time. After Gabe's suicide attempt fails, Claire lies to Ruth that his drug overdose was an accident and points out that she, not his uncaring family, should help. David, Nate, and Brenda go to Vegas for a funeral directors' meeting where Nate informs Gilardi he knows what the arsonist's motive was, David meets Keith under unpleasant circumstances just after being caught with a male prostitute, and Nate and Brenda have an equally unpleasant encounter with Billy though have different opinions on how best to deal with it. To avoid all her floral arrangements looking like those in funerals, in between worrying about whether David really is gay and what it means for their relationship, Ruth takes a class on arranging which also instructs how to use instinct.—brainybrailler@comcast.net", "Nate and Dave are off to Las Vegas to attend a funeral directors convention. Brenda decides to tag along as well. Dave is a little stressed as he is scheduled to make a speech - originally scheduled to be given by his father - on the future of independent funeral homes. Kroehner Services is represented in force, including Gilardi. Nate and Brenda are having a good time until they realize that her disturbed brother Billy has followed them there. David seeks some company but ends up in jail; he can think of only one person to turn to for help. Back home, Nikolai tells Ruth that her flower arrangements are, well, too funereal. She signs up for a flower arranging course that also gives her a new way to look at things. With everyone else away, Rico has to deal with the case of a 3 week-old baby who died of SIDS. With his own wife about to give birth, he's barely able to function.—garykmcd"], "genres": "N/A", "imdbID": "0702029", "rating": 8.3, "votes": 2499, "number_of_episodes": 63}