{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0001026": "Joanna Cassidy", "0289343": "Robert Foxworth", "0001152": "Illeana Douglas", "0642522": "Ed O'Ross", "0050156": "Eric Balfour", "0005457": "Dina Spybey-Waters", "0019950": "Jed Allan", "0082517": "John Billingsley", "0789171": "Timm Sharp", "0769446": "Wendy Schaal", "0943566": "Lisa K. Wyatt", "0539305": "Irina Maleeva", "0038192": "Elena Arzhanik", "0853238": "Tate Taylor", "0809894": "Scott Alan Smith", "0724437": "Bob Richardson", "0003737": "Jim Brooks", "0911175": "Lynn Wanlass"}, "geners": ["Comedy", "Drama"], "runtimes": ["60"],  "plot": ["An egocentric husband is killed with a frying pan after his wife finally has enough of his mouth.", "At breakfast, egomaniacal Jonathan Arthur Hanley receives a blow on the head with a frying-pan when his wife finally has enough of his mouth. Rico's replacement David and Nate find is difficult to reason with and informs Ruth she's convinced David is gay. Nate confronts Billy after he displays a degrading picture of him at an art gallery, and Brenda too grows disgusted with him when his parents reveal what he actually did instead of attempting suicide years before...but not enough to believe he should be institutionalized as they do. Ruth shows her feelings about Nikolai, and a rival shows her feelings about her. David meets Keith at a food distribution and is disappointed to learn his feelings for him aren't mutual. Claire is concerned with Gabe's continued possible depression without any support from his family, especially when she picks up on an underlying message in his words to her.—brainybrailler@comcast.net", "Dave and Nate interview a number of possible replacements for Rico and of the three candidates they meet settle on Angela who is quite talented but quite unorthodox in her dress and quite open about her life. Ruth and Nikolai go out for dinner and she is accosted by another woman who accuses her of stealing Nikolai away from her. Brenda is still having to deal with her brother Billy only this time it's her parents who have decided that he should be institutionalized. They want Brenda to talk him into it however. Dave tries to rekindle his relationship with Keith. Claire also tries to rekindle her relationship with her old boyfriend Gabe but is worried about him.—garykmcd"], "genres": "N/A", "imdbID": "0702021", "rating": 8.3, "votes": 2537, "number_of_episodes": 63}