{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0889846": "Jacob Vargas", "0101603": "Lombardo Boyar", "0613687": "Karmin Murcelo", "0380912": "Gary Hershberger", "0005457": "Dina Spybey-Waters", "0113194": "Candy Ann Brown", "0606487": "Dean Norris", "0883620": "Armando Valdes-Kennedy", "0735300": "Elizabeth Rodriguez", "0673637": "Tony Perez", "0338144": "Mary-Pat Green", "0008949": "Ken Abraham", "0892323": "Roger Velasco", "0752595": "James Leo Ryan", "0007132": "Blaine Pate", "0733287": "Luis Robledo", "3425823": "Greg Bronson"}, "geners": ["Comedy", "Drama"], "runtimes": ["52"],  "plot": ["When a gang member is shot, his family requests that he is buried, but the gang's leader wants it done a different way.", "The police are investigating the fire across the street and it's clear that the police suspect a member of the family. Claire is their first choice. Nate and David find themselves caught in the middle between a family and a gang leader when 'Paco' Bolin is killed by a rival gang. The family want to bury their son but his gang leader, 'Powerful', wants it done his way. The business is in dire need of the money so they get Rico to try and settle any disagreement. David and Keith are called fags in a parking lot and Keith can't comprehend David's passive reaction to the slur. Nate invites Brenda over for dinner and they are caught by his mother in a compromising situation.—garykmcd", "Mexican-American gang member Manuel Antonio \"Paco\" Bolin is shot by a rival while trying to call for help after his car breaks down. David asks Rico to speak to his gang leader, sensing their tension around him, but manages to insult him by suggesting he'll understand more about the gang. Later, he and Nate meet Gilardi to inform him, again, they won't sell, and David is inspired to be more aggressive. Keith also encourages him to be more assertive and less self-loathing when it comes to his sexuality. Nate and Brenda are questioned about the fire, but at home suspicions mount that Claire is the arsonist, especially when she attempts to befriend gang leader \"Powerful\".—brainybrailler@comcast.net"], "genres": "N/A", "imdbID": "0701991", "rating": 8.3, "votes": 3056, "number_of_episodes": 63}