{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0050156": "Eric Balfour", "0693090": "Brian Poth", "0112063": "Joel Brooks", "0851833": "Arthur Taxier", "0573494": "Joan McMurtrey", "0532461": "Justina Machado", "0635728": "David Norona", "0165760": "Terrell Clayton", "0787340": "Zach Shaffer", "0668320": "Eric Payne", "0305450": "Ted Garcia", "0808843": "Jason Matthew Smith", "0717146": "Billy Rieck", "0421753": "Gunther Jenson", "0804035": "Stewart Skelton", "0050332": "Alan Ball"}, "geners": ["Comedy", "Drama"], "runtimes": ["60"],  "plot": ["A gay couple is attacked and one of them is killed, causing controversy among the family and a confession to be made.", "A pair of young gay men is attacked, resulting in Marc Foster, Jr's death. With citizens arguing over the morality or immorality of the situation, David feels extreme discomfort on his being gay, making it even more daunting when he is encouraged to confess it to Ruth. So does Keith, instructed to deal with any troublemakers who attend the funeral. Nate tries to convince Brenda that Billy should receive treatment as their parents suggested after he attacks him, but Brenda doesn't get it until it happens to her.—brainybrailler@comcast.net", "Billy's behavior is growing ever more erratic. A practical joke on Nate leaves him feeling threatened but Brenda refuses to take any action to have him committed. Nate fears come true when Brenda becomes the next victim. At the funeral home, they have the case of a young man, Marc Foster, who was beaten to death in a gay bashing. Dave, who has always been reticent to proclaim is sexual preferences, tells Rico who is apt to make jokes about \"homos\". He also decides it's time to tell his mother. It also leads to Dave to take direct action against a heckler at the Foster funeral.—garykmcd"], "genres": "N/A", "imdbID": "0701974", "rating": 8.8, "votes": 2802, "number_of_episodes": 63}