{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000715": "Caroline Aaron", "0420955": "Richard Jenkins", "0050156": "Eric Balfour", "0380912": "Gary Hershberger", "0849522": "Hayden Tank", "0135306": "John Capodice", "0700944": "Sandra Purpuro", "0839836": "Carol Ann Susi", "0137583": "Christina Carlisi", "0059863": "Joe Basile", "1641925": "Lindsey Parks", "0067506": "Marty Belafsky", "0584091": "Christopher Michael", "1098160": "Darren Le Gallo", "0868465": "Scott Torrence", "0445233": "Eric Keith", "0562035": "Lenora May", "9415055": "Bean", "0005438": "Jeremy Sisto", "0933585": "Jenna Z. Wilson"}, "geners": ["Comedy", "Drama"], "runtimes": ["53"],  "plot": ["The family considers selling the business. Their latest client had an unfortunate accident with an industrial dough-mixer.", "While cleaning a dough-mixer from the interior, Thomas Alfredo Ramono gets caught in his aide accidentally activating it. Nate agrees to sell to Kroehner's, with Ruth's support (and David's opposition overruled), but changes his mind when he hears another's view of Gilardi so is forced to reconsider if this easy choice is the best one. Gabe reveals that he and Claire slept together, resulting in mockery from half the school, so she decides to get revenge on him in a disturbing, sick move. Ruth's friend Amelia makes it over to offer sympathy and eventually succeeds in raising her spirit by gambling at the racetrack...but Nate and David sink it again after it already falls when her luck reverses. Just as Claire returns with more bad news for the family, an apparently good piece of news comes up: the cheap crematorium Gilardi planned to open in the house across the road burns down...but the timing, between Claire's recent suspicious actions, Nate's brutal rejection of Gilardi, and his and Brenda's sleeping there hours earlier, doesn't look good for the Fishers in the short run.—brainybrailler@comcast.net", "The Fishers have decided to sell, but then back out at the last minute because Nate cannot stand Gilardi. Claire finds a rather interesting way to get back at Gabe for spreading rumors about her. Gilardi find his own way of payback: by buying the rundown house across the street from them in order to provide a cheap alternative to Fisher & Sons. However, the house mysteriously catches on fire after Nate and Brenda fool around in it.—Anonymous", "Nate is trying to talk the family into selling the business to Kroehner Services. He gets his mother's support and makes a deal with Kroehner but gets an an attack of the guilts and re-visits his decision. The company starts to make good on its threat to put them out of business in six months. Claire finds that her recent encounter with her now former boyfriend is known throughout the school. She has her own plans for revenge. Their latest client, Tommy Romano, presents many challenges not the least of which is that he is now in several pieces having had an unfortunate encounter with an industrial dough mixer. He's also missing a body part. Nate and Brenda continue to see each other but she has her own secrets. Ruth and a friend go to the track for the day but it isn't as therapeutic as she had hoped.—garykmcd"], "genres": "N/A", "imdbID": "0702016", "rating": 8.3, "votes": 3159, "number_of_episodes": 63}