{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0000893": "Ed Begley Jr.", "0642522": "Ed O'Ross", "0931898": "Wade Williams", "0768620": "Raphael Sbarge", "0454020": "Brian Kimmet", "0083712": "Frank Birney", "0534380": "Tim Maculan", "0635728": "David Norona", "0153108": "Nancy Linehan Charles", "0912102": "Eric Ware", "1116889": "Davis Henry", "0614270": "Gary Murphy", "0574571": "David McSwain", "3640988": "George Peña", "0085413": "Marina Black", "0082563": "Ange Billman", "1023021": "Shannon Convery", "0592081": "Dianna Miranda", "1963946": "Luke Sabre", "0103508": "Matt Bradshaw", "2254687": "Raphael Gamon", "0112063": "Joel Brooks", "0179960": "Annie Corley"}, "geners": ["Comedy", "Drama"], "runtimes": ["51"],  "plot": ["The family must persuade the angry brother of a war veteran who died of lung disease that his brother should receive a military-honoring burial.", "Gulf War First-class Private Victor Wayne Kovich finally passes away after years of suffering lung disease, and Nate must persuade Daivd and the man's angry brother that he should receive a military-honoring burial as he wished. Claire prepares for the PSAT test she doesn't care about and wonders how much better her life will turn out compared to others'. Ruth takes a job at Nikolai's shop and invites Hiram to join them for a meal (prepared by him). Rico, angry that Nate plans to take a weekend trip with Brenda to the desert, professes the Fishers' lack of appreciation to him just before getting a call from Gilardi. As for Nate's plans, just as they're accepted grudgingly by Rico and David, a turn of events might throw them.—brainybrailler@comcast.net", "Much to Dave's annoyance, Nate plans to take the weekend off and go away with Brenda. Things don't go quite as planned when Brenda's brother Billy, apparently off his meds, has a crisis. Rico also is not happy with his situation and with a new baby on the way decides to listen to a offer from Gillardy at Kroehner Services. Ruth meanwhile decides to invite her boyfriend Hiram over for dinner and introduce him to the family. She also decides to do something about her life and gets a job at Nikolai's flower shop. Paul Kovitch asks the Fishers to make arrangements for his brother Victor's funeral. Victor was a war veteran and suffered from Gulf War Syndrome but Paul wants nothing to do with the military and doesn't want a funeral or a service. When Nate learns that the dead man wanted a military funeral, he tries to change Paul's mind.—garykmcd"], "genres": "N/A", "imdbID": "0701979", "rating": 8.0, "votes": 2639, "number_of_episodes": 63}