{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0005438": "Jeremy Sisto", "0341737": "Rachel Griffiths", "0000893": "Ed Begley Jr.", "0642522": "Ed O'Ross", "0050156": "Eric Balfour", "0085413": "Marina Black", "1018679": "Steven Pasquale", "0789171": "Timm Sharp", "0769446": "Wendy Schaal", "0545998": "Ted Marcoux", "0920169": "David Wells", "0566783": "Matt McCoy", "0710632": "Dale Raoul", "0165760": "Terrell Clayton", "1706019": "Jake Gridley", "1230639": "Hal Ozsan", "0317276": "Louan Gideon", "1152545": "Gabriel Cade", "0003737": "Jim Brooks", "1913694": "Johnny Drocco", "0420955": "Richard Jenkins", "1422570": "Robert Laughlin", "1047150": "Jull Weber"}, "geners": ["Comedy", "Drama"], "runtimes": ["60"],  "plot": ["A boy accidentally shoots and kills himself while playing with a gun, and his mother is nearly comatose with grief.", "While babysitting, Gabe kicks his little brother out of the room so he and Andy can get high, but Anthony Cristopher Finelli ends up playing with a gun and it goes off. Claire tries to support Gabe since no one else bothers trying, and Nate has to deal with his abusive stepfather when he arrives at the funeral. David goes with Kurt to a disco where he gets some ecstasy, and later hides it in the aspirin. Unfortunately, this appears to be a weekend where the family has a case of headaches, so he has to inconspicuously question Claire if anything unusual happened after she treated hers, and never suspects that Ruth took some on her camping trip with Hiram. Brenda gets Nate to act as a potential customer for some local funeral homes so he can get into the feel of his job.—brainybrailler@comcast.net", "Brenda decides that Nate needs some perspective in his new job and decides that he should visit other funeral parlors to see how they deal with families. Posing as a married couple, it proves to be a bit of an eye opener for Nate but Brenda goes just a little too far in her role playing. Dave and Kurt go out on a date and takes ecstasy at a disco. He also takes some home with him but hides them in a pill bottle not realizing that mother Ruth will be taking some on her weekend camping trip with Hiram. Claire spends time with her old boyfriend Gabe after his 6 year-old brother accidentally shoots and kills himself. Gabe's mother is nearly comatose with grief and she helps him deal with his own sense of guilt. Rico decides it's time to move on from Fisher and Sons.—garykmcd"], "genres": "N/A", "imdbID": "0702000", "rating": 8.6, "votes": 2707, "number_of_episodes": 63}