{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0050156": "Eric Balfour", "0532461": "Justina Machado", "0925033": "Julie White", "0000481": "Alice Krige", "1191866": "Page Kennedy", "0914424": "Tuc Watkins", "0789171": "Timm Sharp", "0387432": "Judith Hoag", "0112063": "Joel Brooks", "0380912": "Gary Hershberger", "0085413": "Marina Black", "0584777": "Nicki Micheaux", "1156144": "Aysia Polk", "0420646": "Eddie Jemison", "0860184": "Grant Thompson", "0500159": "Aaron Leigh", "0846663": "Brian Tahash", "0356101": "Shashawnee Hall", "0293360": "Dee Freeman", "0565197": "Julianna McCarthy", "0593497": "Katie Mitchell", "0154632": "Ricardo Chavira", "0581518": "Susan Merson", "0036439": "Evan Arnold", "0425001": "Drake Johnston", "1485744": "Alex Quattlander"}, "geners": ["Comedy", "Drama"], "runtimes": ["58"],  "plot": ["A famous football player dies of dehydration during a strong training session, and the family is hired for the funeral services.", "A football player collapses of dehydration during a practice session, but doesn't die...but his fellow player and best friend Joshua Peter Lagmead is ignored as he falls a moment later. Nate and Brenda prepare to make her high-school boyfriend Trevor envious when he visits for dinner with his own family, but in between trying to succeed, Nate is plagued with visions of Josh weeping, afraid of what will happen to him in death, and does his best to ignore his presence. Robbie graduates from The Plan, and invites Ruth to be his witness, and she's intrigued by the positive outcome and free-spiritedness seen in all its graduates so considers enrolling. David tries to keep contact with Keith as a friend, and when he tags by Keith's sister Karla's houses so he can give his niece Taylor a birthday gift, Taylor becomes intrigued on their relationship, while Keith is angry with his relapsing drug-addict sister for neglecting Taylor. Claire learns that Gabe stole embalming fluid from the Fishers to create a more powerful drug substance, though doesn't reveal it to an investigating cop...before learning he robbed the store, causing her to refuse to help anymore. Rico requests a $20,000-loan for his family's first house, and is disgusted both when he's forgotten to the offer of a modern casket-display wall, and when his sister-in-law Angelica gives one. Nate and David are even more disgusted, though, to learn there was a string attached when they bought the wall.—brainybrailler@comcast.net", "Nate doesn't let on about his medical condition to anyone but he's really stressed about the situation. He can't open up to Brenda who is still remote and withdrawn. She decides decides to invite an old boyfriend and his family to dinner but then wonders what she was thinking. Rico's wife Vanessa finds her dream home but they're a little short on the down payment so he turns to Nate and Dave for a loan. They decide to invest in a casket display wall to boost sales leaving them little to share with their employee. They also get something of a surprise after it's installed. At school, Claire accuses Gabe of stealing chemicals from the funeral home after one of his friend's freaks out. He finally tells her the kind of trouble he's in. At the flower shop, Ruth's co-worker asks her for a special favor. With his own medical conditions on his mind, Nate has to deal with the grieving family of a young football player who collapsed and died on the playing field.—garykmcd", "When the football player Joshua Peter Langmead dies of dehydration after a strong training, the Fishers are hired for the funeral services. Brenda invites her former sweetheart Trevor, his wife Dawn, and their son Will for a dinner with Nate. Rico asks for a US$ 11,000.00 loan to David and Nate to buy a house for his family, but David decides to buy an Appleby casket wall instead. The executive of Kroehner, Mitzi Dalton Huntley, makes another offer to buy the Fishers' business. Claire finds that Gabe stole a controlled substance for embalming corpses to make stronger marijuana and robbed a convenience store. Nate is haunted by the spirit of Josh and decides to tell his brother about his condition AVM and that he may have a stroke or an aneurysm any moment.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ruth Fisher has her first exposure to \"The Plan,\" after being invited by Robbie, her co-worker at the flower shop, to witness his graduation from the program; \"The Plan\" is a variant of the often controversial self-awareness/improvement group experience programs which gained popularity as part of the human potential movement.—russellld"], "genres": "N/A", "imdbID": "0702003", "rating": 8.2, "votes": 2227, "number_of_episodes": 63}