{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0001026": "Joanna Cassidy", "0289343": "Robert Foxworth", "0642522": "Ed O'Ross", "0915499": "Kellie Waymire", "1156144": "Aysia Polk", "0085413": "Marina Black", "0607175": "James Morrison", "0616766": "Kim Myers", "1035730": "Victor McCay", "0584777": "Nicki Micheaux", "0510853": "Ben Lin", "0453550": "June Kyoto Lu", "0160988": "Art Chudabala", "0498536": "Beverly Leech", "1519675": "Giancarlo Rodriguez", "0398293": "Scott Hoxby", "0003006": "Anita Finlay", "1396592": "Shawn Huang", "0101799": "Jenna Boyd", "0124703": "Paul Butcher", "0832652": "Gretchen Storms", "0588678": "Joshua Miller"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["While David and Keith try to iron out their problems, Karla has a secret that could pose trouble.", "Benjamin Srisal suffers a heart attack at home, requiring a Bhuddist service at Fisher & Sons that Nate gets a crash-course in how to conduct, but he's still got no answers as far as what should be done concerning Brenda and Lisa. Lisa apologizes for her outburst in the store but requests she have full custody of the child, causing him to be haunted by visions of the first child they conceived, as well as all the others he lost to abortion. David and Keith begin to argue again, especially after Karla accidentally hits and kills a homeless man on the street, and Taylor is too shaken to actually keep it secret and tells David under the pretense that it's a joke - David is troubled enough to tell Keith, but feels too guilty to report to the police as Keith does. After hearing her \"soul-twin\" parents have chosen to remarry, Brenda attends an orgy with Melissa where she sleeps with more than one man but then chooses to blame Melissa for her infidelity so breaks contact with her. Claire considers attending an arts college. Ruth returns Nikolai to his apartment prematurely at his request, but invites him to move in with her.—brainybrailler@comcast.net", "Nate is still adjusting to the thought of impending fatherhood when Lisa asks him to sign away his parental rights. He begins to have doubts about it all and feels guilt over his past. Claire takes an interest in photography and her first subjects are the deceased at the funeral home. Nate's more concerned with the possibility of law suits that any hidden talents she may have. In any event, her project for English class doesn't go down quite well. Her friend Parker gets into Yale but Claire didn't get into UCLA. Brenda sees a therapist, realizing that her anxiety level is up, even as she continues her many and varied sexual encounters. She and Nate drop in on her mother and find someone they know in residence. She also decides to go to a sex party with her friend Melissa but reconsiders what she's been doing the next day. David and Keith are living together but bickering. David's in a bit of a bind when Taylor tells him her mother struck a man with her car. Ruth helps Nikolai move back to his apartment but when she starts cleaning and tidying, realizes that she could never live there. At the funeral home, the Fishers have to arrange a Buddhist funeral when a man drops dead in his driveway. Dave has the requirements down pat.—garykmcd", "While pushing the garbage can to the sidewalk, Benjamin Srisai has a heart attack and dies on his lawn. His family hires a Buddhist service with David and Nate. Lisa asks Nate to sign papers giving the guard of the baby to her. Keith and David have some troubles in their relationship. Nikolai decides to return to his home, and Ruth cleans his apartment and invites him to move to her house. Claire takes pictures of the corpses for her homework, but her teacher does not like them and fails her in the exam. Brenda has a session with a psychoanalyst, wishing to have sexual encounters with strangers without feeling edgy. Nate and Brenda have dinner with Margaret Chenowith and she informs that she is living again with her husband, Dr. Bernard Chenowith. Karla hits a beggar on the street and is arrested later. Claire visits the East Valley facility to see if she will study there. Brenda goes with Melissa to a sex party on Saturday night and has sex all the night with a couple. Meanwhile, Nate has a nightmare with the children that his partners have aborted or miscarried. Brenda breaks off with Melissa, blaming her for her behavior, while Nate unsuccessfully deals an arrangement for the baby with Lisa.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702026", "rating": 8.1, "votes": 2028, "number_of_episodes": 63}