{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0280245": "Glenn Fitzgerald", "0642522": "Ed O'Ross", "0236952": "Larry Drake", "0532461": "Justina Machado", "0085413": "Marina Black", "0005424": "Grant Show", "0622535": "Geoffrey Nauffts", "0640055": "Deirdre O'Connell", "0685755": "John Paul Pitoc", "0736263": "Daniel Roebuck", "0910328": "Patrice Walters", "1043358": "Allison Kyler", "1516737": "Brian Shakti", "2336925": "Chuck Slavin"}, "geners": ["Comedy", "Drama"], "runtimes": ["59"],  "plot": ["In the Season Two finale, Nate must take action with his AVM while also dealing with a troubled Brenda.", "Aaron Buchbinder passes away painfully shortly after Nate arrives to visit (after he argues with Ruth about her visiting and photographing his daughter Maya). Kroehner's last act against the Fisher & Sons funeral home is to hire an inspector to examine the place, and they're fined for the problematic drainage system. Nate has a bleed requiring a cranial surgery to cure. Vanessa encourages Rico to ask for permission to be a partner since he has the money to pay the fine, and he's given 25% of it only when Nate reminds David he may need a replacement for Nate. Ruth quits her job at Nikolai's since she feels they can't easily share an environment. Claire goes to an interview at LAC but remembers her father's loss was the reason she began artwork, so cries for the first time since his death. Nate goes by to see Brenda one last time to attempt reconciliation and announce he'll be getting surgery, and finally tells Ruth about the surgery and its cause on their way back from seeing Maya. Ruth, still trying to keep control, insists Claire and David go to the gradation Claire doesn't care about rather than be with Nate. At the hospital, Nate receives anesthesia and dreams that he's running in the desert when a bus pulls up next to him. He boards it to find it's empty and doesn't start moving...yet.—brainybrailler@comcast.net", "Fisher and Sons find themselves undergoing an unexpected inspection after someone files a complaint. Dave is pretty sure he knows where that came from. It results in costly repairs being required and without money, Nate and Dave are facing having to close the business, at least for a while. Rico and Vanessa's good fortune comes at a good time given these developments and his continuing interest in a partnership. It's graduation time for Claire, who has little interest in attending. Claire also has her interview for LAC Arts college with an interesting and unexpected reaction on her part. Nate and Brenda have a heart to heart talk about their feelings and their future. Nate visits Aaron Buchbinder who is in the last moments of his life. Nate helps him pass on and the experience results in him arranging for his own surgery.—garykmcd", "Ruth takes lots of pictures of Maya, upsetting Nate, and he visits Aaron Buchbinder, who is agonizing and finally dies. There is an inspection of DCA in Fisher's Funeral, and they are severely fined. Rico buys 25% of the society for US$ 75,000.00 and saves their business. Claire goes to the LAC-Arts for interview, and she recalls her father and cries. Taylor moves to her grandparents' house, because Keith is suspended. Brenda faces that she is sexually addicted and goes to therapy. Nate has a bleed and needs a cranial surgery, and he goes with his mother to visit the baby, and he finally tells her about his surgery. Ruth quits the job in Nikolai's shop. Claire has a conversation with Nate, and he visits Brenda. Ruth goes with him to the hospital, and Claire and David do not go to her graduation, going also to the hospital.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702018", "rating": 9.2, "votes": 2626, "number_of_episodes": 63}