{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0420955": "Richard Jenkins", "0000666": "Lili Taylor", "0642522": "Ed O'Ross", "0000539": "Dina Meyer", "0915499": "Kellie Waymire", "1156144": "Aysia Polk", "0112063": "Joel Brooks", "0534380": "Tim Maculan", "0004957": "Leeza Gibbons", "0584777": "Nicki Micheaux", "0306832": "Ashley Gardner", "0258632": "Stephanie Erb", "0901679": "Ilia Volok", "1182011": "Timothy V. Murphy", "0631381": "Joe Nieves", "0254760": "Chris Ellis", "0452014": "Michael Khmurov", "1586679": "Linwood Porter"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["Ruth continues to help an injured Nikolai recover; Brenda's escapades help her to write, but her feelings about being engaged grow muddled.", "A construction worker's metal lunch-pail falls from his perch on the building and strikes Dwight Edgar Garrison on the head - resulting in a major family conflict between his current wife and her 2 stepdaughters from his first marriage, on whether he should be buried with his late wife or the widow. Besides having to deal with that, Nate remains unaware that Brenda is still seeing other men but wonders whether she still wants to marry him, or just does out of pity...and whether he should wed at all when Lisa meets him and announces she's pregnant with his child. Claire has doubts about her relationship with Billy, who's also throwing Brenda and her perspective on most of her relationships into confusion. David's relationship with Keith is strong, but Keith's life is troubled when Karla relapses into drugs. Meanwhile, just about everybody finds Nikolai to be a pain while Ruth's working - even Rico loses his sandwich to him. But Ruth is more concerned with the fact that he's in debt to Yuri, a loan shark.—brainybrailler@comcast.net", "Ruth is still working in the flower shop even though Nikolai is recovering from his broken legs at her house. She gets a visit from a scary character named Yuri and Nikolai tells her that his injuries weren't the result of a random robbery. Nikolai is also proving to be a demanding patient and driving everyone at home just a bit around the bend. Brenda finally learns of Nate's medical condition when he has a seizure at a most inopportune moment. He begins to wonder why she would still want to marry him. Brenda is still continuing her sexual activities and getting more fodder for her book. Dave and Keith meanwhile are still together but the sudden return of Keith's his sister, who he is convinced is still on drugs, is proving very stressful. Claire on the other hand has started to hang around with Billy Chenowith which is of considerable concern to Nate who has seen him at his worst. Claire tells him to mind his own business but sees what he means when Billy has a meltdown. Nate learns that Lisa Kimmel, who he and Claire stayed with when they went to Seattle the previous summer, is now living in LA. She also has a big surprise that throws him for a major loop. When Dwight Garrison is killed in an accident - a high-rise construction worker's lunch pail falls on his head - a battle ensues between his young wife and his two daughters from his first marriage.—garykmcd", "While having lunch with his buddy on a building under construction, a worker accidentally drops his metal pan for carrying food on the head of the pedestrian Dwight Edgar Garrison and kills him. The widow and Dwight's two daughters have a serious altercation at Fisher's Home because of the last wish of Dwight of being buried side-by-side with his former wife and mother of his daughters. Brenda and Nate watch the sunset at the shore, and Nate questions Brenda if she really wants to marry him for love. Nate invites David to be his best man and meets Lisa by chance in the supermarket, and she discloses that she is five months pregnant of him, and Nate faces a dilemma. Brenda has casual sex with a stranger in the bathroom of a bookstore and tells Melissa later. Karla drugs herself again, and Keith convinces her to go to a clinic for treatment. Ruth finds that Nikolai actually owes money to dangerous Yuri. Claire meets Billy and sees how deranged he still is.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702008", "rating": 7.9, "votes": 2024, "number_of_episodes": 63}