{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0004395": "Adam Scott", "0915499": "Kellie Waymire", "0261452": "Christine Estabrook", "0085413": "Marina Black", "1156144": "Aysia Polk", "0635728": "David Norona", "0534380": "Tim Maculan", "0165760": "Terrell Clayton", "0116717": "Eric Bruskotter", "0339159": "Brad Greenquist", "0706814": "David Raibon", "1056583": "Jamie Anne Allman", "1573698": "Heather McPhaul", "0750142": "Bob Rumnock", "2024866": "Bhavna de Montebello", "0436105": "Bill Kalmenson", "0496844": "Aysia Lee"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["A middle-aged woman chokes to death in her apartment, and is found dead a week later.", "Emily Previn chokes on her TV dinner and isn't discovered dead in her apartment until a week later. Her funeral has already been set up, but Rico finds it a time-consuming impossibility to let her have an open-casket one since she's in such bad shape and Nate and David are only able to contact one of her friends (the one who has a funeral-phobia). The questions left of who she is and why she lived alone have an even more profound effect on Ruth, who begins having troubling dreams of living in an empty environment. David hopes to begin a strong relationship with Ben Cooper, but Keith turns up at his door after he awaits judgment for shooting an intoxicated man arguing with his wife...then leaves the next morning, apologizing for his \"wrong\" action and leaving David depressed. Claire is enraged to hear that Parker McKenna is cheating on her SATs and that she claims she's slept with Gary Deitman. Brenda befriends her prostitute client Melissa and watches her at work after determining to start writing a book, and later proposes an engagement to Nate. With no luck even getting the requested Catholic priest for the Previn funeral, Ruth insists her family and Rico attend, and later finally confronts her children about their relationships.—brainybrailler@comcast.net", "David, who is still looking for a relationship, meets lawyer Ben Cooper and goes out on a date with him. He and Ben are getting along fine but things get a bit complicated when his former partner Keith shows up at his place, clearly distressed and in need of Dave's support. Brenda has decided to write a book but begins to wonder if she has experienced enough of life to pull it off. She phones one of her massage clients who had recently told her she was a prostitute. Claire is outraged with her now former friend, Parker McKenna, when she realizes a substitute wrote Parker's SATs. At the funeral parlor Dave, Nate and Rico have to deal with Emily Previn who died in her apartment but was not found for a week. She evidently died alone and friendless - she had prepaid and selected her funeral arrangements several years before - and Nate for one isn't sure anyone will even show up for the service. Ruth has a solution for that.—garykmcd", "When the lonely forty-and-something-year-old Emily Previn chokes to death, he body is found only one week later, and the Fishers' funeral service had been previously hired by Emily herself many years ago with very specific instructions. However, Nate is not able to contact any friend from the list of contacts previously delivered by Emily. Meanwhile, Brenda decides to write a book, and without inspiration, she has lunch with her shiatsu's client Melissa, who is a prostitute. Brenda passively participates of an appointment of Melissa, watching her oral sex with a perverted client that requests audience of another woman. Claire is studying for an examination and finds that her friend Parker McKenna is cheating the exams, and she becomes very upset with Parker and her counselor Gary Deitman. Keith is pressed by his nasty niece, and kills an armed addicted junkie and meets David, who started a romance with Benjamin Cooper. Brenda proposes Nate to get married with her, and he accepts.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702017", "rating": 8.4, "votes": 2183, "number_of_episodes": 63}