{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0001858": "Mare Winningham", "0420955": "Richard Jenkins", "0050156": "Eric Balfour", "0000481": "Alice Krige", "0005424": "Grant Show", "0552832": "Nan Martin", "0112063": "Joel Brooks", "0028625": "David Andrews", "0865119": "Beverly Todd", "0419054": "Graham Jarvis", "0635728": "David Norona", "1156144": "Aysia Polk", "0517606": "Kristopher Logan", "0369184": "Jerry Hauck", "0741891": "Romy Rosemont", "0091480": "Michael Bofshever", "0363011": "Luck Hari", "0640486": "Raymond O'Connor", "1588361": "Kyra Groves", "0923711": "Amy Wheaton", "0663476": "Benjamin John Parrillo", "1531156": "Herschel Bleefeld", "0344387": "Barbara Gruen", "0912414": "Bree Michael Warner", "0787863": "Greg Shamie", "0131220": "Joe Camareno", "2873994": "Ric McCloud"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["A man dies after a long battle with cancer, and his psychic widow discusses the funeral arrangements with the family.", "Michael John Piper finally passes away, depressed and delirious, after a long battle with cancer, and his \"psychic\" widow sticks around Fisher & Sons to discuss his funeral arrangements with him. She also predicts that one of the brothers will have a child, and perplexedly tells Nate she doesn't sense Nathaniel - though only because the funeral home is crowded so not everyone can be sensed. Nate is also baffled by Brenda's so-called ebb in sexual activity, especially when learning even Rico, with a family of four, has an extremely strong pattern of one. He does get some good news, though - at his first funeral-directors' meeting he enthusiastically declares war on Kroehner's and is well-received by all present. Ruth begins attending The Plan seminar when Robbie invites her, and alternates between resisting their hate-the-world policy and taking a hard look at her actual family relationships, meaning she mostly insults her kids. Claire soon has more to worry about than cutting remarks, though, when she's questioned by and lies to the police about any knowledge of Gabe's store-robbery and theft of her, then later gets a phone call from him begging her to pick him up and take him somewhere safe...until he shoots an insulting driver and she's forced to desert him again. As she tries to tell Nate, he's distracted by bad news of his own - an apparently devoted independent funeral-director has sold. Later Keith, looking after Taylor in his sister's absence and trying to convince his mother to handle the situation more effectively, is forced to come in to help.—brainybrailler@comcast.net", "Now that Nate is a full-fledged funeral director, he gets to attend his first lunch with the LA independent funeral directors - all three of them. His condemnation of Kroener Services is popular with the others but it doesn't keep one of them from selling out. Brenda still has no interest in sex and has decided to take a university course. She doesn't quite hit it off with the professor. Ruth signs up for a seminar with The Plan but isn't sure it's relevant to her life. Nate and Dave deal with the widow of Michael Piper who claims to be a psychic and can speak to her dead husband. Keith is still worried about his niece after he suspects that his sister Carla is back on drugs. Claire finds herself being questioned about Gabe's whereabouts but she hasn't seen him for two weeks. When he does get in touch with her, trouble ensues.—garykmcd", "Ruth finds herself reacting badly to The Plan, a self-help seminar she's been dragged to by Robbie. Claire worries about what's happening with Gabe after she's called into a meeting with the police, but finds her concern changing to anxiety after Gabe calls her asking for her help. David and Nate deal with a \"psychic\" widow who insists on involving her late husbands in discussions concerning his funeral arrangements.—BusterLA", "When Michael John Piper dies of cancer, his psychic widow goes to the Fisher's and discusses details of the funeral service with Nate, David and her dead husband. Ruth is dragged by Robbie to a seminar called \"The Plan\" for recovering her self-esteem but she has a bad reaction. Brenda is not in a mood for sex, and Nate becomes curious with the sexual life of his acquaintances and friends. Claire is questioned by the police in school about Gabe, and later she meets him. When Gabe shoots a driver while stopped in a traffic light, she leaves him and discloses the truth to Nate, David and Keith and is advised to go to the police.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702023", "rating": 8.2, "votes": 2168, "number_of_episodes": 63}