{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0165101": "Patricia Clarkson", "0364748": "Harriet Sansom Harris", "0642522": "Ed O'Ross", "0925033": "Julie White", "0532461": "Justina Machado", "0004395": "Adam Scott", "0419054": "Graham Jarvis", "1156144": "Aysia Polk", "0165760": "Terrell Clayton", "0752852": "Steve Ryan", "0154632": "Ricardo Chavira", "0925887": "Gwendolyn Whiteside", "0831479": "Erik Stolhanske", "0446964": "Leonard Kelly-Young", "1026172": "Joshua Preven", "1215266": "Anthony Martins", "0678776": "Danielle Petty"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["While at a boat party, a drunken man falls overboard. The family tries to convince his widow to use their funeral services.", "At a corporate-funded boat-party he denounces, Matthew Heath Collins has too much to drink, drops his latest beverage over the side of the deck, and in attempting to retrieve it falls underwater and is cut by the propeller. His widow Catherine first contacts Fisher & Sons for a closed-casket funeral without bodily repairs, then chooses to switch to Kroehner's instead, forcing David and Nate to think of a way to set a cheap, but reasonable, price to convince her to switch back. Ruth's sister Sarah comes to visit upon receiving her message after years of feuding, angering Ruth once again at the memory of how her friend slept with Nate as a teenager and she did nothing to help with taking care of their grandmother. So she's not very supportive that Sarah informs Claire she's a natural artist. David continues dating Ben but doesn't feel anything for him - he chooses not to invite him to Nate and Brenda's engagement dinner with the family, Sarah, and Nikolai, where the dinner's conversations and divulged secrets make it difficult for Ruth to receive it well. When David and Nate are invited on a recreational Kroehner business trip where they again forcibly reject the offer, Rico gets into an argument with his family that he can't stick around to help them repair their mold-infested wall. Brenda goes beyond her normal interactions with clients to sleep with one. Just before her husband's funeral, Catherine Collins requests Nate to show her the body she asked not to be cleaned, and has an interesting reaction compared to her grief and despair earlier.—brainybrailler@comcast.net", "Ruth has been re-establishing contact with friends and relatives and soon her sister Sarah comes for a visit. They have not seen each other or spoken for a great many years as a result of an incident involving a 15 year-old Nate; Claire didn't even know she was alive. Sarah is a free spirit having pursued her own eclectic interests and Ruth resents the fact that she has had much more fun in her life than she has. Sarah sets her straight on that count. Sarah also encourages Claire's artistic streak. At a family dinner, Nate and Brenda announce their big news but it all falls flat when Brenda sees Ruth's reaction. Rico and Vanessa are bickering when it's discovered that their new house is in need of serious repairs. In the funeral home, Nate and David deal with Catherine Collins whose husband Matthew died when he fell off a boat. Her main interest is that the funeral be cheap - no restoration, closed casket - and she is clearly playing them off against another funeral home owned by Kroehner Services. She opts for Fisher and Sons but when she asks David to open the casket for one last look, her reaction is not what he expected.—garykmcd", "While in a party in a boat, the completely drunken Matthew Heath Collins falls overboard and dies. The widow Catherine Collins bargains with David and Nate and decides to hire the funeral services of Unger, which belongs to Kroehner group. David reduces the price even more to get the client. Meanwhile, Aunt Sarah visits the Fisher family after the invitation of her sister Ruth as part of her new \"blueprint\" of her life. David is dating the public defender Benjamin Cooper, but he misses Keith. Nate and Brenda join the whole family in an engagement dinner. Mitzi Dalton Huntley unsuccessfully tries to seduce Nate and David to sell their business to Kroehner. Rico is facing infiltration problem in his new house. Brenda has an unusual behavior along the shiatsu session with her client. Before the funeral service, Catherine shows her anger against her late husband.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701997", "rating": 8.1, "votes": 2063, "number_of_episodes": 63}