{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0001026": "Joanna Cassidy", "0005424": "Grant Show", "0635728": "David Norona", "0915499": "Kellie Waymire", "1156144": "Aysia Polk", "0865119": "Beverly Todd", "0564530": "Michael McCafferty", "0696113": "Judy Prescott", "0746525": "Hansford Rowe", "0116717": "Eric Bruskotter", "0857275": "Deborah Theaker"}, "geners": ["Comedy", "Drama"], "runtimes": ["58"],  "plot": ["Nate and Claire go to Seattle to pick up the body of a man who died on a public bus.", "Harold Mossback falls asleep but doesn't wake up on a bus tour in Seattle, where his kids hire the Fishers but insist he should transported by land back from LA since he feared flying in life. Unable to get any transportation services, Nate chooses to fly to Seattle and stay at his ex-roommate Lisa Kemmel's, then transport him by rental-car, offering to take Claire along for the ride (and to help drive). David is stuck sitting Taylor for Keith when he's stuck on assignment for several hours, annoying Rico and causing Ruth, now trying to contact old friends and estranged relatives to discuss their relationships, to remind him he shouldn't be too candid on his gayness with a child still \"developing her blueprints\"...until David advises her to mind her own business and drop the metaphors. Brenda, still fantasizing of seeing other, preferably dangerous and exciting, men, is called to be with her mother in an \"emergency\", only to discover she wanted attention as she stalks then attacks a woman her father is seeing, so has a major confrontation with her for it afterward. In Seattle, Nate receives affections from Lisa (whom Claire finds odd) that he doesn't return and later has a seizure at a drive-through in front of Claire, confesses his disease to her, and gets consolation from Lisa later.—brainybrailler@comcast.net", "Ruth has taken the Plan to heart and is now contacting various old friends and relatives to try and re-establish relationships that may have fallen by the wayside. Dave gets a call from his former partner Keith, who is stuck on the job and can't collect his niece Taylor at school. Dave, who still has hopes of re-kindling his relationship with Keith is more that happy to oblige, even if Taylor is a bit of a handful at times. When Harold Mossback dies on a bus tour in Seattle, his family wants him returned to LA for the funeral. In life, Harold hated flying and his family insists that his remains be shipped overland. When Dave is unable to arrange for quick transportation, Nate volunteers to fly there, rent a a van and drive back. He even asks Claire to go with him. In Seattle, they stay with his one-time co-worker Lisa Kimmel, who happens to still have feelings for him. When Nate and Claire start the journey back he has a minor seizure and has to tell Claire what is going on. Back in LA, Brenda has another fight with her mother and is intrigued by one of her massage customers who works as a prostitute.—garykmcd", "Nate and Claire travel to Seattle to pick up a body and spend some time there with Nate's old roommate, Lisa who comforts Nate after he becomes upset about his AVM. Brenda finds herself stuck in a car with her mother who is lying in wait for her husband's mistress. David and his mother (who is still actively \"rebuilding her house\" after her exposure to The Plan) find themselves babysitting Keith's (overly) mature niece.—BusterLA", "When Harold Mossback dies in a bus tour in Seattle, the Fishers are hired by his son and daughter for the funeral service and for bringing the body to Seattle by van, since Mr. Mossback was afraid to fly by plane. Nate invites Claire to go with him, and they spend a couple of days with Lisa, Nate's former roommate. Brenda is called by her dysfunctional mother to go to the Tranquility Spa, and once there, Brenda finds that she actually wants to snoop the mistress of her husband. Ruth unsuccessfully tries to renew her old friendships and get close to her sons and daughter. David brings Keith's niece for babysitting while Keith is assigned in a situation.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701985", "rating": 8.4, "votes": 2218, "number_of_episodes": 63}