{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0289343": "Robert Foxworth", "0280245": "Glenn Fitzgerald", "0420955": "Richard Jenkins", "0642522": "Ed O'Ross", "0532461": "Justina Machado", "1156144": "Aysia Polk", "0635728": "David Norona", "0276691": "Efrain Figueroa", "0116717": "Eric Bruskotter", "0603740": "Gina Morelli", "0144753": "Vincent Castellanos", "0891190": "Jennie Vaughn", "0538625": "Karl Makinen", "0922563": "Travis Wester", "0145262": "Diana Castle", "0008514": "Jim Abele", "0629538": "Austin Nichols", "0528433": "Richard Lynch", "0218749": "Michael Dempsey", "0452014": "Michael Khmurov", "0087257": "Fred Blanco"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["Tensions between Nate and Brenda boil over, while Claire finally finds some direction in her life.", "The Diazes' friend and former neighbor Leticia Perfecta Perez dies in her sleep at a beauty parlor and leaves his family a large sum of money, causing Rico to remember how he lost his father and got into the funeral business to begin with. However, she also leaves behind a son, never close to her in life, who wishes to give her a more expensive casket than her pre-meet's choice and is jealous of Rico. Nate and Brenda attend her parents' remarriage, he goes to cheer up Aaron Buchbinder, and Keith, David, and Taylor are visited by a social worker. Nikoai responds indifferently when Ruth tries to plan what days they'll meet, and while watching a separate movie than he is, she breaks up with him. Claire likes the prospect of attending LAC Arts school but is disappointed that Gary Deitman is about to transfer jobs. The news that Kroehner is bankrupt and undergoing a federal inspection is overshadowed by bad news for both David and Nate - Keith is found innocent for his shooting, but hours later attacks an argumentative abusive husband he investigates and is judged guilty; and Nate reads Brenda's story then recognizes it's not fiction when one of the subjects Brenda slept with from the night before comes by. Nate breaks off his engagement with Brenda just before Lisa calls to inform Ruth his daughter has been born.—brainybrailler@comcast.net", "Nate finally gets to read part of Brenda's novel but realizes she's not making it up and writing from her own experiences. Lisa Kimmel gives birth and phones Nate to let him know, only to speak to Ruth who learns she is now a grandmother. Dave and Keith don't exactly see eye to eye on how best to raise Taylor. They have have a visit from a social worker coming up and Keith is stressed awaiting the results of the shooting investigation. Another incident on the job puts his future in jeopardy. Claire is seriously thinking of going to LAC Arts college and goes on a tour of the campus. She likes what she sees and thanks her guidance counselor who has some sad news. Ruth and Nikolai are still seeing each other but it soon becomes apparent that Nikolai doesn't want to be with her. Nate continues working on Aaron Buchbinder's funeral arrangements. The funeral home's latest client is 80 year-old Letitia Perez, Rico's friend and neighbor. Her son, a successful surgeon, never spent much time with her and Rico and Vanessa are rewarded for their friendship.—garykmcd", "When the old lady Leticia Perfecta Perez dies in the dryer of her hairdresser, Federico shows a great respect and tells that she was his dearest front-door neighbor. Later, Vanessa and he surprisingly inherit US$ 149,000.00 from Letícia. Meanwhile Rico recalls the death of his father and how Nathaniel restored his face. Nate reads a hot part of the Brenda's book in her laptop, with the description of a threesome, and later he visits Aaron to give moral support to him. Keith, David and Taylor prepare to be visited by a social assistant that checks if they have conditions to raise the girl. Keith is considered not guilty of his murder case, but later he beats an abusive husband and is interrogated by the board of the police. Claire visits LAC Arts, loves the place and when she tells Gary Deitman, he informs that he has just lost his job in the school. The parents of Brenda find that they are soul twins and get married again. Ruth goes with Nikolai to the movie theater, he decides to watch different movies (\"Murdered by the Numbers\" and \"Blade II\") and she realizes that he does not love her and breaks their commitment. Nate finds that Brenda is having sex with strangers and breaks his engagement with her. Lisa tells Ruth about Nate's baby, and Kroehner is bankrupted.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701994", "rating": 8.9, "votes": 2429, "number_of_episodes": 63}