{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0165101": "Patricia Clarkson", "0001026": "Joanna Cassidy", "0662504": "Molly Parker", "0642522": "Ed O'Ross", "0112063": "Joel Brooks", "0532461": "Justina Machado", "1156144": "Aysia Polk", "0915499": "Kellie Waymire", "1197466": "Stark Sands", "0165760": "Terrell Clayton", "0605978": "Sara Mornell", "0307600": "Lee Garlington", "0154632": "Ricardo Chavira", "0116717": "Eric Bruskotter", "0880034": "Chris Ufland", "0683986": "Robert Pine", "0655951": "Brett Paesel", "2033493": "Tannoz Bahremand", "1177880": "Benjamin Byron Davis", "0010050": "David Ackert", "0138390": "Maria Carmen", "0697061": "Moira Price", "0419498": "Francisco Javier", "0743501": "Jeffrey Ross", "0482131": "Christi Lake", "0820501": "Steven St. Croix", "2030530": "Jason Daughtery", "0384664": "Scott Sterling Hill", "0401987": "Ellyn Dawn Humphreys"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["A Jewish funeral at Fisher and Sons leads Nate to seek spiritual guidance from an intense female rabbi.", "Jeffrey Marc Shapiro performs asphyxiation therapy while watching an adult video and jogging on his treadmill, but winds up hanging himself after not using his lemon slice to assist breathing. Nate befriends the man's religious leader, Rabbi Ari, and asks her the Jewish beliefs on death and afterlife. Claire chooses to go to Tapenga Canyon to visit Sarah for a weekend, despite Ruth's objections, and is interested more in the teenage son of a pair attending the artists' party there than the partying artists themselves. With Claire gone, Nate busy, and David going out to dinner with Keith after he leaves Eddie and invites him out (though dinner is canceled after Taylor undergoes appendix surgery), Ruth is lonely at home but makes a mistake in how to deal with it. Brenda continues to get advice from Melissa, cheat on Nate, and meets her mother with the usual disastrous results. Rico suspects his cousin Ramone is sleeping with Vanessa, but discovers the truth is even more shocking.—brainybrailler@comcast.net", "Dave is surprised when he gets a call from Keith telling him that he's broken up with his partner. Dave isn't quite sure what to make of it since Keith has in the past made it clear that they would not be getting together again. They agree to have dinner but when Keith doesn't show up, Dave assumes the worse, until he hears why. Claire meanwhile has been invited by her Aunt Sarah to spend the week at her place and Ruth is dead set against it, always remembering what happened to Nate when he went there as a teenager. Claire defies her mother and goes anyway and find her aunt's free-spirited and hippie-ish friends odd and interesting. At the funeral home, Nate and Dave meet Jessica Shapiro whose husband Jeffrey seems to have committed suicide. As a result, the service cannot be conducted at his Synagogue. Nate's not convinced that Jeffrey killed himself and thinks it may have been an accident. Still worried abut his own medical condition, he seeks advice from Rabbi Ari on Judaism's approach to dealing with death.—garykmcd", "While masturbating with asphyxiation, the Jewish executive Jeffrey Marc Shapiro hangs himself and dies. The ceremony of the funeral is conducted by Rabi Ari and Nate gets close to her. Keith dreams with David, breaks his relationship with Eddie and invites David for dinner. However, Taylor has an appendicitis crisis and is submitted to an emergency surgery. Claire decides to spend the weekend with Aunt Sarah, and meets their \"crazy\" friends that live in the 70's in a party. Claire spends the night with Toby, the son of one of the couples. Meanwhile Ruth feels alone in her house. The needy Brenda meets her dysfunctional mother Margaret, and they do not understand each other. Brenda meets Melissa again, and they are becoming close friends. Further, Brenda is getting excited with wild sex and apparently Nate is not satisfying her anymore. Rico believes Vanessa is cheating him with his cousin Ramon, but he finds a different reality.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701977", "rating": 8.0, "votes": 2100, "number_of_episodes": 63}