{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0280245": "Glenn Fitzgerald", "0662504": "Molly Parker", "0364748": "Harriet Sansom Harris", "0642522": "Ed O'Ross", "0532461": "Justina Machado", "0925033": "Julie White", "0112063": "Joel Brooks", "1156144": "Aysia Polk", "0635728": "David Norona", "0085413": "Marina Black", "0584777": "Nicki Micheaux", "0681782": "James Pickens Jr.", "0865119": "Beverly Todd", "0901679": "Ilia Volok", "0171319": "Kim Coles", "1768047": "Lynda Scarlino", "0853331": "Wilda Taylor", "0831921": "Jessica D. Stone", "0083573": "Peter Birkenhead", "0942257": "Bruce Wright", "0157520": "Michael Childers", "0629538": "Austin Nichols", "1365097": "Chase Penny", "1253206": "Anthony Sherritt", "1426375": "Amy Wieczorek", "0307775": "Thomas Garner", "0001026": "Joanna Cassidy", "0289343": "Robert Foxworth", "0291785": "Adrienne Frantz", "0609078": "Ronn Moss", "0868089": "Justin Torkildsen"}, "geners": ["Comedy", "Drama"], "runtimes": ["49"],  "plot": ["Nate and Brenda find comfort thanks to Rabbi Ari's advice. Ruth's need to control Nikolai and Claire leads to a surprising self-assessment.", "Edith Kirky is the 4th patient of the year to be brought to Fisher and Sons from Bay Breeze Hospital where Vanessa works, so David predicts Rico's usual pride over the fact...but no one predicts him, suspicious about her neck-markings, to discover a whole hot dog wedged down her esophagus. When informing the authorities, Fisher and Sons is forced to allow them to bring Vanessa and her partner to be examined since they failed to find the hot dog themselves. Rabbi Ari encourages Nate and Brenda to be honest with each other, but Brenda reacts badly when Nate informs her he's going to be a father (though fails to mention she's unfaithful to him) and he later talks about it with Rabbi Ari, who introduces him to a Jewish client, Aaron Buchbinder, who needs a pre-need consultation since he has pancreatic cancer. Brenda's reaction after criticizing Nate is to get high and sleep with a pair. At Brenda's bridal shower, Bernard Chenowith asks Ruth what she's done as far as Claire's depression, but when Ruth visits Gray Deitman to see if she is depressed, the answer comes as a different sort of shock. David encourages Keith to stand up to his father when he and his mother ask that Taylor come to San Diego to live with them, and David himself is forced to find some inner strength of his own to get Catherine Collins, supported by Mitzi Dalton-Huntley, not to sue them for \"emotional distress\" after Nate's showing her husband's mutilated body at her request. He doesn't have any qualms about becoming angry with Ruth, though, after she pays all of Nikolai's debt to Yuri just before David and Nate have need of the money themselves.—brainybrailler@comcast.net", "With his sister now in custody, Keith has to deal with his parents over what to do with Taylor. They want to take her back to San Diego but Keith is against it. He's also afraid of his demanding and authoritarian father but Dave urges him to do what's best for Taylor and stand up to him. Claire and her friend Parker take some of Aunt Sarah's magic mushrooms and spend a day tripping. More seriously, Claire is struggling to decide what to do now with her life and is seriously considering pursuing her artistic interests. At the flower shop, Ruth is alone when loan shark Yuri drops in to visit Nikolai. She has a surprise for him, one that displeases Nikolai when he hears about it. With their wedding fast approaching, Brenda and Nate get counseling from Rabbi Ari who encourages them to be honest with one another. Nate finally tells her about the child. At the funeral home, Nate and Dave find out they are being sued by Catherine Collins, the woman who insisted on Nate opening the casket so she could have one last look at her husband. They also find out who is behind the suit. They also receive a body from the retirement home where Rico's wife Vanessa works. They have to refer it to the police however which has unexpected repercussions. Nate also meets with Aaron Buchbinder who was referred by Rabbi Ari and is dying.—garykmcd", "While in the Bay Breeze hospital sharing the room with another patient, Edith Kirky dies. Vanessa Diaz is one of the nurses in charge of Edith, and sends her body to Fisher's Service. Her husband Federico finds a hot-dog in the throat of Edith, calls the police and Vanessa loses her job, accused of negligence. Nate and David are sued by the bargain hunter Catherine Collins (of \"In Place of Anger\") in US$ 500,000.00 because Nate showed her husband's corpse to her. They find that Mitzi Dalton Huntley is providing the lawyers and David tries to deal the lawsuit with the widow and has a great surprise. Ruth believes Claire is depressed, visits Gary Deitman and he suggests that Ruth herself is the depressed one. Keith's parents decide to take Taylor with them, and David convinces Keith to face his father. The codependent Ruth secretly pays the debt of US$ 87,000.00 of Nikolai with Yuri. Nate discloses the truth about the pregnancy of Lisa to Brenda, and his disturbed, dysfunctional and unstable girlfriend uses many drugs, recalls her twisted childhood and has sex simultaneously with two strangers. Rabbi Ari visits Nate and he tells her about his disease and the pregnancy of Lisa.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702019", "rating": 8.3, "votes": 2039, "number_of_episodes": 63}