{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0001026": "Joanna Cassidy", "0420955": "Richard Jenkins", "0005438": "Jeremy Sisto", "0642522": "Ed O'Ross", "0532461": "Justina Machado", "1156144": "Aysia Polk", "0915499": "Kellie Waymire", "0005404": "Rusty Schwimmer", "1197466": "Stark Sands", "0743404": "Franc Ross", "0114868": "W. Earl Brown", "0154632": "Ricardo Chavira", "0584777": "Nicki Micheaux", "0138390": "Maria Carmen", "0519440": "Tony Longo", "0958638": "Harley Zumbrum", "0939773": "Janet Wood", "0331165": "Steve Gormley", "1428915": "Britnee Lapham", "0676589": "Max Peters", "1560681": "Brooke Swift"}, "geners": ["Comedy", "Drama"], "runtimes": ["54"],  "plot": ["The Christmas season marks the anniversary of Nathaniel's death - and gets everyone thinking about their last moments with him.", "Christmas Eve - and the one year anniversary of Nate and Brenda's meeting and Nathaniel Fisher's death - is approaching, and this year, the Fishers are requested by bikers to allow the funeral home to be open on Christmas Day so they can have a party/memorial service for Jesse Ray Johnson, who was involved in a motorcycle accident on his way to his part-time job as a mall Santa while greeting some kids. The family (and Rico) each remember their last moments with Nathaniel and, in most cases, regret what they didn't do for him before he died. On Christmas Eve Brenda's mother invites Brenda and Nate over for dinner with a \"special guest\", who turns out to be Billy. Ruth prepares to take Claire to church with David out to visit Keith and Taylor, but they never make it when they enter Nikolai's shop to see it robbed and him shot in the legs with both now broken. Ruth decides, to the chagrin of the family, that he'll stay with them until he can walk, since he has no insurance. Nate is forced to confess his AVM to Brenda when he has a seizure as they sleep together. On Christmas Day, Marrilyn Johnson offers Nate a motorcycle as a gift so he can live every day to the fullest. Toby, Keith, and Taylor are invited for dinner that evening. Rico has a good holiday with his family - until his cousin Ramone arrives to attack him when he's forced to tell Vanessa he's gay and she told his wife. Also, Claire's holiday takes an interesting turn when Toby calls her \"hostile\" and she drives him away, though she does enjoy keeping in touch with Billy Chenowith.—brainybrailler@comcast.net", "It looks like it's going to be an interesting Christmas for the Fishers. Ruth is fussing over having everyone and their significant others for dinner. Brenda will attend, as will Keith and even Claire invites someone, Toby, whom she met at her Aunt Sarah's. Even Nikolai will be there, but a lot longer that just dinner: Ruth found him in his shop on Christmas Eve beaten and robbed and with two broken legs. It looks like he will be sleeping on the couch for eight weeks or so. It's also the anniversary of Nathaniel's death and several of them remember their time with him. Brenda's mother has a Christmas surprise for her, one that she doesn't entirely approve of. She's also continuing her sexual experimentation as she continues to write her book. Nate and Dave also have to work Christmas day when the wife and friends of biker Jesse Ray Johnson insist on giving him a big send-off. Nate gets a bit of a surprise the next day.—garykmcd", "While driving his motorcycle for a temporary work as Santa Claus in a mall, the biker Jesse Ray Johnson waves to three children on the sidewalk and dies in a traffic accident. His beloved wife Marilyn Johnson and two friends of Jessie hire the best services of Fisher & Sons Funeral Home for the funeral, but under the condition of using the place for a party with their bikers' friends on the Christmas day. Rico is pressed by Vanessa and tells her the truth about Ramon, and later Vanessa discloses the secret to Ramon's wife Graciela. Ruth invites the whole family to have Christmas dinner together with their mates. Claire invites Toby, Nate invites Brenda, and David invites Keith and Taylor. Each member of the Fisher family recalls a moment with Nathaniel. Nikolai has two broken legs in a burglary to his store, and without health plan, is treated by Ruth. The unstable Brenda flirts with a man in a store, and later she tells Melissa. Brenda and Nate are invited to dinner with Margaret on the Christmas Eve, and surprisingly Billy is there, invited by his dysfunctional mother, affecting Brenda. Nate has a seizure and finally tells Brenda about his AVM. Claire is corresponding through e-mails with Billy. Taylor's mother returns home.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702020", "rating": 9.0, "votes": 2611, "number_of_episodes": 63}