{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0004999": "Shawn Hatosy", "0420955": "Richard Jenkins", "0642522": "Ed O'Ross", "0050156": "Eric Balfour", "0005016": "Alexandra Holden", "0622535": "Geoffrey Nauffts", "0165760": "Terrell Clayton", "0850335": "Barbara Tarbuck", "0550358": "Melissa Marsala", "0930413": "Denalda Williams", "0040797": "Scott Atkinson", "0454598": "Cleo King", "0112070": "Stanley Kamel", "0338144": "Mary-Pat Green", "0789421": "David Shatraw", "0778874": "Ben Scott", "0210885": "Vincent De Paul"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["A drug-addicted actress dies from a cocaine overdose and leaves her fellow cast and crew members to set up the funeral.", "Drug-addict actress Rebecca Leah Milford overdoses on cocaine, leaving her fellow cast and crew members, including Rico's sponsoring obnoxious sister-in-law, to set up the funeral. A guide to parents with gay children recommends accepting them by welcoming their lovers for a family meal, so Ruth prepares to invite Brenda, Gabe, and Nikolai before learning that Keith is no longer part of David's life. David and Nate both get bad news on their MRI's: David has gonorrhea and Nate learns that his brain condition is indeed AVM, potentially (but not necessarily) fatal, but, upon learning there appears to be no effective solution for curing it, leaves the doctor angrily with no intention of learning anything more about it. He tries harder than usual to stay fit and healthy by taking an aspirin a day...but ends up taking one of David's ecstasy tablets instead, making Ruth's dinner an interesting one. Later, he dreams his father introduces him to Life and Death, playing Chinese checkers with him, asking Nate to choose whether or not to join the game.—brainybrailler@comcast.net", "Now that she is having a relationship with Nikolai, Ruth invites him over for dinner and wants all three of her children to be there along with their own significant others. She does it primarily for David but he's not in a relationship at the moment. Nate gets the results of his tests which confirm the earlier diagnosis. He has an interesting experience at Ruth special dinner when he inadvertently takes the Ecstasy Dave left in an aspirin bottle. His relationship with Brenda is at a low ebb and she can't explain why she's not interested. At the funeral home, they deal with the friends of a young actress who overdosed. Their main interest seems to be to have as cheap a funeral as possible.—garykmcd", "When the B-movies actress Rebecca Leah Milford, artistically known as Becky Maxwell, dies of overdose of cocaine, her boyfriend Brody Farrell and the cast and crew of her last movie hire the funeral services with the Fishers. Brenda and Nate, and Claire and Gabe are having troubled relationships; David finds he has a sexual disease and Ruth is trying to learn how to deal with the gay situation of her son.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701998", "rating": 8.3, "votes": 2424, "number_of_episodes": 63}