{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0004936": "Ben Foster", "0532461": "Justina Machado", "0728132": "Leon Rippy", "0933988": "Rainn Wilson", "0531589": "Peter Macdissi", "0935616": "Matt Winston", "0395196": "David Hornsby", "0821817": "Josh Stamberg", "0188041": "Myndy Crist", "0485071": "Karen Landry", "0924604": "Cheryl White", "0353243": "Molly Hagan", "0286022": "Amanda Foreman", "0034976": "Yareli Arizmendi", "0020143": "Landry Allbright", "2039594": "Quinby Kasch", "2038994": "Kyle Mullaney", "0672688": "Antoinette Peragine", "0320163": "Lindsey Ginter", "0291044": "Noah Frank", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0042348": "Austin Priester", "1171196": "Mark L. Young"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["After the patriarch of a cultish new-age clan dies, Fisher and Diaz is overrun by the wives and children left behind.", "63-year-old polygamous family leader \"Daddy\" leaves behind 5 wives and numerous children of The People clan, making the Fishers intrigued about their spiritual and cultural beliefs, like their guarding his body throughout the embalming. Ruth gives Arthur an unwanted kiss and instantly breaks her vow not to do it again, so struggles to find a new way for her to express her passions for Arthur. Terry and Patrick invite themselves to Gay Paintball Day - which plays right into Keith's hands since he chooses to be on the opposite team as David as revenge for being taken to the hated brunch. Lisa schedules an appointment with Brenda under a false name to see if she and Nate are still passionate, but hears that Brenda has gone through some difficult times love-wise lately but is ultimately content now. Claire becomes suspicious of Olivier's motives for not letting Russell go on her errands with her when, in Azusa, a former assistant tells her she enjoyed sleeping with him as her job, then asks if this is a year he's chosen a male as his partner when Claire says she's never been in that position. Rico's concern for Vanessa and her possible depression turn to certainty of and anger for it when, despite his pleas for her to try to reconnect with her family, he finds she's neglecting them.—brainybrailler@comcast.net", "When Daddy dies in a polygamous family where their rules are written in \"Daddy's Book\", his five wives hire the Fisher & Diaz funeral services, but with the condition that the embalming process should be witnessed by each wife in shifts. Meanwhile, Vanessa misses and grieves her mother and has been visiting her tomb in the graveyard every Sunday for four months, neglecting her sons and her house. Ruth has a huge crush on Arthur and kisses him. David and Keith play paint-ball with a group of gays, while Claire quits her position of \"assistant\" of Olivier. Lisa schedules a Shiatsu session with Brenda to see and meet her.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ruth is getting closer to Arthur and spontaneously kisses him. She's immediately embarrassed by what she's done but Arthur doesn't react as she expected. Lisa is still paranoid about Nate and Brenda and decides to meet her by booking a massage appointment under a false name. She soon realizes that Brenda has problems of her own. Rico gets a call from school telling him that he has to pick up his children at school because they cannot reach Vanessa. Claire is growing ever more fed up with working as Olivier's assistant. Despite the fact that she and Russell had their day planned, Olivier insists she go on a fairly long drive to pick something up. Once there, she meets Olivier's former assistant. She also learns a lot about him. Keith is looking forward to a paint-ball game with some of his police buddies. He's actually quite happy when Dave tells him that a couple of his friends from the choir will be coming. The funeral home, is also over run with wives and children after the death of the head of a polygamous group.—garykmcd"], "genres": "N/A", "imdbID": "0702010", "rating": 7.9, "votes": 1914, "number_of_episodes": 63}