{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0004936": "Ben Foster", "0000870": "Kathy Bates", "0001573": "Catherine O'Hara", "0685755": "John Paul Pitoc", "0531589": "Peter Macdissi", "1423048": "Sarah Rafferty", "0643275": "Megan Austin Oberle", "0049943": "Judith Baldwin", "0333158": "Jason Graae", "0395196": "David Hornsby", "0144073": "Paul Cassell", "0225169": "Josette Di Carlo", "1769666": "Eric Ustian", "0704270": "Zachary Quinto", "1033193": "Mageina Tovah", "0015935": "Lori Alan", "0941404": "Marc Worden", "2306672": "J. Paul Rogen", "1934845": "Jeremy A. Roberts", "2393064": "The Gay Men's Chorus of Los Angeles", "1569879": "Tenaya Cleveland"}, "geners": ["Comedy", "Drama"], "runtimes": ["51"],  "plot": ["Keith and David find the reality of a resort vacation different than advertised.", "Callie Renee Morimer flees a group of jeering young men calling to her as she walks alone in the dark, who turn out to be some joking friends, but stops in the street and is hit by a car upon realizing it. David enjoys singing in the choir but turns down an opportunity to go to a member's open house - he and Keith are spending the weekend at a hotel out of town, but from the moment they get there David worries about seeming too obviously gay in front of the straight couples. Carol finally crosses a line when blaming Lisa's family for not allowing her to give her constant perfect emotional support, so Lisa quits and she, Nate, and Maya are forced to temporarily move in with Ruth. For her own part, Ruth is happy to have them, and happy in general, with Bettina instructing her in the arts of receiving massages, shoplifting, and just enjoying life. Claire continues to accept Phiil's player attitude until it gets in the way of their personal schedule, so leaves him, and is intrigued by the unorthodox artist teaching her class in place of the one she took it to see.—brainybrailler@comcast.net", "While walking on the sidewalk in the night, the nineteen-year-old Callie Renee Mortimer hears the voices of three threatening men, panics, tries to escape from them and is hit by a car on the street. In the end, it was only a prank of three friends of her that caused the fatal accident. David is singing in the choir and travels to a hotel with Keith for a couple of days of leisure, but he feels uncomfortable with his gay situation in the place. Claire is in love with the unfaithful Phil, but she has a class with an outstanding art professor that shows the ambivalence of her life, changing her perspective and she breaks with the crematory guy in spite of loving him. Ruth goes with Bettina to a mall to play around, and she learns how to be a shoplifter just for fun. The temperamental and emotionally affected Carol upsets Lisa, and she quits her job. Nate, Lisa and Maya provisionally move to Ruth's house.—Claudio Carvalho, Rio de Janeiro, Brazil", "David and Keith decide to go away for a weekend at a resort but it doesn't quite meet their expectations. The food is sub-par and Dave is self-conscious about the fact that they're the only gay couple there. Lisa and Nate find themselves moving into Ruth's house after Lisa's boss Carol has a major meltdown and Lisa quits. Ruth has a new friend in Bettina and is enjoying the time they spend together. Their shopping expedition is a bit of an eye opener however. Claire is still interested in her musician-boyfriend Phil but he loses some of his shine when it becomes obvious that he will continue to see other women. At the funeral home, they deal with the death of 19 year-old Callie Morimer who was struck by a car when her friends tried to frighten her. Rico sees how effective Nate is at consoling people and begins to think he's not cut out for the job.—garykmcd"], "genres": "N/A", "imdbID": "0702015", "rating": 7.8, "votes": 1919, "number_of_episodes": 63}