{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0004936": "Ben Foster", "0532461": "Justina Machado", "0531589": "Peter Macdissi", "0933988": "Rainn Wilson", "0343325": "Arye Gross", "0534380": "Tim Maculan", "0395196": "David Hornsby", "0826745": "Brian Stepanek", "1524810": "Tereza Rizzardi", "0283468": "J. Michael Flynn", "1648149": "Michelle Gardner", "0601376": "Joel David Moore", "1490283": "Jeremy Guskin", "1703159": "Smith Cho", "0677399": "Shawn Carter Peterson", "2040777": "Markus Rudel", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1853155": "Neil Patil"}, "geners": ["Comedy", "Drama"], "runtimes": ["53"],  "plot": ["The Fishers run into unexpected guests at an art-school benefit featuring works by Claire and company.", "Melinda Mary Bloch shuts herself in he garage in her activated car by way of suicide, leaving behind only a guilty ex-lover who worries Rico when he mentions she'd actually received treatment for depression, and Nate when he admits he'd tried to end their relationship more than once but wound up staying longer than he wished. Lisa, who's been having arguments constantly with him, officially meets Brenda at Claire's art show where Billy also has a display, and Brenda confronts her about her sneaky meeting and assures her she isn't close to Nate. When she and Olivier run into Billy, Claire learns that Billy slept with Olivier when he was his student, heightening her worries about Russell. David and Keith, after both their secrets of paint-ball and 3-way sex have slipped in counseling, get approval from Frank to do the latter if both of them so desire, but David's agreement in public doesn't match his private doubts later on. Arthur gets close, in both senses of the word, to Ruth and they almost sleep together, but then he leaves abruptly, puzzling her.—brainybrailler@comcast.net", "A couple of days after the ending of her relationship with her mate, Melinda Mary Bloch commits suicide. Claire and Russell are preparing the art opening promoted by their school in the Rothman Gallery. The relationship of Nate and Lisa is on crisis, and Rico is also disappointed with Vanessa. David comments on the three-way sex with a stranger and Keith in their therapy and the therapist proposes that they establish rules and limits in their sexual games. Ruth invites Arthur to go with her to the benefit show. Billy, Brenda and their dysfunctional mother are also in the exhibition, and Brenda meets Lisa and tells her that their previous meeting was weird, dishonest and kind of \"stalkerish\". When the Claire'd dark picture is sold, she soon discovers who bought her dark vision of the world.—Claudio Carvalho, Rio de Janeiro, Brazil", "Claire and Russell are among a very few students selected to display their art at a prestigious exhibition. Olivier, their teacher, is at his worst when it comes to his students' anxieties about their first exhibition. The entire family shows up: Ruth, with Arthur as her date; David with Keith, who is still stinging from his encounter with Dave's friend's from the choir; and Nate and Lisa, whose relationship is fast deteriorating. It doesn't help that Brenda is also there and now realizes Lisa's earlier deception. Claire meets Billy again and is surprised that he was once Olivier's student - and also his lover. David and Keith meanwhile discuss their recent threesome with their analyst and he gives them the okay to continue provided they agree on the ground rules. Ruth meanwhile is confused by her relationship with Arthur. Rico's concerns about his wife's growing depression aren't helped by the suicide of their latest client, Melinda Bloch, who locked herself in her garage with the car running after her husband left her.—garykmcd"], "genres": "N/A", "imdbID": "0702022", "rating": 8.0, "votes": 1844, "number_of_episodes": 63}