{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0165101": "Patricia Clarkson", "0004936": "Ben Foster", "0000870": "Kathy Bates", "0001573": "Catherine O'Hara", "0532461": "Justina Machado", "0343325": "Arye Gross", "0685755": "John Paul Pitoc", "0743671": "Matt Ross", "0651296": "Jim Ortlieb", "0034858": "Julie Ariola", "0840066": "Claudette Sutherland", "0174523": "Edward Conery", "0371180": "Paul Hayes", "0831550": "Fred Stoller", "1519675": "Giancarlo Rodriguez", "1307878": "Onika Day"}, "geners": ["Comedy", "Drama"], "runtimes": ["50"],  "plot": ["David and Rico are at odds over doing business with the family of a deceased telemarketer.", "Telemarketers Andrew Wayne Milne, Matthew Clark Hazen, and Martin Jacobs are shot by their insane former co-worker Daniel Grant Showalter who then commits suicide. Fisher & Diaz gets both the Milne and the Showalter funerals - but Rico objects to having the killer's, especially on the same day his victim's is to be held, so makes David's life miserable by refusing to pick up his body or do his job quietly. Stuck picking it up himself, David misses therapy with Keith, and Frank Mushler encourages him to view his own feelings about David without him around to defend himself. Lisa and Nate manage to invite David and Keith over for a barbecue dinner for a while before Carol barges in and literally demands Lisa's attention, but it gives Keith and David plenty of time to reflect on what problems their relationship has. Though she claims their own marriage is wonderful, Nate's dream of whether it was meant to be begin to crumble as several minor arguments arise with Lisa. Ruth's trip to Tapenga Canyon to give Sarah some Vicodin turns interesting when she learns her sister is addicted to it, and she befriends her spirited friend/caretaker Bettina.—brainybrailler@comcast.net", "Daniel Grant Showalter comes to his office and shots Andrew Wayne Milne, Matthew Clark Hazen and Martin Jacobs killing them. When Fisher and Diaz are hired for his funeral, Rico does not accept the work, but David does. Davidpractices singing for the choir, and he and Keith visit Nate and Lisa. Sarah calls Ruth and asks her to buy Vicodin. When she arrives at her place, she meets Bettina, who is taking care of Sarah's withdrawal of drugs. Claire brings Phil, the guy from the crematory that she is dating, to her home, and he discloses his feelings to her.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ruth goes out to Topanga Canyon to visit her sister Sarah. There she meets Sarah's friend Bettina and for the first time learns about her addiction to vicodin. Nate and Lisa have David and Keith over for dinner but Lisa's demanding boss, Carol, interrupts. Claire is bored with all of her theory classes at school and is more into her new boyfriend, Phil. At work, Dave and and Rico clash over handling the funeral for a fired telemarketing employee who subsequently went into his workplace and killed three of his former co-workers. Fisher and Diaz is handling the funeral for one of the victims as well and Rico thinks it's wrong to have to deal with the killer or his family.—garykmcd"], "genres": "N/A", "imdbID": "0702035", "rating": 7.8, "votes": 1943, "number_of_episodes": 63}