{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0004936": "Ben Foster", "0000342": "James Cromwell", "0532461": "Justina Machado", "0531589": "Peter Macdissi", "0933988": "Rainn Wilson", "0550358": "Melissa Marsala", "0171583": "Ivonne Coll", "0946579": "Momo Yashima", "0156475": "George Cheung", "0587323": "Peggy Miley", "0837942": "Larry Sullivan", "0109944": "Gary Bristow", "0847543": "Ken Takemoto", "0945330": "Kiyoko Yamaguchi", "0096558": "Gail Borges", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "9348749": "Jennifer Chu", "1310216": "Priscilla Leona Horne"}, "geners": ["Comedy", "Drama"], "runtimes": ["49"],  "plot": ["Fisher and Diaz is brimming over with activity and mourners after a trio of unrelated deaths.", "Convience-store owner Dorothy Kim Su is fatally shot during a robbery. Nate is forced to file a missing-person report when he continues to hear nothing from Lisa. Construction-worker Edward Tully hits some electrical wires in the site where he's working during an earthquake, is electrocuted, and falls to his death. Nate calls David, where he's sleeping with Patrick, and tells him he's starting to panic, especially after the earthquake. Ruth has convinced herself, as usual, that everything, including Lisa, is fine, but doesn't convince Claire, who is set to believe she's died. David Jordan Monroe suffers a fatal heart attack while on a treadmill at his health club, giving Fisher & Diaz a full schedule of 3 funerals in one day, 2 at the same time. forcing David and Rico to quickly escort the mourners out. Brenda is now living in an apartment to avoid Billy, but Margaret forces both of them to show up to dump Bern's ashes, and when she can't be persuaded to place them where her kids know he would have preferred them, she chooses an unorthodox place to put them. Vanessa sees a psychiatrist who reduces her medication and her pushy sister Angelica comes over to help...by encouraging her to spend freely without Rico's consent, and ignore any practical advice he gives. Claire again refuses to take Russell back and confronts Olivier - before discovering that she is pregnant. Ruth finally accepts something terrible must have happened to Lisa and ends up crying on a man's shoulder when he comes to reclaim his glasses in the funeral home, but Gerge Sibley is accepting and sympathetic to her worries. When Lisa's car and cell phone are located in a state park, deserted, Nate checks into a nearby hotel and waits in despair, while David and Claire try to console him.—brainybrailler@comcast.net", "In a robbery of a convenience store, the owner Dorothy Kim Su is shot in the forehead and immediately dies. While working in an electrical post, there is an earthquake and Edward Tully falls over the wires and is electrocuted. While running on a belt in a health club, David Raymond Monroe has a fulminating heart attack. Meanwhile, Lisa is missing while traveling to Santa Cruz and a freak-out Nate calls David in the middle of the night. In the morning, while having breakfast with David, Nate and Claire, Ruth keeps an optimistic opinion, denying any possibility of a tragic event that might have happened with Lisa. Rico goes with Vanessa to the doctor, and she cuts the medication Vanessa is using, since she is clinically depressed. Brenda moves to a cheap apartment, and her mother calls her to dump the ashes of her father. Russell does not give up on a disappointed Claire, and later she has a serious altercation with Olivier, accusing him of being manipulative and violating the regulation of the school. After calling the sheriff's department and the highway patrol, the car of Lisa is found, Nate goes to a motel nearby the place where the car was found, and David and Claire join their brother to comfort him. Claire finds that she is pregnant. Angelica goes to the mall with Vanessa and buys a television and a refrigerator with Rico's credit card, upsetting him.—Claudio Carvalho, Rio de Janeiro, Brazil", "Fisher & Diaz is particularly busy when they have 3 funerals to arrange at the same time. Nate is growing less helpful as his panic over Lisa's disappearance begins to grow. He files a missing person's report and when the police find her car, abandoned, everyone begins to imagine the worst. David begins sleeping with Patrick as his relationship with Keith seems to be on the skids. Brenda is desperate to avoid Billy after their last meeting and she moves into an inexpensive bungalow. Vanessa's doctor reduces her meds which should help but Rico now has to put up with his overbearing sister-in-law Angelica who moves in with them. Claire still refuses to see Russell and has a confrontation with Olivier. She subsequently discovers something that sends her reeling. At one of the several funerals they are dealing with, Ruth meets George Sibley with whom she forms an almost instant bond.—garykmcd"], "genres": "N/A", "imdbID": "0701984", "rating": 8.8, "votes": 2122, "number_of_episodes": 63}