{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0004936": "Ben Foster", "0531589": "Peter Macdissi", "0933988": "Rainn Wilson", "0188041": "Myndy Crist", "0161970": "Robert Cicchini", "0120141": "Donna Bullock", "0440160": "Tara Karsian", "0100895": "Pamela Bowen", "0137488": "Amanda Carlin", "1569879": "Tenaya Cleveland", "1882321": "Deven Streeton", "1347908": "Shawn Barber", "2286261": "Monica McCarthy", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh"}, "geners": ["Comedy", "Drama"], "runtimes": ["50"],  "plot": ["Lisa takes Maya on a camping trip and Rico wrestles with the challenges of a double-wide corpse.", "Karen Postell Pepper suffers a hemorrhage to the nose while preparing to enter the \"Making Love Work\" TV studio with a question to ask Dr. Dave. Nate prepares to go on his first camping trip in 2 years (where he went without Brenda), with Lisa, Maya, and Dana, Todd, and their toddler daughter Spencer. By the time they arrive, though, he realizes he won't be able to drink 3 cans of beer that night or smoke cigarettes. Ruth becomes interested in Arthur the more she gets to know him, and rents a movie whose score he says he favors. David believes Russell is gay, though Claire doesn't and defends him from Olivier's harsh criticism. An obese man's body causes trouble for everyone when it falls from its extra-large coffin and Arthur, Ruth, Claire, and Russell must move it back. Lisa is annoyed with their friends' constant claims of affection for one another, but Nate simply grows jealous and worried that he can't seem to have any of those moments with Lisa refusing to smoke or hike with him. After mutilating a snake and forcibly demanding why no one will join him, he hikes alone to a towering mountain where he finds Brenda has been pursuing him. He agrees to kiss her but then sends her away - and she leaps off the cliff, and Nate wakes up from his dream. When he and Lisa finally do go out hiking, it's anything but peaceful when she takes his remark on how they differ from Spencer's parents to mean he rejects her, and he retorts that she won't accept him without change. They end up sleeping together passionately before returning home.—brainybrailler@comcast.net", "While in a line waiting for Dr. Dave's show \"Making Love Work\", Karen Postell Pepper dies of nose bleed. Lisa, Nate and Maya go camping with another couple and their son. Ruth rents the 1972 \"Silent Running\" for Arthur Martin. Claire makes love with Russell, and David believes he is gay. Nate hikes alone to the top of a mountain, has an erotic dream of Brenda and later he has sex with Lisa in the woods.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ruth and Arthur get to know each other better and seem to be taking a liking to one another. Claire introduces Russell to Dave who is convinced that his sister's friend is gay. Russell reacts badly when their teacher Olivier publicly trashes his latest sculpture. Nate, Lisa and Maya go on a camping trip but it doesn't go too well. Nate wants to drink and smoke up but Lisa is quite happy to just sit and read. At the funeral home, they prepare a woman who died from a hemorrhage for her funeral. Rico also has to contend with the remains of a very large man who requires an extra-large coffin and presents particular problems for Russell in the middle of the night.—garykmcd"], "genres": "N/A", "imdbID": "0702001", "rating": 7.9, "votes": 1975, "number_of_episodes": 63}