{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0004936": "Ben Foster", "0000342": "James Cromwell", "0532461": "Justina Machado", "0933988": "Rainn Wilson", "0240043": "Anne Dudek", "0065320": "Graham Beckel", "0395196": "David Hornsby", "0534380": "Tim Maculan", "0550358": "Melissa Marsala", "0064769": "Jim Beaver", "0140200": "David Carrera", "0660073": "Catherine Paolone", "0852328": "Elayn J. Taylor", "1484297": "K.T. Thangavelu", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "2393064": "The Gay Men's Chorus of Los Angeles"}, "geners": ["Comedy", "Drama"], "runtimes": ["53"],  "plot": ["After a serial killer is executed in Texas, his daughter brings him home for a fitting Fisher and Diaz funeral.", "Woman-killer Carl Desmond Williman finally receives the death penalty by a lethal injection in Texas, and his unemployed daughter hires Fisher & Diaz for the funeral, and sleeps with Nate since they're both miserable and want to escape their problems, but he treats her unsympathetically the following day out of sheer guilt. David breaks up with Keith after spending more time with Patrick. Claire chooses to get an abortion and calls Brenda when she learns she needs a driver, who accepts. Ruth considers marrying George but does decide to slow things down a bit after learning he's been through 6 marriages. Angelica continues to give Rico grief at home. Claire tries to convince Nate to speak to Brenda after her favor to her but Nate's too wrapped up in thinking up everything that could've happened with Lisa to welcome her in, or pay attention to much else.—brainybrailler@comcast.net", "In Texas, the murderer of women Carl Demond Williman is executed through a lethal injection. His daughter Allison Williman, who lost her job in a car dealer, hires the Fisher & Diaz services and has a one-night stand with Nate. Brenda calls Nate, but he never answers her calls. Claire goes to a Planned Parenthood clinic and schedules an abortion, and asks Brenda to go with her. Ruth moves fast and decides to settle down and get married with George. Nate has many daydreams and nightmares with Lisa. David has an affair with Patrick and breaks off with Keith.—Claudio Carvalho, Rio de Janeiro, Brazil", "With everyone trying to deal with their own deteriorating personal situations, Claire is unable to find someone to accompany her to the clinic and ten drive her home. She finally asks Brenda to help her out. Ruth's relationship with George is moving ahead pretty quickly and they decide to get married. She's a bit surprised when he tells her about his previous marriages. David is growing more comfortable in his relationship with Patrick and decides to tell Keith it's over. As for Nate, the lack of progress in locating Lisa is having a devastating effect on his life and his work. He imagines all sorts of terrible things that could happened to her. It's not helped by the fact that their latest client is Carl Williman who was executed in Texas for his crimes. The man's daughter Allison, who lost her job to attend her father's execution, is clearly interested in Nate.Vanessa's severe depression continues and Rico is growing increasingly angry at her sister's constant interference in their home life.—garykmcd"], "genres": "N/A", "imdbID": "0702034", "rating": 8.4, "votes": 1957, "number_of_episodes": 63}