{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0857620": "Justin Theroux", "0000342": "James Cromwell", "0420955": "Richard Jenkins", "0532461": "Justina Machado", "0933988": "Rainn Wilson", "0550358": "Melissa Marsala", "0050156": "Eric Balfour", "0216738": "Idalis DeLeon", "0114034": "Kimberlin Brown", "0636046": "Nolan North", "0539155": "Paula Malcomson", "1022349": "Manuel Urrego", "0205772": "Ken Davitian", "0315369": "Violetta Gevorkyan", "0625126": "Adam Nelson", "0797406": "Eve Sigall", "0342466": "Jack Grinnage", "0363764": "Magda Harout", "1706019": "Jake Gridley", "0752879": "Tim Ryan", "1336965": "Jillian Henry", "1188010": "Leo Marks", "2043622": "Sonja Alarr", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1516737": "Brian Shakti", "0837942": "Larry Sullivan", "0951838": "Lynnanne Zager"}, "geners": ["Comedy", "Drama"], "runtimes": ["59"],  "plot": ["In the Season Three finale, Death continues to shuffle its deck randomly for would-be clients of Fisher and Diaz.", "A piece of \"blue ice\" broken off an airplane strikes Anahid Havanessian, whose husband goes to Fisher & Diaz for a funeral...but changes his mind when, frustrated with the government for hiding that such deaths are common and suspecting Nate's silence is indifference, he's snapped at by Nate, who then snaps at David and Rico for telling him he lost them money by not demanding payment for the meeting when they \"switched to the local chapel\". Walking in the early hours of the morning to clear his head without success, and drinking heavily and sleeping with a bar prostitute, he's in bad shape and can't accept the news of his mother marrying George. David and Claire are also reluctant, since David is worried about his brother and believes it should be delayed and Claire is worried they haven't known each other long enough to wed, but they know they'll marry either way. Claire visits her father's grave and learns, along with the fact that he's OK with the marriage himself, Lisa, Gabe Dmas, and her child are all with him. David is encouraged by his father to make up with Keith, which he does at church by talking with him so long they forget to go in. They're both present for their mother's wedding, but Nate isn't - after getting the news that Lisa has been found drowned, he continues to drink heavily and gets into a bar fight. Rico gets into a situation almost as bad when getting the bad news that his sister-in-law, despite being a nuisance, won't leave yet. Angry with Vanessa, he goes to dance class without her then is invited to a strip club where he sleeps with one of the dancers, Sophia. Brenda prepares to date, but not sleep with, her charming neighbor Joe. Nate finally leaves the bar after losing the fight, drives drunk, and is haunted by visions of Lisa and Nathaniel urging him to drive off a bridge, and finally ends up at Brenda's.—brainybrailler@comcast.net", "While speaking in the cell phone in the yard of her house, a \"blue ice\" of a plane going to Burbank comes off onto Anahid Havanessian. Her husband and her mother are badly treated by a totally uncontrolled Nate. He leaves Maya alone, thinking of Lisa, goes to a bar, drinks a lot and has sex with a prostitute. Six and a half weeks after meeting each other, Ruth and George decide to get marry and inform the family, receiving a cold reception from David, Claire and Nate, who do not approve their marriage. Brenda meets her neighbor Joe, who plays French horn. They date, but Brenda advises she is in celibate. David invites Keith to go to the church; they have a long conversation and settle their situation. Rico has an argument with Vanessa because of Angelica, goes to the dance class alone and later a friend invites him to go to a bar. He meets the stripper Sophia \"Infinity\" and she has oral sex with him in his car. The police call Nate and tells they found the body of Lisa. Ruth gets married with George, with the presence of Claire, David and Keith. Nate, completely wasted, fights in a bar and drives to Brenda's home.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ruth and George's announcement that they are to be married doesn't go over very well in the Fisher household. They've only known each other for just over 6 weeks and Nate in particular thinks they're moving just too fast. Nate of course hasn't been himself since Lisa disappearance and a call from the police saying they have found a body doesn't help at all. He's been drinking heavily for some time but now he goes on a real bender and picks a fight in a bar. Bruised and battered, he ends up at Brenda's. Claire goes to visit her father's grave, which she has a hard time finding, and imagines seeing Lisa, her old boyfriend Gabe and her baby all there. Ruth and George are getting married and she makes it clear that they are going ahead with it whether the children are there or not. Rico meanwhile has taken to going to dance class without the ever depressed Vanessa. His sister-in-law is refusing to move out and Vanessa is refusing to tell her to go. Rico goes to a strip club where he meets the alluring Sophia.—garykmcd"], "genres": "N/A", "imdbID": "0701995", "rating": 9.2, "votes": 2667, "number_of_episodes": 63}