{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0004936": "Ben Foster", "0000870": "Kathy Bates", "0933988": "Rainn Wilson", "0531589": "Peter Macdissi", "1102140": "Josh Radnor", "0593734": "Silas Weir Mitchell", "0935616": "Matt Winston", "0395196": "David Hornsby", "0333158": "Jason Graae", "0359289": "Terri Hanauer", "0168371": "Dennis Cockrum", "0127680": "Christina Cabot", "0916491": "Ben Weber", "0353548": "Michael Hagerty", "0869354": "Nick Toth", "1044769": "Anastasia Basil", "1660030": "Bill Doyle", "1307680": "Baron Rogers", "0737318": "Ron Rogge", "2393064": "The Gay Men's Chorus of Los Angeles", "1569879": "Tenaya Cleveland", "0696397": "Damon Preston"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["Fisher and Diaz deals with the recently discovered body of a man missing for years.", "A lost pair of hikers discover the wrecked remains of a car with the skeleton of the driver, William Aaron Jaffe, inside. Nate is surprised by the son who never knew him not seeming to be troubled by it, and worried by the remarried widow's remark that they weren't right for each other and married too hastily - his own relationship with Lisa has become strained when she encourages him to cut back on his spending and considers staying home with Maya for a few years, without even letting him be the first to know. Things are further complicated when Nate runs into Brenda, and Lisa suspects the drinks they had together weren't just for catching up and apologies. David's enjoyment of the choir is overshadowed by one of the members recognizing him from a shameful experience several years before. Claire's invitation to go with Russell to his brother's wedding is forgotten when Olivier asks her to be his assistant - which turns out to mean his driver. Keith is ready to quit his job. Rico convinces David to hire an apprentice, despite Nate's and Ruth's doubts, to assist in Claire's place, and hires nerdy Arthur Martin, who turns out to be oddly like Ruth. Later, Nate is accused of living in a marriage that will surely fall apart and be bad for their offspring the way Will Jaffe's would have, but Nate rejects the prediction...without convincing himself.—brainybrailler@comcast.net", "A young couple finds a crashed car with a skeleton inside while hiking through a wrong trail in the woods. William Aaron Jaffe has been missing for more than twenty five years. Russell invites Claire to date him in the wedding of his brother. Claire is also invited to be the assistant of Oliver Staal, but later she finds that he needs a driver actually. Rico convinces David to hire a new apprentice to save US$ 10,000.00 per year, and the weird Arthur Martin is selected. David sings with the choir and is afraid of one of the gays that recognized him from the toilet of the Sears. Lisa does not want to work anymore because of Maya, and presses Nate to save money. Brenda visits Nate and has a cold reception, and later she apologizes with him for her attitudes in the past.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nate and Lisa's relationship is hitting some rough spots. She begins to nag Nate about his spending habits, going over their credit cards bills and challenging some of his purchases. She lays on the guilt pretty thick telling they have to think of their baby's future. He's further displeased when he learns from his mother that Lisa will not be looking for a job and is going to be a full-time house mom. It all comes to a head when Nate tells her that he and his former girlfriend Brenda had a drink together that day. Brenda had sought him out to apologize for having slept around when they were supposed to be in a monogamous relationship. Nate thinks it's all innocent but Lisa is feeling very vulnerable. Dave meanwhile is enjoying singing in the choir until another member reminds him of a casual sexual encounter they had many years before. Keith is growing ever more weary of his job as a security guard and is thinking of taking his life in a new direction. At the funeral home, they deal with the case of William Jaffe whose remains were found in his vehicle in a remote location. It's clear he died in an accident but after an absence of some 25 years, no one in his family seems to care much one way or the other. Now short-staffed with Claire working for her art teacher, Rico suggests they hire an apprentice. The lucky candidate is Arthur Martin.—garykmcd"], "genres": "N/A", "imdbID": "0702028", "rating": 7.8, "votes": 1898, "number_of_episodes": 63}