{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0289343": "Robert Foxworth", "0004936": "Ben Foster", "0532461": "Justina Machado", "0933988": "Rainn Wilson", "0935616": "Matt Winston", "0395196": "David Hornsby", "0484713": "Timothy Landfield", "1161335": "Melissa Paull", "1306271": "Santo Ragno", "1558590": "Alan Lambert", "1519675": "Giancarlo Rodriguez", "0568205": "Glen McDougal"}, "geners": ["Comedy", "Drama"], "runtimes": ["48"],  "plot": ["David and Keith (reluctantly) play 'Leading Ladies' at a brunch with members of the Gay Men's Chorus.", "Surrounded by his family, Bernard Asa Chenowith dies of stomach cancer, and when Nate learns of it he requests Lisa's permission to attend his funeral since Brenda was there after his father's. Lisa agrees, and Nate plans to leave Maya with Ruth, but she's out secretly stalking Arthur jogging. Claire chooses to go shopping with Russell at an arts store, where Russell buys her a gift of an expensive bottle of paint she refused to purchase. David takes a reluctant Keith to Terry's party, where he's humiliated at playing a game and eventually leaves David to take his drinks alone. Nate doesn't want to leave Maya with Arthur and almost drops her off at the Diazes', but Vanessa is so distracted and on edge he decides against it. He informs Rico, though, who worries that she's depressed over her mother's loss and despairs of getting her to talk about it openly. Nate ends up taking Maya to the funeral, which angers Lisa, who believes Nate still loves Brenda rather than her, along with the fact that Brenda touched Maya.—brainybrailler@comcast.net", "Lisa travels with Dana to a food convention, and while reading the newspaper, Nate sees that Bernard Asa Chenowith had died. Nate goes to the funeral with Maya, since he did not feel comfortable to leave the baby with Vanessa, and Brenda tells him that her father died of gastric cancer and that she misses Nate. Arthur decides to run in the park, and Ruth, with the behavior of an adolescent, stalks him. David goes with Keith to a gay's party, but Keith does not feel comfortable and leaves David alone. Claire is feeling good with the gentle Russell.—Claudio Carvalho, Rio de Janeiro, Brazil", "Brenda's father dies and Nate decides to pay his respects. Lisa is OK when he tells her he is going but it all leads to yet another fight when she learns that he took baby Maya with him. There was no one at home to take care of her and he even tried Rico's wife Vanessa but she was acting so erratically he didn't trust her to leave Maya there. Lisa is convinced there are still feelings between Nate and Brenda and is convinced she is only his second choice. Ruth follows Arthur when he goes jogging. David and Keith attend a brunch put on by a member of the choir but Keith doesn't have much of a good time. Nate tells Rico about Vanessa's odd behavior and starts to wonder about what exactly is going on.—garykmcd"], "genres": "N/A", "imdbID": "0702033", "rating": 8.0, "votes": 1891, "number_of_episodes": 63}