{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0004936": "Ben Foster", "0000870": "Kathy Bates", "0420955": "Richard Jenkins", "0160550": "Dennis Christopher", "0531589": "Peter Macdissi", "0359577": "Evan Handler", "0890951": "Anthony Vatsula", "0449669": "Dagney Kerr", "0391885": "Jim Holmes", "0460671": "David Knell", "0581336": "Todd Merrill", "2393661": "David Peterson", "2393064": "The Gay Men's Chorus of Los Angeles", "1569879": "Tenaya Cleveland", "1061672": "Brandon Dean"}, "geners": ["Comedy", "Drama"], "runtimes": ["51"],  "plot": ["The partner of a recently deceased gay man orchestrates an operatic tribute at Fisher and Diaz.", "Robert Lamar Griffin's rare heart disease finally takes its fatal toll, leaving behind his boyfriend Kevin Lamb, a scene-designer of the opera company where he was a lighting-designer, who requests Fisher & Diaz to allow him to create a Chinese opera set for the funeral. David suspects Rico's views of homosexuality are narrow and defends it, while the couple's having been together so long offer new insight to his relationship with Keith. With Ruth's birthday approaching, Lisa prepares to throw her a party despite Nate's warning that she prefers her birthdays without any celebration. But with fun-loving Bettina invited and at Lisa's insistence, Ruth breaks her own standards of not using the best china or dancing. Claire is the only one not to attend the party; she's out watching the introduction of ultra-radical artist Scott Philip Smith, and is invited to dinner with Russell by Olivier and Smith, later learning what her potential may come to and wondering what it will be. After a while, Nate retreats from the party, too, disturbed by the growing similarities between Lisa and Ruth. He dreams that his father hints that between the wife he married by default and his hated inherited job, Nate may soon wish to use the old apartment he used to escape from the same things, and Nate retorts that he's less secretive, he loves his family, but Nathaniel wonders...why shouldn't he have loved his own, if he remained with them?—brainybrailler@comcast.net", "When the L.A. Lyric Opera lighting designer Robert Lamar Giffin dies of cardiomyopaty, his mate for twenty-two years and scenic designer Kevin Lamb proposes David and Nate to build the scenario of Turandot for the funeral services. Lisa decides to make a birthday party for Ruth and invites Bettina and Keith. Bettina takes Ruth for her first massage and she loves the sensation. Claire goes to a lecture of the famous artist Scott Philip Smith with her friend Russell Corwin, and later they are invited by their art professor Olivier Castro-Staal to join Scott and have some drinks. Olivier discloses his sincere opinion about the artistic veins of Claire and Russell.—Claudio Carvalho, Rio de Janeiro, Brazil", "Lisa decides to throw a party for Ruth's birthday despite Nate's advice that his mother has never wanted to celebrate her birthday in the past and has always made a point of avoiding the subject. Everyone is surprised, perhaps Ruth most of all, when they have a really good time. Nate however begins to see how much Ruth and Lisa are alike and begins to question why he married her. Claire can't make the party as she has to attend an art show with her friend Russell and teacher Olivier. Afterwards, Russell reveals something about himself to Claire. At the Funeral home, they make arrangements for Robert Griffin's funeral. His partner of 22 years, Kevin Lamb, wants to stage a tribute that reflects their work - both were professionals in the theater - which proves to be particularly moving to David and makes him wonder if he and Keith will be able to have anything as near a lasting and meaningful relationship.—garykmcd"], "genres": "N/A", "imdbID": "0702002", "rating": 8.6, "votes": 2242, "number_of_episodes": 63}