{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0004936": "Ben Foster", "0532461": "Justina Machado", "0933988": "Rainn Wilson", "0531589": "Peter Macdissi", "0681782": "James Pickens Jr.", "0865119": "Beverly Todd", "1156144": "Aysia Polk", "0395196": "David Hornsby", "0919710": "Ann Weldon", "0938674": "Lenny Wolpe", "0715594": "Michael James Reed", "1022349": "Manuel Urrego", "0149175": "Linda Cevallos", "1538553": "Guillermo Cespedes", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0781899": "Pamela Adlon", "0815823": "Lisa Christensen", "1692857": "Ciara Huntington"}, "geners": ["Comedy", "Drama"], "runtimes": ["50"],  "plot": ["Nate tends to Maya while Lisa visits her sister. Meanwhile, Vanessa seems like her old self.", "Jeanette Louise Bradford has an allergic reaction to a bee-sting in Balboa Park, causing Keith to go to San Diego for his aunt's funeral and David to join him, encouraging him to discuss sleeping with a third man with him and to confront his father on his abusive childhood after the funeral. Russell admits he was sleeping with Olivier and an angry, betrayed Claire demands he leave her alone from now on. She and Ruth talk with each other about their relationship problems when Ruth learns Arthur is a virgin so there's nothing new to be gained from spending time with him. Vanessa is now again living life to the fullest, taking dance classes with Rico, but then collapses one night from too many medications. Billy, remarkably depressed after watching a poor video version of his and Brenda's beloved childhood book \"Nathaniel and Isabel\", kisses Brenda, who goes to visit Nate. Alone with Maya while Lisa goes to visit her sister's family in Santa Cruz, Nate consoles Benda until she begins to appear to want to become closer to him, and she quickly stops herself and departs. Keith and David are relieved to hear that Taylor is doing fine with Lucille and Roderick, but when Keith finally chooses to tell his father he's willing to forgive him for beating him and his sister, it's met with denial and quickly becomes a fight...and when David tries to calm both of them down for Keith's sake he's insulted by Roderick and unappreciated in his efforts by Keith, so leaves. When Nate calls Lisa's sister's, he learns Lisa hasn't yet made it to her place as expected, and isn't worried when he can't get through to her phone the first time...but he does start to be when he continues to call with no response.—brainybrailler@comcast.net", "While in a barbecue in Balboa Park with her family, Keith's great-aunt, Jeanette Louise Bradford, is stung by a bee and has an allergic reaction and dies. While driving to the funeral, David questions Keith about their threesomes with strangers. Meanwhile, Vanessa is very eager, having great sex with Rico and going to a dance class. Nate welcomes a client who mourns the loss of his beloved wife, and later Nate cries. Lisa travels to her sister's house, leaving Maya and Nate alone for a couple of days. Ruth questions Arthur about the course of their relationship and finds that he has no sexual experience. Russell discloses to Claire that he had sex with Olivier while she was going to Azusa. Claire tells him that he is a misfit and she does not want to see him any more. Billy French kisses Brenda and she leaves his apartment completely astonished. Keith has a serious quarrel with his father, David defends him and Keith mistreats him. David leaves Keith and when he arrives in the bus station back home, Patrick is waiting for him. While Nate is having a good time with Maya, a disturbed Brenda visits him; they kiss, but she leaves and then she goes to a hotel to spend the night. Ruth and Claire disclose their feelings to each other.—Claudio Carvalho, Rio de Janeiro, Brazil", "David accompanies Keith who is to attend his aunt Jeannette's funeral. Keith and his father have never gotten along and certainly haven't spoken since his niece Taylor went to live with them. Keith decides the time has come to speak to his dad and forgive him for the abuse he inflicted on him and his sister as children. It doesn't go well and Dave's attempt to support Keith leads to additional friction between all of them. Claire's worst fears are realized when Russell admits to Claire that he and Olivier had sex. She ends their relationship on the spot. In a subsequent conversation with her mother, she learns a lot about Ruth's early life and relationship with her father. Rico's wife, Vanessa, has been on medication prescribed by her doctor but then takes to self-medicating based on a friend's advice. She seems to be getting better but soon comes crashing down. Nate is on his own after Lisa sets off to visit her sister. Brenda drops in unexpectedly after another unhappy encounter with her brother Billy but Nate doesn't want her there. A call to Lisa's sister reveals that she's not arrived.—garykmcd"], "genres": "N/A", "imdbID": "0701988", "rating": 8.4, "votes": 1963, "number_of_episodes": 63}