{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0420955": "Richard Jenkins", "0001573": "Catherine O'Hara", "0343325": "Arye Gross", "0685755": "John Paul Pitoc", "0622535": "Geoffrey Nauffts", "0188041": "Myndy Crist", "0161970": "Robert Cicchini", "0114034": "Kimberlin Brown", "0636046": "Nolan North", "0481222": "Caroline Lagerfelt", "0810934": "Stephen Snedden", "0484178": "Sarah Lancaster", "0567340": "Alicia McCutcheon", "0221430": "Dan Desmond", "0893558": "Julia Vera", "0910328": "Patrice Walters", "0075061": "Bobbin Bergstrom", "1451549": "Mandy June Turpin", "16236142": "AllRise", "0004936": "Ben Foster", "1851108": "Jennifer Lutheran"}, "geners": ["Comedy", "Drama"], "runtimes": ["48"],  "plot": ["In the Season Three premiere, Fisher and Sons has become Fisher and Diaz, and Rico is doing all he can to make sure he's not a \"gofer\" anymore.", "The surgeons are dismayed when Nate's blood vessel ruptures and he suffers a hemorrhage, and his blood pressure continues to rise, then Nate dies...At least, the family and Rico are in shock, grieving, while Nate himself is dining in a hated restaurant with his father, impatiently waiting to get to his own funeral. He arrives early, sick of the food, and sees his funeral (open-casket, not a memorial service after cremation as he wished)...then hears David speaking to him from the next room where he sees himself paralyzed and with speech problems struggling to relearn. He continues through the home and witnesses himself completely healthy living with Lisa and Maya; at Christmas dinner with his family, including his father, who never died; living with a woman he has yet to meet and their son; spending his time lazily, watching TV and drinking beer with a woman. Returning to the funeral room, he meets his father again, who doesn't give him a straight answer on whether he's alive but suggests he just traveled through parallel worlds and must open a white coffin to get his answer....7 months later: Nate, Lisa, and Maya live with Lisa's self-absorbed actor boss Carol, where Lisa is a cook. David and Keith, now a reluctant security guard, are in therapy to find a healthy relationship, and David is advised to find an activity for himself so applies to the Gay Men's Chorus. Claire is attending LAC, enjoying it less than she anticipated, and starting a relationship with rock-band member Phil. Nate learns an interesting secret about his own life from Ruth and all the while sees scenes shown in his surgery that make him wonder if this life is meant to be.—brainybrailler@comcast.net", "While being submitted to the emergency cranial surgery, Nate has a bleed and foresees different possibilities of his life, inclusive his death and the funeral service at \"Fisher & Diaz\". Seven months later, he is living with Lisa and Maya. Keith and David are having sessions with a couple's counselor, trying to find a middle term between Keith's anger and David's submission. Claire is painting and has a one-night-stand with a rock and roll guitar player of a garage band.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nate undergoes his brain surgery and has several previews of what his life might have been like, both pre- and post-surgery. Seven months after surgery, he's living with Lisa who is still working as a cook for her ditsy and demanding employer. Their little girl, Maya, is doing just fine and her doting grandmother is more than happy to help out - which Lisa is finding more than a little annoying. Dave and Keith meanwhile are having couples therapy. He has issues with Keith's angry responses to him and feels worthless when they occur. Claire is attending LAC but finds some of the courses boring. In art class, she's learning how to draw a perfect circle freehand. Rico is now a full partner in the business which has been renamed Fisher and Diaz Funeral Home.—garykmcd"], "genres": "N/A", "imdbID": "0702005", "rating": 8.2, "votes": 2269, "number_of_episodes": 63}