{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0857620": "Justin Theroux", "0004936": "Ben Foster", "0532461": "Justina Machado", "0000666": "Lili Taylor", "0933988": "Rainn Wilson", "0001021": "Veronica Cartwright", "0006958": "Jonathan Tucker", "0324462": "Angela Goethals", "0550358": "Melissa Marsala", "0697785": "Andrew Prine", "0003740": "Julie Dretzin", "0944891": "Jeff Yagher", "0188041": "Myndy Crist", "0161970": "Robert Cicchini", "0216738": "Idalis DeLeon", "1151899": "Robert Baker", "0105438": "Steffani Brass", "0665922": "Shawn Michael Patrick", "1581427": "Godfrey Moye", "2038417": "Michael Viens", "2041913": "Matthew Viens", "1519675": "Giancarlo Rodriguez", "0024683": "Brian Ames"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["In an attempt to honor Lisa's last wishes, Nate finds himself at odds with her family.", "In 1972, Bruno Baskerville Walsh took LSD at a party, and \"flew\" off the balcony where he stood, landing on a car in a parking lot. Ruth and George sleep together their first night of marriage...extremely loudly, annoying David and Keith, and Claire. The next day, Rico is guilty and tells Vanessa Angelica can stay however long she wants, but Vanessa actually kicks her out. Claire is furious with Nate for missing Ruth's wedding, until he returns home from sleeping with Brenda and announces her death. Claire tells Russell she aborted his child, and gets an amazing reaction. Rico goes to a church he doesn't attend and confesses his infidelity. Nate gets into an argument with Lisa's mother, who she never got along with - her mother insists she be cremated and placed in the family burial grounds, but Nate insists Lisa get her wish of a green burial in a national park without embalming. He and David can't see any way they can legally win, so Nate is forced to think of a solution that may not be legal, but right.—brainybrailler@comcast.net", "While in a party in the 1970s, Bruno Baskerville Walsh had an acid trip with Cindy, and decided to fly off the top of the building, smashing on a parked car. David is very edgy and Claire is upset with the absence of Nate in Ruth's ceremony. Ruth and George have sex too loud, disturbing everybody in the house. Nate goes to Brenda's place completely drunken and has sex with her. He comes home and tells his family that Lisa drowned. Dave drives with Nate to bring Lisa's corpse. Joe visits the disturbed Brenda, and Vanessa asks Angelica to leave her house. David questions if he is back together with Keith. Claire tells Russell about her abortion. Rico goes to a distant church to confess that he had oral sex with a stripper of the Seventh Veil Stripper Club. Nate and Lisa's parent have a serious altercation whether Lisa will be cremated, or will be buried directly on the ground without casket as per her wish. Nate deceives Lisa's parents and fulfills her last wish.—Claudio Carvalho, Rio de Janeiro, Brazil", "It's the morning after and Nate finally makes it home to tell everyone that Lisa's body has been found. David and Claire had spent a sleepless night due their mother and George's noisy lovemaking. Problems arise with Lisa's family over the funeral arrangements. They expect a traditional funeral but Nate tries to respect Lisa's wishes and provide her with a 'green' funeral. On edge and with emotions running high, David suggests they try to find a compromise. Nate finds a unique solution, assisted by Bruno Baskerville Walsh who jumped to his death in 1972 while high on LSD. Claire is at a low ebb and gets in touch with Russell but her information may be too much for him to handle. David and Keith may be together again; David isn't quite sure. Brenda gets friendly with her new neighbor.—garykmcd"], "genres": "N/A", "imdbID": "0701990", "rating": 9.0, "votes": 2605, "number_of_episodes": 63}