{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0002546": "Mena Suvari", "0005438": "Jeremy Sisto", "0004936": "Ben Foster", "0532461": "Justina Machado", "0000870": "Kathy Bates", "0004906": "Peter Facinelli", "0001021": "Veronica Cartwright", "0697785": "Andrew Prine", "0003740": "Julie Dretzin", "0944891": "Jeff Yagher", "0337042": "Sprague Grayden", "0540164": "Matt Malloy", "0914209": "James Waterston", "1006868": "Brooke Dillman", "0935616": "Matt Winston", "0372366": "Pat Healy", "0070924": "Vivienne Benesch", "0862331": "Becky Thyre", "0716277": "Phil Reeves", "0735226": "Adam Rodriguez", "0105438": "Steffani Brass", "1081748": "Angelique Little", "1535579": "Rachel Thorp", "1478568": "James MacPherson", "0175425": "Justin Connor", "0355838": "Lois Hall", "2038417": "Michael Viens", "2041913": "Matthew Viens", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0797329": "Gary Sievers"}, "geners": ["Comedy", "Drama"], "runtimes": ["48"],  "plot": ["Nate gives Maya \"one last look\" at a memorial for Lisa, where some surprise discoveries ensue.", "Nate dreads having to go to Idaho to visit Lisa's family and attend a service they have arranged. He and Brenda have reconciled and she convinces him that going is the right thing to do. He asks her come along. The visit goes well but after Nate returns to LA, the local funeral director tells Lisa's parents he doesn't think the ashes they interred were in fact Lisa's. David and Keith attend a friend's wedding and decide they want to adopt a child, though David seems to think it's more pressing. Ruth returns home and tells George what it will take for them to continue as a married couple. She invites George's son Kyle and her friend, who are now a couple, to dinner. Claire has a final confrontation with Edie and seems to be getting friendlier with Billy. Rico is happy to have spent some time at home with the kids but is quickly dismayed when he realizes that Vanessa has asked an old high school friend to visit her.—garykmcd", "The wife of the alcoholic Robert Duane Wething kicks his dead body is a parking area. Nate does not want to travel to Idaho for the religious ceremony with Lisa's ashes, but Brenda convinces him to go and she travels with Maya and him. Keith and David go to the wedding of Terry and Paul, and David wants to adopt a child. Ruth returns home and imposes conditions to George to keep their marriage. Rico visits his sons and Vanessa, very well-dressed, dates an old high school friend, upsetting Rico. Ruth invites Kyle and Becky for dinner with George, and they discuss possibilities of the end of the world, through nuclear bomb, use of oil, lack of water or global heating. Barb meets Brenda with Nate and Maya after leaving The Black Forest Inn. The minister tells Lisa's parents that he believes the ashes they buried are not from Lisa.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702013", "rating": 7.7, "votes": 1766, "number_of_episodes": 63}