{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0002546": "Mena Suvari", "0857620": "Justin Theroux", "0004936": "Ben Foster", "0532461": "Justina Machado", "0004906": "Peter Facinelli", "0337042": "Sprague Grayden", "0663469": "Lana Parrilla", "0216392": "Diane Delano", "0607031": "Bob Morrisey", "0946628": "Tatyana Yassukovich", "0484350": "Ken Land", "0935143": "Rebecca Wink", "0382608": "Carol Hickey", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0705976": "Bette Rae", "0614104": "Betty Murphy", "0063750": "Lindsay Beamish", "1682494": "Dave Shalansky", "1186666": "Hawk Younkins"}, "geners": ["Comedy", "Drama"], "runtimes": ["54"],  "plot": ["Fisher and Diaz hosts two very different parties in one night. Meanwhile, David is uncomfortable with all the comfort he's receiving.", "David has recovered physically from his carjacking but refuses to tell his family what really happened to him. At the funeral home, he has the case of Robert Meinhardt who he thought was a suicide but then learns he was shot in the head by burglars. David has a panic attack and has to call 911. George and Ruth attend an academic receptionist where she overhears a conversation and learns of George's philandering ways. It's David's birthday and Ruth has organized a dinner to celebrate the occasion. In the kitchen she lets slip to Vanessa that Sophie visited Rico. She also embarrasses George by lashing out at him. Nate gets a new job taking care of dogs in a canine retreat and is at peace with himself. Joe has found a house for he and Brenda but she drops in on Nate, not sure she can live a simple life with Joe.—garykmcd", "During a robbery in his home, Robert Carl Meinhardt is tied and executed with a shot in his head. David is completely traumatized, lies to his family and tells that he was carjacked only. Joe finds a new big house to live with Brenda. Ruth goes to a dinner party with George and hears some comments of one ex-girlfriend of George, becoming upset and in a bad mood. On the birthday party of David, Ruth makes a comment to Vanessa about Sophia, and Rico tells that he is helping the outgoing young mother, based on the request of charity of their priest. David gets an upscale watch from Keith, and later he has a panic attack. He discloses to Claire the truth about the torture he was submitted, and Claire asks Nate to work with and give support to David. Brenda visits Nate, telling that she is afraid of having a simple and happy little life with Joe, and they kiss each other.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702011", "rating": 8.3, "votes": 1915, "number_of_episodes": 63}