{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0002546": "Mena Suvari", "0857620": "Justin Theroux", "0004936": "Ben Foster", "0532461": "Justina Machado", "0001122": "Ellen DeGeneres", "0004906": "Peter Facinelli", "0005502": "Michelle Trachtenberg", "0933988": "Rainn Wilson", "0216738": "Idalis DeLeon", "0337042": "Sprague Grayden", "0348152": "Anna Gunn", "0085316": "James Black", "1151899": "Robert Baker", "0812020": "Maura Soden", "0852848": "Mark L. Taylor", "0386645": "Hallee Hirsh", "0580082": "Erica Mer", "1404488": "AJ Michalka", "0789972": "Sheila Shaw", "0286595": "Andy Forrest", "0319251": "Kim Gillingham", "1377804": "Monica Garcia", "0342858": "Max Grodénchik", "0278897": "Eva Fisher", "0178626": "Kathi Copeland", "0118427": "Tara Buck", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1519675": "Giancarlo Rodriguez"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["A group of prank-happy teenagers find their latest joke is no laughing matter. Meanwhile, the Fishers decide to hold a yard sale.", "Nate meets a divorced mom with a tot the same age as Maya and they soon arrange for a play-date for the kids - which turns out to be quite playful for them as well. David works with Arthur on his appearance - he buys him a new suit - and on his technique for dealing with clients. George and Ruth receive a wedding present that contains a tin of feces. She's convinced she knows who sent it. Sophia has Rico wrapped around her little finger and he agrees to pay for her new boob job. Claire is surprised when she learns that Edie is a lesbian. Joe tells Brenda he wants to spice up their sex life with a little role play.—garykmcd", "While making a prank call, 14-year-old Kaitlin Elise Stalte falls off her bed and dies. Rico teaches Arthur how to embalm, while David buys a new suit for him. Meanwhile, George receives a beautiful package with a box that contains feces. Ruth blames Arthur for sending excrement because of his hurt feelings; he becomes upset, quits his job and leaves the house, leaving David and Rico alone. Sophia manipulates the silly Rico, trying to get a new surgery on her breasts. Claire goes to a party with Anita, and finds that Edie is a lesbian. Nate, exhibiting some weird behavior, is having an affair with the mother of one of Maya's friends. Brenda was hoping to have normal sex with Joe, but the guy wants kinky sex. Keith is the new bodyguard for the star Celeste. Claire convinces her family to burn what was left after a garage sale.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702004", "rating": 8.0, "votes": 1916, "number_of_episodes": 63}