{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0001026": "Joanna Cassidy", "0004936": "Ben Foster", "0922995": "Michael Weston", "0216738": "Idalis DeLeon", "0337042": "Sprague Grayden", "0807548": "Brooke Smith", "0731826": "Elise Robertson", "0786641": "Brent Sexton", "1006868": "Brooke Dillman", "0083564": "Lauren Birkell", "0291192": "Art Frankel", "0043847": "Ethel Ayler", "0933829": "Marquise Wilson", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0024683": "Brian Ames"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["With Keith away, David gets taken for a ride by a hitchhiker. Meanwhile, Nate goes to a bereavement group.", "Although their earlier visit did not go very well, Ruth suggests they invite George's estranged son Kyle for dinner. She's also thinking of inviting a friend of hers and introduce them. Nate goes to a grief management class but has trouble relating to the other participants. At the funeral home, Rico and Dave console Anne Thornton's husband who blames himself for his wife's death. Claire doesn't react well to criticism of her self-portraiture photos. David picks up an apparently stranded motorist but it all turns nightmarish for him.—garykmcd", "While celebrating her anniversary in a hot tub after her husband prompts her to enjoy drinking, Anne Marie Thornton falls in the shower and dies. Keith moves on tour for three months with the security team and David misses him. Claire shows her picture in class and her stillness is not well accepted. Sophia, completely stoned, looks for Rico in his work, and Nate understands the situation. The upset Nate goes to a support group following Ruth's advice. Ruth invites Kyle for dinner upsetting George, who becomes disappointed with her. Margaret visits Brenda in the campus and Brenda admits her wish of having a baby. David gives a lift to a hitchhiker called Jake while bringing the corpse of Anne Marie, and soon he regrets it.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702012", "rating": 8.8, "votes": 3113, "number_of_episodes": 63}