{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0002546": "Mena Suvari", "0857620": "Justin Theroux", "0532461": "Justina Machado", "0420955": "Richard Jenkins", "0933988": "Rainn Wilson", "0335275": "Beth Grant", "0216738": "Idalis DeLeon", "0337042": "Sprague Grayden", "0653959": "Rick Overton", "0085316": "James Black", "0501937": "Tom Lenk", "1658471": "Erik Meinerth", "0015466": "LBONGO", "0750927": "David Lee Russek", "1260534": "Rob Evors", "1171196": "Mark L. Young", "0396175": "Mat Hostetler", "1101381": "Ash Christian", "0142087": "Daniel Bryan Cartwell", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1519675": "Giancarlo Rodriguez", "0201373": "Jennifer Darling", "0723372": "Caroline A. Rice"}, "geners": ["Comedy", "Drama"], "runtimes": ["49"],  "plot": ["George puts his stamp on the Fisher home, settling into domestic routines that irk Arthur.", "Devoted Christian Dorothy Sheedy mistakes inflatable dolls floating from a truck bed for angels, and jumps out of her car, unaware of her surroundings, and is hit by another driver. Her husband, also strong in his faith, doesn't know whether his wife's death was an odd accident or suicide but remains calm about it, believing it was simply her time to die. Nate doesn't accept that and when David forces him to stop pressing the man with questions on why his beliefs are thus and why he won't appear more angry or saddened, he quits the business and confronts Ruth for trying to persuade him to stay at all. Keith goes to a job interview to be a celebrity's security guard. A plumbing-system problem causes blood to arise in all the building's drains, and David has an interesting reaction to the plumber that Keith takes in stride. Everyone else gives Ruth a hard time for putting George's belongings up in place of the family's. Rico continues to weakly answer Sophia's pleas to see him, spending less time with his family or at work.—brainybrailler@comcast.net", "Nate's recent loss is affecting his work and he challenges a client to question why his wife, Dorothy Sheedy, for no apparent reason, stepped out of her car and stood in the middle of the street then being hit by a car. Dave has just about had it with him and Nate makes a big decision. Keith gets a new job as a security specialist with a firm that provides protective services to celebrities. Claire makes a new friend and gets her creative urges flowing again. George and Ruth decide to put some of George's furniture in the house but it doesn't quite fit in with the the rest of the decor. George also gets an interesting parcel on the mail. Rico just can't seem to stay away from Sophia. Brenda and Joe finally sleep together.—garykmcd", "When the fanatic religious Dorothy Sheedy is hit by a car in a weird accident, her conformed husband goes to Fisher & Diaz. Nate does not accept his apathy in his grief, and discusses with the client, with David and with Rico. Later he quits his partnership. Ruth replaces the Formica table of the kitchen by a Persian one that belongs to George, and the family does not like it. Claire makes a new friend, Anita Miller, and they go to a bar where poets are lecturing their poems, and they become close to Edie. Keith, very nervous, is interviewed and hired by a safeguard protection company that makes the security guard of stars, that has for principle to defuse a situation before becomes a situation. Rico is visiting Sophia and giving gifts for her, and his relationship with Vanessa seems to be ending. Brenda dates Joe and after many days they have sex. David gets a blow-job of the plumber Andy and later he tells Keith.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701996", "rating": 7.8, "votes": 1845, "number_of_episodes": 63}