{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0002546": "Mena Suvari", "0857620": "Justin Theroux", "0532461": "Justina Machado", "0004906": "Peter Facinelli", "0134072": "Bobby Cannavale", "0005502": "Michelle Trachtenberg", "0922995": "Michael Weston", "0550358": "Melissa Marsala", "0216738": "Idalis DeLeon", "0337042": "Sprague Grayden", "0821817": "Josh Stamberg", "0915901": "Lee Weaver", "0806614": "Vivian Smallwood", "0404924": "Michael Hyatt", "0534380": "Tim Maculan", "0085316": "James Black", "0820562": "Soledad St. Hilaire", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1697871": "Eyvonne Williams", "0878582": "Carmen Twillie", "1484075": "Angela Joy", "0922149": "John J West"}, "geners": ["Comedy", "Drama"], "runtimes": ["53"],  "plot": ["Nate and Brenda take Maya on a train ride, getting caught in their tracks when they go a little too far.", "David is living at home alone now that Keith is on the road with rock star Celeste. He does take advantage of an out of the blue call from an old acquaintance, Sarge, but still suffers from post-traumatic stress. Keith finally comes out to one of his co-workers but it's an encounter with Celeste that sends him packing. Ruth has come to the end of her tether when she returns from church to find that George has trimmed a tree her first husband had planted in the yard. She leaves a note saying she's gone away for awhile. Having told Joe that she has slept with someone on the side - without identifying who - she undertakes to try harder to be good. When Joe unexpectedly comes home and finds Brenda and Nate on the sofa half-naked, he doesn't have to guess who the other guy was. Claire comes to a decision on advancing her relationship with Edie but it leads to frustration all-round. Vanessa and her sister Angelica decide to visit Sophia and let her know just what they think of her fooling around with Rico.—garykmcd", "Claire has an unsatisfactory homosexual experience with Edie. Claire feels pulled to Edie, but not sexually driven. James Dubois Marshall drives his car to Fisher & Diaz for his own funeral and dies. Vanessa throws Rico away and he sleeps with Sophia. Later Vanessa calls Angelica, they fight with Sophia and break her car with a baseball stick. Rico ends his affair with Sophia. Brenda meets Nate and Maya and travels in the Travel Town train. Sarge calls David and they have sex. Celeste has sex with Keith and fires him. Joe comes home unexpectedly and sees Brenda and Nate having sex. The hysterical Ruth is increasing her paranoia with George.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701981", "rating": 8.0, "votes": 1794, "number_of_episodes": 63}