{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0004936": "Ben Foster", "0532461": "Justina Machado", "0420955": "Richard Jenkins", "0922995": "Michael Weston", "0004906": "Peter Facinelli", "0531589": "Peter Macdissi", "0337042": "Sprague Grayden", "0003740": "Julie Dretzin", "0944891": "Jeff Yagher", "0392073": "Tina Holmes", "0540164": "Matt Malloy", "0381117": "J.G. Hertzler", "0421087": "Lucinda Jenney", "0122020": "Scott Burkholder", "0730099": "Brent Roam", "0089093": "Jenni Blong", "0104861": "Alicia Brandt", "0055578": "Dwayne Barnes", "0528518": "Janice Lynde", "1421588": "Nicole Richie", "0105438": "Steffani Brass", "0360435": "Matt Hannigan", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0114280": "Michael Anderson Brown", "2046180": "Jason Connell", "0000666": "Lili Taylor"}, "geners": ["Comedy", "Drama"], "runtimes": ["59"],  "plot": ["In the Season Four finale, Ruth is delighted to meet George's daughter, but worries as his paranoid \"views\" of the future escalate.", "George's infatuation with impending disaster is causing him nightmares. His daughter Maggie joins him and Ruth for dinner and she has a lot of stories about her dad. Later, Ruth is quite concerned when she finds George talking by himself to an imaginary person. Claire's showing of her work is a huge success but she ignores her friends in the process. Nate is stressing over Barb's threat to take Maya away from him. He learns more about the circumstances of Lisa's death, leading to another tragedy. David hopes that if he faces his attacker, who is now in prison, he will feel liberated. It doesn't quite work out that way. Keith gets an interesting offer from Roger, who had promised to drop his lawsuit against Dave in return for sex.—garykmcd", "Given the opportunity to have some of her artwork displayed at a successful gallery, Claire is highly praised and recognized by viewers while being scorned for her detachment from relationships with and by her friends. David decides to meet his attacker in jail to put behind his burdening fears and anger. Nate finds out some shocking news about Lisa's death and George, having already stirred up some anxieties in his constant fear of freak occurrences, is found talking to himself by Ruth who calls his daughter Maggie for help.—Molly B.", "Kenneth MacDonald Henderson is split in two while trying to rescue three passengers of an elevator. Jimmy shows the pictures of Claire to a dealer and she is invited to expose in the Bellandi Gallery. Claire is excited and invites her friends, using cocaine in the vernissage. She argues with the selfish Russell, Billy defends her and later they have sex. Roger Pasquese has oral sex with Keith and calls off his claim in the justice. Later he invites Keith to be his bodyguard. Ruth and George have lunch with George's daughter Maggie. Later, when Ruth sees George speaking alone, she calls Maggie. Rico misses his family, and after having a conversation with Kenneth's widow, he proposes reconciliation with Vanessa, but she asks for the divorce. David visits Jake in the prison to express his rage and he feels better in the end. Nate sees the picture of Lisa that Michaela gave to David and travels to Idaho. He meets Hoyt and discloses an inner secret with tragic consequences.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702030", "rating": 9.1, "votes": 2520, "number_of_episodes": 63}