{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0004936": "Ben Foster", "0532461": "Justina Machado", "0004906": "Peter Facinelli", "0531589": "Peter Macdissi", "0337042": "Sprague Grayden", "0003740": "Julie Dretzin", "0944891": "Jeff Yagher", "0540164": "Matt Malloy", "0899487": "Tom Virtue", "0609948": "Christine Mourad", "0194900": "Nicholas D'Agosto", "0083564": "Lauren Birkell", "1347221": "Ryan Raddatz", "0721216": "Alisa Reyes", "0083573": "Peter Birkenhead", "0853231": "Tamara Taylor", "0381117": "J.G. Hertzler", "1408531": "Jordan Garrett", "1543278": "Hunter Johnson", "1378893": "Rob McCarthy", "1744948": "Kate Enggren", "0316723": "Reedy Gibbs", "1745040": "Carol Woodbury", "1744990": "Syvalouis Nance Jr.", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh"}, "geners": ["Comedy", "Drama"], "runtimes": ["49"],  "plot": ["Ruth is giddy about going to a tantric workshop with George, who retreats to the emergency shelter.", "Brenda feels the clock is ticking and wants to have a baby sooner rather than later. Nate wants to think about it for a while. A lunch with her mother Margaret doesn't go particularly well - Margaret is rushed to the hospital. The event does give Brenda and Billy a chance to see each other again. George feels they should be preparing for whatever catastrophe may befall mankind. Ruth tells him of the old bomb shelter and he thinks it's just perfect. Claire's latest project gets raves from Billy and several of her classmates but she reacts badly when Russell claims to have originated the concept with her. She's thrilled though when she gets the opportunity display some of her work at a show. David learns that the man whose ear he's bitten is suing him for $500,000. There's one way he can get out of it but it involves Keith. At the funeral home, Rico and Nate deal with a particularly tragic case when four members of the Gorodetsky family - parents and two children - are killed in a car accident leaving only their eldest son to deal with it all. Nate is forced to admit to Lisa's sister Barb that he buried her in the desert.—garykmcd", "While making a turn with his van, Edward Gordon Gorodetsky hits a truck and the whole family dies (Coco Grimes Gorodetsky, Michael Timothy Gorodetsky and Amanda Lynn Gorodetsky). Brenda wants to have a baby and Nate and she receive Barb and Hoyt. Nate tells that he buried Lisa in the Mojave desert and Barb threatens to take Maya from Nate. David is sued in US$ 500,000.00 by Roger Pasquese because of the bite in his ear. Claire exposes her pictures in Billy's class and Russell steals part of her credit. Brenda has lunch with her mother and Margaret needs to be submitted to an emergency surgery. George buys lots of bottles of water and prepares the bomb shelter for any catastrophe, while Ruth wants to travel with him. The police arrest Jake and call David for identification.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701978", "rating": 8.0, "votes": 1798, "number_of_episodes": 63}