{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0165101": "Patricia Clarkson", "0002546": "Mena Suvari", "0857620": "Justin Theroux", "0532461": "Justina Machado", "0000870": "Kathy Bates", "0134072": "Bobby Cannavale", "0005502": "Michelle Trachtenberg", "0550358": "Melissa Marsala", "0216738": "Idalis DeLeon", "0337042": "Sprague Grayden", "0807548": "Brooke Smith", "0663469": "Lana Parrilla", "0425616": "Lauri Johnson", "0511941": "Jack Lindine", "0445551": "Tim Kelleher", "0544067": "Michael Mantell", "0083564": "Lauren Birkell", "0368243": "Steve Hasley", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1046808": "Geraldine Singer", "0584408": "Kerry Leigh Michaels", "0138966": "Jean Carol", "0330437": "Mary Kathleen Gordon"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["Ruth goes on a fossil hunt with George and digs up Sarah and Bettina. Claire focuses her talents on Edie.", "Claire has taken a liking to her friend Edie but is having difficulty coming to terms with her emotions. With Vanessa suspicious, Rico decides to tell Sophie he can't come by anymore. She's at her manipulative best and he can't bring himself to break away. Vanessa follows him and assumes the worse when she sees her. Nate and Brenda have been sleeping together but he also goes on a date with a fellow worker from the pet retreat. George and Ruth's relationship is strained and he invites her on his annual fossil hunt. Their outing doesn't go well and they end up at her sister Sarah's house. Sarah's overcome her addiction but Ruth realizes she may have more in common with her sister than she would like to admit. Keith is on tour with Celeste who takes them to a gay bar.—garykmcd", "Joan Morrison postpones the treatment of two tumors, they get bigger and bigger and she dies of cancer. David is feeling better, but he is still much traumatized. Rico breaks with Sophia, but Vanessa sees him leaving Sophia's house and sends him away from home. Ruth is paranoid with George, and decides to follow him in his fossil hunt in the canyon. She decides to go with him to Sarah's house, where she meets Bettina. Brenda sleeps with Nate and decides to tell Joe. Celeste is upset after losing her favorite earrings, and she decides to go to a gay bar, and Keith discloses his sexual preference to Javier. Claire decides to have a homosexual experience with Edie.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702014", "rating": 7.9, "votes": 1814, "number_of_episodes": 63}