{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0002546": "Mena Suvari", "0857620": "Justin Theroux", "0001026": "Joanna Cassidy", "0004936": "Ben Foster", "0532461": "Justina Machado", "0004906": "Peter Facinelli", "0134072": "Bobby Cannavale", "0005502": "Michelle Trachtenberg", "0531589": "Peter Macdissi", "0944886": "Missy Yager", "0216738": "Idalis DeLeon", "0337042": "Sprague Grayden", "0914209": "James Waterston", "0807548": "Brooke Smith", "0172558": "Mo Collins", "0384032": "Amy Hill", "0465664": "Thomas Kopache", "0003740": "Julie Dretzin", "0944891": "Jeff Yagher", "0085316": "James Black", "0454482": "Benjamin King", "0534380": "Tim Maculan", "0105438": "Steffani Brass", "0247475": "Margaret Easley", "1080716": "Anthony Begonia", "2041913": "Matthew Viens", "2038417": "Michael Viens", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1807923": "Spencer Hill", "0427757": "Christopher Jones", "1952450": "Michael Kozak", "0000666": "Lili Taylor"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["David's ex-fiancee re-enters his life in search of answers to the question, \"Why me?\"", "Ruth is more convinced than ever that Arthur is responsible after they receive yet another package with feces. She decides she's going to lay a formal complaint with the police but George finally tells her it's not Arthur and knows who is sending these packages to them. David receives a frantic call in the middle of the night from Jennifer, his one-time fiancée, telling him that her father Lawrence Mason died from a lightning strike. He wants to help her out as much as possible but worries when her current fiancé seems less than supportive. When he reaches out to her she unleashes her pent up anger over their failed relationship. Nate begins to think that Lisa may not be dead. Brenda and Joe have dinner with Brenda's mother and Olivier. Keith has yet to come out at work and it's starting to weigh on him.—garykmcd", "While walking in the rain with a stolen umbrella, Lawrence Henry Mason is struck by a lightening and immediately dies. His daughter Jennifer, former girlfriend of David, calls him to make the arrangements of the funeral service. Keith and David discuss the colleagues of Keith that believe he is straight. David is disappointed with Keith and tells him that he should come out with his gay situation to his mates. Further, he says that Keith would be the last person he would believe that would turn into a self-loathing homo. Keith becomes upset with the eccentric and nasty star Celeste in a benefit show. Maya visits Legoland with Barb's family and Nate visits Brenda, who is playing twisted SM games with Joe, but they receive him. On the next morning, while running in the park, Nate follows a dog and he arrives in a psychic that tells him that Lisa is alive, disturbing him again. Ruth decides to press charges against Arthur in the police, and George tells her that his son Kyle is the one actually sending feces to him. Ruth schedules a visit to Kyle. Claire, with dyed hair, has a disappointing date with Jimmy, and Edie offers a real orgasm to her. Rico is split between the insistent Sophia and Vanessa. Brenda and Joe have dinner with Margaret and Olivier, and later Joe tells Brenda that he would like to have a baby.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701980", "rating": 7.7, "votes": 1809, "number_of_episodes": 63}