{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0004936": "Ben Foster", "0000870": "Kathy Bates", "0420955": "Richard Jenkins", "0004906": "Peter Facinelli", "0337042": "Sprague Grayden", "0180094": "Michael Cornacchia", "0372366": "Pat Healy", "0827561": "Maury Sterling", "1240415": "Andrew Friedman", "0571930": "Joel McKinnon Miller", "0475836": "Emily Kuroda", "1736215": "Scott Freeburg", "1394335": "Xhercis Mendez", "0108861": "Kevin Brief", "1705015": "Kacey Camp", "1091922": "Juan Carlos Cantu", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1542353": "David Daskal"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["Ruth and Bettina take a road trip to Mexico, leaving the men of Fisher and Diaz to some male bonding.", "Having agreed over the phone not to have sex with others, Keith on his return tells David of having slept with Celeste. Still stressed from his attack, David now worries that Keith will develop an interest in women. Claire is still having trouble coming to grips with her own sexuality. Her friend Edie no longer wants to speak to her but Jimmie suggests they sleep together. Claire is also surprised at school when she learns that Billy Chenowith will be their substitute teacher for the rest of the term. In the year he's been away he seems to have gotten his act together but does admit he's not seen his sister Brenda in that time. Brenda and Nate are sleeping together regularly but her admission that she loves him elicits a strange and unexpected response. Ruth has no interest in returning home and she and Bettina set off for a holiday in Mexico that has its own surprises for them. At the funeral home, Nate and Rico's latest client is Lawrence Tuttle, a comic book collector. Rico is still living at the funeral home and pining for Vanessa and the kids; George suggests it's time to move on and find a new woman.—garykmcd", "The comic books collector Lawrence Tuttle dies while trying to reach a rare magazine on a shelf on the top of a cabinet. David is still traumatized, and Keith tells him his one nightstand with Celeste. David tells Keith about his sexual encounter with Sarge. Ruth and Bettina travel to Mexico, while George advises Rico to forget Vanessa and find another woman. Billy substitutes Pope in Claire's class. Brenda tells Nate that she is in love with him, and he leaves her in the bed. Edie avoids Claire and stays with Anita, and they tell Jimmy that Claire has never had an orgasm. Jimmy proposes Claire to have sex with her and use his \"grinding the corn\" technique, and she is satisfied.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701992", "rating": 7.6, "votes": 1803, "number_of_episodes": 63}