{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0000870": "Kathy Bates", "0165101": "Patricia Clarkson", "0001026": "Joanna Cassidy", "0005438": "Jeremy Sisto", "0420955": "Richard Jenkins", "0392073": "Tina Holmes", "0922995": "Michael Weston", "0531589": "Peter Macdissi", "0582149": "Chris Messina", "0708867": "Anne Ramsay", "0540164": "Matt Malloy", "0534380": "Tim Maculan", "1766885": "Kendre Berry", "1468486": "C.J. Sanders", "0639917": "Sean O'Bryan", "0161970": "Robert Cicchini", "1058940": "Scoot McNairy", "0498513": "Joanne Rubino", "1462333": "Lilli Babb", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["While David attends to family business, Keith makes an embarrassing self-discovery on the job.", "The family prepares for the worst funeral of their lives. Ruth makes things worse on David by taking out her pain on him until he stands up for himself, and Nate makes things worse for Brenda by reminding her she had the chance to marry Joe if she doubted him. Claire, troubled by the fact that mainly negative memories come to mind, again finds comfort in Ted, who explains that it's not unusual. In the middle of the preparations, Keith gets an emergency call from Roger to remove a breaking-and-entering actor...who reveals Roger taped their affair as he promised he wouldn't, so Keith quits working for him. David has no other business so concentrates on the funeral to keep himself together, especially after a brutal insult from his father, who dodges the question on whether he had favoritism among his children but openly condemns David's gayness. Ruth's pain increases when learning it's a green burial so helps David in order to see the body. At the private burial, David is terrified when he imagines he's attacked by Jake in an orange-sweatshirt in the car and suffers another panic attack, so doesn't help. Ruth gets some comfort with Bettina's visit and, after the funeral, with Brenda's request for her to watch Maya until she can recover from her own pain...and anger.—brainybrailler@comcast.net", "When David brings Nate's corpse, he realizes that his brother was a donor of organs. David tells Brenda that Nate had told him that he wanted a green funeral, being buried neither with restoration nor coffin. The family and friends grieve the loss and Ruth blames herself for her absence. Brenda has inner conflicts with the whole situation and leaves Maya with Ruth.—Claudio Carvalho, Rio de Janeiro, Brazil", "On her return home, Ruth learns about what's happened to Nate and is angry at herself for being out of contact for so long. Her sister Sarah and friend Bettina are there to support her. Claire tries to overcome her feelings by turning to drugs and asks Ted to help her out. He again proves to be a good friend and takes her out of the house to give her a chance to have some time away from the others. David hasn't slept much and has to do what a funeral director does while Keith takes care of the two boys. Unfortunately Keith's boss Roger has a job for him to do on today of all days. Keith does it but when he learns that Roger recorded their sexual encounter and is showing it to others, he quits. Maya is asking Brenda where her daddy is and Brenda and her mother disagree on what Brenda should say. With everything that's happening around him, David begins to have panic attacks and visions of a stalker in a red hood.—garykmcd"], "genres": "N/A", "imdbID": "0701975", "rating": 9.7, "votes": 4164, "number_of_episodes": 63}