{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0004936": "Ben Foster", "0392073": "Tina Holmes", "0000893": "Ed Begley Jr.", "0004906": "Peter Facinelli", "0531589": "Peter Macdissi", "0582149": "Chris Messina", "0337042": "Sprague Grayden", "0708867": "Anne Ramsay", "0592081": "Dianna Miranda", "1766885": "Kendre Berry", "1468486": "C.J. Sanders", "0875684": "Christine Tucci", "1354503": "Abby Brammell", "0710271": "Kevin Rankin", "0644418": "Deborah Offner", "0133341": "Victor Campos", "0213320": "Irene DeBari", "0646192": "Gabriel Olds", "0454030": "Kenneth Kimmins", "0068407": "Michael Bell", "0276232": "Edith Fields", "1364480": "Leonardo Ciacci", "0923600": "Richard Wharton", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1261965": "Darcy Donavan", "1933842": "Nicholas J. Giordano", "1762924": "Athena Stamos"}, "geners": ["Comedy", "Drama"], "runtimes": ["56"],  "plot": ["A young Latina's funeral raises questions about the culture--and future--of Fisher and Diaz.", "Pilar Sandoval attempts to Rollerblade a steep hill while walking her dogs but literally doesn't make it when she loses control and is hit by a car. Brenda is upset with Nate's fists-up attitude toward the daughter they'll have, and is suspicious that his latest wish to attend Quaker meetings is simply to join Maggie. David, Nate, and Rico try but fail to agree on how to invest on the business, but it gives Rico a good opportunity to focus on pursuing his relationship with Vanessa. Ruth's babysitting experience with Durrel and Anthony goes sour when they don't return from playing basketball until Durrell drives the SUV home, and, only after David blames Ruth, is learned to have done it before. Later Durrell threatens Keith during a confrontation over it, and David learns from Anthony that he doesn't get they won't have to eventually leave. Ruth, encouraged by Claire to get a haircut, goes camping with Hiram again. Claire herself only attends Anita's show when Ted offers to tag along, and it goes smoother than she expects. The second night Nate attends a Quaker meeting with Maggie, Brenda goes there after her ultrasound with Jackie, only to find Nate absent, since he and Maggie got wrapped up talking and never went. As Brenda waits for his arrival, they sleep together...then Nate gets up, and immediately goes numb and collapses.—brainybrailler@comcast.net", "Keith and Dave have settled into parenthood reasonably well and ask Ruth to babysit while they go out. Ruth is more than happy to and wants to get to know her new grandchildren better. She loses track of them however and when Dave sees Durrell driving an SUV in the garage, he realizes they have a ways to go. Ruth pays a visit to her old boyfriend, Hiram Gunderson. She invites him back to the house and has more than just a chat in mind. Claire invites her lawyer friend from work, Ted Fairwell, to accompany her to the LAC Arts student art exhibit. She runs into a number old friends, including her one-time teacher Olivier, but her ex-boyfriend Russell is a mess and causes a scene. Nate is still interested in the Quaker faith but Brenda isn't. He goes to pick up Maggie for church but one thing leads to another and he afterward ends up in hospital after collapsing in her living room.—garykmcd", "While walking with her rollerblade in a steep hill with her three dogs, the Latin Pilar Sandoval is hit by a car. In the Fisher & Diaz, David proposes the investment in a crematory, but Rico disagrees. Brenda goes with Jackie to Dr. Melnick's office to be submitted to an ultrasonographic examination, and she tells Jackie that Nate is very distant of the baby. Further, that he had suggested her to go with him to a Quaker church for meditation instead of to a counselor. After the examination, she refuses again the amniocentesis. Claire meets Anita by chance and is invited to go to an arts exhibition. She dates with Ted and meets her former friends from the art school. Keith is threatened by Durrell with a knife, and Anthony tells him later that Durrell is having much fun as possible before returning to the adoption agency, like the other foster parents have done. The dysfunctional Ruth dates the hairdresser Hiram. Rico has a serious conversation with Vanessa about their relationship. Nate visits Maggie before going to the church and they have one night stand. Later Nate feels his arm dumb and faints.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702007", "rating": 8.7, "votes": 2109, "number_of_episodes": 63}