{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0392073": "Tina Holmes", "0185078": "Jennifer Elise Cox", "1468486": "C.J. Sanders", "0051862": "Lisa Banes", "0001034": "Rosalind Chao", "0921753": "Mia Wesley", "0269599": "Meagen Fay", "0846834": "Jayne Taini", "0319304": "Mary Gillis", "0212939": "Ron Dean", "0325975": "Danny Goldring", "0908685": "Jack Wallace", "0586994": "Andy Milder", "0864960": "Patty Tobin", "0425001": "Drake Johnston", "1965417": "Braeden Lemasters", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "2235902": "Lalonie Davis", "3973049": "Audrey Harris", "1800847": "Sarah Nanko", "2106867": "Shea Weaver"}, "geners": ["Comedy", "Drama"], "runtimes": ["49"],  "plot": ["Ruth finds a new way to unwind from George, who longs to close the distance between them.", "Diabetic Daniel Holzenchenko succumbs to the call of canned peaches...and leaves behind 2 brothers and 2 sisters who seem unable to agree on anything from refreshments to music to be used at his funeral. While trying to mediate them, Nate also has to figure out how to convince Brenda not to tell Maya that she is her stepmother and her real mother Lisa is dead. David and Keith go to an adoption agency picnic where they meet Anthony, and choose to foster and possibly adopt him and his brother, when Mary's news about conception changes to news of an error. Ruth tells her knitting group her patience with George has officially ended, and at their urging convinces him to find an apartment for them and a job for himself - but actually plans to leave him with the apartment. Claire has a worse time leaving Billy, pressured by Margaret as well as him. Julio torments another student so Rico volunteers to go in and explains his anger is actually from his parents' divorce, but Vanessa confronts him about what he says. Nate is advised to make a choice about talking with Maya from an interesting source, and gets a surprising response from Brenda.—brainybrailler@comcast.net", "While eating canned peaches, the diabetic Daniel Holzenchenko dies and his relatives do not agree with a procedure for the funeral services. George invites Ruth to travel, but she has no further patience with him. Brenda decides to tell Maya that she is her stepmother, upsetting Nate. David and Keith go to an adoption picnic promoted by an agency and David meets the Afro-American Anthony; however, Mary tells them that she is pregnant and they conclude that they are not able to have two children at home. Margaret puts pressure on Claire to return to Billy. Julio has a problem at school with another student, and Rico manipulates the principal blaming his divorce with Vanessa for the situation, telling private details of her life. Mary finds that is not pregnant, and David and Keith return to the adoption agency and finds that Anthony has an older brother. Ruth rents an apartment and plots to leave George in the place. Nate decides to tell Maya the truth about Lisa.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nate and Brenda argue over when Maya should be told about her biological mother. Nate still hasn't come to terms with Lisa's death and what it all means. Claire has moved out of Billy's apartment after his bad behavior. He desperately wants her back and starts taking his medication again but she'll have nothing to do with him. Billy's mother Margaret asks her out for dinner but it's nothing short of an ambush. Claire's life at home isn't much better and her battles with Ruth have reached a fever pitch. David and Keith decide that pursuing both options for children - a surrogate or adoption - is best but David really wants to adopt, especially after meeting a nice kid named Anthony. Rico and Vanessa continue to argue, this time about their son Julio who is accused of bullying a classmate at school. Rico talks to the principal and basically lays it all on Vanessa. Ruth has decided the time has come for George to move out but is less than honest with him about it.—garykmcd"], "genres": "N/A", "imdbID": "0701986", "rating": 8.1, "votes": 1834, "number_of_episodes": 63}