{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0420955": "Richard Jenkins", "0392073": "Tina Holmes", "0000893": "Ed Begley Jr.", "0933988": "Rainn Wilson", "0642522": "Ed O'Ross", "0582149": "Chris Messina", "1766885": "Kendre Berry", "1468486": "C.J. Sanders", "0335691": "Vince Grant", "0338872": "Michele Greene", "0880820": "Andy Umberger", "1187258": "Elaine Kao", "1268799": "Mae Hi", "0920223": "Gordon Wells", "1994573": "A.J. Lee", "0414052": "Sonia Jackson", "1515478": "Tim Mikulecky", "0424500": "Andrea Johnson", "1484129": "Wayne Lopez", "1026376": "Cindy Lu", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0490560": "Jim Lau"}, "geners": ["Comedy", "Drama"], "runtimes": ["49"],  "plot": ["David and Keith get comfortable with their new family life; Claire discovers she and Ted share a common interest.", "Lawrence Hall Matheson chooses the wrong moment to check his pulse while jogging in a California \"ecotone\" - a cougar mauls him. Hospitalized following his seizure, an unconscious Nate dreams he returns home after he simply woke his asleep arm up and requested a divorce, while in reality Maggie struggles to answer medical questions and contact the family. David arrives only to learn that Anthony is terrified to be in a hospital, and Claire is accompanied the whole time by Ted, so she respects him despite the fact that he's Republican. The doctor, unfamiliar with Nate or the family, at first only manages to report redundant information, then finally concludes he should be fine, save some left-side weakness that therapy should eventually cure. Ruth doesn't have a cell phone so while everyone else awaits news of Nate, she is unaware of the situation and rejects Hiram, fantasizes revenge on all her boyfriends (and what her reaction would be to her husband), and after a long walk manages to start home via Chinese tour bus. Brenda guesses what \"physical activity\" caused Nate's heart to race just before his incident, and confronts him when he awakens, only to find her offer of forgiveness rejected: Nate says he's tired of fighting and is ready to give up on their relationship. When he and David fall asleep together, they both dream they're in the back of their father's VW bus smoking. A casual, relaxed David (Nate says he dreamed he was a whole other person) is surprised to see \"what they've been waiting for\" turns out to be the ocean, where Nate eagerly jumps in and encourages him to follow, though he's not as surprised as Nate and their father are that he balks and makes excuses about sharks. But David has to face the shock of his life when he wakes up.—brainybrailler@comcast.net", "Nate has had another cerebral hemorrhage and everyone spends an anxious night in the hospital waiting room. Nate comes out of surgery okay but has limited mobility on his right side. Brenda is willing to forgive his transgressions but Nate seems to have his own plans for the future. Ruth and Hiram go camping and she is oblivious to Nate's current situation. She and Hiram have an argument and she sets off on a her own only to get lost. Claire is having dinner with her new friend Ted - and isn't too keen on his political views - when Dave lets her know about Nate. Ted turns out to be a good friend. Dave and Keith take their kids to the hospital but Anthony is behaving strangely. Alone with Nate in his hospital room, Dave has a dream where he, Nate and their father go to the ocean but Dave is afraid to go in the water. He awakens to a more startling reality.—garykmcd", "While walking in the canyon, Laurence Hall Matheson is attacked by a cougar. Nate is sent to the Saint Bridger Hospital, and the diagnosis is HVM and bleed. Maggie calls David, and he calls Brenda and Claire, who comes to the hospital with Ted. While in the waiting room, the atmosphere is tense with the presence of Maggie. Meanwhile, Ruth invites Hiram to camp, and she argues with him and leaves him, walking alone back home. Nate ends his relationship with Brenda, and while watching TV with David, he has a dream and dies.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701987", "rating": 9.5, "votes": 3497, "number_of_episodes": 63}