{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0001152": "Illeana Douglas", "0392073": "Tina Holmes", "0528518": "Janice Lynde", "0540164": "Matt Malloy", "0708867": "Anne Ramsay", "0185078": "Jennifer Elise Cox", "0255175": "Chase Ellison", "1483657": "Mimi Michaels", "0637598": "Bruce Nozick", "1957415": "Netta Most", "0416381": "Colton James", "0083573": "Peter Birkenhead", "0035395": "Jillian Armenante", "0694386": "Dave Power", "1693589": "Jared Elliott", "1553725": "Kellan Lutz", "0375289": "Chip Heller", "1461001": "Andrew Reville", "1717737": "Zaki Rubenstein", "1851071": "Chil Kong", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh"}, "geners": ["Comedy", "Drama"], "runtimes": ["50"],  "plot": ["Claire is seduced by Billy's newfound lust for life, but hits a roadblock along the way.", "In 1954 Loretta Smith Sibley committed suicide in front of her son George. With the anniversary of September 9th approaching, George is haunted by her presence enough to distract him at home, repeats his habit of placing unwanted food in his pockets, telling Ruth he was saving it, and confesses to Maggie that he again needs therapy. Ruth also has to deal with Claire confronting her after she freezes her account since she's no longer in school. Billy buys her the camera she wanted to purchase herself as they consider leaving for Spain, but Ruth disapproves of the whole thing. Rico runs into but is rejected by Vanessa at a church dating meet, so dates his former replacement Angela. Brenda befriends a co-worker after her first counseling experience results in a physical attack, and Nate befriends his stepsister Maggie, a divorcée whose son passed away at a young age.—brainybrailler@comcast.net", "Ruth is totally upset with George, who asks his daughter Maggie to take him to a new session of electroshock. He recalls when his mother, Loretta Smith Sibley, committed suicide and asked him to hold her hand. David and Keith have trouble with the adoption process and David overreacts. Rico goes to an undertaker convention and meets his former replacement Angela, and they have one night stand. Brenda is bounced against the wall by a patient and her colleague Jackie invites her to have dinner with her family. Brenda feels very comfortable and schedules a family dinner with Nate and Maya. Claire plans with Billy to move to Spain but her allowance is cut by her family lawyer since she dropped the college, and she argues with Ruth.—Claudio Carvalho, Rio de Janeiro, Brazil", "Billy thinks he and Claire should go live in Europe for a few years, preferably in Spain. Claire is outraged however when the family lawyer tells her that having dropped out of school, she no longer has access to her trust fund. She also learns that her mother was complicit in the decision. Keith and David have changed their minds and have decided to adopt a child. Their suitability is called into question when something from David's past comes back to haunt him. Brenda starts her new internship at the university but has a nasty encounter with an unstable student. George continues to act erratically. It's the anniversary of his mother's death and he's haunted by having watched her died. Ruth is concerned by what she finds in his laundry. His daughter Maggie has stayed around and she and Nate hit it off at a family dinner. Rico attends a Church-sponsored singles night and meets Vanessa there. At a funeral directors convention however, he runs into Angela who had replaced him when he'd left for a short while.—garykmcd"], "genres": "N/A", "imdbID": "0701993", "rating": 8.2, "votes": 1873, "number_of_episodes": 63}