{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0001026": "Joanna Cassidy", "0392073": "Tina Holmes", "0828906": "Cynthia Stevenson", "0582149": "Chris Messina", "0220886": "Stanley DeSantis", "0750598": "Elizabeth Ruscio", "0051862": "Lisa Banes", "0001034": "Rosalind Chao", "1766885": "Kendre Berry", "1468486": "C.J. Sanders", "0875684": "Christine Tucci", "1354503": "Abby Brammell", "0710271": "Kevin Rankin", "0644418": "Deborah Offner", "1404825": "Vanessa Marano", "1382563": "Nathan Norton", "0913585": "Audrey Wasilewski", "0624842": "Christopher Neiman", "0624498": "Mary-Joan Negro", "0919258": "René Ashton", "0864960": "Patty Tobin", "0565450": "Rod McCary", "2409906": "Ariel Rivera", "3632808": "Tony Cronin", "2584426": "Angelo Custino", "1795440": "Chris Farach", "3112508": "Amanda Leighton", "4016627": "Hayden Thompson"}, "geners": ["Comedy", "Drama"], "runtimes": ["57"],  "plot": ["David and Keith struggle to create parent-child boundaries. Brenda and Nate get some ambiguous news.", "Maggie Sibley's friend and fellow Quaker Peter Thomas Burns suffers a heart attack while watching a play, and Nate becomes intrigued about her faith when she brings it up. Brenda's blood tests reveal that her and Nate's child has a higher-than-usual possibility for developing Down's Syndrome or other complications at birth, and the doctor recommends amniocentesis to eliminate these factors. Ruth, feeling a misfit among other women in the sudden free time offered her without George, is displeased to hear that he wants the briefest divorce possible since he's already found another woman, so warns her she'd be marrying a depressed, sick man. Meanwhile, Rico is disgusted that sleeping with Vanessa is brief, to the point, and unenthusiastic, almost like another chore for him to help out with. Claire meets Ted, a lawyer, at work and eventually chooses to try to connect with him. David accidentally learns that Durrell will be performing in a school musical, and, remembering what it was like to have a parent who didn't have time to do it for him, he insists to Keith that they should go see him in it...despite the fact that Durrel's embarrassed enough about it not to want them to. After hearing Maggie admit her handicapped son's life was painful for her, Nate is inclined to agree with the doctor that Brenda should test to ensure there are no problems with her pregnancy, but Brenda is doubtful enough of his support to refuse.—brainybrailler@comcast.net", "Moving back in with Vanessa isn't working out as Rico had hoped. It becomes apparent that Vanessa only asked him back to help out around the house. With her separation from George now apparently complete, Ruth now feels empty and drained of emotion. George asks her to visit and she reluctantly agrees but isn't at all ready for what he asks of her. She decides to do something about it. Claire decides to go out for a drink with her co-workers where one of them tells her she's having a thing with company lawyer Ted Fairwell. When Claire and Ted talk, he has a somewhat different story. It's also obvious that he's interested in Claire. Nate and Brenda are disturbed when their doctor suggests that tests on their unborn baby suggest the possibility of birth defects and that an amniocentesis is highly recommended. Nate wants to go ahead with the tests fearing that a special needs child will be too difficult for them to handle. Brenda refuses and then becomes suspicious when she sees Nate and Maggie Sibley together at the funeral home. Dave and Keith meanwhile are continuing to hone their parenting skills and attend Durrell's school play.—garykmcd", "While in the audience of a theater, the Quaker Peter Thomas Burns dies, and Maggie becomes deeply sad, since he was her friend. David and Keith have continuous troubles with the behavior of Durrell, and David accidentally finds that Durrell will participate in a musical play in his school. However, the boy is embarrassed and has not invited them for the event. Brenda finds that her baby has a great possibility of developing Down's Syndrome through a non-conclusive examination, and her doctor advises an amniocentesis to check more accurately. Nate immediately agrees, but Brenda does not accept the test. Their marriage is in crisis and Nate suggests her to go with him to a Quaker church for meditation. George asks the divorce to Ruth in an urgent basis since he is in love with another woman. The dysfunctional and hysterical Ruth visits Joy Solomon to tell her that George is a deranged man. Rico is upset with the cold relationship with Vanessa. Claire is meeting with her colleagues after hours in a shopping bar and the lawyer Ted is getting closer to her.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702027", "rating": 8.0, "votes": 1868, "number_of_episodes": 63}