{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0420955": "Richard Jenkins", "0392073": "Tina Holmes", "0708867": "Anne Ramsay", "0185078": "Jennifer Elise Cox", "0016687": "Ellen Albertini Dow", "0051862": "Lisa Banes", "0001034": "Rosalind Chao", "0540164": "Matt Malloy", "0113935": "Julie Brown", "1404825": "Vanessa Marano", "1382563": "Nathan Norton", "0639917": "Sean O'Bryan", "0161970": "Robert Cicchini", "0655963": "Scott Paetty", "0864960": "Patty Tobin", "0865869": "Berlinda Tolbert", "1872697": "Gloria Garayua", "1656102": "Glenda Tusher", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1927313": "Joe Bell", "0001152": "Illeana Douglas", "3973049": "Audrey Harris", "0000666": "Lili Taylor"}, "geners": ["Comedy", "Drama"], "runtimes": ["51"],  "plot": ["Brenda is disturbed by Nate's reaction to her latest news. Ruth shares her feelings about George with friends.", "Lila Simmonds Coolidge passes away just before her 95th birthday...which she happened to share with Nate. This year, Nate's 40th is marked by the news that he'll be a dad, which he doesn't react to as enthusiastically as Brenda had hoped. Claire breaks off with Billy after a final night together because of his wild behavior off medication, while George's apologies to Ruth don't lessen her impatience toward his problems. Rico sleeps with Vanessa when he shows up to remind she forgot to pick their son up, but she ensures it will be the last time. At Nate's unwanted party where his mood is already low after accidentally revealing Brenda's pregnancy and creating more friction, a bird some consider to be an omen and others merely to be an annoyance continues to invade the house. When Nate is insulted for allowing its return by not closing the window it originally entered through, he takes out all his frustration on the bird.—brainybrailler@comcast.net", "On the day of his fortieth birthday, Brenda tells Nate that she is pregnant and she becomes upset with his reaction. Billy is aggressive and disturbed since he stopped his medication, affecting his relationship with Claire. David and Keith have an interview with the candidate to rent her belly, and they ask if they may use her eggs. Rico brings his son to Vanessa's place and they have one night stand. David decides to cut his hair and has a crush on the hairdresser. Brenda gives a surprise birthday party to Nate, and they argue. Nate is not sure if he loves Brenda and wants a baby. George feels miserable with the treatment of Ruth. Claire has one night stand with one friend of Nate.—Claudio Carvalho, Rio de Janeiro, Brazil", "It's Nate's 40th birthday and while he says it's just another day, his mood and his actions say otherwise. He doesn't react as expected when Brenda tells him the results of her most recent pregnancy test. He also has little to say at the surprise party she throws for him when he gets home that night. Billy is off his medication and living with him is proving to be a bit too much for Claire. Keith and Dave decide on the egg donor and the surrogate for their child. Rico and Vanessa end up in bed when he drops their son off at home but she still wants him out in the morning. At her knitting club, Ruth has been telling a couple of her friends about her week with George. She is deeply unhappy with her lot in life and doesn't see much improvement in George. At the funeral home, their latest client is 95 year-old Lila Coolidge who died at home of old age.—garykmcd"], "genres": "N/A", "imdbID": "0702032", "rating": 8.7, "votes": 2129, "number_of_episodes": 63}