{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0392073": "Tina Holmes", "0708867": "Anne Ramsay", "0278979": "Jenna Fischer", "1517976": "Chris Pine", "0193639": "Ann Cusack", "0639917": "Sean O'Bryan", "0381117": "J.G. Hertzler", "0330813": "Elaine Kagan", "1711052": "Rhys Coiro", "0878034": "Bahni Turpin", "0789117": "Monti Sharp", "0227406": "Mariana Dimitrova", "0584408": "Kerry Leigh Michaels", "0122913": "Traber Burns", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "2163881": "Nikole Smith", "1734650": "David Di Brienza"}, "geners": ["Comedy", "Drama"], "runtimes": ["53"],  "plot": ["Nate hangs with high-school friends, but finds that, as adults, they share little more than old memories.", "While trying to reach the newspaper on the sidewalk, Samuel Wayne Hoviak, who was the best high-school friend of Nate, falls and his truck run over him. In the funeral service, Nate meets their other former best friend, Tom Wheeler; they recall their adolescence and realize that they are getting up. The bitter and deranged Ruth has no patience with George, and they receive his daughter Maggie. David proposes Claire to donate her eggs for the baby of his own with Keith, but she refuses. Claire feels her art rejected by the owner of a gallery and Billy misses his former personality. Rico dates Sharon and does not understand her hint that she does not want to see him again. Brenda begins an internship in a free clinic and does not support her first day, seeking Margaret's influence to help her to find a better place to work.—Claudio Carvalho from Rio de Janeiro, Brazil", "Nate's high-school friend Samuel Wayne Hoviak falls from his truck while trying to reach the paper, but manages to activate it while falling so is run over after he lands. Nate reunites with the third member of their trio and wonders why he's changed so much since then while Tom hasn't. Ruth grows weary of dealing with George and he feels guilty in response, and the help that his daughter Maggie's visit brings is only temporary. Brenda rejects her mother's offer to quickly get a free psychiatric internship but has a difficult time there. Claire's latest experimentation with art isn't as popular as her old one, and David is uncomfortable when Keith asks him if he'll consider using her as a surrogate mother with him so that their child will be like both him and David. Sharon doesn't answer Rico's calls, and things turn out differently than expected when he goes to visit her apartment, worried about her. Billy notices he's changed since the same things don't inspire him at his artwork anymore, so goes off his medication again.—brainybrailler@comcast.net", "Nate is shocked when he realizes that their latest client is his best friend from high school, Sam Hoviak, who died when he fell out of his car in his driveway while reaching for the morning paper and the vehicle promptly ran over him. He meets his other high school buddy at the funeral home but realizes that they have very little in common any more. Claire is almost desperate to have another show but can't seem to get her art dealer interested in her new project. Billy has his own frustrations as his medication impairs his artistic side. Dave and Keith meanwhile have decided to go the surrogate route in their desire to have a child but have yet to find a surrogate. Keith suggests an idea that would involve Claire. Rico has been seeing a girl but panics when she suddenly stops returning his calls. Brenda's mother is horrified when she learns Brenda has taken an internship at a free clinic and offers to find something better for her. Ruth's relationship with George is at a very low ebb. She resents that he didn't tell her about his mental illness before they were married. When he's at his best, he's polite and caring but at his worst, she feels like she's dealing with an impish child. George's daughter Maggie comes to help out.—garykmcd", "Nate meets a high-school friend but finds that as adults, they share little more than teenage memories. Ruth gets relief from George's daughter Maggie; Brenda is reluctant to accept Margaret's help and struggles in her new internship. David begins to have doubts about a surrogate child. Claire bemoans being pigeonholed by her art. Billy defends his career but secretly wonders what happened to his old self. And Rico, mortified that he couldn't take a dating hint, seeks sympathy from Vanessa.—Anonymous"], "genres": "N/A", "imdbID": "0701983", "rating": 7.9, "votes": 1896, "number_of_episodes": 63}