{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0000666": "Lili Taylor", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0001573": "Catherine O'Hara", "0392073": "Tina Holmes", "0531589": "Peter Macdissi", "0001021": "Veronica Cartwright", "0003740": "Julie Dretzin", "0944891": "Jeff Yagher", "0278979": "Jenna Fischer", "1047343": "Chris Harrison", "0047896": "Maggie Baird", "0528518": "Janice Lynde", "0474779": "Anil Kumar", "0570033": "Kate McGregor-Stewart", "0362862": "Mark Harelik", "0534380": "Tim Maculan", "0105438": "Steffani Brass", "0280173": "Annie Fitzgerald", "0644418": "Deborah Offner", "1149125": "Joy Highsmith", "0832557": "Elizabeth Storm", "0301993": "J.J. Gales", "1083197": "Elisabeth Stassen", "1274142": "Leyna Weber", "0929757": "Amber Willenborg", "0546089": "DeVera Marcus", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "0191747": "Sabrina Culver", "1554561": "Brian David", "2324262": "Brandon Dante Davis", "2494940": "Gwendolyn Druyor", "1399816": "Brad Hammer", "1671501": "Franceska Lynne"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["In the Season Five premiere, Ruth dreads George's return from the hospital in light of his recent diagnosis.", "The insecure Andrea Kuhn is encouraged by her psychiatrist to disclose her true feeling to her family, and when she is happy being herself, her husband accidentally kills her after an argument. Ruth recalls how stress triggered a depressive psychosis in George and his treatment with electroshock. Brenda has a miscarriage in the eve of her wedding day. Billy invites Claire to move to his place. David and Keith are discussing the alternative for their baby, adoption or to rent a belly. Rico misses a steady relationship while dating women from an Internet site.—Claudio Carvalho, Rio de Janeiro, Brazil", "Encouraged by her psychiatrist to be more open on relationships with her family, Andrea Kuhn gets all the reactions she expects - her sister complains, her father cries, her brother yells...and accidentally impales her on a fireplace grate while trying to force a chair our from under her. Brenda ensures Nate their wedding will be nothing like his first one she sees on a videotape - which turns out to be true when she suffers a miscarriage the day before but still insists on keeping the date. Since Nate's proposal, George has been hospitalized and received electro-convulsive therapy for his specific type of depression, and now returns home with short-term memory loss, giving Ruth more to worry about just before the wedding. Claire and Billy decide to move in together despite David and Nate's doubts. At the wedding (where Rico is accompanied by Internet-date Sharon rather than Vanessa), Claire makes the mistake of getting a picture of George clumsily spilling a drink due to another side-effect of correlation, problems and Ruth accuses her of trying to capture details that make it appear as though they married too soon. David and Keith agree to consider adoption and surrogacy at the same time.—brainybrailler@comcast.net", "Brenda and Nate are looking forward to their wedding and have everyone over for dinner a couple of nights before. Their wedding day is less happy than would be the case when Brenda miscarries the day before. Ruth meanwhile is feeling guilty about having had George institutionalized. He was living in the bomb shelter and having imaginary conversations. He underwent treatment with medication but it proved unsuccessful and the doctor, with George's consent, introduced electric shock therapy. He's now due to come home and she isn't comfortable with the situation. Rico is still living at the funeral home and has entered the dating pool. Billy asks Claire to move in with him. Dave and Keith have decided to adopt and are going through the process of being approved as prospective parents. Keith seems to be more inclined to having a biological child that is his own, however. At the funeral home, Dave and Rico make funeral arrangements for Andrea Kuhn who was accidentally killed at home.—garykmcd", "Ruth dreads George's return from the hospital in light of his recent diagnosis; Nate and Brenda prepare for a big day, but an emergency makes them reconsider; David and Keith bring up alternative parenting options for discussion; Rico navigates new waters via Internet dating; and Claire enjoys domestic bliss but crosses a line with her camera, inciting an attack from Ruth.—Anonymous"], "genres": "N/A", "imdbID": "0701973", "rating": 8.4, "votes": 2030, "number_of_episodes": 63}