{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0000870": "Kathy Bates", "0005438": "Jeremy Sisto", "0001026": "Joanna Cassidy", "0420955": "Richard Jenkins", "0392073": "Tina Holmes", "0531589": "Peter Macdissi", "0582149": "Chris Messina", "1766885": "Kendre Berry", "1468486": "C.J. Sanders", "0534380": "Tim Maculan", "0862331": "Becky Thyre", "0568101": "James McDonnell", "0398440": "Terri Hoyos", "1931096": "Kristin Morley", "1892588": "Sahar Bibiyan", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1708617": "Michelle Alexandria", "2393454": "Blade Anthony", "0050332": "Alan Ball", "1162113": "Louis Bernstein", "0104954": "Les Brandt", "0165101": "Patricia Clarkson", "1824868": "Ingrid Coree", "2156393": "Michael Didriksson", "0243952": "Mark Durbin", "0346161": "Armando Guerrero", "0390491": "Toby Holguin", "0541141": "Ricardo Mamood-Vega", "2141187": "C.J. Manigo", "0693561": "Alan Poul", "2763771": "Lee Wesley", "1377617": "Rachel Zeskind"}, "geners": ["Comedy", "Drama"], "runtimes": ["73"],  "plot": ["In the series finale, the Fishers begin the healing process while embracing the future.", "Nate and Brenda's daughter Willa is born, but 2 months early and at only 2 lb. 4 oz., requiring a prolonged hospital stay. Nate is convinced she won't make it and insists that he can't accept it if she does and is \"damaged\", shaking Brenda's own confidence. Rico encourages David to sell the funeral home but instead he and Keith buy out Rico's 25% so he can start his own. David agrees to temporarily leave home, and goes to the funeral home. There he's confronted by Nathaniel about considering leaving the business and for his gayness, and is forced to fight his mysterious attacker back, then finally sees his face. Maya is returned to Brenda and Ruth has to face her own problems, until Maggie reveals Nate did see her, happily, as Brenda insisted. Claire takes up photography (of Ted) again and gets a job offer at a New York photo production company, but offers to be there for Ruth until she insists she go and unfreezes her account. Brenda gets a surprise visit from Nate, who finally shows love for his daughter, and someone else. Claire learns the company who gave the job offer has just failed, but Nate encourages her to go onto New York anyway.—brainybrailler@comcast.net", "Brenda gives birth to baby Willa some 8 weeks premature. Brenda is most anxious about her condition but there is little the doctor can tell her beyond waiting and hoping for the best. The situation is not improving at home and Keith, worried about the impact of Dave's condition and behavior on the boys, insists that he out move out until he gets better. Claire makes up with Ted whom she had treated terribly when he brought home the day she was fired. She gets a job offer out of the blue from a stock photo company in New York City but has her hopes dashed at the last minute. Rico and Vanessa decide to buy their own funeral home but problems arise when Rico asks Dave to buy out his 25% share of the business. Dave finally sees who it is who is stalking him and comes to terms with everything that has happened. Keith has an idea on how they can buy out Rico's share and make a home for themselves and the boys.—garykmcd", "Brenda has troubles in the delivery of the premature Willa in the Cedars-Sinai Hospital. Claire is feeling lost, not sure whether she is not good to be an artist. She is invited by a New York City agency to work as assistant photographer. Keith uses his savings to buy Rico's share in the funeral house. Ruth moves to Sarah's place. David defeats his fears and ghosts and recovers his sanity. Claire moves to New York, while envisioning the fate of each character.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0701989", "rating": 9.9, "votes": 14057, "number_of_episodes": 63}