{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0005438": "Jeremy Sisto", "0392073": "Tina Holmes", "0582149": "Chris Messina", "1690665": "Amy Spanger", "0641266": "Jenny O'Hara", "1312073": "Billy Lush", "1766885": "Kendre Berry", "1468486": "C.J. Sanders", "1354503": "Abby Brammell", "0875684": "Christine Tucci", "0710271": "Kevin Rankin", "0828863": "Charles C. Stevenson Jr.", "0160644": "Libby West", "0270591": "Fred Fein", "1931096": "Kristin Morley", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh"}, "geners": ["Comedy", "Drama"], "runtimes": ["54"],  "plot": ["As David's fears take over, Keith tries to protect him, and the boys. Billy attends to his sister.", "Iraqi War veteran Paul Ronald Duncan receives a euthanasia in the hospital - and Claire, on drugs, takes out her own loss on the family by denouncing the war in general but also them for letting their son serve. Later, after several days of drinking, she is fired and fights Ted for taking her keys, then later crashes her car by trying to avoid hitting a deer when going to visit the family's newest grave. David can't find a way to express his feelings so colorfully, so is still plagued by nightmares and daydreams 6 weeks after the funeral, mostly involving an orange-hooded figure resembling his attacker. When reports come out that a similarly-clad child-killer is loose, David becomes increasingly worried about the boys, troubling his family enough to have Keith suggest he leave until he's calmed down. He's too distracted to talk business yet, so Rico begins to plan ahead for himself at Vanessa's advice, finds an available spot, and learns she's a natural when it comes to consoling mourners. Nate supports Ruth's keeping Maya permanently, so she argues when Brenda first attempts to pick her up until it's agreed to lengthen her temporary stay. Brenda plans to have Billy help raise Maya and her second daughter, until a troubling dream changes her mind. When attempting to reclaim Maya for a second time, Brenda's proposed argument is about to be delivered, when she goes into labor prematurely...—brainybrailler@comcast.net", "It's been six weeks since the funeral and all is not well. David is a basket case and can barely get out of bed in the morning. He continues to have panic attacks and see the stalker in the red hood. He's even neglecting his duties at work and puts Rico in a bind by taking the afternoon off and leaving someone's remains unprepared for a viewing. Alone at the funeral home, Rico gets Vanessa to help him out and they make a pretty good team. Billy has moved in with Brenda to help out but her own feelings towards him are such that she has to ask him to leave. She's also ready to have Maya move back in with her but Ruth isn't certain it's the right thing to do and wants Maya to stay with her. Brenda goes into premature labor. Claire has been drinking to excess and going to work drunk most days. After a blowup with a co-worker she is fired. She only makes matters worse by verbally attacking a client at the funeral home whose soldier son, Paul Duncan, lost an arm and both legs in Iraq and subsequently committed suicide in the hospital.—garykmcd", "Holly, the sister of the mutilated soldier Paul Ronald Duncan, provides a lethal injection to him and he commits suicide. David is completely disturbed with the death of Nate and seeing Jake wearing a red hood. Brenda has an incestuous dream with Billy while Ruth insists on raising Maya. Claire is totally drunk and height everyday in her job, and after an argument with Kirsten, she is fired. When she arrives home and sees Paul's mother trunk with a plate \"Support Our Troops\", she offends the family with a political speech. Rico unsuccessfully tries to have a business meeting with David and Vanessa convinces him to schedule a visit with a real state agent to buy another funeral house, the Weingarden Mortuary. Claire capsizes her car after visiting Nate's grave.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0702009", "rating": 9.1, "votes": 2793, "number_of_episodes": 63}