{"cast": {"0470244": "Peter Krause", "0355910": "Michael C. Hall", "0175814": "Frances Conroy", "0024404": "Lauren Ambrose", "0135585": "Freddy Rodríguez", "0820783": "Mathew St. Patrick", "0532461": "Justina Machado", "0000342": "James Cromwell", "0341737": "Rachel Griffiths", "0165101": "Patricia Clarkson", "0005438": "Jeremy Sisto", "0000870": "Kathy Bates", "0392073": "Tina Holmes", "0708867": "Anne Ramsay", "0307600": "Lee Garlington", "0655951": "Brett Paesel", "0109192": "Susie Bright", "0550358": "Melissa Marsala", "1468486": "C.J. Sanders", "1766885": "Kendre Berry", "0269599": "Meagen Fay", "1724323": "Jayma Mays", "0875684": "Christine Tucci", "1354503": "Abby Brammell", "0710271": "Kevin Rankin", "0674007": "Merle Perkins", "0152282": "Andi Chapman", "0683986": "Robert Pine", "0235004": "Cullen Douglas", "1519675": "Giancarlo Rodriguez", "1519722": "Brenna Tosh", "1519723": "Bronwyn Tosh", "1906074": "Janis Jones"}, "geners": ["Comedy", "Drama"], "runtimes": ["55"],  "plot": ["Ruth happily helps \"circle the wagons\" when Sarah calls. David and Keith discover it's hard work playing house with Anthony and Durrell.", "Sarah O'Connor's best friend and Nate's first love Fiona Lenore Kleinschmidt falls down a mountain on a hiking trip with Sarah, causing she and her friends to stay a few days at the Fishers' and giving Ruth a good excuse not to show up to George's apartment for a few days...until Maggie notes she's put nothing of hers in the place. Claire applies for a temp agency job but the blandness of it is disappointing, especially with an art grant's rejection at about the same time. Anthony's older brother Durrel proves a rebellious, trouble-making thorn that Keith is all too eager to rid himself of but David wouldn't mind adopting, causing tensions to quickly mount as the social worker's visit nears. Vanessa's housekeeper Donna proves to have issues so Rico is unexpectedly asked to return to help with work. When Ruth finally does make it over to George after Sarah, Bettina, and the other drinking, smoking mourners have cleared out, he coolly reveals he knows her plan and breaks off with her, saving her the trouble.—brainybrailler@comcast.net", "While hiking with Sarah in the Topang Canyon, Fiona Lenore Kleinschmidt stumbles and falls over a cliff. David and Keith have troubles with Durrell and Anthony. Ruth leaves George alone in his apartment, and celebrates with Sarah and her friends smoking pot and drinking wine during the funeral of Fiona. Claire finds a job in a conservative company, and her coworkers seem to be very friendly. Brenda is worried with Billy, and her brother keeps going to her house bothering Nate and her missing Claire. Vanessa hires a maid from Canada, but she has problems with the attitude of the girl, and in the end she invites Rico to return home. George understands that his relationship with Ruth has ended.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ruth has moved George into a new apartment without telling him that she has no intention of moving into it with him. His daughter Maggie senses something is amiss when she realizes that Ruth hasn't moved any of her belongings. Claire is anxiously awaiting word on her grant application and decides to take a temp job in the meantime. The company she works for is quite conservative and she finds it more that just a bit stifling. Dave and Keith have their hands full fostering Anthony and his brother Durrell. Keith in particular is having a hard time and thinks it's time to bring the arrangement to an end. Vanessa tries out a nanny but it clearly isn't going to work. Her solution is a real surprise to Rico. Ruth meanwhile has to come to terms with the death of Fiona Kleinschmidt, her sister Sarah's best friend. Ruth has never quite forgiven Fiona for having sex with Nate when he was only 15. The funeral arrangements give her an excuse at least to stay away from George who comes to his conclusions.—garykmcd"], "genres": "N/A", "imdbID": "0702024", "rating": 8.5, "votes": 2018, "number_of_episodes": 63}