{"cast": {"2569233": "Yûki Kaji", "2095800": "Marina Inoue", "3426369": "Yui Ishikawa", "2944513": "Yû Shimamura", "0837523": "Tomokazu Sugita", "0411167": "Unshô Ishizuka", "1778737": "Seiro Ogino", "1337113": "Akeno Watanabe", "5953156": "Yûichi Karasuma", "3393222": "Kiyohito Yoshikai", "5700457": "Yoshihito Sasaki", "5680826": "Shigeyuki Susaki", "5691003": "Kazuhiro Fusegawa", "5842714": "Yuka Maruyama", "2235461": "Maeghan Albach", "2996555": "Erik Archilla", "6801212": "Ben Bryant", "1070753": "Andrew Chandler", "2171329": "Jessie James Grelle", "1920556": "Todd Haberkorn", "3346054": "Christian Heep", "2792984": "Scott Hinze", "0421004": "Bill Jenkins", "1931870": "Brittney Karbowski", "3119972": "Lauren Landa", "3279467": "Justin Locklear", "6801364": "Brandon Luna", "2233310": "Matthew Mercer", "4275455": "Alex Moore", "6610668": "Barrett Nash", "2986974": "Trina Nishimura", "2867434": "Alex Organ", "0651682": "Jonathan C. Osborne", "0745310": "Bryce Papenbrook", "5778204": "Paul Giovanni Ramirez", "6801365": "Chris Schmidt", "3670870": "Micah Solusod", "1204639": "Christopher Wehkamp", "3583779": "Brian Witkowicz"}, "geners": ["Animation", "Action", "Adventure", "Drama", "Fantasy", "Horror"], "runtimes": ["24"],  "plot": ["After the failed scouting expedition, Eren and his superiors are summoned to the capital. Annie sees just how deep corruption runs in the Military Police and agrees to join Armin in a plot to defy the government-but nothing is as it seems.", "Annie has a dream of being trained by her father before waking up. In the Stohess District of Wall Sina, the Military Police are ordered to escort the Recon Corps convoy once they enter the capital. The Military Police are shown to be lazy and corrupt which one of Annie's colleagues, Hitch, reveals she joined the police for that reason. Another colleague, Marlow, is disgusted, revealing he joined the police so he could reform it to become a better organization which Annie respects since he reminds her of Eren. After the convoy has entered Stohess, Annie is secretly called by Armin in the alleyways. Armin asks for her help as he is helping Eren escape the capital as the one riding in the convoy is actually Jean in disguise. She refuses at first but after Armin begs again, believing she is a good person, she finally agrees. Together with Annie, Mikasa, and Eren, Armin leads them to an underground tunnel. However, Annie refuses to enter as she has noticed Armin behaving strangely and hidden Recon Corps members watching her. Armin finally reveals his suspicion that Annie is the Female Titan since the Maneuver Gear she had after Sawney and Bean were killed is Marco's and the Female Titan did not kill him during the last expedition. Eren and Armin beg Annie to prove them wrong by following them, but knowing her identity is exposed, Annie laughs sadly and tries to transform. Despite the Corps' attempts to stop her, she succeeds in transforming using the spike in her ring.—anonymous"], "genres": "N/A", "imdbID": "3174238", "rating": 9.0, "votes": 24274, "number_of_episodes": 98}