{"cast": {"2569233": "Yûki Kaji", "3426369": "Yui Ishikawa", "0157136": "Susumu Chiba", "1694008": "Shinji Kawada", "5713187": "Natsuki Aikawa", "2095800": "Marina Inoue", "1328775": "Daisuke Ono", "0436778": "Hiroshi Kamiya", "1063029": "Kishô Taniyama", "2049893": "Yû Kobayashi", "0657139": "Romi Park", "3950075": "Ashly Burch", "0130774": "Jessica Calvello", "0235103": "Jason Douglas", "1708798": "Caitlin Glass", "2171329": "Jessie James Grelle", "3119972": "Lauren Landa", "0568772": "Mike McFarland", "2233310": "Matthew Mercer", "0586003": "Vic Mignogna", "2986974": "Trina Nishimura", "0745310": "Bryce Papenbrook", "0448686": "Christopher Corey Smith", "2057312": "J. Michael Tatum", "0915818": "Brett Weaver"}, "geners": ["Animation", "Action", "Adventure", "Drama", "Fantasy", "Horror"], "runtimes": ["24"],  "plot": ["Managing to get out of Erwin's trap, the Female Titan transforms once more and chases after Levi's squad, who fight back in a deadly clash.", "Erwin tells Hange that it was a mistake to think all humans who can transform into Titans are like Eren when the Female has unique abilities that are far beyond a novices, while elsewhere the mole transforms into the Female Titan and chases after Levi's squad. Armin theorizes the mole is someone who had seen Eren transform during the invasion of Trost. Eren wants to transform into his Titan form, but the squad tells him to trust in their skills and keep moving forward. Petra, Erd, and Auruo manage to blind the Female Titan and attempt to cut off her arms and kill her. However, the Female Titan manages to quickly regenerate her right eye and kills Erd, Petra, and Auruo. Seeing his comrades dead, a grieving Eren transforms into his Titan form which gets Mikasa and Levi's attention. Believing his comrades and squad's death could have been avoided if he had transformed in the first place, Eren fights the Female Titan in a long battle. The Female Titan defeats Eren by taking off his head and swallowing Eren. Mikasa attempts to stop the Female Titan but to no avail. She is later joined by Levi who tells her to keep their distance, as the Female Titan is getting tired.—anonymous"], "genres": "N/A", "imdbID": "3148020", "rating": 9.6, "votes": 30650, "number_of_episodes": 98}