{"cast": {"2569233": "Yûki Kaji", "0436778": "Hiroshi Kamiya", "0157136": "Susumu Chiba", "2950682": "Kôzô Mito", "5713187": "Natsuki Aikawa", "1694008": "Shinji Kawada", "0657139": "Romi Park", "1328775": "Daisuke Ono", "0632641": "Rintarô Nishi", "5680826": "Shigeyuki Susaki", "5680798": "Kenta Ôkuma", "0130774": "Jessica Calvello", "3447971": "Jonathan R. Freeman", "1708798": "Caitlin Glass", "2171329": "Jessie James Grelle", "6610670": "Nick Haley", "1235266": "Jerry Jewell", "2233310": "Matthew Mercer", "0586003": "Vic Mignogna", "0745310": "Bryce Papenbrook", "1230837": "Ian Sinclair", "0805550": "J. Paul Slavens", "0448686": "Christopher Corey Smith", "2057312": "J. Michael Tatum", "0915818": "Brett Weaver"}, "geners": ["Animation", "Action", "Adventure", "Drama", "Fantasy", "Horror"], "runtimes": ["24"],  "plot": ["A memory of Eren testing out his Titan powers sheds light on how his abilities work. As the Female Titan slaughters members of the Scout Regiment, Eren is faced with a difficult decision: does he trust his teammates or act out on his own?", "Levi fires a noise round and tells the squad to keep moving forward. With more of the rearguard getting killed by the Female Titan, Eren begs his squad to let him fight but they tell him to trust Levi's decision. As he considers turning himself into his Titan form, Levi tells him to choose to be either a monster or a member of the Recon Corps. Eren starts remembering when Hange, Levi, and his squad had him try to transform into a Titan for experimental purposes but was unable to. During a break when he tried to pick up a teaspoon, Eren suddenly partially transformed, much to the squad's shock. They almost attacked him but Levi ordered them to stand down. Hange deduced that Eren is able to transform into a Titan not by solely injuring himself but also due to his desire to fulfill his goals. The squad apologized to Eren and told him they should trust each other. Remembering this, Eren decides to trust his squad's plan. It is then revealed that Levi's squad is bait to lure the Female Titan into an ambush where Erwin and his men fire hundreds of grappling hooks at the Titan, trapping it. Levi leaves his squad to meet up with Erwin to find out who the Female Titan is.—anonymous"], "genres": "N/A", "imdbID": "3122060", "rating": 8.9, "votes": 23939, "number_of_episodes": 98}