{"cast": {"0000867": "Jason Bateman", "0005577": "Portia de Rossi", "0004715": "Will Arnett", "0148418": "Michael Cera", "0790057": "Alia Shawkat", "0355024": "Tony Hale", "0189144": "David Cross", "0001787": "Jeffrey Tambor", "0910055": "Jessica Walter", "0591485": "Liza Minnelli", "0339460": "Judy Greer", "0330917": "Mel Gorham", "1510088": "B.W. Gonzalez", "0235112": "Jerry Douglas", "0397984": "James Howell", "0646786": "Bruno Oliver", "0623928": "Robert Neches", "0006671": "Robert Isaac Lee", "1197231": "Christopher Gehrman", "0000165": "Ron Howard", "1628054": "Tanya Raisa"}, "geners": ["Comedy"], "runtimes": ["21"],  "plot": ["Michael trades in his bicycle for his father's car and ends up giving a ride to a complete stranger who mistakes Michael for a killer.", "During a heat wave, Michael discovers that his siblings have been hiding his father's Mercedes from him. Lindsay chastises him for not doing anything charitable so he picks up a woman, Helen, whom he thinks is his mother's new housekeeper Lupe. Lindsay, who has conversely been chastised by Michael decides to volunteer to clean up the wetlands. She finds herself horribly out of her comfort zone and calls Michael to pick her up. She finds her cab but forgets to call Michael, who shows up with Helen. Helen flees and Michael goes to the Save the Wetlands Bachelorette Auction to support his mother. He sees that Lindsay, sunburnt and in ill-shape, did try to be charitable and saves her from humiliation by bidding $1,000 on her. When Michael finds that Gob has been hiding the family car and taking free frozen bananas from the Banana Stand he tells him off in front of George Michael. When Kitty tells Michael that George never filed some building permits, George tells Michael to have Gob break into the Permit Office to misfile them. Michael asks his brother, who demands Michael tell George Michael to respect his uncle. He also gives up animation rights for his newly invented Mr. Bananagrabber character. After chipping a tooth on a carmel apple, he whistles when he speaks and blows his cover at the permit office. He delegates the task to George Michael and Maeby. They are caught by security guards but George Michael lets Maeby escape so he can take the heat. Lucille prepares for the Save the Wetlands Bachelorette Auction and instructs Buster to bid $10,000 on her so she can show-up her social rival Lucille Austero. Lucille 2 has been waiting for Buster to make a romantic gesture toward her, but he is terrified of her so he has been hiding. Lucille tries to lure Lucille 2 away from the auction with The Producers tickets but when Buster refuses to call her back she decides to go to the auction. Buster, running late, runs into the auction when he hears the word \"Lucille\" and bids $10,000 on the wrong Lucille.", "To help the company's image, Lindsay returns to her roots - charity fund raisers. While Lindsay is the most charitable member of the family, Michael tries to prove he's a more charitable person by helping a woman he thinks is his mother's housekeeper. Maebe, defying her parents, decide to break into the permit office, using George-Michael's help, and they learn a shocking secret about the Bluth Company. Meanwhile, Buster accidentally bids on his mother's social rival Lucille Austero at a charity bachelorette auction.—halo1k"], "genres": "N/A", "imdbID": "0515214", "rating": 8.2, "votes": 3248, "number_of_episodes": 84}