{"cast": {"0000867": "Jason Bateman", "0005577": "Portia de Rossi", "0004715": "Will Arnett", "0148418": "Michael Cera", "0790057": "Alia Shawkat", "0355024": "Tony Hale", "0189144": "David Cross", "0001787": "Jeffrey Tambor", "0910055": "Jessica Walter", "0063906": "John Beard", "0773536": "Jonathan Schmock", "1014366": "Hira Ambrosino", "1075429": "Paul Mendoza", "0340291": "Stacey Woods", "0251807": "Chad Einbinder", "1051113": "Andy Morrow", "1700607": "J. Hunter Ackerman", "0000165": "Ron Howard"}, "geners": ["Comedy"], "runtimes": ["21"],  "plot": ["After his father fails to promote him within the family business, Michael accepts a job in Arizona -- until his dad is arrested for shady bookkeeping.", "Michael anticipates becoming the new president of his father's homebuilding company, having put up with his family for years in order to achieve it. Instead, the position is given to his mother, Lucille-just before his father George Sr. is arrested by the SEC. When his family proves unable to run the company, Michael reluctantly returns to help. Meanwhile, Gob's magic career is derailed and George Michael develops a crush on his cousin Maeby.", "Widower Michael Bluth has been working for his father's development company since he was a teenager manning the family's frozen banana stand, and he and his son George Michael have gone so far as to move into one of the company's model homes. So when his father George Sr. throws his retirement party on the family yacht, Michael expects that he will be announced as his father's successor. Instead, Michael gets two surprises: His mother is the new President, and his father is under investigation by the SEC. So Michael has to hold his wildly dysfunctional family together.—Demonnick", "On the eve of his retirement, George Bluth Sr. has been arrested and is being held under investigation by the Securities And Exchange Commission. The family's large assets have been frozen, and George Bluth's son Michael is the only member of the family who has realized that the family's problems may be much deeper than some shady bookkeeping deals. But when Michael goes to investigate his dysfunctional family's problems, the rest of the family - his son George Michael, his sister Lindsay and her husband Tobias, his mother Lucille, his brother Gob, his brother Buster, and his niece Maeby, have problems of their own. But the matters get worse when George Bluth is in prison - and he's loving every minute of it.—halo1k"], "genres": "N/A", "imdbID": "0515236", "rating": 8.1, "votes": 4482, "number_of_episodes": 84}