{"cast": {"0000867": "Jason Bateman", "0005577": "Portia de Rossi", "0004715": "Will Arnett", "0148418": "Michael Cera", "0790057": "Alia Shawkat", "0355024": "Tony Hale", "0189144": "David Cross", "0001787": "Jeffrey Tambor", "0910055": "Jessica Walter", "1169306": "Patrice O'Neal", "0403622": "Lillian Hurst", "0040797": "Scott Atkinson", "0063906": "John Beard", "0166106": "Kendall Clement", "1648223": "Monika Jolly", "0821396": "Raul Staggs", "1591196": "Michael Bartel", "0000165": "Ron Howard", "1628054": "Tanya Raisa"}, "geners": ["Comedy"], "runtimes": ["22"],  "plot": ["Michael suspects that George Sr. is running the business from inside prison. George Michael is made manager of the banana stand, and Michael gives Gob a letter to mail after Lucille suggests that he be included in the business.", "The banana stand has burned down and flashbacks reveal the events that led to its destruction: Michael tries to get George Sr. to let him run the company himself. Maeby joins George Michael working at the banana stand, where she steals money from the till. George Michael sets it on fire, with Michael's permission. They do not realise that it is not insured due to Gob not mailing a letter to the insurance company and Michael is informed by George Sr. that there was $250,000 within the walls of the stand. Michael builds a new stand out of wood. Tobias auditions for a commercial but the role is given to Lindsay instead.", "After getting some unexpected help at the family's frozen banana stand, Michael suspects that George Sr. has been running the business from inside prison. His suspicions are confirmed when he follows his mother's house keeper to the family storage unit, which has been burned to the ground. Michael and his son decide to teach their father a lesson by burning the stand to the ground. Meanwhile, Gob deals with a pet store who refuses to give him a refund, and George-Michael has a hard time adjusting to his new roommate.—halo1k"], "genres": "N/A", "imdbID": "0515256", "rating": 8.4, "votes": 3926, "number_of_episodes": 84}