{"cast": {"0001349": "Jennifer Love Hewitt", "0175633": "David Conrad", "2324912": "Christoph Sanders", "0005085": "Jamie Kennedy", "0005179": "Camryn Manheim", "0272474": "Jay R. Ferguson", "0219748": "Catherine Dent", "0128657": "Erin Cahill", "0625529": "Kirsten Nelson", "1755731": "Deidrie Henry", "2720952": "Connor Gibbs", "1695726": "Claudia Choi", "3946950": "Marcia French", "2538904": "Samantha Bailey", "1449868": "Freedom Bridgewater", "1536169": "Patrick Weil"}, "geners": ["Drama", "Fantasy"], "runtimes": ["45"],  "plot": ["When Aiden is put in danger, Melinda won't accept anything but the truth and sets out on a shocking investigation into the life of an angry murdered ghost.", "Aiden comes home in a soaked rain coat and Melinda makes him take off the muddy shoes. Jim comes home and tells Melinda he really wants to take her out. The nanny down the street agrees to baby-sit Aiden. When they are alone in the house, Aiden refuses to do a volcano puzzle, but agrees to play hide and seek. Aiden goes and hides inside a crawl space and it locks from the outside. The nanny calls the 9-1-1 to rescue him from the crawl space. Melinda goes to visit Ben's mom, Sarah, who says nothing but nice things about Kelly, even though the house almost burnt down and one of her kids had to be rushed to the hospital. Eli goes to the park and talks to local nannies who share some dirt on Kelly. Aiden tells Eli that Kelly smelt like beer while they re at the park. Melinda and Jim go and meet with one of Kelly's past clients, Gill Bradley, whose wife is the ghost that Melinda has been seeing. Ghost wife Laura shows up and denies that Kelly got along with Laura. Gill apparently has no clue about how Laura felt about Kelly. When his daughter drops a doll, Melinda goes to help pick it up and gets a vision of a woman drinking and Gil's daughter burning her hand. The next morning Jim finds out that Laura was the one with the drinking problem, not Kelly. As they are talking, Kelly is babysitting the neighbor's kids next door babysitting and the car starts to drive off on its own. Sarah realizes that Melinda was right and fires Kelly. Laura shows Melinda a vision of Gill getting the same tattoo as a woman - a unity symbol. Melinda is trying to piece things together when Kelly walks in to confront Melinda about what she said to Sarah. Melinda notices that it wasn't Laura and Gil that got the unity tattoos, it was Kelly and Gil. That night, Melinda is about to give Aiden a bath when she starts chocking on the Clorox. It is a vision that Laura wanted her to see because she believes that Kelly poisoned her to steal her husband. Laura goes to Gill's house and spills the ammonia and chloride to kill them both. She then goes and tells Melinda that they will both pay for their mistake. Melinda rushes to Gil's house and finds both of them unconscious on the floor. Eli comes and helps get them out. At the hospital Kelly explains that they were leaving in a polygamist lifestyle. She got away to be with a normal family and they formed a union. Laura thought that they were trying to have an affair, but really he was just talking about getting Laura into rehab. That night Jim and Melinda have their make-up date night - and Aiden makes them a special dinner—agldwn", "A parents-night-out turns nightmarish when Aiden suffers a frightful experience under the watchful eye of a new babysitter. Seems a lot of children have suffered under her care, which Melinda discovers after receiving warnings from an angry, hoarse-voiced ghost; but, is the babysitter truly a case of Munchausen syndrome by proxy or is the ghost, who believes herself murdered, more involved than she lets on? With children potentially endangered, Melinda speedily seeks the truth before the situation turns deadly.—statmanjeff"], "genres": "N/A", "imdbID": "1601588", "rating": 7.3, "votes": 191, "number_of_episodes": 107}