{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "0565858": "Eddie McClintock", "1596073": "Ben Jelen", "0372191": "Shari Headley", "1634958": "Erin Foster", "0476378": "Dylan Kussman", "0892956": "Stephanie Venditto", "0566084": "Skye McCole Bartusiak", "1620703": "Kelly Kirklyn", "0354810": "Tim Haldeman", "1046808": "Geraldine Singer", "1026376": "Cindy Lu", "0089200": "Mark Bloom", "1117689": "Eric Cazenave", "1272826": "Lindsay Pulsipher", "1909522": "Rhea Lando", "1914219": "Diego Clare", "5099286": "Alexander Hall", "2101373": "Michael Miraula"}, "geners": ["Drama", "Mystery"], "runtimes": ["44"],  "plot": ["During a meningitis outbreak which overwhelms the clinic, House is drawn to a single patient: a 12-year-old competitive diver whose symptoms don't quite match everyone else's.", "Teenage competition diver Mary Carroll overcomes her fear and plunges to see all eyes are averted to one of the judges who collapsed bleeding. He's brought in and the pool and hospital quarantined, as his symptoms and soon those of a flood of others indicate a meningitis epidemic. Dr. Robert Chase may have the best ideas by far and the steadiest hand, he still is in the dog-house and gets landed with endless chores, including an epic Internet search after House found Mary's case is probably not just meningitis, while Foreman gets the interesting practice and even his breaks. Meanwhile Cuddy not only makes House stay and help screening the flood of possibly infected people like everyone else in such an emergency, but orders him and his only friend Wilson to interview candidates to replace Dr. Allison Cameron, but Gregory's creativity to reject even the most suitable on dubious 'indications' such as footwear makes James conclude it's all Freudian.—KGF Vissers", "House tries to get Cameron to return but before she could answer, he gets a call to go back to the hospital. He finds that people who attended a diving competition are there because someone there got sick and they fear it could be an outbreak and that it's contagious. Cuddy orders House to take care of them. He discovers one of the divers, a girl is exhibiting symptoms that are not of the disease. He tries to find out what she has. At the same time he's told by Cuddy to interview possible replacements for Cameron.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "0606028", "rating": 8.2, "votes": 3981, "number_of_episodes": 176}