{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "0000677": "Robin Tunney", "0014803": "Andrew Airlie", "0788907": "Rekha Sharma", "1185639": "Maya Massar", "1763041": "Dylan Basu", "1745653": "Ava Hughes", "1985784": "Kyarra Willis", "1986683": "Ethan Kyle Gross", "0161419": "Candus Churchill", "1147686": "Michale Ascher", "1248394": "Alana Husband", "1995155": "Janet Glassford", "5099286": "Alexander Hall", "3901593": "Rachel Lana Li", "1062656": "Mycole Metcalf", "2102635": "Maria Nicotero", "0860226": "Ian Thompson", "1482750": "Alexander von Roon"}, "geners": ["Drama", "Mystery"], "runtimes": ["43"],  "plot": ["Young kindergarten teacher Rebecca Adler collapses in her classroom after losing intelligible speech while teaching students.", "Pretty 29-year-old kindergarten teacher Rebecca Adler collapses one morning as she teaches her young students, babbling incoherently and unintelligibly. When her physicians cannot diagnose her, Rebecca is sent to Princeton-Plainsboro Teaching Hospital (PPH) in New Jersey to consult with the foremost diagnostician in America, Dr. Gregory House. House's small team of young specialists perform all of the initial testing, including the taking of patient histories, performing environmental studies at her classroom and, by breaking and entering, her home. House firmly believes that everybody lies. He jokes that Rebecca might be running a meth lab in her basement, so he does not want her team to ask her for her house keys. No meth lab is found but there is pork in her refrigerator. Rebecca questions the fact that she has met Dr. Eric Foreman, Dr. Allison Cameron and Dr. Robert Chase (House's entire team), PPH hospital administrator Dr. Lisa Cuddy, and Dr. James Wilson, PPH oncologist and House's best friend - all but Dr. House. She asks Wilson if House cares about his patients; Wilson cannot give her an easy answer. Rebecca asks Wilson if House cares about him, his best friend; when Wilson hesitates, the wise young teacher tells Wilson it is not what people say but, rather, what people do which determines whether they care; so, Wilson acknowledges House cares about him. The treatment Rebecca receives leads to strange side effects but her exact diagnosis eludes the doctors ... until it does not. House has problems with Cuddy, as she demands he work his share of time in the PPH clinic. House tells Cuddy he is a fan of the great philosopher, Mick Jagger; but, through subtle manipulation, Cuddy finds she can get what she needs. In the clinic, a married man who is orange shows up for treatment; House tells him to talk to a divorce attorney. A young man who has diagnosed himself from the Internet seeks House's advice, and House chastises the clueless mother who withholds her son's asthma inhaler. Finally, Rebecca faces her mortality and refuses all further treatment. House has an idea but cannot prove it without more treatment. If he wants to cure her, House will have to visit Rebecca in person and actually talk to her.—LA-Lawyer", "House and his team have a case with a 29-year-old kindergarten teacher who collapses at school after losing the ability to talk properly. (Clinic Cases: An orange man with leg pain, a young boy with asthma, a man who thinks he has Chronic Fatigue Syndrome or fibromyalgia.)—Jaxotea"], "genres": "N/A", "imdbID": "0606035", "rating": 8.4, "votes": 7387, "number_of_episodes": 176}