{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "0700712": "Dominic Purcell", "0188041": "Myndy Crist", "0254392": "Brennan Elliott", "0285569": "Clementine Ford", "0523825": "Henri Lubatti", "0401352": "Endre Hules", "1987993": "James Conkle", "5099286": "Alexander Hall"}, "geners": ["Drama", "Mystery"], "runtimes": ["44"],  "plot": ["A woman comes down with symptoms of African sleeping sickness, but there seems to be no way she could have contracted it. House and his aides must ask a few tough questions and make some tough decisions in order to try to save her.", "Loving hunky husband Ed Snow brings in Elise, who slapped him for pushing her to get up after three days in bed and admits she's out of control. Her hallucinations are just a side-effect of what works out must be a rare, hidden brain tumor or African sleeping disease, but either therapy is extremely dangerous. Samantha Campbell visits House's clinic with poisoning symptoms and fabulous breast implants 'for her husband's 40th birthday', but House elaborates his own theory... All possible causes for the African bug are excluded, except one: either spouse could catch it from adultery; when she reacts badly to the other therapy after both deny being a risk factor, Ed must decide whether to have her treated for it, and shows surprising instincts...—KGF Vissers", "Loyal husband Ed Snow brings in wife Elise for a diagnosis after exhibiting three sleepful days in bed with deteriorating health, both mental and physical. The team explores three theories, each impossible to prove - a cancerous tumor that hasn't formed, Rabbit Fever from a French restaurant that's cleaner than a hospital, and African Sleeping Sickness when no one has ventured south of New Jersey. Each treatment is different and potentially life-threatening, with time running out. Meanwhile, a large-breasted woman in the clinic suffering shortness of breath prompts House to call Wilson for a consult.—statmanjeff"], "genres": "N/A", "imdbID": "0606022", "rating": 8.0, "votes": 4562, "number_of_episodes": 176}