{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "1724323": "Jayma Mays", "0757993": "Dahlia Salem", "1788146": "Julia Ling", "0516279": "Alice Lo", "1484297": "K.T. Thangavelu", "0166106": "Kendall Clement", "5099286": "Alexander Hall"}, "geners": ["Drama", "Mystery"], "runtimes": ["44"],  "plot": ["Cameron gets mad at Foreman because Foreman steals her idea for an article. The case of the week: a woman has not slept for ten days despite taking a bottle of sleeping pills.", "A young woman swallows a bottle of sleeping pills - not to kill herself but to go to sleep, something she says she hasn't done in 10 days. Then her case deteriorates, but her partner is in a perfect position to help her. Meanwhile, House keeps falling asleep because living with Wilson has disrupted his sleep pattern. Cameron's mad at Foreman for swiping her ideas for a medical-journal article, and at House for letting him do it.—IowaSurvivor", "Female patient, Hanna, hospitalized for an accidental overdose of sleeping pills, presents with a sleep disorder which quickly progresses into liver failure. Her girlfriend, Max, wants to donate a part of her liver to save Hanna's life, but Cameron is ethically taken aback when she discovers that Hanna wants to end their relationship after the surgery.—Lynne Boris Johnston", "SPOILER: Hannah is brought in with a sleeping disorder (lasting 10 days), but not quite sleepless either, just oblivious of her short dozing off and lacking vital REM. The team spirit is poisoned by Cameron's whining about her medical journal article on ethics being ignored by House and allegedly plundered by Foreman. House guesses right that Hannah lied about her previous medication. She covered up the fact that she faked an allergy in order to dump her partner Max. Max meanwhile innocently volunteers to donate part of her liver, just to buy Hannah time to be diagnosed.—KGF Vissers"], "genres": "N/A", "imdbID": "0765624", "rating": 8.0, "votes": 3471, "number_of_episodes": 176}