{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "0559986": "Dave Matthews", "0001748": "Kurtwood Smith", "1752080": "Ingrid Sanai Buron", "1163975": "Kendra Cover", "0918547": "Scott Weintraub", "0666633": "Tyler Patton", "0075061": "Bobbin Bergstrom", "2474696": "Alex Gary", "5099286": "Alexander Hall", "0610056": "Dru Mouser", "1950628": "David Pearl"}, "geners": ["Drama", "Mystery"], "runtimes": ["44"],  "plot": ["House struggles to find out why a pianist savant is losing his ability to play. Ultimately, a decision must be made as to how much brain is necessary for a normal quality of life.", "Musical savant Patrick Obyedkov ends up at Princeton-Plainsboro care after he suffers muscle spasms in his left hand during a piano concert. House learns that Patrick was in a terrible bus accident at age 10, which resulted in severe brain damage - and a sudden, inexplicable ability to play the piano perfectly despite having had no musical training. House and his team race to find the cause of Patrick's rare movement disorder and bleeding problems in time to save the savant's life. Meanwhile, Cuddy suspects that House has applied for a job with another hospital in Massachussetts, only to learn that he was really applying to be a patient in a clinical trial studying brain cancer.—elizabethbennet135", "A pianist virtuoso's prized possessions contort horrifically during a benefit concert and becomes House's newest fascination. The piano being their singular shared interest seemingly fails to distort the realist views that he adopts has his religion. He coins the man (as the title suggests) as being a half-wit. Meanwhile, Cuddy investigates a series of curious inquiries by House to a rival Hospital in the past month which leads to a shocking revelation. Thoroughly disturbed, she consults Wilson who reveals a shocking secret that could change the way his understudies see him altogether.—Eric T."], "genres": "N/A", "imdbID": "0942528", "rating": 8.9, "votes": 4543, "number_of_episodes": 176}