{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "0001297": "Joel Grey", "1015262": "Leighton Meester", "0892956": "Stephanie Venditto", "0153316": "William Charlton", "0075061": "Bobbin Bergstrom", "5099286": "Alexander Hall"}, "geners": ["Drama", "Mystery"], "runtimes": ["44"],  "plot": ["House and his team face a lot of moral dilemmas when a patient wants them to help him end his life.", "Ezra Powell, a renowned pioneer in the field of medical research, collapses in his lab. House is struggling after the ketamine treatment wore off and doesn't want to talk about it. When the team put Ezra through rigorous diagnostic tests and don't come up with anything conclusive Ezra demands the team to help him end his life. Now the team goes through twists and turns of the moral dilemma of ignoring his wishes or to assist in his suicide and abide by Ezra's wishes.—SoWeirdo65", "The ketamine has worn off and House is back to using his cane and doesn't want to talk about it. His new patient is Ezra Powell, a renowned pioneer in the field of medical research, who collapsed in his lab. House puts Ezra through diagnostic rigors, but the team is unable to come up with a conclusive diagnosis, and Ezra's health continues to deteriorate. Becoming increasingly debilitated, Ezra ultimately demands that the team stop the litany of medical tests and help him end his life. The team members have divergent opinions on the morality of helping Ezra die, especially since the possibility of a cure is still in question. The moral dilemma of whether to assist in his suicide and abide by Ezra's wishes, or to ignore what their patient wants drives the team in very different directions. Meanwhile, the teenage daughter of a clinic patient has developed a crush on Dr. House.—Paul Lyon"], "genres": "N/A", "imdbID": "0834715", "rating": 8.5, "votes": 3691, "number_of_episodes": 176}