{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0607185": "Jennifer Morrison", "0817980": "Jesse Spencer", "0239293": "Conor Dubin", "0001464": "Kay Lenz", "0324070": "Maurice Godin", "0589646": "Pat Millicano", "1652374": "Bevin Prince", "2739971": "Liliya Toneva", "1394335": "Xhercis Mendez", "1366009": "Kathryn Adams", "1553983": "Leo Vargas", "0847543": "Ken Takemoto", "1178860": "Shannon McClung", "0075061": "Bobbin Bergstrom"}, "geners": ["Drama", "Mystery"], "runtimes": ["43"],  "plot": ["House is off his game without the team, and Wilson uses an extreme tactic to force him into interviews.", "House is without a team, but is unfazed by it. Cuddy and Wilson both try to get him to hire a new team, but House argues he doesn't need a team. Cuddy presents him with a case of a woman caught in an collapsing building, and challenges him to diagnose her on his own, without help, before the day is through. House accepts, hijacks a janitor to serve as soundboard, and diagnoses the woman. Once treatment is started, new symptoms arise. Every time House diagnoses a new problem, another crops up. The woman's boyfriend and mother seem to have no idea about what went on in her life. They claim she was a happy young woman, but House can prove she was on anti-depressants when he finds her diary. They are sure she was no drinker, but House proves she was a heavy drinker. The boyfriend claims they wanted children, but House finds evidence of at least one abortion, and traces of anti-conception medication. When she proves to be allergic to a drug she has recently taken without problems, House starts to suspect something else is going on. People lie, but the facts never do. Yet here, the facts seem to lie as well. Wilson has another way of forcing House to hire a team : he kidnaps House's new guitar. House goes overboard about this, and kidnaps one of Wilson's patients. The realization that the patient could be mistaken by the staff for someone else, finally sets House on the right path to solve the problem at hand. He grudgingly admits that, with a team, he would have solved the case much faster, and decides to hire new people. Of course, he will do it \"the House way\".—damienklael"], "genres": "N/A", "imdbID": "1081396", "rating": 8.9, "votes": 4294, "number_of_episodes": 176}