{"cast": {"0491402": "Hugh Laurie", "0000494": "Robert Sean Leonard", "0004376": "Franka Potente", "0592135": "Lin-Manuel Miranda", "0230155": "Megan Dodds", "1277177": "Derek Richardson", "0035664": "Curtis Armstrong", "0079374": "Angela Bettis", "0498572": "Andrew Leeds", "0687443": "Jack Plotnick", "2016157": "Artemis Pebdani", "0246373": "Alex Désert", "0722476": "Kim Rhodes", "0105672": "Andre Braugher", "0877481": "Dale E. Turner", "3521217": "Ana Lenchantin", "2046480": "Albert Malafronte", "0733101": "Sloan Robinson", "3165233": "Henderson Wade", "2948887": "Meghan Bradley", "3596836": "Harrison Forsyth", "1640119": "Rickey G. Williams", "2112440": "Zuri Alexander", "3276594": "Luke Davis", "0275261": "Norman Fessler", "2170132": "India King", "2373994": "Elizabeth Rivera", "2823710": "Katherine VanderLinden", "2689313": "Alan Weinreb"}, "geners": ["Drama", "Mystery"], "runtimes": ["89"],  "plot": ["House fights his doctors, the staff and his fellow patients when he's forced to stay in the psychiatric hospital under threat of permanently losing his medical license.", "House begins a detox program at Mayfield Psychiatric Hospital to get the Vicodin out of his system in an attempt to control his hallucinations. House plans to leave the treatment facility once he is clean, but he is strong-armed into staying by his attending physician, Dr. Darryl Nolan. Dr. Nolan agrees to write a recommendation to reinstate House's medical license only if House agrees to further treatment. When House is moved to a new ward in the hospital, he develops a close relationship with his new roommate, Alvie, and Lydia, a frequent visitor who helps House bend the rules. House asks Alvie to help him uncover incriminating information about Dr. Nolan that would allow him to blackmail his way out of the treatment center and convinces Lydia to loan him her car to sneak out a delusional patient in an attempt by House to undermine Dr. Nolan's course of treatment. But when devastating events ensue, House is humbled into reluctantly accepting help.—Fox Publicity"], "genres": "N/A", "imdbID": "1462220", "rating": 9.6, "votes": 10871, "number_of_episodes": 176}