{"cast": {"0491402": "Hugh Laurie", "0249046": "Lisa Edelstein", "0004898": "Omar Epps", "0000494": "Robert Sean Leonard", "0817980": "Jesse Spencer", "0414772": "Peter Jacobson", "1312575": "Olivia Wilde", "0005415": "China Shavers", "0472832": "Doug Kruse", "0574535": "Jamie McShane", "0855967": "Desean Terry", "1665358": "Angel Oquendo", "2788383": "Kimberly M. Bailey", "2321387": "Jason Paul Field", "1345932": "Edward Chen", "1336377": "Matthew Brent", "2807080": "Caroline Pho", "0398582": "Marty Hrejsa", "0075061": "Bobbin Bergstrom", "3169780": "Christon Blue", "3732895": "Ward Edmondson", "4306993": "Joshua Enbom", "3029577": "Waymond Lee", "1792648": "Joseph O'Brien", "3180390": "David Pryor", "3026246": "Leonard Jonathan Ruebe", "3387844": "Alen Toric"}, "geners": ["Drama", "Mystery"], "runtimes": ["43"],  "plot": ["Cuddy, House and members of the team join forces with a search-and-rescue team to provide much-needed medical attention at the scene of an emergency.", "House gives Cuddy a valuable medical tome written by one of her M.D. ancestors as a housewarming gift for her and Lucas; House is surprised by her response. A large crane operator doing work in Trenton loses control, colliding into a building and parking garage. The team joins firefighters, law enforcement, physicians, EMTs and rescue personnel to scour the wreckage for survivors. House hears noises coming from the parking garage but he cannot convince firefighters to make more than a cursory investigation. House stubbornly crawls into the wreckage to investigate the noises; a hand grabs his cane, \"Carrie\" style. He finds a woman in her mid-30s alive, but trapped with a leg pinned under the wreckage. She does not want to be rescued if it means amputation; because of his leg, House both understands and advocates for her. But, as time passes, priorities change; and House is forced to re-evaluate his beliefs.—LA-Lawyer"], "genres": "N/A", "imdbID": "1503406", "rating": 9.5, "votes": 6215, "number_of_episodes": 176}