{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "5224900": "Ross Butler", "7994181": "Casey Cott", "3080981": "Sarah Habel", "0613147": "Lochlyn Munro", "4329459": "Asha Bromfield", "8004570": "Hayley Law", "1410076": "Nat Boltt", "8739882": "Daniel Desveaux", "0393953": "Barclay Hope", "4181215": "Cody Kearsley", "0492687": "Colin Lawrence", "0564245": "Tom McBeath", "8004571": "Caitlin Mitchell-Markovitch", "5883582": "Sean Quan", "4271632": "Olivia Ryan Stern", "0761452": "Alvin Sanders", "7798933": "Trevor Stines", "7994182": "Daniel Yang", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["46"],  "plot": ["As a new school year begins, the town still reels from Jason Blossom's tragic death; Archie decides to pursue a career in music; Cheryl Blossom stirs up trouble.", "As a new school year begins, the town of Riverdale is reeling from the tragic death of high school golden boy Jason Blossom. Archie Andrews is still the all-American teen, but the summer's events made him realize that he wants to pursue a career in music - not follow in his dad Fred's footsteps - despite his forbidden relationship with Riverdale's young music teacher, Ms. Grundy. With the weight of the world on his shoulders, Archie must look for a new music mentor and turns to Josie McCoy but she is focused solely on her band, Josie and the Pussycats. Weighing heavily on his mind is also his fractured friendship with budding writer Jughead Jones. Meanwhile, girl-next-door Betty Cooper is anxious to see her crush Archie after being away all summer, but she's not quite ready to reveal her true feelings to him. And Betty's nerves, which are hardly soothed by her overbearing mother Alice, aren't the only thing holding her back. When a new student, Veronica Lodge, arrives in town from New York with her mother Hermione, there's an undeniable spark between her and Archie, but Veronica doesn't want to risk her new friendship with Betty. And then there's Cheryl Blossom, Riverdale's Queen Bee, who is happy to stir up trouble amongst the others even though she's keeping a few secrets of her own.", "As a new school year begins, the town of Riverdale is reeling from the tragic death of high school golden boy Jason Blossom. Archie Andrews is still the all-American teen, but the summer's events made him realize that he wants to pursue a career in music - not follow in his dad Fred's footsteps - despite his forbidden relationship with Riverdale's young music teacher, Ms. Grundy."], "genres": "N/A", "imdbID": "5728914", "rating": 7.5, "votes": 3854, "number_of_episodes": 137}