{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "1151899": "Robert Baker", "1410076": "Nat Boltt", "5002730": "Jordan Connor", "0192024": "Martin Cummins", "0002101": "Robin Givens", "9338539": "Tommy Martinez", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "1775177": "Graham Phillips", "8786450": "Kaiden Berge", "0007103": "Mark Brandon", "2243516": "Michelle Brezinski", "0573926": "Scott McNeil", "0761452": "Alvin Sanders", "2086765": "Donna Soares", "4423531": "Drew Ray Tanner", "9096563": "Leo Thomas", "8554682": "Andrew Nadanyi", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["A charge led by Mayor McCoy threatens to further escalate tensions with the Southside; Betty is thrust into a burgeoning mystery surrounding the Sugarman.", "When the case against Nick for Cheryl's assault falls through the cracks, the blame is shifted to Jingle Jangle and Mayor McCoy becomes bent on getting it off the streets and arresting its dealers. Reggie claims that a Serpent sold the drug to him, and this leads to her organizing a raid of Southside High and the arrest of every Serpent in sight. Jughead faces a difficult decision when Mayor McCoy's raid of the Southside weakens the Serpents and the Ghoulies back them into a corner about merging the gangs. In a desperate attempt to step up and prevent war from erupting, Jughead takes FP's advice to organize a street race between the two gangs with high stakes. Archie interferes in an unexpected way that may help Jughead but have other repercussions. The Black Hood forces Betty to find out and bring him the name of the Sugarman, the person responsible for the Jingle Jangle trade. Her doing so means having to fix things with Veronica and getting Cheryl to do some digging into her family's past. Cheryl struggles with the aftermath of Nick's attempted assault and becomes upset after learning that her mother took hush money from Nick's family. She seizes the cheque and demands that her mother give her the name of the Sugarman, per Betty's mission, or else never see a dime. Penelope reveals a chilling secret and does an unexpected good deed. When the Sugarman is revealed, Betty decides to change the Black Hood's game and invent her own rules... only to discover she may have already lost. Veronica is infuriated to learn that Hiram is still doing business with Nick's family and reveals a truth to her parents, with dangerous repercussions.—snowflakeaudrey"], "genres": "N/A", "imdbID": "6746392", "rating": 7.9, "votes": 1779, "number_of_episodes": 137}