{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "3702160": "Ashleigh Murray", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "2431797": "John Behlmann", "0117206": "Peter Bryant", "5002730": "Jordan Connor", "0192024": "Martin Cummins", "7843299": "Hart Denton", "0301370": "M.C. Gainey", "0002101": "Robin Givens", "2694584": "Brit Morgan", "0605081": "Vanessa Morgan", "0613147": "Lochlyn Munro", "0299956": "Eli Gabay", "0316515": "Mark Gibbon", "0409174": "John Innes", "0507803": "Terry Lewis", "0573926": "Scott McNeil", "0580217": "Ana Mercedes", "2803891": "Stephan Miers", "0701304": "Michael Puttonen", "0731842": "Françoise Robertson", "0761452": "Alvin Sanders", "2315589": "Christian Sloan", "0853175": "Sharon Taylor", "8790945": "Moses Thiessen", "8807441": "Andrew Beha", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["An act of vandalism stirs up suspicion; Archie's new job as Hiram's intern has Veronica worried he'll learn about the Lodge family secrets.", "As preparations for her confirmation ceremony get underway, Veronica becomes concerned that Archie, who's agreed to be Hiram's \"intern,\" may be learning too much about her family's secret business dealings. Jughead and FP lead the charge after an incident at Pickens Park leads to increased tensions among the Serpents. Meanwhile, Chic helps Betty deal with her inner darkness, while Archie finds himself in over his head after a high-stakes poker game with Hiram's shady inner-circle goes awry.", "Veronica prepares for her confirmation ceremony as Archie begins his tutorage with Hiram, running errands and working a high-stakes poker game with the leaders of the underworld. Veronica expresses concerns that Archie is being led down a dangerous path with her family's mob ties and may be learning too much about their secret business dealings. On a fateful night, Archie overhears a hit being put out on Hiram's life and makes a decision, with fatal consequences. Adams continues pressuring Archie, causing him to be split between being loyal to Hiram and protecting the people he loves. Archie soon finds himself in over his head. As tensions between Mayor McCoy and the Southside mount, Jughead and FP clash when Penny returns to expose Jughead's bad deed. His future with the Serpents is then put to a vote by an increasingly hostile Tall Boy. With Betty's help, Jughead is determined to expose the traitor in their midst who decapitated General Picken's statue, leading to a reckoning and an exile. Chic helps Betty deal with her inner darkness by becoming a cam girl, until Betty decides to confront her true demons and makes a big decision. Finally, a dangerous visitor at the Cooper house sends Alice and Betty into a spiral.—snowflakeaudrey"], "genres": "N/A", "imdbID": "6746444", "rating": 7.7, "votes": 1635, "number_of_episodes": 137}