{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "5002730": "Jordan Connor", "0002101": "Robin Givens", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0613147": "Lochlyn Munro", "3165233": "Henderson Wade", "0117206": "Peter Bryant", "6514896": "Rob Raco", "4803105": "Andre Anthony", "2897134": "Brent Clark", "2010729": "Nelson Giles", "0336797": "Mackenzie Gray", "8207833": "Julian Haig", "4181215": "Cody Kearsley", "6671109": "Aason Nadjiwon", "4316154": "Vanessa Richards", "5251966": "Ryan Rosery", "0743796": "Robyn Ross", "4423531": "Drew Ray Tanner", "9813243": "Christopher Thomas", "8554682": "Andrew Nadanyi", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Betty turns to Cheryl for help when she has a suspicion about the Black Hood; A mysterious message leaves everyone on edge.", "As the town's mayoral race between Fred and Hermoine heats up, Hiram sets his sights on a new ally - Sheriff Minetta. Betty turns to Cheryl for help when she has a suspicion about the Black Hood. Meanwhile, the reveal of a dark secret forces Archie and Jughead to try and ease tensions between the Bulldogs and Serpents. Finally, on the eve of the mayoral debate, a mysterious message leaves everyone on edge.—snowflakeaudrey", "Archie continues to search for the Black Hood under the pretense of door-to-door campaigning. Hiram offers Archie a more effective way of bringing the Black Hood out, reuniting the Dark Circle under the guidance of Hiram's new pocket-sheriff, Michael Minetta. Betty turns to Cheryl with a suspicion about her father as feelings of guilt about sending Chic to his death overwhelm her. As they investigate, a close-call scare and a series of revelations rock Betty, prompting her to confront her father, twice, and bring her suspicions to a conclusive head. Her plan unravels when Cheryl is unintentionally put in harm's way. Elsewhere, Veronica's act against Nick St. Clair captures the attention of the underworld and a number of mobster families send their children to pitch proposals to the Lodges via Veronica. She scouts a partnership in establishing Riverdale's first ever casino, but Hiram crushes her spirits. As the mayoral debate heats up, the Black Hood makes a move against Fred and Hermione, terrifying everyone. Veronica is furious with her father for putting his plans for the prison ahead of Hermione's safety. Hiram forms an alliance with Reggie. As the town demands blood for Midge's murder, Jughead's documentary footage is released and the heat quickly falls on Fangs. Following his arrest, tensions between the Northside and the Southside, on opposite sides of the vote to free or lock Fangs up, clash in a devastating way. Archie and Veronica finally pick a side of the mayoral campaigning. Cheryl receives a visit."], "genres": "N/A", "imdbID": "7124490", "rating": 8.2, "votes": 1623, "number_of_episodes": 137}