{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "2431797": "John Behlmann", "1410076": "Nat Boltt", "5002730": "Jordan Connor", "7843299": "Hart Denton", "0002101": "Robin Givens", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0613147": "Lochlyn Munro", "1775177": "Graham Phillips", "0117206": "Peter Bryant", "1975050": "Tiera Skovbye", "2753036": "Alison Araya", "3908228": "Emilija Baranac", "1342807": "Paul Lazenby", "0507803": "Terry Lewis", "0761452": "Alvin Sanders", "4423531": "Drew Ray Tanner", "2592871": "Derek Schnobb", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Tensions mount when Jughead and his fellow students from Southside High transfer to Riverdale High; Betty sets out to find her long-lost brother.", "Tensions mount when Southside High is closed down under suspicious pretenses, and the students are forced to transfer to Riverdale High. Though Veronica arranges a warm welcome for the new students, per her father's request, the Vixens and the Bulldogs have other plans. Archie receives a visit from Agent Adams of the FBI, who ropes him into a dangerous task under the threat of his father being arrested. Archie discovers more about the events following Nick's party and pays him a visit for revenge. Jughead is outraged when Weatherbee bans all gang paraphernalia from Riverdale High and demands that the Serpents remove their jackets and wear a new uniform. Veronica confronts Archie about him keeping a secret. Betty searches for her long-lost brother, Charles Smith, after Polly makes it clear that she does not want Alice and Hal in her children's lives. As Charles \"Chic\" is welcomed into the Cooper home after a near-death experience, a new threat looms. Archie reveals a nagging thought about the Black Hood.—snowflakeaudrey"], "genres": "N/A", "imdbID": "6746428", "rating": 7.6, "votes": 1637, "number_of_episodes": 137}