{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "0176175": "Mark Consuelos", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "5002730": "Jordan Connor", "0192024": "Martin Cummins", "2694584": "Brit Morgan", "0605081": "Vanessa Morgan", "2771116": "Jason Bell", "9470878": "Leonie Bennett", "3446783": "Lisa Chandler", "8580372": "Mira Eden", "1048171": "Jenn Griffin", "0507803": "Terry Lewis", "1283775": "Cameron McDonald", "0573926": "Scott McNeil", "2803891": "Stephan Miers", "9403296": "Juliana Parreira", "4702685": "James Tyson", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["When Jughead learns that F.P. is getting released from prison, he and Betty organize a welcome home party; Archie and Veronica push their relationship issues aside to focus on the Black Hood investigation.", "Betty and Jughead must prepare for FP's release from prison but are determined to investigate their lead about the Riverdale Reaper. They ask Archie and Veronica to fulfill their roles as the detective duo and visit \"the devil's house,\" where a family was murdered. They discover a series of clues and ultimately, a shocking revelation and the reopening of an old wound. Things also grow tense between them as Archie confesses his love to Veronica and she is unsure if she can say it back. Following his release, Betty and Jughead throw FP a retirement party at the White Wyrm, but things take a turn when Betty is determined to become a part of Jughead's world, FP discovers a heartbreaking truth about Jughead, and Archie and Veronica's relationship comes to a head. With the emotional stakes higher than ever, the party ends in tragedy for all. Meanwhile, Cheryl and Josie continue to be inseparable, Alice celebrates her Serpent roots for a hot minute, and Jughead receives pressure from Penny Peabody.—snowflakeaudrey"], "genres": "N/A", "imdbID": "6746406", "rating": 7.8, "votes": 1781, "number_of_episodes": 137}