{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "2431797": "John Behlmann", "1410076": "Nat Boltt", "5002730": "Jordan Connor", "0192024": "Martin Cummins", "7843299": "Hart Denton", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0000208": "Molly Ringwald", "0005439": "Azura Skye", "0393953": "Barclay Hope", "4012665": "Barbara Wallace", "3908228": "Emilija Baranac", "1267858": "Beverley Breuer", "1501598": "Marion Eisman", "0299956": "Eli Gabay", "0316515": "Mark Gibbon", "4181215": "Cody Kearsley", "1342807": "Paul Lazenby", "2803891": "Stephan Miers", "0082629": "Michele Billy Povill", "5779289": "Andrea Rosolia", "9455150": "Barclay Stiff", "4423531": "Drew Ray Tanner", "8790945": "Moses Thiessen", "2490049": "Aliza Vellani", "8655858": "Kevina Lazari", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Riverdale High's student council election heats up; Archie steps up to help after learning that Hiram's mobster associates have come to Riverdale to stir up trouble; an unexpected guest shows up at the Cooper residence.", "When Penelope spins an unconvincing tale to explain Cheryl's sudden disappearance, Veronica, Toni, and Josie team up to find and save her. A troubling discovery causes Josie to re-evaluate her allegiances. Nana Rose steps up to protect Cheryl in the face of Penelope and Claudius' manipulation. As the town's mayoral race gets underway, a question-and-answer seminar is held for Riverdale High's student council election, where Archie makes it clear that he stands with the Lodges and their plans. He reaffirms his loyalty again when he joins Hiram at his meeting with Lenny and Kowalski, which quickly takes a dark turn. When it becomes apparent that Hiram is being blackmailed into paying protection money and one of his own capos is turned against him, the Lodges must step up to protect their own. Hiram and Archie come up with a bold short-term solution involving the help of the Bulldogs. Fred is left in the cold by his son when an ultimatum arises. Elsewhere, things take a dangerous turn for Betty, Alice, and Chic when a stranger shows up asking questions about the shady man's disappearance and soon attempts to extort the Coopers. Betty reaches out to Jughead for help. Finally, Toni and Veronica craft a daring plan to help Cheryl escape from conversion therapy, just in time for Carrie the Musical auditions at Riverdale High.—snowflakeaudrey"], "genres": "N/A", "imdbID": "7124370", "rating": 7.8, "votes": 1557, "number_of_episodes": 137}