{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "1410076": "Nat Boltt", "0192024": "Martin Cummins", "0000153": "Gina Gershon", "0002101": "Robin Givens", "5002730": "Jordan Connor", "4181215": "Cody Kearsley", "8829933": "Trinity Likins", "4386140": "Bernadette Beck", "2054607": "Nneka Croal", "2318823": "Simon C. Hussey", "0455058": "Matthew Yang King", "0814552": "Veena Sood", "10456928": "Michael Taylor", "5706675": "G. John Turnbull", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["An unsettling message forces \"The Midnight Club\" to reunite; Veronica and Reggie resort to desperate measures; Kevin gives Moose an ultimatum.", "Amidst preparations for their upcoming wedding, Sierra and Tom receive an unsettling message, which forces \"The Midnight Club\" to reunite. Meanwhile, Veronica and Reggie take drastic measures to clean up a mess they created. Cheryl learns some unexpected news about the college she has set her sights on. Lastly, Kevin gives Moose an ultimatum.—sarah_l91", "An unsettling message forces The Midnight Club to reunite at the high school, but the parents soon learn they may be being misled. Veronica and Reggie must get themselves out of a bind when Hermione's buyer comes to town to collect, and they soon discover that the buyer is someone they know. Kevin tries to get Moose to come out to his dad, and Cheryl gives him a not-so-subtle nudge in that direction, which causes Toni to be angry with her for forcing his hand. Cheryl is blocked from attending her mother's alma mater and must get her mother to lift the ban. Josie has an audition for Juilliard and she gets closer to Archie. Gladys comes home to stir up trouble. Moose's dad proves to have secrets of his own.—snowflakeaudrey"], "genres": "N/A", "imdbID": "8451444", "rating": 7.1, "votes": 1340, "number_of_episodes": 137}