{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "8520133": "Nico Bustamante", "5046516": "Zoé de Grand'Maison", "0614877": "Chad Michael Murray", "7684864": "Shannon Purser", "0000208": "Molly Ringwald", "1975050": "Tiera Skovbye", "2811818": "Michael Patrick Denis", "8829933": "Trinity Likins", "7183747": "Luke Roessler", "4423531": "Drew Ray Tanner", "0873021": "Lori Triolo", "4386140": "Bernadette Beck", "1043259": "Maria J. Cruz", "0335284": "Brian Grant", "7058274": "Jay MacDougald", "3462855": "Valin Shinyei", "5775621": "Nikolai Witschl", "8816788": "Marcus Zane", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Veronica stages an elaborate plan; Betty makes a chilling discovery; Jughead finds himself one step closer to unmasking the Gargoyle King.", "Veronica turns to Mary and Archie after uncovering a secret that Hiram has been keeping from her; Betty raises questions after witnessing some strange activities at The Farm; Jughead finds himself one step closer to uncovering the Gargoyle King's identity.", "Betty has her first session with Edgar, which proves to be far from what she expected. Determined to get to the bottom of it, she begins to unwind the web of lies spun by Edgar and comes across a series of horrifying revelations. Now sure that everyone is in danger, she warns Cheryl and Toni, leading to an epic, high-stakes race for their lives. Jughead tracks down the deliverer of Betty's envelope at prom and comes face-to-face with a troop of young G&G players protecting Ethel. As Jughead tries to convince Ethel to come out of hiding, they have a dangerous confrontation with the Black Hood and all of their lives are endangered. Ethel reveals the identity of The Gargoyle King. Archie and Veronica mastermind a plot to put Hiram behind bars after she discovering his lies about Pop's. He challenges Hiram to a boxing match and everyone wants in on the action, but Archie may not make it out of the ring alive. Jughead is determined to investigate the bombshell that Ethel dropped on him and has a shocking realization.—snowflakeaudrey"], "genres": "N/A", "imdbID": "8590036", "rating": 8.0, "votes": 1306, "number_of_episodes": 137}