{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "6663708": "Madelaine Petsch", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "0192024": "Martin Cummins", "0000153": "Gina Gershon", "5002730": "Jordan Connor", "8829933": "Trinity Likins", "0761452": "Alvin Sanders", "4423531": "Drew Ray Tanner", "4012665": "Barbara Wallace", "1022732": "Link Baker", "4459829": "Riun Garner", "3273353": "Colm Hill", "3629916": "Jaeson Lee", "1051364": "Sheila Tyson", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Jughead questions his mom's motives for returning; Archie recruits the gang for a G&G mission.", "As Gladys prepares for FP's 50th birthday party, Jughead questions his mom's motives for returning to Riverdale. When an unexpected encounter brings Archie back into the world of G&G, Jughead and Betty devise a plan to help him face his past head-on. Finally, Cheryl and Toni find themselves at a crossroads, and Veronica reveals a damaging secret to Betty.—sarah_l91", "Archie decides to bring The Red Paladin quest to a head by seeking out the remaining players with Hiram's quest cards. Jughead adds an addendum to the quest that will force them all to take their shots during a twelve-hour period or give up. The Joneses navigate a move to the Northside when Gladys unexpectedly buys the Cooper home, and as FP's 50th birthday approaches, his family celebrates and he reflects on his life. Jughead is tipped off about Gladys and does some digging. Reggie surprises Veronica with a risky request that may mean the end of their personal and professional relationship. Cheryl and Toni's power struggle comes to a hot and heavy head.—snowflakeaudrey"], "genres": "N/A", "imdbID": "8590008", "rating": 7.3, "votes": 1212, "number_of_episodes": 137}