{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "6663708": "Madelaine Petsch", "3702160": "Ashleigh Murray", "7994181": "Casey Cott", "0605081": "Vanessa Morgan", "0000240": "Skeet Ulrich", "0000749": "Mädchen Amick", "0000580": "Luke Perry", "1410076": "Nat Boltt", "8520133": "Nico Bustamante", "0192024": "Martin Cummins", "2345856": "Eli Goree", "5046516": "Zoé de Grand'Maison", "0613147": "Lochlyn Munro", "0614877": "Chad Michael Murray", "7086839": "Jonathan Whitesell", "0117206": "Peter Bryant", "8829933": "Trinity Likins", "5609065": "Connor Paton", "4423531": "Drew Ray Tanner", "1044731": "Dean Aylesworth", "2357929": "Ali Dunn", "0335284": "Brian Grant", "8207833": "Julian Haig", "3322739": "Darcy Hinds", "7058274": "Jay MacDougald", "10219165": "Taryn Roberts", "4513579": "Gregory Taven", "2391229": "Brittany Willacy", "5775621": "Nikolai Witschl", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Betty dives deeper into Edgar's mysterious power; Archie and Veronica team up for a high-stakes fight; Jughead investigates a gruesome murder.", "When a tainted batch of fizzle rocks makes its way through Riverdale, Jughead and FP set out to find who's responsible. After asking Veronica to help get him into an upcoming boxing tournament, Archie quickly learns he may be in over his head. Elsewhere, Betty makes one last attempt to rescue Alice from The Farm's grip, and Toni becomes unsettled by a sudden change in Cheryl's behavior.—sarah_l91", "While investigating Edgar's mysterious ability, Betty makes a last-ditch effort to save Alice from The Farm by reminding her that Charles is dead. When all else fails, she tries to help her mother remember who she used to be. Betty confronts Edgar and threatens Evelyn. Toni and Betty team up to snap Cheryl back to reality and expose The Farm from the inside. Archie and Veronica team up for the grand opening of the El Royale boxing club and Archie wants a rematch with his previous opponent. FP and Jughead investigate the gruesome murder of Baby Teeth that would suggest the return of the \"real\" Gargoyle King, but they are quickly caught off guard by a tainted batch of Fizzle Rocks making their way around Riverdale that causes psychosis. They also track down and confront Kurtz, who tells them about the Gargoyle King's sinister plan for the Joneses that involves Jellybean.—snowflakeaudrey"], "genres": "N/A", "imdbID": "8590026", "rating": 7.2, "votes": 1132, "number_of_episodes": 137}