{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "6663708": "Madelaine Petsch", "0629653": "Marisol Nichols", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0000749": "Mädchen Amick", "2345856": "Eli Goree", "3066909": "Mishel Prada", "0000208": "Molly Ringwald", "0005439": "Azura Skye", "0829121": "Malcolm Stewart", "5372762": "Alex Barima", "1799258": "Arabella Bushnell", "5085882": "Sean Depner", "4480988": "Sarah Desjardins", "4809250": "Ajay Friese", "5084446": "Doralynn Mui", "2797418": "Jordan Robinson", "0761452": "Alvin Sanders", "4012665": "Barbara Wallace", "3725434": "Garrett Black", "7384323": "Marlon Kazadi", "7576540": "Adam Klassen", "7739716": "Alexander Lowe", "0657502": "Shekhar Paleja", "0731552": "Russell Roberts", "9987794": "Kyle Clark", "2017931": "Juan Riedinger", "5073287": "Madison Ryne Smith", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Archie's peaceful Thanksgiving dinner at the community center is derailed by unexpected guests; Jughead and Betty search for clues about a recent death in Stonewall Prep.", "Archie's plan to host a peaceful Thanksgiving dinner at the community center quickly gets derailed when some unexpected guests arrive. Stranded at Stonewall Prep by an ice storm, Jughead and Betty search for clues about a recent death on campus. Elsewhere, while FP, Alice, Hiram and Hermoine wait out the storm together at Pop's, Cheryl and Toni get resourceful as they host a dinner for Cheryl's family.—sarah_l91", "As the town celebrates Thanksgiving, a harrowing ice storm affects everyone's plans. Hiram is appointed the town's new mayor and orders to shut down Archie's community centre. FP refuges to oblige and questions his role as Sheriff. The ice storm forces Alice, FP, Hiram, and Hermione together, where tensions reach a boiling point. At the community center, Archie hosts a Thanksgiving dinner for underprivileged kids, but the arrival of unwanted guests may threaten everyone's safety. In a tense moment, a stroke of luck proves to be a saving grace. Archie and Mary decide to give thanks by commemorating Fred in a way that would make him proud. At Thistle House, Cheryl and Toni plan to cover up the murder of Cheryl's uncle in self-defense, but soon discover that they are being watched by her aunt. They decide to invite Cheryl's family to Thanksgiving and scare them away with a truly terrifying \"performance art piece\" using a tale by Nana Rose and Jason's corpse. Betty and Jughead spent Thanksgiving alone at Stonewall Prep, living out a fantasy of having junk food for Thanksgiving. They decide to do some sleuthing regarding Chipping's death, and upon discovering that they are not alone, tense confrontations and twisted revelations ensue. A secret society is discovered, Donna tells Betty a story that she doesn't quite buy, an intimate moment is intruded upon, and Jughead is determined to uncover the truth about the nefarious activities taking place at Stonewall Prep.—snowflakeaudrey"], "genres": "N/A", "imdbID": "11056160", "rating": 7.4, "votes": 1023, "number_of_episodes": 137}