{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "6663708": "Madelaine Petsch", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "0000240": "Skeet Ulrich", "2345856": "Eli Goree", "0455058": "Matthew Yang King", "0597235": "Robert Moloney", "4264186": "Wyatt Nash", "0005445": "Kerr Smith", "1022429": "Sam Witwer", "5372762": "Alex Barima", "5085882": "Sean Depner", "4480988": "Sarah Desjardins", "0492687": "Colin Lawrence", "8829933": "Trinity Likins", "5084446": "Doralynn Mui", "4423531": "Drew Ray Tanner", "4386140": "Bernadette Beck", "8786285": "Mark Blancaflor", "0203728": "Glynis Davies", "3516105": "Morgan Derera", "1501598": "Marion Eisman", "2898214": "Adam Pateman", "8816788": "Marcus Zane", "7609014": "Britt Good", "8637114": "Malia McMullen", "9640051": "Brandon Vick", "8171368": "Emma Willey"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Archie forges a new beginning for Mad Dog; Jughead receives a special offer; Veronica pays for her parents' mistakes; Cheryl goes head to head with the school's new principal.", "Archie encourages Mad Dog to attend Riverdale High and join the football team. Jughead meets Mr. Chipping, who offers him a spot at an elite school called Stonewall Prep. Veronica is conflicted when information about her involvement in Hiram's arrest leaks to the public. Kevin applies for a spot on the Blue & Gold to make amends with Betty. And Cheryl goes head to head with Mr. Honey, the school's new principal.—sarah_l91", "It's the beginning of a new school year. Archie convinces Mad Dog to join the Bulldogs. Tensions brew with an insecure Reggie, leading to a realization by Archie about Reggie's home life. He soon helps Reggie forge a new beginning. Cheryl clashes with the new principal at Riverdale High when he sabotages her back-to-school dance and threatens her position, leading to a power struggle between the two. Cheryl throws a back-to-school party at Thistle House. Jughead receives a visit from one of the judges of the short story contest, who offers him a spot at Stonewall Prep, a prestigious private school. Jughead takes a tour and realizes he fits in better than he ever did at Riverdale, but transferring could mean spending less time with his girlfriend. Betty works with Charles to infiltrate The Farm but becomes worried when Alice stops communicating with them. Kevin tries to make amends with Betty, but she soon discovers that Kevin has still been talking to Fangs, leading her to use him to get to The Farm by letting a fake piece of intel slip around him. After everything, they get close to discovering the Farm's whereabouts. Veronica pays for her parents' mistakes when the paparazzi continuously ambush her at school and Hiram has a piece published that claims Veronica is the criminal mastermind instead of him. After a meeting with Mr. Honey, she fears that it will affect her standing at school and her Harvard application. She decides to bring all events to a head with a press conference.—snowflakeaudrey"], "genres": "N/A", "imdbID": "10674820", "rating": 7.4, "votes": 1155, "number_of_episodes": 137}