{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "0629653": "Marisol Nichols", "6663708": "Madelaine Petsch", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "0605081": "Vanessa Morgan", "0192024": "Martin Cummins", "3066909": "Mishel Prada", "0005445": "Kerr Smith", "0829121": "Malcolm Stewart", "5372762": "Alex Barima", "5085882": "Sean Depner", "4480988": "Sarah Desjardins", "5084446": "Doralynn Mui", "4221489": "Bruce Blain", "0161419": "Candus Churchill", "0731552": "Russell Roberts", "8361548": "Andres Soto", "2391229": "Brittany Willacy", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Worried about his future after high school, Archie seeks advice from Hiram; Veronica begins to spiral; Jughead confronts a critical accusation.", "Worried about what the future may hold for him after high school, Archie seeks advice from an unlikely source - Hiram Lodge. Meanwhile, Veronica begins to spiral after learning some devastating news about someone close to her. Finally, accusations made against Jughead leaves his future at Stonewall Prep hanging in the balance.—sarah_l91", "On the week preceding The Ides of March, Jughead receives some troubling news from Mr. DuPont followed by a series of accusations, threats, and lies, leaving his future hanging in the balance. Veronica begins to spiral after learning some troubling news about her father's health and worries Archie with a return to her party girl ways. Cheryl, Toni, and Veronica team up to take down Hermosa when she attempts to infiltrate their Maple Club rum operation. Archie struggles with the pressures of running two businesses and keeping up with school, leading to Mr. Honey giving him some devastating news about graduation. He reaches out to an unlikely source, Hiram, for advice. Veronica is determined to keep Hiram on his toes. As the Stonewall Preppies win a rigged game and Jughead forms a final plan, the events at Stonewall Prep come to a bloody head.—snowflakeaudrey"], "genres": "N/A", "imdbID": "11662332", "rating": 7.3, "votes": 938, "number_of_episodes": 137}