{"cast": {"6216001": "KJ Apa", "3929887": "Lili Reinhart", "6161516": "Camila Mendes", "0819850": "Cole Sprouse", "6663708": "Madelaine Petsch", "0176175": "Mark Consuelos", "7994181": "Casey Cott", "0000240": "Skeet Ulrich", "6217576": "Charles Melton", "0605081": "Vanessa Morgan", "2345856": "Eli Goree", "0000208": "Molly Ringwald", "0730455": "Ryan Robbins", "0005445": "Kerr Smith", "0829121": "Malcolm Stewart", "5372762": "Alex Barima", "5085882": "Sean Depner", "4480988": "Sarah Desjardins", "5084446": "Doralynn Mui", "0855045": "Emily Tennant", "6011497": "Connor Anthony", "5023439": "Eric Bempong", "8017011": "Serena Crouse", "10305239": "Tyler Gibson", "11294405": "Jase Griffith", "10049138": "Mya Lowe", "1490411": "Cameron Park", "5373781": "Nisreen Slim", "0820605": "Michael St. John Smith", "1452304": "Ty Wood", "10270345": "Julia Bose", "7522388": "Mariesa Crouse", "9189260": "Lauren Denysek", "9305395": "Christina Hamdon", "9189253": "Charlotte Kavanagh", "8171368": "Emma Willey", "9640051": "Brandon Vick"}, "geners": ["Crime", "Drama", "Mystery", "Romance"], "runtimes": ["42"],  "plot": ["Emotions run high as Riverdale celebrates a monumental Spirit Week; Jughead considers a pivotal opportunity; Veronica pursues a new passion.", "As Riverdale High prepares for the championship football game against Stonewall Prep, Betty gets to work on a story about the rivalry between the schools. Archie is conflicted when Mary tells him about Uncle Frank's troubled past. Cheryl goes head to head with Ms. Appleyard, the school's new cheerleading coach, and Veronica hits a road block with her latest Luna Rum recipe. Finally, Jughead is forced to pick a side after the perks of attending Stonewall Prep begin to interfere with his personal life.", "Riverdale High celebrates a monumental Spirit Week and gears up for a football game against Stonewall Prep. After being commissioned for a piece in the school's newspaper, Betty investigates claims that Stonewall's team plays dirty when Monroe is jumped before the big game. Betty enlists Veronica to go undercover at a Quill and Skull party to get Brett to admit to jumping Monroe, leading to an unexpected discovery. Jughead is welcomed into the Quill and Skull secret society with an initiation that involves revealing your darkest secret. He then scores an interview with a Yale recruiter but receives pressure from Mr. DuPont to halt Betty's exposé. Archie and Frank get to know one another better, much to Mary's chagrin, as she tries to convince her son that Fred's brother is bad news. Frank helps Monroe overcome his injury, in order to make sure he can play for the visiting Notre Dame recruiter. Cheryl goes toe-to-toe with the newly appointed leader of the River Vixens and comes up with an innovative way to be rid of her. Veronica continues to face off against Hiram when, after the successful launch of her new Luna Rum business, he slams her with a cease and desist order. She sends her father a message with Reggie's help and forges a \"sweet\" new partnership at the football game. The big football game is met with wins and losses for different people. Mr. Honey gives Betty permission to continue pursuing her efforts to expose Stonewall Prep, insofar as she brings home a win. Jughead and Brett receive news from Yale, and in the future, Jughead's acceptance may be short-lived.—snowflakeaudrey"], "genres": "N/A", "imdbID": "11401822", "rating": 7.1, "votes": 922, "number_of_episodes": 137}