{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0001018": "Keith Carradine", "0000470": "Jeffrey Jones", "0648486": "Timothy Omundson", "0226813": "Garret Dillahunt", "0571964": "Ray McKinnon", "0108703": "Sean Bridgers", "0422434": "Geri Jewell", "0949775": "Keone Young", "0159609": "Joe Chrest", "0644406": "Nick Offerman", "0419273": "Peter Jason", "0175076": "Jane Leigh Connelly", "0245000": "Dean Rader-Duval", "0383835": "Dan Hildebrand", "1939718": "Cheryl Huggins", "0652657": "Toni Oswald", "0799919": "Tom Simmons", "1587626": "Bree Seanna Wall", "8445746": "Al Collado", "4916501": "Michael Keyes"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["56"],  "plot": ["As suspicions arise that \"road agents\" may have been the true perpetrators of a massacre, Swearengen takes a special interest in the health of its sole survivor, a young girl ministered to by the unlikely team of Doc Cochran and Calamity Jane. Meanwhile, Bullock and Star attempt to buy property from Swearengen, who suspects an alliance between Wild Bill and the hardware fellows.—WyattJones", "Word spreads pretty quickly through Deadwood about Seth Bullock and Wild Bill Hickok's shooting incident in the night. Neither of them believe it was Indians who attacked the family and that proves to be correct when Al Swearengen gets it out of some of his underlings that they attacked them to get whatever gold they might have had. Al is none too pleased and is worried about just what Hickok in particular is up to. He decides Hickok has to go and wants ones of his flunky, Jack McCall, to dispatch him. Doc has Sofia, the young Norwegian girl, under his care but he too knows what would happen if the culprits learned she survived, so he makes the point of telling everyone that she is not likely to recover. Seth and business partner Sol Star also want to buy the property they've been renting from Al but he drives a hard bargain, one that Seth refuses to accept. Brom Garret meanwhile doesn't have much luck on his first day panning for gold on the claim he bought for $20,000 from Al.—garykmcd"], "genres": "N/A", "imdbID": "0556297", "rating": 8.2, "votes": 2589, "number_of_episodes": 36}