{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0000470": "Jeffrey Jones", "0571964": "Ray McKinnon", "0108703": "Sean Bridgers", "0225332": "Kim Dickens", "0920038": "Titus Welliver", "0419633": "Ricky Jay", "0304579": "Richard Gant", "0422434": "Geri Jewell", "0949775": "Keone Young", "0147738": "Larry Cedar", "1587626": "Bree Seanna Wall", "0245000": "Dean Rader-Duval", "1615471": "Monty 'Hawkeye' Henson", "1589072": "Meghan Glennon", "1615454": "Nick Amandos", "1615488": "Ralph Richeson", "1615976": "Teresa Shae", "1615980": "Gene Thatcher", "8445746": "Al Collado", "8406863": "Jeff Feuerhaken", "4916501": "Michael Keyes"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["53"],  "plot": ["An opium theft leaves Swearengen trying to find a common language with his supplier, and navigating murky waters to deal with the mess. Meanwhile, Silas Adams, bagman for the magistrate from Yankton, arrives with bad news for Swearengen. Bullock regrets having raised his hand at the government meeting. An unwelcome and ailing Reverend Smith gravitates to the Gem and its new piano.—WyattJones", "Mister Wu reports to Al Swearengen that his opium courier was attacked and that Al's supply was stolen by two white men. He has a pretty good idea who is responsible. He negotiates a solution with Wu. In his capacity as health commissioner, Seth decides to do something about sanitation conditions in the camp including garbage dump and an infirmary. Silas Adams arrives to collect the bribes for the Legislature but also has a letter for Al from the magistrate there. A.W. Merrick suggests to some of the men that they form a club, freeing them from having to meet in the crowded hotel dining room. Rev. H.W. Smith, his seizures growing in frequency and severity, takes to spending time in the Gem listening to the piano which, he says, relieves his headache. Joanie Stubbs wants to end her ties with Cy and Eddie may have the solution.—garykmcd"], "genres": "N/A", "imdbID": "0556301", "rating": 8.6, "votes": 2155, "number_of_episodes": 36}