{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0000470": "Jeffrey Jones", "0571964": "Ray McKinnon", "0108703": "Sean Bridgers", "0225332": "Kim Dickens", "0920038": "Titus Welliver", "0419633": "Ricky Jay", "0422434": "Geri Jewell", "0750916": "William Russ", "0419273": "Peter Jason", "0340260": "Zach Grenier", "0147738": "Larry Cedar", "1587626": "Bree Seanna Wall", "1615488": "Ralph Richeson", "1854538": "Kai Cofer", "1572587": "Ashleigh Kizer", "8445746": "Al Collado", "8406863": "Jeff Feuerhaken", "4916501": "Michael Keyes"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["58"],  "plot": ["Alma's father, Otis Russell, arrives from New York to \"help\" with her claim. Swearengen strikes a bargain with Adams to rid him of some legal baggage involving the arriving magistrate. Jewel journeys to Doc's cabin for help with her leg. Eddie resumes work at the Bella Union, while Bullock is angered by the choice of the corrupt Con Stapleton as the new sheriff.—WyattJones", "Alma Garret's father, Otis Russell, arrives in Deadwood. He tells her that Brom's parents think she is responsible for his death. It's pretty obvious to those who meet him that he is a ne'er do well who is out to protect his own interests. Con Stapleton wrangles an appointment for himself as the new Sheriff, making it quite clear that his first loyalty will be to those who appointed him. It doesn't sit well with Seth Bullock who thinks the position is too important for one of the camp's hangers-on to occupy. Magistrate Clagett's bagman, Silas Adams, pays the camp a visit to collect the bribes and Al makes him an offer to make the warrant for his arrest disappear. Eddie Sawyer returns to the Bella Union intent on keeping his promise to Joanie Stubss to help her our financially. Trixie and Sol have clearly taken a liking to one another and she drops in on Sol Star at the hardware store for some personal time. Al has other ideas however and expects Sol to pay. Jewel asks Doc Cochrane to build a brace for her leg. The local paper goes upscale when Merrick receives the camera he ordered.—garykmcd"], "genres": "N/A", "imdbID": "0556300", "rating": 8.3, "votes": 2028, "number_of_episodes": 36}