{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0001018": "Keith Carradine", "0000470": "Jeffrey Jones", "0648486": "Timothy Omundson", "0226813": "Garret Dillahunt", "0225332": "Kim Dickens", "0108703": "Sean Bridgers", "0419633": "Ricky Jay", "0930617": "Gareth Williams", "0340260": "Zach Grenier", "0419273": "Peter Jason", "0839708": "Nicolas Surovy", "0147738": "Larry Cedar", "0799919": "Tom Simmons", "1587626": "Bree Seanna Wall", "0176941": "Candice T. Cain", "4916501": "Michael Keyes", "3235385": "Christopher Valin"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["58"],  "plot": ["Swearengen directs Farnum to buy back the Garret claim. Garret's wife, Alma, prevails on Calamity Jane and Wild Bill for help with the claim issue. Hickok's respect for Bullock grows and, as a result, he commissions Bullock to do a review of the Garret claim. An ailing colleague, Andy Cramed, rejoins the Bella Union, and Wild Bill's run of luck at poker ends abruptly.—WyattJones", "With her husband dead, Alma Garret gets Doc Cochran to examine the body for foul play. He confirms there is no evidence of murder and that his injuries are consistent with a fall. Knowing there is a huge gold find in what he thought was a panned out claim, Al Swearengen now wants it back and gets E.B. Farnum to buy it. Alma turns down his offer and asks Wild Bill Hickok to help determine what really happened and why it is exactly they are now trying to buy it back. He's certain that Swearengen is up to no good and asks Seth Bullock to take over and estimate the value of the claim. Hickok goes back to playing poker for him it's the day for aces and eights, all black. Meanwhile, a new arrival at the Bella Union saloon is quite ill.—garykmcd"], "genres": "N/A", "imdbID": "0556299", "rating": 8.8, "votes": 2530, "number_of_episodes": 36}