{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0226813": "Garret Dillahunt", "0571964": "Ray McKinnon", "0108703": "Sean Bridgers", "0225332": "Kim Dickens", "0068338": "Kristen Bell", "0419633": "Ricky Jay", "0996651": "Greg Cipes", "0422434": "Geri Jewell", "0419273": "Peter Jason", "0340260": "Zach Grenier", "0839708": "Nicolas Surovy", "0928186": "Clay Wilcox", "1587626": "Bree Seanna Wall", "1577095": "Everette Wallin", "0923600": "Richard Wharton", "0930908": "Jim Cody Williams", "8445746": "Al Collado", "8406863": "Jeff Feuerhaken", "4916501": "Michael Keyes"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["49"],  "plot": ["After tracking down a murderer, Bullock returns to Deadwood a changed man as well as a marked one. Dan and Joanie both take a special interest when teenagers Miles and Flora Anderson arrive in camp in search of their father. Calamity Jane earns her moniker in the Pest Tent, while Swearengen sees through Trixie's subterfuge. Alma remains cold to Farnum's inappropriately advanced bid on her claim.—WyattJones", "A teenage brother and sister, Miles and Flora Anderson, arrive in Deadwood looking for their father. He is supposed to be prospecting in the Black Hills and to have sent for them by now. No one knows where their father might be but both Al and Cy are interested in the pretty Flora, for obvious reasons. Al gives Miles a job sweeping up in the Gem while Cy puts Flora into the hands of Joanie. Flora proves to be quite willing. Alma Garret has beaten her addiction to laudanum, and after arranging her husband's funeral, plans to stay in camp. Al Swearengen is none too pleased, seeing as Trixie was supposed to introduce her to opium to encourage her to sell the claim. Seth Bullock catches up with Jack McCall and delivers him to US Federal authorities. He returns to Deadwood just in time for the Garret funeral and agrees to continue the work of having Alma's claim assayed. Andy Cramed recovers from smallpox but lets Cy Tolliver know just what he thinks of being dumped in the woods to die.—garykmcd"], "genres": "N/A", "imdbID": "0556292", "rating": 7.9, "votes": 2269, "number_of_episodes": 36}