{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0000470": "Jeffrey Jones", "0571964": "Ray McKinnon", "0225332": "Kim Dickens", "0108703": "Sean Bridgers", "0419633": "Ricky Jay", "0930617": "Gareth Williams", "0512992": "Juddson Keith Linn", "1587626": "Bree Seanna Wall", "1577095": "Everette Wallin", "0652657": "Toni Oswald", "1440916": "Parisse Boothe", "0176941": "Candice T. Cain", "8445746": "Al Collado", "8406863": "Jeff Feuerhaken", "4916501": "Michael Keyes"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["52"],  "plot": ["Bullock encounters native resistance in his quest to bring a murderer to justice. Swearengen presses Farnum to keep tabs on Alma and Trixie. After an outbreak of smallpox hits Deadwood, the camp fathers pool their resources to track down the vaccine, and Doc enlists Jane as a nurse. Swearengen proudly collaborates on an article in the Deadwood Pioneer meant to minimize the threat of the outbreak.—WyattJones", "Smallpox is in the camp and the business owners, led by Al Swearengen, agree to foot the bill for the vaccine and the opening of pest tents where those who are ill can be quarantined. Doc Cochran recruits a still grieving Calamity Jane after she tells him she spent time with Andy Cramed in the woods without being infected. Alma Garret is still undergoing withdrawal symptoms from her dependency on laudanum but Al begins to wonder if Trixie is doing as she was told. At the Bella Union, Joanie Stubbs teaches the finer points of craps to Ellesworth but tries to give him a break, something that doesn't sit well with Cy Tolliver. On the trail of Jack McCall meanwhile, Seth Bullock has a violent encounter with an Indian.—garykmcd"], "genres": "N/A", "imdbID": "0556304", "rating": 8.1, "votes": 2159, "number_of_episodes": 36}