{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0001018": "Keith Carradine", "0000470": "Jeffrey Jones", "0648486": "Timothy Omundson", "0226813": "Garret Dillahunt", "0571964": "Ray McKinnon", "0108703": "Sean Bridgers", "0225332": "Kim Dickens", "0419273": "Peter Jason", "0419633": "Ricky Jay", "0147738": "Larry Cedar", "0092877": "Bill Bolender", "0245000": "Dean Rader-Duval", "0571930": "Joel McKinnon Miller", "0928186": "Clay Wilcox", "0745774": "Tahmus Rounds", "0799919": "Tom Simmons", "1587626": "Bree Seanna Wall", "1648048": "Tammy Brooks", "0176941": "Candice T. Cain", "2029107": "Julius Callahan", "3237699": "Joey Rocketshoes Dillon", "0310887": "Gill Gayle", "0422434": "Geri Jewell", "4916501": "Michael Keyes", "1572587": "Ashleigh Kizer"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["52"],  "plot": ["Competition arrives for Swearengen in the form of the Bella Union, a new gambling outfit from Chicago operated by savvy Cy Tolliver, Madame Joanie Stubbs and gaming guru Eddie Sawyer. Hickok puts up precious collateral in a poker game with McCall; Bullock and Sol strike a deal with Swearengen on a lot for their hardware store. Garret threatens Swearengen before investigating his gold claim.—WyattJones", "Al Swearengen is none too pleased when an outfit from Chicago comes to Deadwood and opens the Bella Union saloon run by Cy Tolliver. Also at the new saloon is a new madam, Joanie Stubbs and her prostitutes. It turns out that Tolliver already has his own spies in the camp. The new saloon does a booming business on its opening night. Hickok continues his non-stop all-night poker playing and has to put up his revolvers to meet Jack McCall's bet. They break at dawn but Hickok is back at the table that evening. Calamity returns to Deadwood with the little girl, who is now running a fever. Brom Garret is now convinced that he was swindled in his land claim purchase and asks Hickok for help. He's on his own however and confronts Al who gives him a suggestion on where to look and a promise of restitution if it doesn't pan out. Sol and Seth finally strike a deal on the property and set to building their new store.—garykmcd"], "genres": "N/A", "imdbID": "0556306", "rating": 8.1, "votes": 2420, "number_of_episodes": 36}