{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0000374": "Brad Dourif", "0370035": "John Hawkes", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0000959": "Powers Boothe", "0000470": "Jeffrey Jones", "0571964": "Ray McKinnon", "0108703": "Sean Bridgers", "0225332": "Kim Dickens", "0920038": "Titus Welliver", "0419633": "Ricky Jay", "0422434": "Geri Jewell", "0001075": "Peter Coyote", "0419273": "Peter Jason", "0750916": "William Russ", "0068382": "Marshall Bell", "0949775": "Keone Young", "0147738": "Larry Cedar", "1587626": "Bree Seanna Wall", "1615488": "Ralph Richeson", "0212498": "Tim DeZarn", "0200453": "Rick Dano", "0482470": "Michael David Lally", "0502959": "Al Leong", "1162235": "Mike McGrath", "0923738": "Zack Whedon", "8445746": "Al Collado", "1615471": "Monty 'Hawkeye' Henson", "1636409": "Seth Olson", "2491507": "Randall Yarbrough"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["60"],  "plot": ["General Crook rolls into Deadwood with his troops, known as \"Custer's avengers,\" and the Yankton magistrate, Clagett, prompting a parade and business solicitations from E.B. Farnum and Cy Tolliver. Al Swearengen delivers a tortured soul from suffering, and Bullock reacts decisively to Russell's intentions regarding Alma. Stapleton's new commission as sheriff proves short-lived, and Bullock and Alma have a late-night meeting.—WyattJones", "Magistrate Clagett shows up in the camp, along with the US military, but Al isn't too pleased with the message he has concerning the warrant. He makes his expectations known but Claggett doesn't seem to get it. Doc is at a loss as to what to do with Rev. Smith, whose situation has deteriorated considerably. He turns to Al for a solution. Cy Tolliver has been vocal about the Chinese community in Deadwood. He's less concerned about racial differences than he is in getting his hands on what is now prime property. Alma's father, Otis Russell, admits to her that he is once again heavily in debt - to the tune of $47,000 - and in need of her assistance. She bailed him out once before and he promised her that it would never happen again. Distraught, she turns to Seth Bullock who doesn't hesitate to take charge of the situation. Seth also has to deal with the buffoon who has been named Sheriff and there seems to be only one solution available.—garykmcd"], "genres": "N/A", "imdbID": "0556308", "rating": 9.1, "votes": 2464, "number_of_episodes": 36}