{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0114868": "W. Earl Brown", "0225332": "Kim Dickens", "0000374": "Brad Dourif", "0348152": "Anna Gunn", "0370035": "John Hawkes", "0000470": "Jeffrey Jones", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0130502": "Dayton Callie", "0108703": "Sean Bridgers", "0226813": "Garret Dillahunt", "0920038": "Titus Welliver", "1587626": "Bree Seanna Wall", "1938285": "Josh Eriksson", "0000959": "Powers Boothe", "0898546": "Pruitt Taylor Vince", "0005299": "Sarah Paulson", "0527945": "Pasha D. Lychnikoff", "0600657": "Philip Moon", "0827561": "Maury Sterling", "0289105": "Kirk Fox", "1024868": "Mei Melançon", "0911933": "Zack Ward", "0310887": "Gill Gayle", "0333689": "Allan Graf", "0445576": "Allen Keller", "1949279": "Ted Mann", "1615488": "Ralph Richeson", "3564355": "Jaden Christopher", "1895534": "Danielle McKee", "0910972": "Linda Wang"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["50"],  "plot": ["Wolcott offers on the claim of two ornery brothers, and reports to Hearst on their progress overall. Miss Isgringhausen strikes a deal with Swearengen, who discusses his options with a friend in a small box. Alma receives very different proposals from both Mrs. Bullock and Ellsworth. A Russian telegraph operator arrives in camp, and Joanie befriends a reluctant Jane.—WyattJones", "Wolcott continues buying up as many claims as possible and he reports to his employer, George Hearst, that with the exception of the Alma Garret claim, they now own all of the major properties in the area. Martha Bullock pays a surprise call on Alma Garret to propose taking over the teaching of the children in the camp. Alma has no objection to her becoming the new teacher and including Sofia, but the rancor between them over Seth gets in the way. Alma is somewhat taken aback by Whitney Ellsworth's proposal of marriage. Merrick is pleased that the telegraph operator named Blazanov has arrived. Al Swearengen sees it as an advantage over his competitors and expects Merrick to use the fact that the telegraph is located in the newspaper office to their advantage. Tom Nuttall receives his long awaited bicycle much to the amusement of everyone in the camp, especially young William Bullock. At nightfall, Wolcott visits Joanie Stubbs who is now alone at the Chez Ami.—garykmcd"], "genres": "N/A", "imdbID": "0556293", "rating": 8.1, "votes": 1641, "number_of_episodes": 36}