{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0114868": "W. Earl Brown", "0225332": "Kim Dickens", "0000374": "Brad Dourif", "0348152": "Anna Gunn", "0370035": "John Hawkes", "0000470": "Jeffrey Jones", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0130502": "Dayton Callie", "0108703": "Sean Bridgers", "0226813": "Garret Dillahunt", "0920038": "Titus Welliver", "1587626": "Bree Seanna Wall", "1938285": "Josh Eriksson", "0000959": "Powers Boothe", "0898546": "Pruitt Taylor Vince", "0005299": "Sarah Paulson", "0147738": "Larry Cedar", "0527945": "Pasha D. Lychnikoff", "0014977": "Franklyn Ajaye", "0304579": "Richard Gant", "0363669": "Michael Harney", "1440916": "Parisse Boothe", "1615454": "Nick Amandos", "1851108": "Jennifer Lutheran", "0022707": "Iris Braydon", "1895534": "Danielle McKee", "2083139": "Tony Swift"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["48"],  "plot": ["Bullock makes a connection with his son. Swearengen, who has entrusted E.B. to spy on the new telegraph operator, stokes rumors of an annexation of the camp and amends his agreement with Miss Isgringhausen. Cy aims to unburden a troubled man of his bloodstained money. Alma and Martha come to an agreement, and a tragic accident befalls the camp.—WyattJones", "Al Swearingen decides the time has come to stir things up a little and has Merrick put an article in the newspaper that Deadwood is likely to be annexed to Montana. With the Commissioner back in the camp, the article gets his as well as Cy Tolliver and Francis Wolcott's attention. Wolcott meanwhile continues buying up properties and persuades Mose Manual to sell out. Manuel's brother isn't too keen but Mose has a solution for that. Now that Mose is a rich man, Cy has every intention of helping him spend it, preferably at the Bella Union. With the arrival of the safe and a large amount of cash, the new bank is ready to open in Seth and Sol's hardware store. Martha suggests that Alma Garret be invited and seems more than prepared to mend fences. Al also makes a deal with Miss Isringhausen that will not only give her a good sum of money but her life. She insists that Seth Bullock be present for the deal but as Seth looks on, a terrible tragedy befalls him and his wife Martha.—garykmcd"], "genres": "N/A", "imdbID": "0556289", "rating": 8.6, "votes": 1704, "number_of_episodes": 36}