{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0114868": "W. Earl Brown", "0225332": "Kim Dickens", "0000374": "Brad Dourif", "0348152": "Anna Gunn", "0370035": "John Hawkes", "0000470": "Jeffrey Jones", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0130502": "Dayton Callie", "0108703": "Sean Bridgers", "0226813": "Garret Dillahunt", "0920038": "Titus Welliver", "1587626": "Bree Seanna Wall", "1938285": "Josh Eriksson", "0000959": "Powers Boothe", "0419273": "Peter Jason", "0147738": "Larry Cedar", "0422434": "Geri Jewell", "0600657": "Philip Moon", "1615454": "Nick Amandos", "1615471": "Monty 'Hawkeye' Henson", "0445576": "Allen Keller", "1949279": "Ted Mann", "1895534": "Danielle McKee", "2533286": "Keith Stevenson"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["51"],  "plot": ["Joanie discovers what happened at the Chez Ami and confides in Charlie Utter. Swearengen meets with Alma regarding Miss Isringhausen's allegations...and her connection to the Pinkertons. The town leaders convene to discuss pressing issues, but neglect to invite E.B., the mayor. By way of a strange circumstance, Utter comes into possession of Wild Bill's final correspondence.—WyattJones", "Merrick is in despair and isn't sure he wants to start up his newspaper again after his office was ransacked. Al has a talk with him. In the aftermath of Francis Wolcott's killing spree, Joanie has sent her remaining girls away with Charlie Utter having safely transported them. Cy Tolliver isn't very forthcoming about what happened and Joanie makes it clear she won't be any problem but turns to Charlie Utter with her secret. Since Joanie approached him as a friend, he will respect her wishes but he gives Wolcott a thorough beating. Al visits Alma Garret to tell her that Miss Isringhausen is a Pinkerton's detective and point out they have common interests in sticking together. Cy starts a marketing campaign of sorts for his new Chinese whores. E.B Farnum is upset at being left of a meeting of the town's leaders.—garykmcd"], "genres": "N/A", "imdbID": "0556298", "rating": 8.3, "votes": 1679, "number_of_episodes": 36}