{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0225332": "Kim Dickens", "0000374": "Brad Dourif", "0348152": "Anna Gunn", "0370035": "John Hawkes", "0000470": "Jeffrey Jones", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0108703": "Sean Bridgers", "0920038": "Titus Welliver", "1587626": "Bree Seanna Wall", "1938285": "Josh Eriksson", "0000959": "Powers Boothe", "0000481": "Alice Krige", "0422434": "Geri Jewell", "0005299": "Sarah Paulson", "0736204": "Channon Roe", "0786641": "Brent Sexton", "0310887": "Gill Gayle", "1589072": "Meghan Glennon", "2233997": "Holly Carbrey", "1939739": "Frank G. Turner", "2692445": "Channing Swift", "1440916": "Parisse Boothe", "2372571": "Lloyd Lineen", "2476331": "Sean LoGrasso", "2083139": "Tony Swift"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["49"],  "plot": ["Tensions flare as the camp faces an uncertain future. Al Swearengen taunts Seth Bullock over his relationship with Alma Garret, and the resulting confrontation between sheriff and criminal turns violent. With a new business venture on the horizon, Joanie Stubbs and Cy Tolliver await the arrival of some fancy new whores on the next stagecoach, which also bears two important reminders of Bullock's past.—WyattJones", "Seven months have now passed and Deadwood is inching closer to being incorporated into the United States. Seth Bullock and Alma Garret's love affair is now pretty common knowledge in the camp and the subject of much conversation. Some ill-chosen words from Al Swearengen leads to a major confrontation with Bullock and they end up giving each other a severe beating while two others are severely wounded. To Bullock's surprise his wife Martha and stepson William arrive in Deadwood unannounced. The stage also brings in some new girls allowing Joanie Stubbs to set up her own business. Cy Tolliver isn't too pleased when he hears that she also has a business partner in the form of a an experienced madam, Maddie. Calamity Jane meanwhile returns to Deadwood, drunk as always and obviously intent on drinking herself to death.—garykmcd"], "genres": "N/A", "imdbID": "0556286", "rating": 8.6, "votes": 2014, "number_of_episodes": 36}