{"cast": {"0648249": "Timothy Olyphant", "0574534": "Ian McShane", "0662504": "Molly Parker", "0064769": "Jim Beaver", "0114868": "W. Earl Brown", "0130502": "Dayton Callie", "0225332": "Kim Dickens", "0000374": "Brad Dourif", "0348152": "Anna Gunn", "0370035": "John Hawkes", "0000470": "Jeffrey Jones", "0539155": "Paula Malcomson", "0728132": "Leon Rippy", "0761836": "William Sanderson", "0917848": "Robin Weigert", "0108703": "Sean Bridgers", "0920038": "Titus Welliver", "0786641": "Brent Sexton", "1587626": "Bree Seanna Wall", "0000959": "Powers Boothe", "0004051": "Brian Cox", "0574468": "Gerald McRaney", "0949775": "Keone Young", "0454598": "Cleo King", "0527945": "Pasha D. Lychnikoff", "0002245": "Tzi Ma", "0034858": "Julie Ariola", "0262193": "Cynthia Ettinger", "1615488": "Ralph Richeson", "0629351": "Angela Nicholas", "1631706": "David Nelson", "1026093": "Kevin P. Kearns", "0445022": "Dennis Keiffer", "2016163": "Mark C. Thomas", "1453507": "George Adams", "8445746": "Al Collado", "3111358": "Rayne Davis", "0255175": "Chase Ellison", "1572587": "Ashleigh Kizer", "2212947": "Michael Lampe", "1888368": "David Redding"}, "geners": ["Crime", "Drama", "History", "Western"], "runtimes": ["51"],  "plot": ["A dandy arrives by stage coach and immediately begins exploring how to bring culture to the camp, Alma and Hearst negotiate business, and Hearst's Aunt Lou comes to camp.", "The stagecoach ushers in new arrivals to Deadwood: Jack Langrishe, a flamboyant stage promoter and old friend of Swearengen, and Aunt Lou Marchbanks, Hearst's longtime cook. A newly westernized Wu returns with news for \"Swegin\" about a soon-to-arrive group of imported Hearst workers. Apparently recovered from her ailments, with the aid of a reliable pal, Alma decides to approach Hearst with a claim deal. Bullock uncovers the truth about the Gem killings, and vows to put Hearst on notice.—WyattJones", "Alma has fully recovered and in good spirits and prepares to meet Hearst. She wants to make him a proposition but Ellesworth thinks she wasting her time as all Hearst will want to know is her price. Ellsworth is correct and Alma is shocked at Hearst's reaction. Hearst's Aunt Lou Marchbanks, his cook and housekeeper, arrives in Deadwood. She takes no backtalk from anyone, Hearst included. Actor and promoter Jack Langrishe , who knows Al quite well, also arrives intent on bringing a touch of culture to the camp. Wu returns from San Francisco where he was hiring Chinese laborers to work for Hearst and they haver 10 days before the crew arrives. Hearst meets Cy Tolliver over Cy's attempt at blackmail but Hearst has the upper hand and actually has a proposition for the saloon keeper—garykmcd"], "genres": "N/A", "imdbID": "0556294", "rating": 8.1, "votes": 1514, "number_of_episodes": 36}