{"cast": {"0089707": "Steve Blum", "0945290": "Kôichi Yamadera", "0082507": "Beau Billingslea", "0411167": "Unshô Ishizuka", "0370677": "Megumi Hayashibara", "0283253": "Wendee Lee", "0153100": "Melissa Fahn", "0846248": "Aoi Tada", "0157120": "Isshin Chiba", "0469674": "Steve Kramer", "0565419": "Michael McCarty", "0138233": "Kevin Seymour", "0046428": "Peter Spellos", "0840537": "Chiharu Suzuka", "0866729": "Kôsei Tomita", "0960033": "Akio Ôtsuka"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Sci-Fi"], "runtimes": ["25"],  "plot": ["Faye recounts her awakening from cryogenic freezing and a man, Whitney Hagas Matsumoto, who helped her before dying. Jet, however, arrives on the ship having caught him for a bounty. Faye now needs to know what was real.", "The Bebop crew is in need for money, so Jet decides to go catch a bounty head that's only worth 1,980 woolongs. The name of the bounty struck Faye in a way she hadn't felt for 3 years. To relieve her stress, she tells Ein a story revealing that she's older than she looks. She can only remember as far as 3 years ago, on 2068 A.D. where she awoke in a hospital. A doctor told her she's been in frozen coma for 54 years. The coma she was in preserved her age and youth so she's still 20 years old after all those years. Faye couldn't remember what exactly happened or how she ended up this way. The doctor told her they have no records, or files on her past life. So this is very confusing for her. And it takes her a long time to admit that she's no longer in the past she once knew. Faye doesn't have a social security number or any money making it difficult for her to leave the hospital. A man named Whitney Hagas Matsumoto helps her out by spending some time with her tell he finds a way for her to be able to leave the premises. After Faye is done with her story, Spike over heard it, but will it change his opinion on Faye?—J LeGault"], "genres": "N/A", "imdbID": "0618975", "rating": 7.9, "votes": 3198, "number_of_episodes": 26}