{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "2357874": "Dean Geyer", "0909935": "Damian Walshe-Howling", "0960946": "Damien Garvey", "0683935": "Alex Pinder", "2258245": "Sam Parsonson", "2794212": "Eka Darville", "4694697": "Terrence Mullings", "0680210": "Anna Lise Phillips", "4725940": "Vienna Bostock", "5046045": "Erin Connor", "5410081": "Paul De'bruyn", "3090991": "Tonia Renee Hammerich", "4880228": "Dru Lee", "4927575": "Victor Leto", "3016229": "Angelo Montano", "4123730": "Melissa Thompson", "5150705": "Ben Weirheim"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["45"],  "plot": ["When Elisabeth, Jim, Malcolm and Taylor investigate radio silence at a nearby scientific outpost, they discover an outbreak of a mysterious virus causing memory loss, paranoia and eventually death. The group must work together to find a cure before they lose their sanity and all of Terra Nova is infected.—Fox Publicity", "When a scientific outpost fails to communicate after a confusing message, commander Taylor takes Jim, Malcolm and Elisabeth along to investigate. They soon find the cause must have been an unknown viral infection which caused all researchers to go mad with rapidly progressing amnesia and die, so they must quarantine themselves in a race against time to find a cure. Jim meanwhile discovers they are under attack from raptors and must control his jealousy after finding out Malcolm was Elisabeth's lover before him. Since only Jim shows no symptoms, the reason must be the key.—KGF Vissers", "A scientific outpost with four scientists loses communication with Terra Nova. Taylor, Elisabeth and soldier Brady head to the outpost and learn that one scientist is missing, three have memory loss and the cables are chewed. Soon they find that there is a virus that caused the loss of memory and Taylor warns Lieutenant Washington that the place is quarantined. However, Jim and Malcom go in his hover to the outpost and Malcom gives a badly tasteful root to Jim to eat to heal his cold he caught from Zoe. When they arrive at the outpost, they find that Elisabeth has lost her recent memory. Further, Taylor believes he is in Somalia and is looking for his wife Ayani heading to Terra Nova, and Brady has passed out in the post. Now Malcom and Elisabeth need to find the cause and the cure before they lose their memory and Terra Nova is infected by Taylor.. Meanwhile, Skye brings Josh to know the owner of a bar, Tom Boylan, that might help him to bring Kara to Terra Nova.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2070472", "rating": 6.6, "votes": 1068, "number_of_episodes": 13}