{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "2357874": "Dean Geyer", "0909935": "Damian Walshe-Howling", "1363122": "Caroline Brazier", "2792721": "Matthew Scully", "2488008": "Emilia Burns", "2757035": "Robert Reitano", "2513057": "Ngoc Phan", "3046505": "Brittany Christine", "7540602": "Verity East", "4537487": "Yasmin Honeychurch", "4880228": "Dru Lee", "4927575": "Victor Leto", "4123730": "Melissa Thompson", "3828892": "Petar Zabic"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Taylor and Mira square-off in the jungle where he learns more about her plans and about his son. But then they both face a pre-historic enemy they must conquer together. Meanwhile, the \"Sixer\" mole scrambles to cover its tracks as Terra Nova goes on lockdown and Jim closes in. Also, Zoe faces a difficult decision as the Ankylosaur she has been caring for grows rapidly.—MC", "Taylor leaves Terra Nova alone in his motorcycle and assigns Jim as temporary commander. He heads to the waterfall where Lucas carves his equations on the rocks. Out of the blue, he is surprised and captured by Mira, who leads him to the Sixers through the woods. However, they are attacked by a pterosaur and Taylor reverts the situation, subduing Mira. When two slashers attack them, they flee but lose their weapon. Now they must team-up to each other to survive. Meanwhile, in Terra Nova, Jim and Mark Reynolds see the Sixers communicating from the woods with the spy using flashlights. Jim spots the location in Terra Nova and they head to the place. Skye is the spy and she hides from Jim and Mark, but cut his hand in a piece of glass that she was using to communicate. Jim finds a drop of blood floating on a paint sealant and he brings to Elisabeth to try to identify the DNA.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2111940", "rating": 7.3, "votes": 752, "number_of_episodes": 13}