{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "2357874": "Dean Geyer", "0483001": "Peter Lamb", "2925569": "Nicholas Cooper", "3810107": "Louis Toshio Okada", "1443601": "Mikhael Wilder", "3689685": "Byron J. Brochmann", "3054127": "Yves Chapand", "4198486": "Ross Price", "3046505": "Brittany Christine", "5046045": "Erin Connor", "4915010": "Joe Davidson", "5410081": "Paul De'bruyn", "3933302": "Kate Hawkins", "4537487": "Yasmin Honeychurch", "10840541": "Morgan Jago", "4880228": "Dru Lee", "4927575": "Victor Leto", "4513813": "Andrew Nicholson", "5115970": "Trent Owers", "5663039": "Ezekiel Simat", "4123730": "Melissa Thompson", "5997749": "Melisa Visca"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["When Terra Nova comes under attack from a legion of Pterosaurs, Jim and Taylor must find a way to save the colony before it's completely overtaken. Elisabeth discovers a former flame is also living in Terra Nova and may have been responsible for her recruitment. Syke tries to make Josh feel at home and Reynolds get protective of Maddy.—Fox Publicity", "Jim and Taylor find themselves trying to save the colony from attacking Pterosaurs. Elisabeth discovers an ex-boyfriend is also living in Terra Nova and may have been responsible for her being recruited. Skye and Josh spend more time together as she is trying to make him feel more comfortable in Terra Nova. Reynolds begins to look out for Maddy.—Anonymous", "While returning to Terra Nova, a vehicle with three soldiers has a flat tire. When they stop, they are attacked by unknown creatures. During the night, Jim and Elisabeth hears a scary noise, and Jim sends the flying creatures away. On the next morning, Taylor organizes a search party with Jim and a few soldiers to find the missing man. Elisabeth stumbles upon her former boyfriend in the medical school, Malcom Wallace, and learns that he had recommended her to Terra Nova. Taylor tells Jim that there is someone in Terra Nova providing inside information to Mira. They find the three men dead an bring them to Terra Nova and they discover they have been attacked from above. When Terra Nova is attacked by bird-like reptiles, Malcom investigates a dead-one, but Elisabeth and him need a couple alive to study the creatures. Soon they learn that Terra Nova was built on their breeding ground, and now the creatures are migrating to breed.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2070471", "rating": 6.7, "votes": 1213, "number_of_episodes": 13}