{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "2357874": "Dean Geyer", "2842232": "Ashley Zukerman", "0960946": "Damien Garvey", "1046288": "Rohan Nichol", "0384473": "Les Hill", "1363122": "Caroline Brazier", "0483001": "Peter Lamb", "2792721": "Matthew Scully", "2488008": "Emilia Burns", "3162426": "Romy Poulier", "3921260": "Carmel Rose", "4375257": "Tai Hara", "2289053": "Kazuya Wright", "1654205": "Robbie O'Brien", "1827034": "Chris Hillier", "2114187": "Liz Buchanan", "4825945": "Ethan Prosper", "0588050": "Catherine Miller", "4826300": "Wade Boyes", "3046505": "Brittany Christine", "5208337": "Jessica Gould", "6462392": "Karen Gould", "4537487": "Yasmin Honeychurch", "4594591": "Piper Leigh", "4927575": "Victor Leto", "4123730": "Melissa Thompson"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["45"],  "plot": ["The 11th Pilgrimage arrives in Terra Nova and the mysterious Phoenix Group in 2149 makes its move to pillage the past with the help of Lucas and Mira.", "As feared, the 11th Pilgrimage actually amounts to an overpowering invasion by Lucas, a private 'Phoenix' army and Mira's band. Jim is captured, but can play confused by a concussion. Malcolm is blackmailed to collaborate, but procrastinates. Only when Josh, who resumed his waiter job to spy on Lucas, gets abused, Jim breaks his cover. Lucas now also discovers how he communicates with Taylor, who is on the run in the forest. The Phoenix militia commander prepares to wipe clear the dinosaurs-infested valley with mega-bombs.—KGF Vissers", "The Eleventh Pilgrimage is ready to come to Terra Nova and Taylor and Jim prepares the defense in front of the portal. The first family arrives, then Kara comes and Jim receives her. However, the next colonist comes asking for help with bombs strapped to his body and blows-up. Jim awakes in the infirmary without memory and deaf. Elisabeth fix his hearing and tells that Washington surrounded after many casualties in Terra Nova and Taylor is somewhere in the woods. He also learns that Kara died in the explosion. Terra Nova is occupied by the mercenary Phoenix Group and Mira is in Taylor's office. When Elisabeth finds numbers in the bullet she withdraws from the mercenaries, Jim realizes that they are coordinates. Jim sneaks out and meets Taylor in the jungle. Now they plot a scheme to resist the invaders.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2112725", "rating": 7.7, "votes": 808, "number_of_episodes": 13}