{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "3115934": "Morgan Davies", "2357874": "Dean Geyer", "0909935": "Damian Walshe-Howling", "0483001": "Peter Lamb", "4694697": "Terrence Mullings", "2792721": "Matthew Scully", "2488008": "Emilia Burns", "4007618": "Deshay Padayachey", "2903837": "Don Christopher", "2925569": "Nicholas Cooper", "4728564": "Angus Freer", "3916488": "Jo Christiaans", "3689685": "Byron J. Brochmann", "3980196": "Arwen Baker", "3046505": "Brittany Christine", "5046045": "Erin Connor", "3090991": "Tonia Renee Hammerich", "4537487": "Yasmin Honeychurch", "4880228": "Dru Lee", "4927575": "Victor Leto", "5115970": "Trent Owers", "9209319": "Andrew Ravuna", "7966135": "Krystal Sayer", "4123730": "Melissa Thompson", "5519216": "Jessica Walmsley", "5150705": "Ben Weirheim"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Commander Taylor immediately grants sanctuary to little runaway Sixer girl Leah Marcos. He's even prepared to fight off a return claim, but Miera gives in suspiciously easily when Leah chooses to stay in Terra Nova. Jim lets her stay in the Shannon home, at least until a permanent foster family is selected. Jim can stop Leah just before she could flee the camp with a mysterious item she dug up from Mira's former home. Taylor mistrusts her story she had to fake having ran away because her kid brother is kept hostage, but Jim sets out to the Sixers side. He's captured and released with assurances the boy was never in real danger and a vague claim the Sixers serve the real, secret present-world purpose of Terra Nova, after an invitation to change side. To Josh's mild amusement, Maddy fails her medical training apprenticeship, being unable to stand disgusting symptoms.—KGF Vissers", "When Taylor's security team captures the girl Leah Marcos outside the perimeter of Terra Nova, Cmdr. Taylor assigns Jim and his wife Elizabeth to be the foster parents of Leah. Soon Mira comes with the Sixties to Terra Nova to discuss the future of Leah, but the girl prefers to stay in Terra Nova with the Shannon's family. When the girl is recaptured after stealing a strange device in the former Mira's house, she says that she lied because she wanted to save her brother Sam that stays with Mira. Taylor asks the people to forget Leah's last lie, but Jim believes the girl is telling the truth.—Claudio Carvalho, Rio de Janeiro, Brazil", "When an orphaned \"Sixer\" girl comes to Terra Nova seeking asylum, Jim and Shannon are at odds if they can trust her; Mira plots to reclaim a valued possession; Taylor begins to suspect there is a traitor in his midst and Reynolds admits his feelings for Maddy.—Fox Publicity"], "genres": "N/A", "imdbID": "2071220", "rating": 7.0, "votes": 973, "number_of_episodes": 13}