{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "2357874": "Dean Geyer", "0960946": "Damien Garvey", "2842232": "Ashley Zukerman", "3115934": "Morgan Davies", "2792721": "Matthew Scully", "2488008": "Emilia Burns", "0498568": "Stephen Leeder", "5920962": "Levi Miller", "4728564": "Angus Freer", "4880228": "Dru Lee"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["It's the colony's founding day. Josh asks dad Jim to check up on Boylan, whom commander Taylor grills mercilessly about the Sixers' mole, then uses a truth serum overdose. Thus Jim hears about a secret buried under the pilgrims tree, which Malcolm knows to be Taylor's alleged first home as colony founder. There Jim finds a corpse, which misses an arm, just like missing general Philbrick. Meanwhile a smashed giant dragonfly is found to be chip-bugged by the Sixers. Malcolm repairs it to trace their mole's communication line. When it enters the Shannon home, Jim is arrested as suspect of being Mira's mole, but he's soon released after hearing Taylor's story about his own son Lucas's part in the ignoble true motives for founding the colony.—KGF Vissers", "Taylor is interrogating Boylan since he believes he is the Sixers' spy in Terra Nova. When Jim comes to see Boylan's condition, he learns that his food was spiked by Taylor and Boylan is not collaborating with new information. Washington calls Taylor and while left alone with the demented Boylan, Jim learns that there is a secret between Boylan and Taylor about what he has buried under the \"Pilgrim's Tree\". He locates the tree and after digging, Jim finds a human skeletal buried there that might have been killed by Taylor. Meanwhile, a soldier in Terra Nova hits a dragonfly and Maddy finds a microchip attached to it. Soon Malcom finds that the dragonfly was used by Miriam to contact the spy in the colony.—Claudio Carvalho, Rio de Janeiro, Brazil", "As Taylor searches for the \"Sixer\" mole within Terra Nova, Jim stumbles onto an old murder, for which Taylor is the prime suspect.—Fox Publicity"], "genres": "N/A", "imdbID": "2089472", "rating": 7.2, "votes": 812, "number_of_episodes": 13}