{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "2357874": "Dean Geyer", "1216008": "Jay Ryan", "0960946": "Damien Garvey", "0483001": "Peter Lamb", "2034948": "Sweeney Young", "1113003": "Steve Rodgers", "2436145": "Alice Parkinson", "3046505": "Brittany Christine", "5046045": "Erin Connor", "4537487": "Yasmin Honeychurch", "4927575": "Victor Leto", "4410706": "Lasarus Ratuere", "7966135": "Krystal Sayer", "4123730": "Melissa Thompson", "0909935": "Damian Walshe-Howling", "5150705": "Ben Weirheim"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Jim discovers that the raptor-killing of soldier Foster, from Mark's unit and their illegal gambling organizer, was arranged as murder. Howard Milner confesses, but Jim soon realizes there's more to the case. Commander Taylor proves ruthless in punishment. Meanwhile bar owner Tom Boylan's price for helping Josh's girlfriend Kira on the next space-trip goes up. Skye helps Josh on the errand to Mira, who makes him promise a marker 'no questions asked'.—KGF Vissers", "While going to repair a communication post, soldier Foster is killed by a Nikoraptor. Jim finds evidences that Foster was killed by an animal trapped inside the station and concludes he was murdered. When he learns that Foster was having a love affair with Rebecca Milter and he goes with Lt. Washington to interview her. Out of the blue, her husband Howard Milner arrives and confesses the murder of Foster because he cheated him with his beloved wife. Cmdr. Taylor tells to the residents that this is the first murder case in Terra Nova and he is forced to banish Howard in accordance with the bylaw. Jim observes Howard and Rebecca and follows the man outside the gate of Terra Nova. Now the afraid Howard tells the truth to Jim and confesses that he was protecting Rebecca. When Jim learns that Rebecca is not the killer, Jim and the security team change the line of their investigation and find that Foster was gambling at Boylan's bar.—Claudio Carvalho, Rio de Janeiro, Brazil", "The colony falls victim to its first murder, and Jim and Taylor must find the perpetrator. Also, Skye helps Josh find a way to get Kira, his girlfriend from 2149, to the past, while Elisabeth and Zoe race to help an unborn Ankylosaurus survive.—Fox Publicity"], "genres": "N/A", "imdbID": "2071219", "rating": 6.9, "votes": 897, "number_of_episodes": 13}