{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "2357874": "Dean Geyer", "2842232": "Ashley Zukerman", "0960946": "Damien Garvey", "0909935": "Damian Walshe-Howling", "1216008": "Jay Ryan", "1363122": "Caroline Brazier", "0483001": "Peter Lamb", "2792721": "Matthew Scully", "2488008": "Emilia Burns", "3921260": "Carmel Rose", "4880228": "Dru Lee", "4428615": "Robin Nicolle"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Lucas races to assemble the final pieces of his mystery device, in advance of the 11th Pilgrimage's arrival. Also, Jim and Taylor confront the colony's \"Sixer\" mole, Skye is reunited with a familiar face and Terra Nova prepares for war.", "Assuming her no serious suspect, Josh promises to cover for Skye during Jim's questioning in the search for the Sixers mole, but seeing father suspects so comes clean. After another near-disaster, Jim makes Taylor consider it looks like she tried to minimize the damage. By the time they arrest her and learn her motive is her sick mother being held medical hostage, Skye has also met Taylor's son Lucas, helped him do supercomputer-calculations and learned about the Sixers' employers somehow sinister plans now two-way communication with the future is possible. Curran redeems himself.—KGF Vissers", "Jim proceeds his investigation and interviews Skye, who tells that was with Josh on the night of the sabotage of the laboratory. Then she asks Josh to lie to her and confirms she was with him. Skye goes to see her mother and Josh asks her to use The Eye to resolve his final calculations; otherwise, he would kill her mother. Meanwhile, the security team finds a breach in the wall and Jim asks to install a hidden security camera. When Jim sees Skye sneaking out Terra Nova, he presses Josh and learns that Skye is the Sixer's mole. Skye delivers the final calculation to Lucas that now is able to travel to the future.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2112724", "rating": 7.4, "votes": 782, "number_of_episodes": 13}