{"cast": {"0641816": "Jason O'Mara", "0174909": "Shelley Conn", "0010837": "Christine Adams", "1935292": "Allison Miller", "2334994": "Landon Liboiron", "4305463": "Naomi Scott", "0356489": "Rod Hallett", "4667912": "Alana Mansour", "0002332": "Stephen Lang", "0450274": "Simone Kessell", "0170347": "Robert Coleby", "1216008": "Jay Ryan", "0960946": "Damien Garvey", "3162426": "Romy Poulier", "0936897": "Scott Witt", "0400063": "Trent Huen", "4613576": "Lizzie Ballinger", "2757035": "Robert Reitano", "5046045": "Erin Connor", "2301728": "Josephine Flynn", "4880228": "Dru Lee", "4927575": "Victor Leto", "4410706": "Lasarus Ratuere", "4123730": "Melissa Thompson"}, "geners": ["Adventure", "Drama", "Mystery", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Josh grudgingly admits to Boylan he must honor Mira's marker-calling when asked to steal a drug from mother's hospital. Skye's skepticism makes him demand proof first that Kara can be contacted, which he gets. Boylan promises to wipe good-for-nothing Willy's debt if he takes the blame, but Jim soon sees trough that ploy. Taylor meanwhile finds banished Curran, saves him form a Komodo-dino and promises leniency if he brings a message to the Sixers camp. Famous scientific explorer Ken Horton visits the colony, on a mission for Dr. Malcolm Wallace, but fan Maddy soon gets him too to doubt Ken's identity.—KGF Vissers", "When Maddy's favorite scientist Dr. Ken Horton returns from an expedition to Terra Nova, he gives an autograph to Maddy and offers an internship to her. However, Maddy notes that Dr. Horton has bad memory and his handwriting is different, but Elisabeth believes they are caused by a stroke he had a couple of years ago. Maddy is not satisfied and finds a secret in her research about Dr. Ken Horton. Meanwhile, Boylan tells Josh that Mira has sent the price to bring Kara: he shall steal the badge of her mother and then steal a specific medication from the laboratory of his mother.—Claudio Carvalho, Rio de Janeiro, Brazil", "Maddy starts interning for the colony's greatest scientist, and her life is put in danger when she discovers a terrible secret. Meanwhile, Josh makes a deal with the devil in order to solidify his plan to bring his girlfriend from the future to Terra Nova.—Fox Publicity"], "genres": "N/A", "imdbID": "2089471", "rating": 7.1, "votes": 804, "number_of_episodes": 13}