{"cast": {"0785245": "Rod Serling", "0675490": "Nehemiah Persoff", "1494829": "Deirdre Owens", "0001495": "Patrick Macnee", "0942220": "Ben Wright", "0103320": "Leslie Bradley", "0404716": "Kendrick Huxham", "0761576": "Hugh Sanders", "0670247": "Richard Peel", "0431164": "Donald Journeaux", "0076150": "Barry Bernard", "0002082": "James Franciscus", "0431510": "Debbie Joyce", "0566389": "Robert McCord"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["It's 1942, a man finds himself on a ship in the Atlantic, not knowing who he is, nor how he got there. He does know the ship will soon be attacked by a German U-boat.", "During World War II, a confused Carl Lancer finds himself as one of only a few passengers on a freighter, the S.S. Queen of Glasgow, traveling from London to New York. As he sits with other passengers, he begins to realize that he is the captain of a U-Boat that is at that very moment tracking the freighter with a view to sinking it. He also knows that in just over an hour the freighter will be attacked.—garykmcd", "1942. The S.S. Queen of Glasgow is one day into its journey from Liverpool to New York City, the ship facing possible peril as it is caught in fog and has been separated from its convoy which is to ensure their safety during wartime. One of the passengers, Carl Lanser, seems to be suffering from some sort of amnesia: he knows his name, he knows he was born in Frankfurt, Germany, but he doesn't know how he got on the ship or why he is sailing on it, that despite his name being on the passenger manifest. He has a look of confusion and fear on his face, not only because of not knowing his situation but because he has a sense of impending doom, especially as he seems to have intimate knowledge of tactics used in marine battles. Before the end of his voyage, he will come to a realization of who he is, flashbacks which will provide the context of why he's on the ship tonight and every night.—Huggo"], "genres": "N/A", "imdbID": "0734582", "rating": 7.3, "votes": 4528, "number_of_episodes": 156}