{"cast": {"0001792": "Rod Taylor", "0001380": "Jim Hutton", "0014493": "Charles Aidman", "0178253": "Maxine Cooper", "0117269": "Paul Bryar", "0003711": "Sue Randall", "0060216": "Joe Bassett", "0275986": "Lisabeth Field", "0275987": "Logan Field", "0490961": "S. John Launer", "0569685": "Oliver McGowan", "0657743": "Gloria Pall", "0783251": "Bernard Sell", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["Three astronauts return from man's first flight into outer space and can't remember the trip.", "Three U.S. astronauts blast off from Earth on an initial test flight in an experimental rocket-ship, but during the flight into space the ship disappears from radar, then reappears. On return, the rocket-ship is hangared and put under a tarp, pending an investigation. One crewman is hospitalized for a leg broken on landing, and is visited by the other two. Next the pair go for a drink, and then one crewman phones his parents from a bar phone-booth - but they say they have no son! The astronaut immediately disappears, and no one in the bar remembers him, except the other astronaut in the bar, the Captain.—David Stevens", "The X-20 experimental spacecraft recently returned after venturing into a 900 mile orbit around the Earth. At one point, the craft disappeared for about 20 seconds and then suddenly reappeared before crashing in the Mojave desert. One of the crew, Maj. William Gart broke his leg on reentry but is recovering. Another of the astronauts, Lt. Col. Clegg Forbes, visits him but is obviously quite shaken. His recollection is there were 3 astronauts in the craft but the newspaper accounts mention only two. The third was Col. Ed Harrington but Gart says he never heard of him. As Forbes remembers it, he and Harrington went out the night before and Harrington begins to have a sense of not belonging. He then vanishes. As he searches for his friend, he can find no one who ever met the man—garykmcd"], "genres": "N/A", "imdbID": "0734555", "rating": 8.3, "votes": 5500, "number_of_episodes": 156}