{"cast": {"0785245": "Rod Serling", "0949574": "Gig Young", "0653942": "Frank Overton", "0853792": "Irene Tedrow", "9078080": "Michael Montgomery", "0000165": "Ron Howard", "0288304": "Byron Foulger", "0173758": "Sheridan Comerate", "0179790": "Joe Corey", "0552022": "Buzz Martin", "0677320": "Nan Peterson", "0641776": "Pat O'Malley", "0158288": "Noble 'Kid' Chissell", "0259984": "Bill Erwin"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["A man, fed up with where he's at in life, finds himself not only in his old hometown, but back to the time when he was a boy.", "Martin Sloan visits his hometown of Homewood and his favorite soda fountain 20 years after leaving. What he soon finds however is that he's actually stepped back in time, something that comes as a jolt when he sees the younger version of himself carving his name in park bandstand. He remembers it all as an idyllic time in his life but when he visits his parents, they think he's a lunatic. His attempt to tell his younger self to enjoy this time in his life ends in an accident. Later a conversation with his father leads to a better understanding of just why he went back.—garykmcd", "In this episode NYC executive Martin Sloane is burned out by the rat race. He seemingly stumbles onto his home town from his youth. Sitting at the counter of the old luncheonette he's surprised to hear the prices are the same as 25 years ago, in fact, everything is as it was 25 years ago.—speedolite1@yahoo.com", "Martin Sloan (Gig Young), a 36-year-old executive, stops in a fuel station off an isolated country road. Not far away, 1.5 miles, is the sight of his hometown, Homewood, he's very curious about all the kinds of things that shaped his childhood. Martin ventures to take a closer look, first he goes to an old shop where he used to get ice cream sodas. Martin is surprised to see the prices haven't changed still a dime for a three scoop ice cream soda. Walking around Martin meets a kid, who is his old neighbor. It is then that he realizes he's in 1934, when he was only 11-years-old. Things get complicated when he bumps into the young Martin, follows him to his house and meets with his parents. They won't believe him when Martin says he's in fact their grown up son. Later, Martin insists in talking with young Martin. He finds him on a carousel, where the child gets hurt falling. Martin will learn, after talking to his father, that every man has his own time and is perhaps better off not looking to the past.—P D'Arcey"], "genres": "N/A", "imdbID": "0734689", "rating": 8.2, "votes": 6644, "number_of_episodes": 156}