{"cast": {"0327089": "Thomas Gomez", "0488024": "John Larch", "0812453": "Vladimir Sokoloff", "0002166": "John A. Alonzo", "0312835": "Paul Genge", "0010928": "Dorothy Adams", "0340558": "Duane Grey", "0521070": "Jon Lormer", "1043866": "Andrea Darvi", "0382223": "Doug Heyes Jr.", "0096470": "Nick Borgani", "0238834": "Alphonso DuBois", "0478710": "Richard LaMarr", "0566389": "Robert McCord", "0639220": "Daniel Nunez", "0712317": "Paul Ravel", "0785245": "Rod Serling", "1151337": "Theresa Testa", "0924643": "Dan White"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["On a hot day, sympathetic Sheriff Koch and callous con man Peter Sykes are among the many who gather in a desert town to see young Luis Gallegos hanged for accidentally killing a child while drunk. Can some magic dust save Luis?", "In a dusty old-western town, a man is scheduled to be hanged after having been found guilty of accidentally killing a child while drunk. His father begs for mercy, but the marshal has no choice but to proceed with the sentence. Sykes, an odious salesman, takes advantage of the situation by selling the desperate father \"magic dust,\" which he says will make the townsfolk take pity on his son. Soon though, events provide for an unexpected conclusion.—garykmcd", "Set in the Wild West, a young man is about to be hanged for accidentally killing a little girl while drunk. A shady businessman sells the father of the condemned a bag of \"magic\" dust, said to turn people's hearts to love and empathy, rather than hate. Will it work?—grantss", "In an isolated threadbare western town of the old west, a desperate father begs for mercy as his son is scheduled to be hanged for an accident he couldn't have prevented. As the son's final hour draws near, the father's approached by an unscrupulous travelling salesman, who after selling the town the rope by which the young man's to hang, wants to also make money off the father's desperation. He offers - at a steep price - to sell him 'magic dust', which he says will elicit the townsfolk's sympathy for his condemned son.—D.Greenberg"], "genres": "N/A", "imdbID": "0734564", "rating": 6.9, "votes": 2900, "number_of_episodes": 156}