{"cast": {"0163816": "Dane Clark", "0001171": "Buddy Ebsen", "0924614": "Christine White", "0095772": "Nesdon Booth", "0177949": "Clancy Cooper", "0121303": "Jane Burgess", "0444745": "William Keene", "0727865": "Robert Riordan", "0779340": "Joe Scott", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["Compulsive gambler Ace Larsen cajoles his friend Jimbo Cobb to use his telekinesis to influence the results of the Las Vegas gambling tables in their favor.", "Ace Larson owns a roadside diner. It's a dreary existence for him, his girlfriend Kitty Cavanaugh, and his friend and employee Jimbo Cobb. Through a serious accident just outside his diner, Ace learns for the first time that Jimbo has telekinetic powers. Ace the gambler sees an easy way to make his fortune, and the three of them set off for Las Vegas. Jimbo has little trouble making roulette balls fall on the right number or making any point with a pair of dice. Ace learns the hard way, however, that there can be too much of a good thing.—garykmcd", "Ace, a compulsive gambler and diner owner, discovers that his best friend, Jimbo, has telekinesis after seeing him save the driver in a car wreck. Jimbo rarely uses the power, as it got him in trouble when he was young, and its use gives him headaches, but Ace sees opportunity and spirits his girlfriend Kitty and Jimbo to Las Vegas to win big at the gambling tables. After the first night, Ace wins enough money to last the rest of his life, but that's not good enough for Ace, who refuses to leave when Kitty wants to. She leaves, but he stays, going out on the town with the hotel's cigarette girl. The next day, Ace gets the biggest no-limits gambler to visit his hotel room and play craps. He keeps winning with Jimbo's help but loses on an all-or-nothing bet when Jimbo's power desert him.—Tony-B4"], "genres": "N/A", "imdbID": "0734672", "rating": 7.0, "votes": 2689, "number_of_episodes": 156}