{"cast": {"0062642": "Barbara Baxley", "0653942": "Frank Overton", "0197320": "Irene Dailey", "0422713": "Ann Jillian", "0814914": "Éva Szörényi", "0095474": "Robert Boon", "0117267": "Claudia Bryar", "0375887": "Percy Helton", "0073471": "Oscar Beregi Jr.", "0017674": "Fred Aldrich", "0149970": "William Challee", "0259984": "Bill Erwin", "0607942": "Charles Morton", "0771667": "Norbert Schiller", "0785245": "Rod Serling", "0910234": "Glen Walters"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["Ilse, the orphaned daughter of telepathic parents must learn to speak and deal with a world she cannot communicate in.", "Sometime after World War II, a small group of people make a pact to develop their telepathic abilities as a means of communicating, foregoing any type of oral communication. One couple, the Nielsens, announce that they are migrating to a small town in the USA, German Corners, Pa. After a tragic fire at their house 10 years later, Sheriff Harry Wheeler and his wife Cora take in the only survivor, the now orphaned Ilsa Nielsen. The young girl has never learned to speak, always using telepathy to communicate with her parents. They don't quite understand why Ilsa won't speak to them and Cora sees her as a replacement for the daughter she lost in an accident some years ago. When they enroll Ilsa in school, her teacher is determined to make her act like all the other children.—garykmcd", "In 1953, in Dusseldorf, three German couples sign a pact to experiment telepathic communication inclusive in their children. Holger Nielsen, his wife and their two-year-old daughter, Ilse, travel to German Corners, Pennsylvania, to live in an isolated house. When a fire destroys their house and only Ilse survives, Sheriff Harry Wheeler takes custody of the child until her parents are contacted, and brings her home. His wife Cora misses their diseased daughter Sally and feels attracted to Ilse. But the girl is telepathic and can not communicate with anybody.—Claudio Carvalho, Rio de Janeiro, Brazil", "In 1953, in Dusseldorf, three German couples sign a pact to experiment telepathic communication inclusive in their kids. Holger Nielsen, his wife and the two-year-old daughter Ilse travel to German Corner, in Pennsylvania, to live in an isolated house. When a fire destroys their house and only Ilse survives, Sheriff Harry Wheeler takes the custody of the child until her parents are contacted, and brings her home. His wife Cora misses their diseased daughter Sally and feels attracted to Ilse. But the girl is telepathic and cannot communicated with anybody.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734595", "rating": 6.5, "votes": 1891, "number_of_episodes": 156}