{"cast": {"0001430": "Jack Klugman", "0553014": "Ross Martin", "0067262": "Fred Beir", "3497822": "Mary Webster", "0254616": "Ross Elliott", "0846448": "Sara Taft", "0547384": "Tammy Marihugh", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["An interplanetary expedition from Earth finds an exact duplicate of their ship and themselves crashed on the planet they were surveying. Should they stay or risk taking off and crashing?", "In 1997, the spaceship E-89 arrives at the 13th planet in star system 51. Their mission is to collect plant samples to take back to an overpopulated Earth so it can be determined if the planet could be colonized. What they find however is a crashed spaceship of Earth design. Inside the ship they discover three dead crew members - but the dead are their duplicates and the crashed vessel is the E-89. The captain refuses to accept that they might be dead and explores several possibilities to explain what has happened including the theory that they may have time-traveled. The two crewmen hallucinate and come to believe they are already dead but the captain refuses to accept that and intends to prove that they are very much alive.—garykmcd", "In 1997, the spaceship E-89 is travelling through the space to collect vegetables, minerals and animals to see if the planet can be colonized by earthlings since Earth is overpopulated. When Lieutenant Mason sees a glittering object on the surface of the 13th planet in star system 51, he and Lieutenant Carter convince Captain Ross to land on the planet. They see a crashed spaceship identical to theirs and decide to explore her. Soon they find three bodies inside the crashed ship, and when they check them, they realize that they are themselves. What is happening to the crew of spaceship E-89?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734562", "rating": 7.6, "votes": 2167, "number_of_episodes": 156}