{"cast": {"0606593": "Howard Morris", "0058117": "Patricia Barry", "0809143": "Loring Smith", "0588903": "Mark Miller", "0417055": "Joyce Jameson", "0589622": "James Millhollin", "0368561": "Bob Hastings", "0050451": "Robert Ball", "0016776": "Jack Albertson", "0230101": "Molly Dodd", "0566389": "Robert McCord", "0663875": "Milton Parsons", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["A wiseacre genie appears from a lamp to a meek man, George P. Hanley. Hanley is so used to bad luck, he imagines how each of three possible wishes could go very wrong - but the genie will grant him only one wish!—David Stevens", "George P. Hanley is a meek and mild assistant accountant. At the office, he is overshadowed by the more outgoing Roger. His luck may have changed however when he buys an old lamp in a curio shop. When he tries to clean it, out pops a genie who offers him one wish. The genie tells him to think about it overnight and George imagines different scenarios he might wish for: married to a famous movie star, but finds that she would likely find her fun with someone else; a millionaire, a captain of industry who soon finds that buying things just isn't fun anymore; and finally, being the President of the USA where he decides he probably doesn't have the ability to make the big decisions. In the end, George comes up with the perfect wish.—garykmcd", "The clerk George P. Hanley is a complete loser and is bullied in the office where he works by his co-worker Roger. On the birthday of the secretary and his romantic interest Ann, George is lured by the owner of a store that sells an old lamp to him. George gives up to deliver his gift to Ann and brings it home. Soon he finds that the lamp is magic and the genie grants one wish for him. George decides to think of three different scenarios with Ann, money and power until he comes up to a conclusion.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734574", "rating": 6.2, "votes": 1728, "number_of_episodes": 156}