{"cast": {"0926235": "James Whitmore", "0640539": "Tim O'Connor", "0110814": "James Broderick", "0486742": "Paul Langton", "0375884": "Jo Helton", "0794333": "Mercedes Shirley", "0070511": "Russ Bender", "1581313": "Danny Kulick", "0448195": "Madge Kennedy", "0911629": "John Ward", "0641337": "Shirley O'Hara", "0072668": "Tony Benson", "0303056": "Lew Gallo", "0785245": "Rod Serling", "1152985": "Martin Strader"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["The Pilgrim I, the first-ever human space colony, is about to be rescued from Planet V9-Gamma where they've lived for three decades. Their leader William Benteen has trouble accepting that big changes are coming in their lives.", "The colonists of Pilgrim I, Earth's first space colony, have spent 30 years on their new home. It's a lonely, barren place more akin to hell then Eden. Now, they're awaiting the arrival of a ship to take them to Earth. Some colonists are at their wits' end; another - the 9th in 6 months - commits suicide. Their leader, William Benteen, a tough drill sergeant-type, who they call Captain, does his best to keep them together. When the ship arrives, they're given 3 days to prepare to leave. As the day of departure approaches, Benteen's assumption that the community will stay together on Earth, is wrong; most will go their own way once on earth. Hearing this, Benteen decides they should stay. When the group decides otherwise, Benteen's left with only one option.—garykmcd", "A party of colonists has been stranded on a far-flung, inhospitable planet for 30 years. During that time their leader, Benteen, has built himself up to be a God-like figure. Now a rescue party has arrived to take them back to Earth. Things should be absolutely peachy but Benteen is now seeing his power slip away.—grantss", "Thirty years ago, a group of colonies left Earth to an outpost expecting to live in a peaceful planet without war. However, the planet is arid with two suns and they survive thanks to \"Captain\" William Benteen, a leader that has kept them together, giving strength to the survivors to stay alive. When Colonel Sloane arrives with a spacecraft from Earth to bring the colonies back home, there is a friction between \"Captain\" William Benteen and Colonel Sloane, since Benteen wants to decide for all his fellows.—Claudio Carvalho, Rio de Janeiro, Brazil", "For 30 years, the first earth colony has just managed to eke out an existence on a desolate planet, baked by 2 suns. They've managed this under the tough control of William Benteen, who's lead them like a cult leader would; total control. When a ship arrives and offers them a new life back on Earth, Benteen feels his control will be lost, and urges the colonists to stay.—Charles Dill"], "genres": "N/A", "imdbID": "0734606", "rating": 8.1, "votes": 2316, "number_of_episodes": 156}