{"cast": {"0649055": "David Opatoshu", "0625343": "Ed Nelson", "0874353": "Natalie Trundy", "0041466": "Jacques Aubuchon", "0339428": "Dabbs Greer", "0001150": "James Doohan", "0110115": "Morgan Brittany", "0065798": "Henry Beckman", "0122576": "Bart Burns", "0129478": "King Calder", "0641315": "Pat O'Hara", "0449017": "Sandy Kenyon", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["A reporter stumbles into a peaceful town where miracles seem to occur due to technology and the townsfolk won't let him leave.", "On the back roads, trying to find his way back home, reporter Philip Redfield and his dog, Rollie, stop in the small town of Peaceful Valley, for gas and food, and directions. When Rollie runs off in pursuit of a cat, a young girl points a device at the dog, and he disappears. Though her father brings Rollie back, Philip finds it all very strange. When Phillip tries to leave town, his car crashes into an invisible barrier, preventing his departure. Shaken up, the town's mayor, Dorn, reveals their secret, and gives Philip the choice; join them or die.—garykmcd/edited by canadazbest", "While returning home in Albuquerque through a secondary road, the reporter Philip Redfield gets lost and short of gas. He finds the small town of Peaceful Valley and stops in a gas station for fuel and in a restaurant for food. His dog Rollie pursues a cat and the girl who owns the cat points a strange device to the dog and it vanishes. However, her father brings Rollie back and Philip decides to leave the town. But he hits and invisible barrier and his car is completely damaged and Rollie is dead. Four locals arrive and bring him and Rollie alive back to the town to meet the Major Dorn and the two-men council. Dorn tells a secret to Philip and offers two choices to him: stay with them forever or die.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734688", "rating": 7.8, "votes": 2330, "number_of_episodes": 156}