{"cast": {"0000763": "Dana Andrews", "0107746": "Patricia Breslin", "0041021": "Malcolm Atterbury", "0180452": "Robert Cornthwaite", "0953437": "John Zaremba", "0941454": "C. Lindsay Workman", "0071913": "Marjorie Bennett", "0654286": "Tudor Owen", "0944898": "James Yagi", "0800359": "Robert F. Simon", "0386944": "Adolf Hitler", "0176855": "Gene Coogan", "0402019": "Peter Humphreys", "0566389": "Robert McCord", "0785245": "Rod Serling", "0914519": "Bobs Watson"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["A scientist attempts to use a time machine to prevent tragedies, both in world history and in his own past.", "Paul Driscoll does not much like the way the 20th century has developed thus far and decides to go back in time to change mankind's future. He first travels to Hiroshima and tries to warn an English-speaking policeman of what is to come, but to no avail. He then travels to Nazi Germany and attempts to assassinate Adolf Hitler but is thwarted when his rifle misfires. He then finds himself aboard the Lusitania but again is unable to convince the ship's captain to alter course before it is torpedoed. When he returns to the present, he agrees with his colleague Harvey that the past cannot be changed. He still does not like the present, so decides to go back to July 1881 to live his life in the small town of Homeville, Indiana. Unfortunately he learns yet again that past events cannot be changed.—garykmcd", "The physicist Paul Driscoll is discontent with the Twentieth Century because of the wars, deaths and radioactivity. He develops a time machine and decides to visit three milestones of the recent history, expecting to change them. He fails and he decides to move to 1881 to Homeville, Indiana, to have a peaceful life. But he learns that only the future can be changed, and not the past.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734602", "rating": 7.3, "votes": 1950, "number_of_episodes": 156}