{"cast": {"0922967": "Jack Weston", "0569410": "John McGiver", "0580109": "Doro Merande", "0002369": "John Williams", "0489484": "Henry Lascoe", "0487140": "William Lanteau", "0573830": "Howard McNear", "0715073": "Marge Redmond", "0398455": "Clegg Hoyt", "0833405": "Judy Strangis", "0000608": "Burt Reynolds", "1093828": "John Bose", "0101394": "Rudy Bowman", "0239532": "Paul Dubov", "0412336": "George Ives", "0628541": "John Newton", "0768443": "Diane Sayer", "0785245": "Rod Serling", "0804089": "Leslie Sketchley", "0935067": "Jason Wingreen"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["Julius Moomer, a talentless, but relentless, self-promoting hack who dreams of becoming a successful television writer, uses a book of magic to summon William Shakespeare to write dramatic teleplays that Moomer will pass off as his own. Shakespeare becomes irritated by Moomer's lack of appreciation and is even more appalled when he discovers the changes wrought on his plays by cynical television executives.—laird-3", "Julius Moomer has given up his job as a streetcar conductor to pursue what he thinks is his true calling - to be a writer. He's gone out and hired an agent, Gerald Hugo, but there's just one problem - he just can't write worth a damn. He's continually pitching hackneyed ideas but when he learns that Hugo is working on a show about black magic he goes off to a bookstore intent on learning more about the subject. The book he finds - actually it sort of finds him - is a book of spells and to his delight, he conjures up none other than William Shakespeare. He soon has Will, as he calls him, writing his scripts and they're a big hit. They're not much of a hit with Shakespeare however when he visits the set and sees just what they have done to his work.—garykmcd", "The former bus driver Julius Moomer is an aspirant television writer without any talent. He is insistent with the agent Mr. Hugo to have a chance and he gives a couple of days to Julius to write about black magic. Julius goes to a book shop to look for a black magic book and the owner gives one to him. Julius accidentally summons Willian Shakespeare and forces him to write for him. However, when Shakespeare hears and see what is happening to his writing, there is a conflict with Julius.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734630", "rating": 5.6, "votes": 1724, "number_of_episodes": 156}