{"cast": {"0446037": "Mike Kellin", "0643000": "Simon Oakland", "0790905": "David Sheiner", "0175912": "John Considine", "0084642": "Bill Bixby", "0141543": "Conlan Carter", "0174030": "Forrest Compton", "0779234": "Henry Scott", "0130083": "Anthony D. Call", "0473943": "Charles Kuenstle", "0507112": "Derrik Lewis", "0046635": "Vincent Baggetta", "0253489": "Louie Elias", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["As a U.S. Navy destroyer cruises near Guadalcanal in the South Pacific, its sonar detects muted but constant hammering on metal undersea. The eerie sounds emanate from a submarine on the ocean floor, apparently there since World War II. The ship's chief boatswain's mate becomes very nervous, having served aboard that sub - and he was its sole survivor.—David Stevens", "In the Pacific Ocean, 100 miles from Guadalcanal, a U.S. destroyer discovers a sunken submarine when the destroyer's sonar picks up the sound of tapping on metal. The crew sends below a diver, who confirms that it's a sunken U.S. submarine. A bit of research reveals that it went down 20 years earlier, during World War II. Meanwhile, the chief boatswain's mate Bell has been acting strangely, and the ship's doctor believes Bell is having a mental breakdown. Not coincidentally, the submarine they've discovered is the one from which Bell was the only survivor -- and believing himself responsible for the ship's sinking, he comes to fear that his former crew mates are calling him to join them.—garykmcd", "While sailing in the South Pacific, a US destroyer detects the sound of beating on a metal undersea. The Chief Boatswain's Mate Bell feels disturbed and sick and is sent to the infirmary by Captain Beecham. The diver McClure finds a submarine stranded in the bottom of the sea and based on the Hull # 714, Captain Beecham learns that the submarine has sunk during the World War II. Further, Chief Bell is the only survivor and blames himself for the sinking of the submarine.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734678", "rating": 7.2, "votes": 2138, "number_of_episodes": 156}