{"cast": {"0000380": "Robert Duvall", "0447125": "Pert Kelton", "0057363": "Barbara Barrie", "0934750": "William Windom", "0918396": "Lennie Weinrib", "0572897": "John McLiam", "0680237": "Barney Phillips", "1496153": "Joan Chambers", "0833628": "Chet Stratton", "0029409": "Richard Angarola", "0738730": "Nina Roman", "0342655": "Claire Griswold", "0123680": "Norman Burton", "0675129": "Joseph V. Perry", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["Mousey misfit Charley Parkes finds the world unfolding before him in a museum doll house to be more real than his boring job and overbearing mother.", "Charley Parkes is a thirty and something years old clerk with a tedious job that lives with his mother Mrs. Parkes, who treats him like a boy. One day, he visits the County Museum and feels attracted by a woman in miniature named Alice. He overhears a song played by her in the piano, but the security guard tells him that it is impossible since the miniatures are wooden made without any mechanism. When he returns to his job, his chief fires him since he is a weird and antisocial man and has no teamwork with his colleagues. Soon Charley becomes fascinated by the doll and instead of looking for another job, he spends his days talking to the miniature doll. Until his family interns him in a psychiatric clinic.—Claudio Carvalho, Rio de Janeiro, Brazil", "Charley Parkes (Robert Duvall) believes that he sees a figure in a museum dollhouse that comes alive. He returns to the museum numerous times and gazes into the dollhouse, repeatedly witnessing the doll in the house become animated. A guard (John McLiam) tells him that the doll is not mechanical, but merely carved from a single block of wood, but this does not dissuade Charley. Charley gradually falls in love with the figure, a woman (Claire Griswold) who is in an abusive relationship with a male figure (Richard Angarola) in the dollhouse. In an attempt to rescue the female doll from the male doll, Charley breaks the glass and is subsequently committed to a psychiatric hospital. He pretends to be rehabilitated and is returned to the care of his mother (Pert Kelton). On the evening of his return home, Charley's family discovers that he has secretly left the house. They contact Charley's psychiatrist (William Windom) and surmise that he has returned to the dollhouse. At the museum, Charley reveals his feelings for the doll. The family, psychiatrist and museum guards search the museum for Charley but find nothing. However, one guard glances into the dollhouse and sees Charley, now a miniature figure, finally together with his love in the dollhouse. Smiling, the guard resolves to never reveal what he has witnessed."], "genres": "N/A", "imdbID": "0734589", "rating": 7.6, "votes": 2234, "number_of_episodes": 156}