{"cast": {"0000454": "Dennis Hopper", "0232213": "Ludwig Donath", "0005196": "Paul Mazursky", "0128995": "Howard Caine", "0354854": "Barnaby Hale", "0012175": "Jay Adler", "0059535": "Wolfe Barzell", "0270640": "Bernard Fein", "0176661": "Curt Conway", "0104585": "Chet Brandenburg", "0117269": "Paul Bryar", "0170106": "Bud Cokes", "0262903": "Joe Evans", "0317975": "Bobby Gilbert", "0364237": "Buck Harrington", "0368155": "Ed Haskett", "0566389": "Robert McCord", "0574990": "William Meader", "5581311": "Jim Michael", "0613862": "Sol Murgi", "0639444": "William H. O'Brien", "0692536": "Jose Portugal", "0712317": "Paul Ravel", "0769690": "Rube Schaffer", "0785245": "Rod Serling", "0958451": "Bill Zuckert"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["A tiny neo-Nazi organization struggles pathetically to succeed in a big city. A mysterious figure begins to ruthlessly guide a young, insecure U.S. Nazi leader, and the group begins to draw more attention.", "Peter Vollmer is the leader of a small neo-Nazi movement in a large American city. He's having trouble getting his message across and seems to alienate people every time he opens his mouth. After a particularly bad rally, he hears a voice and sees a man standing in the shadows. He begins to advise Peter on what to say and how he can structure his message to make it more appealing to his particular audience. Peter has success but his mentor begins pushing him to extremes. There is a limit however and there is a voice of reason in the mob that seemed so willing to follow him.—garykmcd", "The mediocre Peter Vollmer is a young neo-Nazi that has neither leadership no charisma to excite the masses. He is frequently humiliated and his emotional support is the Jewish Ernst Ganz, who raised him like a son. Out of the blue, a black shadow becomes his mentor, teaching him how to speech and to attract the masses despite the costs.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734572", "rating": 7.5, "votes": 2427, "number_of_episodes": 156}