{"cast": {"0004282": "Anne Francis", "0078940": "James Best", "0222873": "Laura Devon", "0634282": "Jeanette Nolan", "0339615": "Virginia Gregg", "0593355": "George Mitchell", "0458560": "Helen Kleeb", "0092899": "Jim Boles", "0521070": "Jon Lormer", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["Appalachian beauty Jess-Belle Stone can't bear to lose Billy Ben Turner, the object of her passion, to local rich girl Ellie Glover, so she turns to local witch Granny Hart for aid. The results bring unexpected and tragic consequences.", "After the love of her life, Billy Ben Turner, gets engaged to Ellwyn, the daughter of a rich farmer, a jealous Jess-Belle turns to a local witch to help her get him back. Granny Hart is known in the area as the person to go to for any potion you might want. Jess-Belle has no money, however, and all Granny Hart can give her is a potion that carries a high price. Jess-Belle is prepared to pay any price, and the potion she takes seems to work: as soon as Billy Ben sets eyes on her, he falls madly in love with her. When the clock strikes midnight, however, Jess-Belle is transformed and later realizes that she, too, is now a witch.—garykmcd", "In the countryside of USA, Ellwyn Glover, who is the daughter of a rich farmer, accepts the proposal of the local farmer Billy Ben Turner. Her father gives a party in a barn to celebrate their engagement. His former lover Jess-Belle Stone, who also loves him, becomes jealous and looks for the local witch Granny Hart. However, she does not have money to pay for a love potion to bewitch Billy Ben. Granny Hart gives the potion to her and tells to Jess-Belle that there is a high-cost involved, but the woman does not care for the price. She immediately bewitched Billy Ben that leaves Ellwyn alone in her party. But soon Jess-Belle learns the price she has to pay for accepting the deal with the powerful witch.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734581", "rating": 6.9, "votes": 2096, "number_of_episodes": 156}