{"cast": {"0178066": "Gladys Cooper", "0405035": "Wilfrid Hyde-White", "0445523": "Cecil Kellaway", "0680097": "Lee Philips", "0887696": "Joyce Van Patten", "0621002": "Alan Napier", "0216819": "Cyril Delevanti", "0706978": "Jack Raine", "0132321": "Colin Campbell", "0444411": "Don Keefer", "0048448": "Frank Baker", "0365039": "Sam Harris", "0428085": "Freda Jones", "0448560": "Colin Kenny", "0505986": "Carl M. Leviness", "0780844": "Scott Seaton", "0785245": "Rod Serling", "0869863": "Arthur Tovey"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["A young American couple, the Ransomes, who are trying to salvage their troubled marriage, insist on booking passage on an old trans-Atlantic cruise liner. But other passengers try to persuade them to disembark immediately.", "Eileen and Alan Ransome's marriage is going through a bad patch and they decide to go on a holiday to London. Eileen insists on traveling by ship and they book passage on the Lady Anne, an old ship that is not recommended by the travel agent but is leaving quite soon. When they arrive at the port terminal another passenger, Mr. McKenzie, insists strenuously that the young couple has made a mistake and tries to discourage them from coming along on what is a \"private cruise\". Mrs. McKenzie keeps her own counsel but clearly shares her husband's sentiments. Another passenger, Burgess, tries to warn them off as well. He and McKenzie offer them money, eventually $10,000, to leave immediately. The Ransomes take umbrage and refuse. The couple finds that all of the other passengers are quite elderly but unsurprisingly have a good deal of wisdom to dispense to the young couple. Alan and Eileen are just beginning to really enjoy the trip when the captain suddenly puts them off the ship at gunpoint with provisions and a promise to notify the authorities of their location. They are rescued but as for the Lady Anne and her other passengers -- well, there's the rub.—garykmcd", "In New York, the businessman Alan Ransome and his wife Eileen Ransome will travel to London together in a second honey-moon trying to save their six-year-old marriage. Eileen wants to travel by ship to have more time with Alan, and they buy a ticket to the old ship Lady Anne despite the advice of the travel agent. In the vessel, two old men unsuccessfully try to convince them to give up to embark. When the ship sails, they realize that all the passengers are over seventy-five years old and soon Eilleen regrets to have forced the voyage by ship. However, the American couple is welcomed by the passengers and they learn that this is the last voyage of Lady Anne that will be scrapped and they are habitué of the Lady Anne. They also note that there is a mystery on board, and soon Eilleen vanishes. What is the secret of the Lady Anne?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734610", "rating": 7.3, "votes": 1885, "number_of_episodes": 156}