{"cast": {"0758692": "Albert Salmi", "0026930": "John Anderson", "0455389": "Wright King", "0713277": "Guy Raymond", "0121636": "Christine Burke", "0363515": "John Harmon", "0761576": "Hugh Sanders", "0628325": "Julie Newmar", "0413839": "Mary Jackson", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["Aging tycoon William Feathersmith is bored with life and makes arrangements through a devilish travel agency to return to the Cliffordville of his youth and start all over again.", "William Feathersmith is a hard-nosed and cold-hearted misanthropic businessman now quite wealthy but bored. It's clear that what he enjoys is the chase and the acquisition of wealth. He also likes breaking men in the process. While leaving the office one day, he finds himself on the wrong floor (the ominous 13th floor, a number usually associated with bad luck and ill fortune) and in the office of Devlin Travel, run by the statuesque and devilishly attractive Ms. Devlin. In return for his amassed fortune -- not his soul because, as she notes, \"we got ahold of your soul some time ago\" -- she offers to send him back in time to his hometown of Cliffordville in 1910 where he can start over and get the pleasure of building his empire all over again. He accepts and once back to the days of his youth begins wheeling and dealing. Nothing quite goes as planned however.—garykmcd", "After destroying his last opponent Deidrich, the evil millionaire William Feathersmith feels bored without any challenge in his life. While leaving his building, he stumbles upon a devilish travel agency managed by Miss Devlin that offers him the chance to return to Cliffordville in 1910, where he started to raise his fortune. She demands all his money since he has already lost his soul. Feathersmith accepts the deal, provided he had the appearance he had in 1910 and his present knowledge. He is transported to Cliffordville, but he fails in all his businesses and needs to make another deal with Miss Devlin.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734605", "rating": 7.2, "votes": 1927, "number_of_episodes": 156}