{"cast": {"0258757": "Richard Erdman", "0269667": "Herbie Faye", "0067589": "Leon Belasco", "0802296": "Doris Singleton", "0731507": "Roy Roberts", "0921799": "Dick Wessel", "1107853": "Ray Kellogg", "0236951": "Ken Drake", "0051199": "Sam Balter", "0198980": "Roy Damron", "0314510": "Rudy Germane", "0356128": "Stuart Hall", "0566389": "Robert McCord", "1150543": "Ray Pourchot", "0694446": "Paul Power", "0747069": "John Roy", "0785245": "Rod Serling", "0759299": "Al Silvani", "0828164": "Norman Stevans"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["Long-winded bachelor Patrick Thomas McNulty loses his job in Mr. Cooper's garment factory, visits his favorite local tavern, converses with a stranger, and is inexplicably given a stopwatch that halts time.", "Patrick Thomas McNulty, an obnoxious blow-hard who has an opinion for every possible situation and topic there is. People find him insufferable: his co-workers, the regulars at the bar he frequents, his boss as well. McNulty submits a grocery list of suggestions to really turn Cooper Corporations around. His boss, Mr. Cooper, dislikes his ideas wanting to keep his business simple. Cooper discards McNulty, along with all of his ideas. Patrick returns to his local watering hole. The bartender Joe has a talk with McNulty, trying to help him realize that the problem may be McNulty's personality, and the fact that he is responsible for alienating everybody. However, he doesn't drive everyone away tonight. There's one strange little man in a bar who seems as desolate and lonely as he is. A bizarre foreign man by the name of Potts. Well, misery loves company. Patrick buys him a beer. Potts is touched. These poor two seem to be made for each other. Patrick offers him the gift of friendship. For making such an offer, Potts gives back the gift of a family heirloom - a old time stopwatch. McNulty finds plenty of uses for the gift of stopping time. After an attempt to market the little gizmo fails, he uses it to get revenge of his former boss and co-workers. He realizes that the only way he's ever gonna get respect if he gets money and lots of it. He uses the supernatural stopwatch to rob a bank. He stops it just as they're opening the vault. And just as he's walking away with an overflowing cart of cash, his pocket-watch falls out of his pocket...—Dane Youssef", "After Patrick Thomas McNulty gets fired from his job, he goes to a neighborhood bar where his non-stop chatter drives all of the customers away. One of the last patrons in the bar has a gift for him: a stopwatch. It's a strange gift and he has no idea what he might do with it. When he presses the button however everything around him stops. He returns to work the next day and tries to market it, but to no avail. He then returns to the bar and again drives everyone out the bar with his bombast.—garykmcd", "McNulty is an annoying and talkative man hated by everybody he knows. His boss Mr. Cooper cannot support him anymore and fires McNulty. Now he spends his spare time in the bar of Joe Palucci, scaring away his costumers. One night, McNutty meets an old man and buys him a beer; in return, the man gives a stop-watch to him. Soon McNutty finds that the stop-watch is capable to stop the time, and he decides to brag to his acquaintances. However, nobody believes him and McNutty decides to go further with the stop-watch, with serious consequences.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734542", "rating": 7.4, "votes": 2470, "number_of_episodes": 156}