{"cast": {"0330150": "Don Gordon", "0462097": "Gail Kobe", "0853299": "Vaughn Taylor", "0641729": "J. Pat O'Malley", "0241523": "Douglass Dumbrille", "0483125": "Douglas Lambert", "0001025": "Seymour Cassel", "0415185": "Ted Jacques", "0641746": "Kathleen O'Malley", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["Salvatore Ross can trade physical characteristics with other people and will use this talent to do anything to gain both the love of his former social worker Leah Maitland as well as the approval of her crippled father.", "Salvadore Ross is a volatile mix of violence and frustration. He's not very bright and hasn't made much of himself so far. He is very much in love with Leah Maitland though she has told him she doesn't want to see him anymore. He thinks she won't see him because her father doesn't approve and that they both think she can do better. When he realizes he can actually exchange parts of himself, like his age, with others he sets out on a path to make himself more acceptable to both of them.—garykmcd", "The ambitious, insensitive and furious Salvadore Ross is a man that desires the social worker Leah Maitland. They have dated in the past but Leah broke their relationship since they have different personalities. Salvatore Ross breaks his hand hitting on Leah's front door and has to spend the night in the hospital. His roommate is an old man with respiratory problem, and Salvatore offers to change his broken hand for the infection. Later he finds that the trade has worked and he learns that he has the power to trade with other people. He exchanges his youth with an old man for a fortune, and then he buys one year from several teenagers until he reaches his age again. Now he looks for Leah again, and she accepts to have dinner with him. However, despite being wealthy, she misses compassion like her father has in his behavior. Now Salvadore Ross offers Mr. Maitland a large amount for his compassion.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734675", "rating": 7.5, "votes": 2069, "number_of_episodes": 156}