{"cast": {"0215000": "John Dehner", "0011366": "Stanley Adams", "0641729": "J. Pat O'Malley", "0495396": "Norman Leavitt", "0375887": "Percy Helton", "0593850": "John Mitchum", "0213159": "Edgar Dearing", "0641868": "Patrick O'Moore", "11262113": "Al Beaudine", "0166581": "John Cliff", "0285754": "Lloyd Ford", "0566389": "Robert McCord", "0615421": "Kate Murtagh", "0764972": "Cosmo Sardo", "0785245": "Rod Serling", "0910468": "Fred Walton", "0956563": "John Zimeas"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["In 1890, traveling salesman Jared Garrity visits the town of Happiness, Arizona offering to resurrect the dead and reunite the townsfolk with their departed loved ones out of the goodness of his heart for hefty prices.", "In the early 1890s Mr. Garrity arrives in Happiness, Arizona apparently knowing a great deal about some of the people who live there. He knows that Jensen the bartender's brother died and that Gooberman the town drunk lost his wife. Garrity also reveals that he has a very peculiar gift - he can bring back the dead. When a dog is run down by a wagon in the street he resurrects it without any difficulty. When he offers to do the same for the town's loved ones, they realize they would rather he not bring back the dearly departed, something they are quite happy to pay him for. Garrity, a charlatan if ever there was one, is glad to accept their money - though he does seem to leave something behind.—garykmcd", "In 1890, in Happiness, Arizona, Mr. Jared Garrity arrives with his wagon and goes to a bar to drink beer. He meets the bartender Jensen and learns that his brother recently died. Soon he discloses to the locals that he has the gift to bring the dead to life. A wagon runs over a dog in the street and he uses his gift to resurrect the animal. Then he goes alone to the cemetery and when he returns to the bar, he tells to the residents that he has resurrected all the dead. But Jensen asks him to return his brother to the grave, and he says that this would demand much effort from him, but Jensen pays a large amount to him. Then the other folks in town do the same and pays the conman to let the dead resting in peace. Later, something happens in Happiness.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0734594", "rating": 7.5, "votes": 1974, "number_of_episodes": 156}