{"cast": {"0625167": "Barry Nelson", "0540487": "Nancy Malone", "7219655": "Denise Lynn", "0635839": "Karen Norris", "0785245": "Rod Serling"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["25"],  "plot": ["The morning after a wild night of partying, a hungover married couple awaken in an unfamiliar and artificial place.", "After drinking too much at a party, Bob and Millie Frazier awaken in a strange bed, in a strange house in a strange town. They're still dressed in the clothes they wore to the party but their memories are fuzzy. Bob was too drunk to drive so Millie was behind the wheel and she vaguely remembers a shadow falling over them. They soon realize that everything in the town is fake: the telephone in the house isn't wired; the drawers and cupboards in the kitchen are only a façade; even the trees are fake. The town is deserted and Millie begins to wonder if they're dead. They keep hearing a child laughing and begin a search. They're not prepared for what they encounter.—garykmcd / edited by Rob", "Millie and Bob Frazier wake-up dressed with party clothes and with hangover in an unknown and strange bed. They do not know where they are and explore the empty house. The place is weird, with fake furniture and bread. When they leave the house, they find that the neighborhood is empty and is composed with a fake animal, tree and grass. They overhear a child laugh and go to the church that is also empty. When they hear a train, they head to the station, enter the train and see the name of the town, Centerville. They celebrate that they are leaving the nightmare, but they return to Centerville. What is happening to the Fraziers?—Claudio Carvalho, Rio de Janeiro, Brazil", "Young New York married couple Bob and Millie Frazier leave a party after drinking too much. They wake up in Centerville, a small town where no one lives, houses are empty, trees are props, food is plastic, and the only train comes right back to Centerville.—Anonymous"], "genres": "N/A", "imdbID": "0734625", "rating": 8.1, "votes": 2791, "number_of_episodes": 156}