{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0001291": "Rupert Graves", "0835939": "Una Stubbs", "1154764": "Louise Brealey", "0733172": "Vinette Robinson", "0600439": "Tanya Moodie", "1305192": "Siobhan Hewlett", "0557520": "William Scott-Masson", "0927002": "Victoria Wicks", "1746737": "Sean Joseph Young", "3982580": "James Duncan", "2939773": "Ruth Everett", "2906167": "Syrus Lowe", "1395101": "Katy Maw", "1746538": "Ben Rufus Green", "3979139": "Pradeep Jey", "0805509": "Imogen Slaughter", "0625085": "David Nellist", "0106573": "Louise Breckon-Richards", "0034877": "Jonathan Aris", "1933893": "Lisa McAllister", "0870199": "Stanley Townsend", "0111730": "Peter Brooke", "0205289": "Phil Davis", "2506300": "Lasco Atkins", "0250645": "Alison Egan", "0309693": "Mark Gatiss"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["88"],  "plot": ["War vet Dr. John Watson returns to London in need of a place to stay. He meets Sherlock Holmes, a consulting detective, and the two soon find themselves digging into a string of serial \"suicides.\"", "Wounded in Afghanistan while in the Army, Dr. John Watson returns to contemporary London and, through a mutual acquaintance, becomes a flatmate at Mrs. Hudson's 221B Baker Street apartment with brilliant if eccentric private investigator Sherlock Holmes. There have been three identical apparent suicides, and Inspector Lestrade asks for Sherlock's intervention over the fourth, the suspicious death of Jennifer Wilson. As she lay dying she wrote 'Rache' upon the floor and Sherlock deduces that this is not just the incomplete name of her stillborn daughter \"Rachel\" of many years earlier but the password of her mobile phone. This leads Sherlock to confront a terminally ill serial killer who slays people, in part, to show superiority over the rest of society, and who is determined to make Sherlock his next victim.—don @ minifie-1", "John Watson, an army doctor, is wounded in Afghanistan and invalided out of the Army. Back in London his search for a place to stay leads him to share a flat with Sherlock Holmes, a brilliant but eccentric private detective. He has hardly met Holmes when Holmes gets called in by Detective Inspector Lestrade to help on a case. People have been committing suicide in identical fashion - by a poisoned pill. The police are calling it \"serial suicide\" but it is clearly the work of a serial killer.—grantss", "In a modern London re-tooling of the classic Sir Arthur Conan Doyle tales, Dr. John Watson, recently invalided out of the army following service in Afghanistan, agrees to share a flat with a private detective, Sherlock Holmes. Watson is amazed at Holmes' powers of observation as well as his eccentricities. Holmes has occasionally helped the police, mainly through DI Lestrade, whose current case is most baffling: four people, all of whom apparently committed suicide. Several similarities in the cases lead the police to believe there may be another explanation. Holmes agrees to assist, particularly after hearing of a difference at most recent scene, where the victim, a lady dressed in pink, scratched the word RACHE on the floor boards. With Watson providing what proves to be invaluable assistance, the game is afoot.—garykmcd"], "genres": "N/A", "imdbID": "1665071", "rating": 8.9, "votes": 34933, "number_of_episodes": 15}