{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0854364": "Zoe Telford", "1154764": "Louise Brealey", "2110418": "Gemma Chan", "1632403": "Al Weaver", "1584487": "Bertie Carvel", "2126655": "Daniel Percival", "0155733": "Paul Chequer", "1076260": "Howard Coggins", "0010268": "Janice Acquah", "1815278": "Jack Bence", "3025293": "John Macmillan", "1214783": "Olivia Poulet", "0150926": "Jacqueline Chan", "0482685": "Sarah Lam", "0253687": "Gillian Elisa", "1166911": "Stefan Pejic", "1875889": "Philip Starnier", "6858425": "Patrick Bradford", "1637981": "Joanna Burnett", "1527369": "Claire Cage", "0355733": "Joe Hall", "4843026": "Daniel van der Molen"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Mysterious symbols and murders are showing up all over London, leading Sherlock and John to a secret Chinese crime syndicate called Black Lotus.", "Banker Eddie Van Coon and reporter Brian Lukis are both shot dead in identical slayings, in rooms locked from the inside. Chinese museum employee Soo Lin tells Sherlock Holmes that, as a teenaged orphan in China, she ran drugs for the Black Lotus crime syndicate, for whom the two dead men also worked. She too is then murdered, the killer being a human fly who can scale buildings. The gang mistake Watson for Holmes and capture him and his new girl-friend, requiring Holmes to come to the rescue.—don @ minifie-1", "Sherlock Holmes is on the job while people are getting murdered left & right - one in a museum/auction house, one a banker in his home, and another after a long foot chase. What do they have in common? And where did the museum worker disappear to who found the first victim? And who was the man who tried to take Sherlock's head?—Ginger", "As Sherlock and John deal with the challenge of living and working together, a pair of murders in connection to a graffiti cipher is brought to Sherlock's attention. Sherlock and John investigate the cause of the murders and the meaning of the cipher while John attempts to make a good impression on his new co-worker Sarah. But even Sherlock's mental and deductive capacity cannot challenge the odds that he faces.—Consulting Hobbit Extractors", "Sherlock Holmes, assisted by Dr Watson, is hired by a large bank to investigate the vandalism of an artwork on the bank's premises. Someone managed to get into the bank and paint a symbol on the painting. Holmes works out that it was a message, and who the message was for. However, when he finds the person, he is dead, shot. To the police it is suicide, as nobody could have gotten into his apartment, it seems, but Holmes is convinced that he was murdered Just then a journalist turns up murdered in their apartment, and Holmes thinks the two crimes are connected. Through tracking the journalist's movements, Holmes discovers the connection - they both were presented with ancient Chinese symbols, sent as a warning. The key to the case lies with a Chinese woman, working at the museum.—grantss"], "genres": "N/A", "imdbID": "1664529", "rating": 7.9, "votes": 30181, "number_of_episodes": 15}