{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0001291": "Rupert Graves", "0835939": "Una Stubbs", "0854364": "Zoe Telford", "1154764": "Louise Brealey", "0778831": "Andrew Scott", "0733172": "Vinette Robinson", "2765916": "Matthew Needham", "1519710": "Kemal Sylvester", "1258483": "San Shella", "0601105": "Deborah Moore", "3108339": "Lauren Crace", "2860110": "Nicholas Gadd", "0873844": "Caroline Trowbridge", "1510027": "Paul Albertson", "0203935": "Rita Davies", "0098414": "Di Botcher", "0785938": "John Sessions", "0105347": "Stefano Braschi", "2935576": "Jeany Spark", "0513245": "Alison Lintott", "0006522": "Haydn Gwynne", "0020464": "Doug Allen", "2017161": "John Lebar", "0267622": "Lynn Farleigh", "0205749": "Peter Davison", "0309693": "Mark Gatiss"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Mycroft needs Sherlock's help, but a remorseless criminal mastermind puts Sherlock on a distracting crime-solving spree via a series of hostage human bombs through which he speaks.", "Mycroft wants his brother Sherlock to investigate the murder of civil servant Andrew West and theft of the Bruce-Partington missile plans. Sherlock, however, prefers to assist Lestrade following a massive bomb blast. The sadistic bomber abducts a string of hostages, who will be released after Sherlock has solved a series of puzzles, including a twenty year old murder, an insurance scam, and the alleged forgery of a long lost painting.—don @ minifie-1", "Sherlock's brother Mycroft presents him with a case of utmost importance to the country and the government. While proceeding to solve that case, Sherlock encounters difficult distractions from a mysterious villain who abducts people and threatens to kill them unless his demands, which are meant for Sherlock, are met. Dodging these distractions, Sherlock solves the original case but comes face to face with the deadly intelligent villain, Sherlock's archenemy, Professor Moriarty!—Damon191", "Sherlock's boredom ends with a bang, thanks to a bomber targeting the edifice facing 221B Baker Street. Mycroft approaches Sherlock with the death of government employee Andrew West and his missing copy of the Bruce Partington plans, but a soulless criminal mastermind, speaking through a series of human bombs (innocent Londoners wired to explode), distracts Sherlock, sending him, Watson and Lestrade scurrying through the city to solve a 20-year-old masked murder, an insurance fraud business, a celebrity poisoning (murder), and assassinations surrounding a forgery scheme. Someone is playing with Sherlock, and he rightly suspects it to be his brilliant criminal equal, the mysterious, unseen figure known only to him as Moriarty.—statmanjeff", "Sherlock Holmes is bored - there are no intriguing murder cases to solve. Then a nearby flat is blown up and Holmes starts to think something may be afoot. His brother Mycroft visits and tries to get him to solve a suspected murder case involving an MI6 officer and find the top secret missile plans he had. Holmes is not that interested. The bomb case gets more intriguing, and deadly, when Holmes is contacted by a would-be victim of the bomber. Unless Holmes solves a certain case within 12 hours, the bomb attached to the person will be detonated. Time is of the essence.—grantss"], "genres": "N/A", "imdbID": "1664530", "rating": 9.0, "votes": 30771, "number_of_episodes": 15}