{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "0778831": "Andrew Scott", "0869871": "Russell Tovey", "0120111": "Amelia Bullmore", "0544139": "Clive Mantle", "1861862": "Simon Paisley Day", "0066885": "Sasha Behar", "3112470": "Will Sharpe", "1643154": "Stephen Wight", "0448053": "Gordon Kennedy", "0870722": "Kevin Trainor", "0461063": "Rosalind Knight", "4845782": "Sam Jones", "1496158": "Chipo Chung", "5186495": "Simon Blood DeVay"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["88"],  "plot": ["Sherlock and John investigate the ghosts of a young man who has been seeing monstrous hounds out in the woods where his father died.", "Twenty years earlier, aged seven, young Henry Knight saw his father torn to pieces by a monstrous creature at Dewer's Hollow near their Dartmoor home. Now Henry has seen the footprints of a huge beast and suspects that the nearby Baskerville government research station is breeding mutant animals. Sherlock and John travel to the moor where local lad Fletcher organizes tourist walks cashing in on the legend of Dartmoor's spectral hound. Using false I.D. the pair infiltrate Baskerville and are challenged by secretive Major Barrymore but rescued by sympathetic Dr. Frankland, a friend to Henry. After Sherlock himself sees the monstrous creature he enlists the help of geneticist Dr. Stapleton to help him solve the mystery.—don @ minifie-1", "A bored Sherlock decides to take on the case of Henry Knight, who claims to have seen the footprint of a gigantic hound in the woods. He also claims that 20 years before he had seen his father mauled to death by the creature. Holmes assumes that the source of the creature is the nearby Baskerville military research facility. Using his brother Mycroft's identity card, he and Watson gain access to the facility though his ruse is quickly found out. His faith in his abilities is shaken to the core when he too sees the creature, something that genuinely frightens him.—garykmcd", "Sherlock Holmes and Dr Watson head down to Dartmoor to investigate the case of a young man who is convinced that his father was killed 20 years earlier by a giant, red-eyed hound. Furthermore, he has recently been confronted by the animal himself. Holmes is skeptical - the description given is not possible - but investigates anyway. Prime suspect - the local Army base, where scientists are performing genetic experiments on animals.—grantss"], "genres": "N/A", "imdbID": "1942613", "rating": 8.3, "votes": 28932, "number_of_episodes": 15}