{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "0778831": "Andrew Scott", "1154764": "Louise Brealey", "0916073": "Danny Webb", "0369854": "Andrew Havill", "0101668": "Todd Boyce", "2772105": "Oona Chaplin", "3355471": "Richard Cunningham", "0809818": "Rosemary Smith", "1206096": "Simon Thorp", "1490222": "Anthony Cozens", "2054580": "Munir Khairdin", "1605024": "Nathan Harmer", "0627639": "Luke Newberry", "4835642": "Darrell Las Quevas", "1310137": "Rosalind Halstead", "0670092": "Peter Pedrero", "4835867": "Honor Kneafsey", "4836358": "Ilana Kneafsey", "4040010": "Thomasin Rand", "3091498": "Lara Pulver", "4924191": "Greg Bennett", "5186495": "Simon Blood DeVay", "2641627": "Amber Elizabeth", "1933893": "Lisa McAllister", "4623778": "Lucy Page"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Sherlock must confiscate something of importance from a mysterious woman named Irene Adler.", "Following a bizarre stand-off with master criminal Moriarty, ended when the villain responds to a phone call, Sherlock interrupts his investigation of a rural slaying when summoned to Buckingham Palace. Dominatrix Irene Adler has incriminating photos of a royal princess which Sherlock is engaged to retrieve; however, having engineered a meeting with Irene, Sherlock realizes that she has far more dangerous evidence in her possession, sought by rogue CIA agents, which causes her to fake her death and pass the facts, encrypted in her camera phone, to Sherlock. Having deciphered the explosive result and discovered a government plot, Sherlock has to consider if Irene can be trusted and indeed if she is in league with Moriarty.—don @ minifie-1", "Sherlock Holmes and his Internet-blogging friend Dr. John Watson are summoned to Buckingham Palace to deal with a matter of national importance. Sherlock's brother, Mycroft Holmes, tells them that dominatrix Irene Adler has been in touch with Palace officials to tell them she has in her possession embarrassing photos of one of the younger royals, a regular client. She hasn't asked for money and there has been no suggestion from her that she is blackmailing anyone. Holmes meets her and is fascinated by her intellect and boldness. She's obviously in trouble however and clearly has something that a CIA black ops team is out to retrieve.—garykmcd", "Sherlock Holmes and John Watson are visited by some no-nonsense types who whisk them away to Buckingham Palace. There they are met by Mycroft Holmes and a representative of a royal person, though which one is not disclosed. A dominatrix, Irene Adler, has compromising photographs of important government officials, stored in a camera phone, and the palace wants Holmes to track down the phone and secure it. Holmes takes the case, but, in dealing with Ms Adler, he starts to show signs of deeper feelings for her.—grantss"], "genres": "N/A", "imdbID": "1942612", "rating": 9.4, "votes": 43134, "number_of_episodes": 15}