{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "0778831": "Andrew Scott", "1154764": "Louise Brealey", "1817670": "Katherine Parkinson", "0733172": "Vinette Robinson", "0034877": "Jonathan Aris", "0600439": "Tanya Moodie", "0686029": "Tony Pitts", "0341694": "Jaye Griffiths", "1675071": "Ian Hallard", "0719690": "Malcolm Rennie", "3041653": "Sydney Wade", "4106075": "Edward Holtom", "0502734": "Paul Leonard", "0402757": "Christopher Hunter", "0915453": "Tony Way", "0385284": "Lorraine Hilton", "4856774": "Samantha-Holly Bennett", "3462529": "Peter Basham", "4857769": "Rebecca Noble", "3146758": "Robert Benfield", "0196704": "Ifan Huw Dafydd", "0612201": "Michael Müller", "1922807": "Pano Masti", "0932811": "Douglas Wilmer", "5148257": "Michael Austin", "3807607": "William Charles", "5126642": "Jason Crane", "4856225": "Stuart Mulcaster", "6593714": "Matthew Rohman", "4174443": "Gillian Steventon", "3825451": "Sy Turner", "2711324": "Chris Wilson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["88"],  "plot": ["Jim Moriarty hatches a mad scheme to turn the whole city against Sherlock.", "Moriarty comes close to stealing the Crown Jewels to prove it might be done but allows himself to be caught. Sherlock gives evidence at the trial where Moriarty has scared the jury into acquitting him and later visits Sherlock, camply taunting him with his superior computer skills, seemingly capable of any crime. Sherlock rescues two children abducted by his enemy, but his brilliantly accurate deductions, leading police to believe he may have been an accomplice in the kidnapping, get him arrested, going on the run with John. After a further encounter with Moriarty, who has persuaded a journalist to publish that he is an innocent actor paid by Sherlock to masquerade as his enemy for Sherlock's own glory, the two meet atop a very high building.—don @ minifie-1", "Sherlock has developed something of a public profile having successfully recovered two kidnapped children. A tabloid journalist is after him and makes it quite plain that she can either be a friend or a foe. Sherlock soon realizes that he is up against his old foe, the master criminal Moriarty, who assists others in the criminal underworld in planning their crimes. Moriarty soon has him in the frame, with the police believing not only that Moriarty is a figment of Sherlock's imagination but that it's Holmes who is the real criminal mastermind. With Moriarty having turned his world inside out, Holmes decides that there is only one course of action left open to him.—garykmcd", "Sherlock Holmes' nemesis, Jim Moriarty, is in the news again. He has just managed to access the Crown Jewels, stored in the Tower of London, open the vault of the Bank of England and open a prison, simultaneously. He is arrested, wearing the Crown Jewels, and doesn't managed to achieve anything financially from the endeavors but the feats are very impressive and represent a boast. Holmes testifies against him at his trial but Moriarty is acquitted. What follows is an intense cat-and-mouse game, with Moriarty setting out to smear Holmes' name, making him out to be a fake and all his solved cases elaborate schemes. With the weight of evidence against him, Holmes appears to be backed into a corner.—grantss"], "genres": "N/A", "imdbID": "1942614", "rating": 9.6, "votes": 42277, "number_of_episodes": 15}