{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "1154764": "Louise Brealey", "0007893": "Amanda Abbington", "0733172": "Vinette Robinson", "3091498": "Lara Pulver", "0677944": "Alistair Petrie", "1546686": "Alice Lowe", "2055297": "Yasmine Akram", "1051081": "Oliver Lansley", "4963600": "Ed Birch", "0366839": "Jalaal Hartley", "6026206": "Adam Greaves-Neal", "3961632": "Helen Bradbury", "0257917": "Alfred Enoch", "1268000": "Tim Chipping", "0444617": "Will Keen", "5709125": "Ritu Arya", "1873687": "Georgina Rich", "0913622": "Wendy Wason", "0154708": "Debbie Chazen", "1477786": "Nicholas Asbury", "4797671": "Jozef Aoki", "6120486": "Laura Dale", "6238406": "Alexandra Doyle", "5243496": "Lisa Jay Jenkins", "5120143": "Georgie Leonard", "5270502": "Barrie Martin", "4605797": "Adam Prickett", "6680316": "Clem So", "6087718": "Lucy Trotman"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["86"],  "plot": ["Sherlock tries to give the perfect best man speech at John's wedding when he suddenly realizes a murder is about to take place.", "As Lestrade fumes over his constant inability to convict the Waters gang of bank robbers, Holmes prepares for his role as best man at Mary and John's wedding. His speech, initially bizarre, turns out to be a moving tribute to his friend whilst he also contributes two anecdotes of recent cases, both unsolved. The first concerns a young guardsman whose life John saved after he was the victim of a 'locked room' attempted murder. The second involves a man who uses the identities of the recently deceased to date different women. As he looks around the wedding party, Holmes suddenly realizes their connected solutions, which also involve Watson's former commanding officer, disfigured war hero Major Sholto.—don @ minifie-1", "Sherlock is about to face one of the greatest challenges of his life: giving a speech as best man at John's wedding. On the big day, he starts off somewhat rambling but in the end delivers a charming and warm oration on his good friend John and his new bride Mary. He also recounts two cases, still unsolved, from John's blog. The first deals with a Guardsman who, soon after being relieved from guard duty, is found stabbed and dying inside a locked shower stall. The second involves a young woman who wants Sherlock to locate a man she had recently met and who then disappeared. As he recounts these tales Sherlock realizes they are linked by a common thread and also to John and Mary's wedding - where one of the guests is going to be murdered.—garykmcd", "It is John Watson and Mary's wedding day. Holmes is the best man and has laboured over his speech, plus micromanaging the reception. While giving his speech he recounts how Watson invited him to be best man, the wedding plans and recent cases of theirs. One of the cases involved a member of the Household Guards who believed he was being stalked, and then was found stabbed in the shower, with no weapon in sight. Another case seemed bizarre - a woman who believed she had had a relationship with a ghost.—grantss"], "genres": "N/A", "imdbID": "2781042", "rating": 8.9, "votes": 29864, "number_of_episodes": 15}