{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "0778831": "Andrew Scott", "1154764": "Louise Brealey", "0007893": "Amanda Abbington", "0034877": "Jonathan Aris", "0242026": "Lindsay Duncan", "2055297": "Yasmine Akram", "1623508": "Tom Brooke", "0893243": "Wanda Ventham", "0138232": "Timothy Carlton", "4694127": "Calvin Demba", "0909095": "Tim Wallers", "1246347": "Glen Davies", "0954851": "Brigid Zengeni", "1702004": "Matthew Wilson", "6217433": "Louis Oliver", "6209004": "David Newman", "0475336": "Simon Kunz", "1925253": "Katherine Jakeways", "1527225": "Will Ashcroft", "1885841": "Ged Forrest", "1042852": "Jamie Jarvis", "0586565": "Lars Mikkelsen", "2746781": "Alan Bond", "8002253": "Tim Howard", "2259143": "Tom So", "2225159": "Tom Whitecross"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Sherlock goes up against Charles Augustus Magnussen, media tycoon and a notorious blackmailer.", "Lady Elizabeth Smallwood is one of many victims of master blackmailer and media tycoon Charles Augustus Magnussen and asks Holmes to retrieve some incriminating letters for her. Having cultivated Magnussen's secretary Janine, Holmes breaks into Magnussen's office but is confronted by a mysterious black-clad woman, who shoots him. He recovers in hospital and goes after her to discover her identity and reason for wanting the blackmailer dead before he and Watson visit Magnussen at his country house for a confrontation and shoot-out.—don @ minifie-1", "Watson isn't quite sure what surprises him most: finding Sherlock in a crack-house while looking for his neighbor's son or leaning that his good friend is in a relationship with Janine, whom he met at Watson's wedding. Sherlock is far more interested however in talking about his latest case: Charles Augustus Magnussen, whom he describes as the Napoleon of blackmail. Acting on behalf of Lady Elizabeth Smallwood, he wishes to retrieve from Magnussen 30-year-old love letters her husband wrote (before their marriage) to his lover - a girl only 15-years-old at the time. Sherlock finds a way into Magnussen's office (which explains his relationship with Magnussen's secretary Janine) but is shot by a black-clad, gun-wielding woman intent on killing Magnussen.—garykmcd", "Sherlock has been hired by Lady Smallwood to intercede on her behalf with Charles Magnussen. Magnussen is an extremely powerful media magnate, manipulating people through blackmail - he has a vault of data on just about everybody, their secrets and pressure points. Magnussen is blackmailing Lady Smallwood and when initial negotiations fail, Sherlock and Watson break into his highly-secure office. Unfortunately, there's a nasty surprise waiting for Sherlock in Magnussen's office, a surprise he may not survive. And the culprit is someone unexpected and close to home.—grantss"], "genres": "N/A", "imdbID": "2781046", "rating": 9.2, "votes": 32954, "number_of_episodes": 15}