{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "0778831": "Andrew Scott", "1154764": "Louise Brealey", "0007893": "Amanda Abbington", "0034877": "Jonathan Aris", "2411784": "David Fynn", "5287110": "Sharon Rooney", "3314507": "Tomi May", "0912012": "Rick Warden", "4980372": "Trixiebell Harrowell", "1682272": "Lace Akpojaro", "2991307": "Jim Conway", "0038018": "Nicole Arumugam", "0304564": "David Gant", "0780969": "Robin Sebastian", "4963600": "Ed Birch", "1933893": "Lisa McAllister", "1494925": "Derren Brown", "2506300": "Lasco Atkins", "0138232": "Timothy Carlton", "5840880": "Elizabeth Coyle", "5885345": "Paul Dawkins", "6256815": "Ollie Douglas", "5231010": "Hugh Holman", "7467310": "Georgina Howard", "0586565": "Lars Mikkelsen", "4605797": "Adam Prickett", "4174443": "Gillian Steventon", "2991424": "Susannah Todd", "0893243": "Wanda Ventham", "2339366": "Paul Warren"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["88"],  "plot": ["Mycroft calls Sherlock back to London to investigate an underground terrorist organization.", "Two years after the devastating effects of The Reichenbach Fall, Dr John Watson has got on with his life. New horizons, romance and a comforting domestic future beckon; but, with London under threat of a huge terrorist attack, Sherlock Holmes is about to rise from the grave with all the theatricality that comes so naturally to him. It's what his best friend wanted more than anything, but for John Watson it might well be a case of 'be careful what you wish for'. If Sherlock thinks everything can be just as he left it though, he's in for a very big surprise.—BBC", "Two years have passed since Sherlock faked his death and left the public eye. Rescued by Mycroft during undercover work in Serbia, he is told a terrorist cell is about to launch an attack on London. Sherlock returns to the capital and, disguised as a waiter, surprises Watson just as he's about to propose to his new-found sweet-heart, Mary. The shallowness of Sherlock's re-introduction does not go down well with John, replacing his profound sense of loss with rage. As the media revels in Sherlock's return, Howard Silcott of the rapid transit system presents him a CCTV video of a man entering a tube train and seemingly never coming out again. Following a bonfire where a kidnapped Watson finds himself nearly burned but rescued by Sherlock and Mary, the two colleagues once again unite. Together they deduce that the terrorists intend to place a subway train in a disused station below parliament and blow it up.—don @ minifie-1 / edited by statmanejeff", "After a two year absence, Sherlock returns to London at his brother Mycroft's request. There has been much speculation since his \"death\" with many having always believed he was alive and well. While many rejoice, one who doesn't take his return well is John Watson who, after grieving the loss of his friend, moved on with his life both professionally and personally. He's upset that his friend didn't trust him enough to tell him just what he was doing. He's also engaged to Mary Morstan. While he tries to get his old friend onside, Sherlock also has to deal with the main reason Mycroft wanted him back: they have credible evidence that there is to be a major terrorist attack in London.—garykmcd"], "genres": "N/A", "imdbID": "2189771", "rating": 8.8, "votes": 32783, "number_of_episodes": 15}