{"cast": {"1212722": "Benedict Cumberbatch", "0293509": "Martin Freeman", "0835939": "Una Stubbs", "0001291": "Rupert Graves", "0309693": "Mark Gatiss", "0778831": "Andrew Scott", "1154764": "Louise Brealey", "0007893": "Amanda Abbington", "0034877": "Jonathan Aris", "2055297": "Yasmine Akram", "0625085": "David Nellist", "0001517": "Catherine McCormack", "0570570": "Tim McInnerny", "3761798": "Natasha O'Keeffe", "0055291": "Tim Barlow", "0477324": "Gerald Kyd", "2082147": "Daniel Fearn", "6599447": "Stephanie Hyam", "1484256": "Damian Samuels", "4816118": "Charles Furness", "6026206": "Adam Greaves-Neal", "0840391": "Richard Sutton", "0189603": "Ben Crowe", "5120337": "James T. Bowman", "5328810": "Antonio Bustorff", "6873929": "Nik Davies", "11085274": "Nathan Dubois", "5564446": "Anthony Farrelly", "6818702": "Gavin Lee Lewis", "3091498": "Lara Pulver", "7149146": "Sophie Slavin", "6680316": "Clem So"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Sherlock Holmes and Dr. Watson find themselves in 1890s London in this Christmas special.", "Imagining himself back in the 1890s, Sherlock is visited by Inspector Lestrade after newlywed Emelia Ricoletti, having apparently killed herself in public, murders her husband Thomas in front of witnesses before vanishing. Some months later Holmes is approached by Lady Carmichael, who tells him that her husband Sir Eustace has been threatened by Emelia, who then seemingly does away with him. With an intrusive Moriarty crossing him, Holmes attempts to solve the enigma, with unexpected help from Watson's wife Mary and evidence of a conspiracy involving half the population of the country.—don @ minifie-1", "Like any Sherlock story, there is an actual case that the detective and his partner are tasked with investigating. This time around, the case is the Abominable Bride, and follows the peculiar, seemingly supernatural event that occurs after a bride rises from the dead following her public suicide and murders her husband. And it is basically set in 1890s London.", "Imagining himself back in 1890s London, Sherlock investigates the unsolved case of an abominable bride: newlywed Emilia Ricoletti goes mad and publicly shoots herself dead before returning as a vengeful ghost to strike down her husband Thomas. Thus begins a string of murders credited to a wedding-gowned ghost preying upon brutal, wayward or neglectful husbands. Sherlock doesn't believe in ghosts and, in seeking out an enemy to whom Mycroft warns he must lose, confronts an old \"ghost\" adversary of his own.—statmanjeff", "In a Sherlock Holmes mind trip he is taken back to the 1890s. In a setting very much like that Sir Arthur Conan Doyle would have envisaged, Holmes is a private detective, operating out of 221B Baker Street. Assisting him is Dr Watson. They are presented with a very baffling case. A woman, Emelia Ricoletti, publicly shoots and kills herself, only to appear a few hours later and kill her husband. Within the next few months other murders are committed by woman appearing to be Mrs Ricoletti. Even the police are thinking that paranormal activity is afoot. Then Sir Eustace Carmichael is threatened by such an apparition and his wife calls in Holmes and Watson.—grantss"], "genres": "N/A", "imdbID": "3845232", "rating": 8.0, "votes": 36848, "number_of_episodes": 15}