{"cast": {"0000685": "Jon Voight", "0005460": "Mary Steenburgen", "0000719": "F. Murray Abraham", "0001406": "Carol Kane", "0063303": "Mark Bazeley", "0129160": "Jonathan Cake", "0219206": "Alexis Denisof", "0607865": "Emily Mortimer", "0688624": "Sydney Tamiia Poitier", "0907427": "Sonya Walger", "0000336": "James Coburn", "0681041": "Max Phipps", "0816877": "Joseph Spano", "0635909": "Terry Norris", "0081815": "Jonathan Biggins", "0792224": "Michael Sheridan", "0261404": "Robert Essex", "0078329": "Paul Bertram", "0822496": "Howard Stanley", "0206458": "Julie Day", "0560862": "Monica Maughan", "0330139": "Deni Gordon", "0469852": "Evelyn Krape", "0200839": "Daniel Daperis", "0206672": "William Dayble", "0256736": "Jonathan Encavey", "0549445": "Dino Marnika", "0743615": "Linda O'Grady", "0084664": "Clarence Biyan", "0641768": "Michael O'Malley", "11835838": "Mary Habib", "10936244": "Lesley-Caron Veater"}, "geners": ["Adventure", "Drama", "Romance"], "runtimes": ["84"],  "plot": ["Oscar-winner Jon Voight stars as Noah in a lavish four-hour miniseries about the Biblical hero who built the ark. On Mount Topek, God warns Noah to take his family and leave the city of Sodom and Gomorrah. Noah tries to warn the people, but only his best friend, Lot, takes his advice and escapes. Lot's wife is not so lucky as she is turned into a pillar of salt when she looks behind her upon fleeing the city. However, Lot eventually gets involved with a gang of thieves and becomes a sinner. Years later, God instructs Noah and his three sons, Japheth, Shem and Ham, to build a huge boat that's large enough to hold two of every animal. God is planning to destroy the world and make a fresh start with Noah's family and divinely-selected animals. With God's help, the ark is completed overnight. One of the villagers, Jezer, leads a mob against Noah so they can burn the ark. Suddenly, the rain begins to fall and Noah quickly makes sure that all of the animals are in place on the ark. Carrying Noah, Naamah, their three sons and their son's girlfriends, Ruth, Esther and Miriam, the ark floats across miles of water as it rains. When the rains cease and the sun comes up, the crew of a pirate ships led by Lot, attacks the ark. The animals join in the fight against the pirates and God destroys it, informing Noah that they are now the only people left on earth. Noah and his family try to fend for themselves and search for dry land without God's divine intervention. Noah eventually cries out for God and in response, the ark sails into a rainbow. They come upon a forest, atop Mount Ararat, where there aren't any sounds, birds, beasts or insects. As the animals disembark from the boat, Noah and Naamah say goodbye to them. In his role as captain of the ship, Noah performs a wedding ceremony for his sons and their girlfriends. Civilization has now earned a second chance as both man and beast are ready to begin anew."], "genres": "N/A", "imdbID": "5819858", "rating": 3.9, "votes": 26, "number_of_episodes": 2}