{"cast": {"0808917": "Kellita Smith", "0702809": "DJ Qualls", "0919616": "Michael Welch", "0019969": "Keith Allan", "1325199": "Anastasia Baranova", "1428690": "Russell Hodgkinson", "2061381": "Pisay Pao", "6688785": "Nat Zang", "0779866": "Tom Everett Scott", "0674782": "Harold Perrineau", "3244135": "Scott Roddan", "3177324": "Lisa Coronado", "1078521": "Lowell Deo", "3900553": "Phil Andrade", "6773617": "Jacqueline S. Davis", "2217184": "Ben Andrews", "3562675": "Sali Sayler", "6773618": "Dougie Dawson", "3328036": "Mark Carr", "1930884": "James A. Smith", "0382702": "Art Hickman", "6143266": "John B Daniels", "4757641": "Keith Cox", "6420602": "Daniel Locicero", "7606476": "Lucas Rick O'Brien", "7304557": "Brian Richardson"}, "geners": ["Action", "Comedy", "Drama", "Horror", "Romance", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Three years into the zombie apocalypse, Lt. Hammond assembles a team of everyday heroes to transport the only known survivor of the zombie virus from New York to California in hopes of using his blood for a vaccine.", "A ragtag team come together to transport the only known survivor of a zombie virus across post-apocalyptic America to a lab that's waiting for his blood in the premiere of this drama. However, what they don't know is that their last, best hope for a vaccine is hiding a dark secret that threatens them all.—Jiilo_Kim", "After a Zombie Apocalypse, the United States is in chaos without president and chain of command. In the upstate New York, Lieutenant Mark Hammond has lost his Delta Force men, but is still trying to transport to California a man that was bitten by a zombie but has survived. This man may be the last chance to produce a vaccine. He meets a group of survivors from National Guard and together they collect other survivors and reach an outpost that has been completely destroyed. They find a baby but soon there is a zombie attack and he turns into a zombie. Now Hammond has to kill the baby.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "3998408", "rating": 6.5, "votes": 1562, "number_of_episodes": 68}