{"cast": {"0808917": "Kellita Smith", "0702809": "DJ Qualls", "0919616": "Michael Welch", "0019969": "Keith Allan", "1325199": "Anastasia Baranova", "1428690": "Russell Hodgkinson", "2061381": "Pisay Pao", "6688785": "Nat Zang", "0000534": "Kelly McGillis", "5281091": "Brad Picard", "5677379": "Sara Coates", "6881142": "Riley Neldam", "5846570": "Logan Binstock", "5119729": "Eden Campbell", "6558805": "Jacob Goudzwaard", "4554071": "Lj Klink", "1130669": "Delanna Studi", "6937462": "Kimberly Nesper", "6938478": "Kaleigh Hopkins", "13824793": "Bazzy Huffmanparent"}, "geners": ["Action", "Comedy", "Drama", "Horror", "Romance", "Sci-Fi"], "runtimes": ["43"],  "plot": ["An all-female commune in Utah is where the two groups of survivors find each other, but when one of them is shot, the idea of Utopia is destroyed.", "As the group gets closer to California, a leg injury causes an abrupt stop. A group of all women takes them in, except the men must stay outside. Soon Addy is under the spell of these men killing people and the group must decide whether to leave her or save her.", "While driving through Utah, the survivors see a thirteen year-old boy called Sam walking on the road. Warren talks to him and he explains that he is heading to Salt Lake City to see his father. Warren asks where she could get water and food and the boy takes them to a Utopic community of women called \"Sisters of Mercy\" and commanded by Helen. They take care of Cassandra, who is wounded on the leg, Warren and Addy, but the men must wait outside the gate. Warren and Cassandra discover that something is wrong since there are no men in the place but Addy adores the place and identifies Helen as her missing mother and decides to stay. However Mack does not accept her decision and tries to convince Addy to follow with the group. What will happen to Mack and Addy?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "3973844", "rating": 7.2, "votes": 874, "number_of_episodes": 68}