{"cast": {"0808917": "Kellita Smith", "0019969": "Keith Allan", "1325199": "Anastasia Baranova", "1428690": "Russell Hodgkinson", "6688785": "Nat Zang", "0004817": "Matt Cedeño", "0000153": "Gina Gershon", "0729256": "Emilio Rivera", "1706003": "Donald Corren", "7834581": "Luis Arambul", "0107808": "Carl Bressler", "5992210": "Nidhi Ghildayal", "8369559": "Sheila Houlahan", "3235296": "Rosalie Miller", "5472151": "Casey Reynolds", "5395719": "Caroline Slater", "2134362": "Peter 'Drago' Tiemann", "4967697": "Matt Clark", "0871568": "Patrick Treadway"}, "geners": ["Action", "Comedy", "Drama", "Horror", "Romance", "Sci-Fi"], "runtimes": ["43"],  "plot": ["The team meets La Reina, Queen of the Zeros, after being captured.", "Our Heroes are captured by the Zeros and taken to the Zero compound. There they are introduced to the Queen of the Zeros, \"La Reina.\" She tells them she is paving the way for a bold new future and instituting her own form of democracy via the Zeros. Impressed with our Heroes, La Reina invites them to join her team. Dr. Kurian is also at the Zero compound where he's been refining his Z-Vaccine and is finally ready for human trials. The first dose seems like a success and all the Zeros line up for their turn. Meanwhile Vasquez decides there's no time like the present to exact his revenge on Escorpion.", "Warren and the survivors reach the border of Mexico and are under siege of zombies and without ammunition. However they are saved by Escórpion and the Zeros and they meet La Reina, the Queen of the Zeros. She is interested in Murphy and the survivors team-up with the Zeros since it is impossible to escape from them. La Reina wants Murphy's blood to find the vaccine for the cure that Dr. Kurian is researching. Vasquez recognizes Escórpion as the man who killed his family and tries to kill him. However, Warren stops Vasquez and he is captured and offered to Dr. Kurian as guinea pig. What will happen to Vasquez?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4971222", "rating": 7.4, "votes": 640, "number_of_episodes": 68}