{"cast": {"0808917": "Kellita Smith", "0702809": "DJ Qualls", "0019969": "Keith Allan", "1325199": "Anastasia Baranova", "1428690": "Russell Hodgkinson", "6688785": "Nat Zang", "0004817": "Matt Cedeño", "0729256": "Emilio Rivera", "0000153": "Gina Gershon", "1706003": "Donald Corren", "0846834": "Jayne Taini", "3177324": "Lisa Coronado", "1160315": "Robert Shampain", "2310612": "Drew Barrios", "0667315": "John Paulsen", "0619873": "Henry Noble", "7804278": "Cora M. Abdallah", "5992210": "Nidhi Ghildayal", "6646364": "Elizabeth Rhoades"}, "geners": ["Action", "Comedy", "Drama", "Horror", "Romance", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Los Angeles! Our Heroes drive through the abandoned city on their way to the coordinates of the mobile CDC lab given to them by Citizen Z. They head up towards Malibu where they discover the CDC lab isn't just a lab...it's a submarine! Dr. Merch welcomes our Heroes aboard and not a moment too soon as the Zeros show up hot on their heels. It's a bittersweet moment as Murphy says goodbye to the rest of our Heroes. As they leave Murphy and the fate of humanity with Dr. Merch, one question lingers; is this really the end of our grand adventure?", "Warren and the survivors reach the location of the CDC and she goes with Vasquez to the restaurant in the spot and Warren talks to the owner Auntie. They call the rest of the team but a group of bounty hunters bring a false Murphy to the place. When they discover the real Murphy, there is a shootout and 10K is seriously wounded in the stomach. Auntie summons the CDC and they arrive in a submarine and take Murphy and 10K with them. Soon Warren, Doc, Vasquez, Addy and Auntie are under siege of La Reina and the Zeros in the restaurant. Meanwhile Murphy finds that the crew and guards have glowing eyes and they live actually in a zombie-free island called Zona and they want his blood to make vaccine for them only. What will happen to Murphy and the survivors?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "5053180", "rating": 8.0, "votes": 674, "number_of_episodes": 68}