{"cast": {"0808917": "Kellita Smith", "0019969": "Keith Allan", "1325199": "Anastasia Baranova", "1428690": "Russell Hodgkinson", "6688785": "Nat Zang", "0004817": "Matt Cedeño", "0729256": "Emilio Rivera", "0000153": "Gina Gershon", "1706003": "Donald Corren", "5395719": "Caroline Slater", "3235296": "Rosalie Miller", "5992210": "Nidhi Ghildayal", "0107808": "Carl Bressler", "7834581": "Luis Arambul", "8369559": "Sheila Houlahan", "4967697": "Matt Clark"}, "geners": ["Action", "Comedy", "Drama", "Horror", "Romance", "Sci-Fi"], "runtimes": ["43"],  "plot": ["All hell breaks loose when it's discovered that Dr. Kurian's Z-Vaccine doesn't work at all! Instead of building an immunity to the Zombie Virus, the bad vaccine actually makes anyone inoculated susceptible to Murphy's unique brand of mind manipulation. Vasquez gets caught in his plot to kill Escorpion and is sentenced to death by La Reina. Murphy uses mental manipulation to position Warren as La Reina's new second in command. Warren frees Vasquez just in time to watch everyone who was inoculated succumb to a bizarre new form of the Zombie Virus.", "Dr. Kurian is ready to test his vaccine in Murphy, but Warren convinces La Reina that the doctor should be the first to be injected with the vaccine. Then his hand is bitten by a beheaded zombie in a box and he does not turn into a zombie. La Reina and the Zeros believe that Dr. Kurian has find the cure and use the vaccine, but Murphy does not inject the vaccine in Warren. Soon she learns that the vaccine was prepared by Dr. Kurian to turn people into half-zombies to be controlled by Murphy. Meanwhile Escórpion tortures Vasques to know his intention of killing La Reina. When he learns the truth, he lies to La Reina about the intention of Warren and her friends. But Murphy controls her mind and Escórpion is arrested by the Zeros. But Dr. Kurian has a hidden agenda.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4971230", "rating": 7.6, "votes": 617, "number_of_episodes": 68}