{"cast": {"0808917": "Kellita Smith", "0702809": "DJ Qualls", "0919616": "Michael Welch", "0019969": "Keith Allan", "1325199": "Anastasia Baranova", "1428690": "Russell Hodgkinson", "2061381": "Pisay Pao", "6688785": "Nat Zang", "0004817": "Matt Cedeño", "5677379": "Sara Coates", "1706003": "Donald Corren", "6558805": "Jacob Goudzwaard", "3832591": "Daniel Brockley", "2103437": "Michelle Hippe", "4019525": "Sarah-Eve Gazitt", "0354481": "Stefan Hayek", "4757641": "Keith Cox", "2788826": "Stephanie Kukuruza", "2317701": "Alex Terzieff", "3613254": "Michelle Damis", "10522039": "Wizard", "13824793": "Bazzy Huffmanparent"}, "geners": ["Action", "Comedy", "Drama", "Horror", "Romance", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Season 2 picks up where Season 1 left off, moments after the launch of the tactical nuclear weapons triggered by Murphy. It's every man for him/herself. Our Heroes split up as they try to outrun the impending blast. Citizen Z finds himself battling thawed zombies and unable to communicate with the team. In a desperate attempt to help them out on their quest to get to California and the CDC, Citizen Z issues an on air bounty for Murphy. Suddenly everyone wants a piece of the Murphy, including a mysterious and deadly bounty hunter, Vasquez.", "In the aftermath of the Nukes, Citizen Z issues a bounty for Murphy's safe delivery to CA, while battling thawed zombies. The group reunites and try to track down and capture Murphy. But things get more dangerous with the arrival of a dangerous bounty hunter.—cyberboy1127-249-955930", "Murphy activates the nuclear weapons attack, and Warren, Doc and 10k survive in a tunnel. Meanwhile Citizen Z destroys zombies from a military plane that crashed near Northern Lights and then he broadcasts a message promising a large bounty the delivery of Murphy to the CDC. Mack meets Addy and she tells that Sam has burned the camp to the ground and released the zombie bear, destroying the compound and killing the Sisters of Mercy. They travel together expecting to find the rest of the group. Murphy changes his skin and when he is captured by a bounty hunter, Cassandra, who is half human half zombie, saves him. Warren leaves Doc with 10k to seek water and supplies. She decides to suicide, but she sees a girl attacked by zombies and saves her. In return, her family feeds her and provides supplies for her friends. When she returns, she meets also Addy and Mack with Doc and 10k. The group seeks out Murphy in a nightclub, but they also stumble with a bounty hunter. Who will catch Murphy?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4216868", "rating": 7.6, "votes": 883, "number_of_episodes": 68}