{"cast": {"0244630": "Eliza Dushku", "0302108": "Zach Galifianakis", "0714188": "Shawn Reaves", "0000594": "Jason Priestley", "0807767": "Cotter Smith", "0890808": "Liz Vassey", "0647638": "Eric Christian Olsen", "0135221": "Lizzy Caplan", "0791487": "Parry Shen", "0121805": "Michael Reilly Burke", "0187356": "Sue Cremin", "1070898": "Maria Marlow", "0174810": "Chantal Conlin", "0391738": "Adrian Holmes", "1752175": "Terry-Dayne Marshall", "1740381": "Nicole Muñoz", "1546587": "Debbie Brown", "0254379": "Beverley Elliott"}, "geners": ["Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": 0,  "plot": ["It's Christmas Eve and a woman who's been dead for months asks Tru for help at the university. Since the woman can't be saved from death, Jack and Tru forget their rivalry and collaborate to find out what she wants from her.", "On Christmas Eve, Richard refuses son Harry a pay-rise which 'would look like favoritism'. The only corpse in Davis' morgue is a Santa died of natural causes, actually the one who fails to turns up at his traitorous lover Carrie's kids center's party, so he promises to fill in, albeit with weird presents. Tru's day reverts unexpectedly by a call for help from a six months old donated corps in her Hudson University med school while she's with Jensen Ritchie. Meanwhile Harrison stands Tru up for their Christmas party after checking up on dad, whom he suspects of infidelity to his second wife Jordan, but surprises in his supposed love-nest meeting with Jack- dad nearly strangles the embarrassing witness. As the college website won't identify the corps, Tru turns to Jack, who remembers her last sight: a car crash scene, where flowers were laid, paid for by Anne Moore; indeed she lost six months ago her sister Allison and takes care of her teenage daughter Cambria. The unnatural allies realize without an actual death, the cry for help must be for a murder attempt on Russell Marks, Allison's colleague and adulterous lover, perhaps by Anne...—KGF Vissers"], "genres": "N/A", "imdbID": "0733914", "rating": 8.1, "votes": 300, "number_of_episodes": 27}