{"cast": {"0000507": "Rob Lowe", "0384211": "Dulé Hill", "0005049": "Allison Janney", "0597223": "Janel Moloney", "0771493": "Richard Schiff", "0817983": "John Spencer", "0925966": "Bradley Whitford", "0000640": "Martin Sheen", "0124079": "Timothy Busfield", "0698346": "Emily Procter", "0493738": "Evgeniy Lazarev", "0823563": "Mike Starr", "0732947": "NiCole Robinson", "0442120": "David Kaufman", "0849689": "Richard Tanner", "0922359": "Tegan West", "0826745": "Brian Stepanek", "0928657": "Wayne Wilderson", "0661490": "Devika Parikh", "0280330": "Melissa Fitzgerald", "1851076": "Sima Kostov", "0614449": "Kris Murphy", "0634377": "Charles Noland", "0877377": "Amy Turner"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["The administration considers recalling Congress to pass a nuclear test ban treaty; a Ukranian politician arrives unannounced at the White House; Sam reluctantly asks Ainsley to summarize a position paper; C.J.'s personal and professional relationship with Danny becomes more complex.", "The administration considers recalling Congress to pass a nuclear test ban treaty; a Ukrainian politician arrives unannounced at the White House; Sam reluctantly asks Ainsley to summarize a position paper; C.J.'s personal and professional relationship with Danny becomes more complex.—Anonymous", "The administration is concerned that the newly elected Congress will be less likely to pass the nuclear test ban treaty, and so considers recalling the outgoing Congress to push it through. A Ukrainian reformist politician breaches diplomatic protocol by arriving at the White House and demanding to meet with the President. Sam continues to underestimate Ainsley when he asks her to summarize a position paper on small business hiring practices. C.J.'s personal and professional relationship with Danny becomes more complex as she needs him to leak a story but also wants to punish his newspaper for their unflattering recent coverage.—Murray Chapman"], "genres": "N/A", "imdbID": "0745697", "rating": 7.6, "votes": 1063, "number_of_episodes": 155}