{"cast": {"0000507": "Rob Lowe", "0000330": "Stockard Channing", "0384211": "Dulé Hill", "0005049": "Allison Janney", "0597223": "Janel Moloney", "0771493": "Richard Schiff", "0817983": "John Spencer", "0925966": "Bradley Whitford", "0000640": "Martin Sheen", "0000571": "Mary-Louise Parker", "0715953": "Roger Rees", "0001185": "Hector Elizondo", "0859450": "Robin Thomas", "0732947": "NiCole Robinson", "1208801": "Jerry Lambert", "1299096": "Brian Dragonuk", "3412422": "Sean Allen Jones", "0479903": "Aaron Michael Lacey", "1784670": "Cazimir Milostan"}, "geners": ["Drama"], "runtimes": ["41"],  "plot": ["A lavish W.H. party for Abbey's birthday the night before a N.H. medical board begins hearings on whether to suspend her license over her secret treatment of her husband's MS. Abbey returns to the residence with C.J. and Amy Gardener to get blitzed on wine and discuss her concerns about her medical career. Donna is restricted from joining the party because a decades-old cartography error puts her birthplace in Canada. Toby and U.K. Ambassador Lord John Marbury (Roger Rees) go to a nearby bar to share a bottle of very rare Scotch and to discuss a planned W.H. visit by an IRA political activist, which culminates in Marbury surprising Toby with his progressive vision. Later, Donna joins the women in the residence and makes an off-the-cuff remark that causes Abbey to rethink her stance on the issue of her license.—Another lively episode centered around a lavish W.H. party, this one for Abbey's birthday the night before a N.H. medical board begins hearings on whether to suspend her license over her secret treatment of her husband's MS. Abbey resign to the residence with C.J. and Amy Gardener to get blitzed on wine and discuss her concerns about her medical career. Donna is restricted from joining the party because a decades-old cartography error puts her birthplace in Canada. Toby and U.K. Ambassador Lord John Marbury (Roger Rees) resign to a nearby bar to share a bottle of very rare Scotch and to discuss a planned W.H. visit by an IRA political activist, which culminates in Marbury surprising Toby with his progressive vision. Late in the episode, Donna joins the women in the residence and makes an off-the-cuff remark that causes Abbey to rethink her stance on the issue of her license.-meebly"], "genres": "N/A", "imdbID": "0745606", "rating": 8.2, "votes": 947, "number_of_episodes": 155}