{"cast": {"0384211": "Dulé Hill", "0005049": "Allison Janney", "0539651": "Joshua Malina", "0597223": "Janel Moloney", "0771493": "Richard Schiff", "0817983": "John Spencer", "0925966": "Bradley Whitford", "0000640": "Martin Sheen", "0550358": "Melissa Marsala", "0813977": "Josef Sommer", "0123632": "Kate Burton", "0636694": "Michael Nouri", "0132841": "Scott Allan Campbell", "0021835": "Joaquim de Almeida", "0280330": "Melissa Fitzgerald", "0781515": "Mindy Seeger", "0652555": "Ron Ostrow", "0349824": "Joyce Guy", "0020594": "Ivan Allen", "0157227": "Tom Chick", "0197827": "John J. Dalesandro", "0408786": "James Ingersoll", "0013462": "Robert Aguilar Jr.", "0264571": "Kevin Fabian", "16578732": "Frank Watt"}, "geners": ["Drama"], "runtimes": ["42"],  "plot": ["Toby awakens at 3 a.m. with an idea of how to save the social security program for future generations, leading him to meet in secret with the president and volunteer to \"touch the third rail\" of American politics. Toby meets with influential Republican senator Gaines about putting aside partisanship in the interest of preserving the critical safety net, and he gets a favorable response, but someone who saw them together leaks the meeting to the press. Toby also gets Dem. senator Brainerd on board with assurances that both sides need to compromise and that the Republican agreed. Elsewhere, Josh tries to help boost the new v.p.'s profile and bland image by having him comically attack the same senator for his weak fundraising efforts. By day's end, both Gaines and Brainerd have publicly withdrawn from Toby's previously secret plan and publicly refused to consider the compromises they'd initially offered. The president angrily orders Toby to fix what he's broken, in response to which Toby submits his resignation letter to Leo. Toby finally sits down with Josh, who is livid at having been kept out of the loop on the s.s. matter, and they discuss the president's legacy and the greater issue of making a lasting impact for the American people, after which Josh recommends turning to Dem. senator Turner to reignite the agreement, leading to a bipartisan negotiation and the White House's realization that the good of the people has to trump any presidential legacy.—meebly"], "genres": "N/A", "imdbID": "0745678", "rating": 8.0, "votes": 769, "number_of_episodes": 155}