{"cast": {"0000257": "Alan Alda", "0000330": "Stockard Channing", "0384211": "Dulé Hill", "0005049": "Allison Janney", "0539651": "Joshua Malina", "0005203": "Mary McCormack", "0597223": "Janel Moloney", "0771493": "Richard Schiff", "0817983": "John Spencer", "0925966": "Bradley Whitford", "0001751": "Jimmy Smits", "0000640": "Martin Sheen", "0155693": "Kristin Chenoweth", "0170550": "Gary Cole", "0001632": "Teri Polo", "0642145": "Ed O'Neill", "0001513": "Tim Matheson", "0005499": "Lily Tomlin", "0005253": "Elisabeth Moss", "0752852": "Steve Ryan", "0261729": "Renée Estevez", "0345466": "Vincent Guastaferro", "0641418": "Shannon O'Hurley", "0445551": "Tim Kelleher", "0215682": "Matthew Del Negro", "0036439": "Evan Arnold", "1388719": "Karis Campbell", "0020594": "Ivan Allen", "1744948": "Kate Enggren", "1683717": "Rebecca Avery", "0120838": "Petrea Burchard", "0534032": "Will MacMillan", "1892865": "Richard Hilton", "1229455": "Jerry Buys", "1412086": "Jason Ryan Lovett", "1950877": "Thomas A. Miller"}, "geners": ["Drama"], "runtimes": ["43"],  "plot": ["WHO WILL BE THE DEMOCRATIC PRESIDENTIAL CANDIDATE? - It's the Democratic National Convention and the race to become the Democratic Presidential candidate has narrowed to three candidates: Russell, Baker and Santos. Also, Bartlet must wrestle with the decision to launch the super-secret defense shuttle to rescue the astronauts trapped at the space station and risk national security or let them die.—NBC.com", "The Democractic convention begins with no candidate having a decisive lead. While delegates cast their ballots on live TV, political operatives for all candidates attempt to outmaneuver each other and change votes. The President ponders using the military shuttle to rescue the astronauts, and the FBI begins its investigation of the leak revealing its existence.—Murray Chapman", "The Democratic convention begins in a symphony of chaos and division; Leo demands that a nominee be chosen by the end of the second day at the very latest. While delegates cast multiple rounds of ballots on live TV, Josh, Donna, Will, and the candidates themselves work the phones frantically behind the scenes to convince delegates to change their votes. The President is furious at the revelation of the secret military space shuttle, and demands that the White House find the source of the leak both as a matter of principle and in order to minimize political fallout. The FBI launches their own leak investigation, while Bartlet ponders ordering the controversial shuttle to rescue the astronauts.—Murray Chapman"], "genres": "N/A", "imdbID": "0745586", "rating": 8.9, "votes": 843, "number_of_episodes": 155}