{"cast": {"0144187": "Elaine Cassidy", "0330913": "Christopher Gorham", "1556320": "Katie Cassidy", "0724460": "Cameron Richardson", "0968405": "Adam Campbell", "0121404": "Richard Burgi", "0064769": "Jim Beaver", "0859702": "C.J. Thomason", "0005543": "Victor Webster", "0147679": "Dean Chekvala", "1204778": "Matt Barr", "1248373": "Gina Holden", "0416404": "David James Lewis", "1600059": "Cassandra Sawtell", "0006419": "Claudette Mink", "1564963": "Brandon Jay McLaren", "0310240": "Chris Gauthier", "1556638": "Sean Rogerson", "1785081": "Amber Borycki", "1222371": "Sarah Smyth", "0970805": "Ben Cotton", "2470629": "Anna Mae Wills", "1650932": "Ali Liebert", "0254379": "Beverley Elliott", "0446892": "Terence Kelly", "0164972": "Robert Clarke", "0136802": "Nicholas Carella"}, "geners": ["Drama", "Horror", "Mystery", "Thriller"], "runtimes": ["40"],  "plot": ["The bride & groom host a scavenger hunt for their friends, most of whom wind up socializing with the locals instead. Trish's old flame turns up unexpectedly; Henry's brother can't stay out of trouble.", "Henry treats his guests to a scavenger hunt on the island. Sully tricks Cal into switching teams so he can flirt with his fiancée, but tires of her and leaves Cal hanging in a hunter's snare. On early deer hunt, Jimmy is rebuked by partner Shane for gracefully allowing animal lover Abi to mess up their kill, later find a deer on their jeep, marked 'psycho' in its blood. The deer later turns up in Henry's room, which he manages to clean before Trish arrives. Trish catches her father talking to Hunter, whom she refused to dump Henry for, but believes their cover story and Henry hangs around the wedding party's campfire, a wanderer-off falls into a hunter's pit and is burned alive. Reverend Fain is caught in another snare and decapitated. The morning after Kelly celebrates being promised she can stay with Abi in LA wildly in bed with J.D., she's found hanged in her room.—KGF Vissers"], "genres": "N/A", "imdbID": "1381350", "rating": 7.1, "votes": 487, "number_of_episodes": 13}