{"cast": {"0144187": "Elaine Cassidy", "0330913": "Christopher Gorham", "1556320": "Katie Cassidy", "0859702": "C.J. Thomason", "1204778": "Matt Barr", "0719678": "Callum Keith Rennie", "1248373": "Gina Holden", "1600059": "Cassandra Sawtell", "1564963": "Brandon Jay McLaren", "0669041": "Aaron Pearl"}, "geners": ["Drama", "Horror", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["Sully and Danny flush out a killer; when Abby can't finish him off, he's dragged to jail instead. Feeling safer now, the friends split up. Sully tries his hand at interrogation as well as fixing a radio. Abby retrieves Shea and Madison; Henry goes to fetch Trish, but she has been lured out to the bluffs by Jimmy with talk of a rescue boat. Abby confronts one killer, but Madison soon reveals that her kidnapper had a \"friend.\" Shea shares her discovery with the others; when Jimmy reports back that Trish accidentally slipped down the rocks, suspicion immediately falls on him. The friends again split up to rescue Trish while guarding the prisoner, who uses the moment to escape and take another victim. A tense standoff is diffused when Trish turns up safe; a boathouse radio could finally bring help. Not realizing that the killer is again loose, Trish makes love to Henry in their cabin, but he is lured out by a strange knock at the door. Shea and Madison must run to Sully for help. Alone in the woods, Jimmy tells Abby he has a long-standing confession to make. A second killer is revealed.—Anonymous", "Wakefield is finally trapped, caught, belt-cuffed and jailed by Sully, whose acolyte Danny he'll later strangle to escape after telling Abby her mother bore his son, whom he tracked down. That fits the accomplice theory, supported belated by Madison's admission they were brought food while in the tunnels. Jimmy is the prime suspect, yet alone with Tris he keeps her safe and is wrongly mistrusted when calling the others for help after she fell down a cliff. After the mystery accomplice attacks the survivors again, he reveals himself only to the least suspecting potential victim when the coast guard is already contacted once Sully has repaired a boathouse radio.—KGF Vissers"], "genres": "N/A", "imdbID": "1381348", "rating": 7.9, "votes": 393, "number_of_episodes": 13}