{"cast": {"0144187": "Elaine Cassidy", "0330913": "Christopher Gorham", "1556320": "Katie Cassidy", "0724460": "Cameron Richardson", "0968405": "Adam Campbell", "0859702": "C.J. Thomason", "0064769": "Jim Beaver", "0147679": "Dean Chekvala", "1204778": "Matt Barr", "1248373": "Gina Holden", "0416404": "David James Lewis", "0006419": "Claudette Mink", "1564963": "Brandon Jay McLaren", "1785081": "Amber Borycki", "0970805": "Ben Cotton", "0254379": "Beverley Elliott", "0942036": "Dean Wray", "0669041": "Aaron Pearl", "1599959": "Sonia Mais", "1600059": "Cassandra Sawtell"}, "geners": ["Drama", "Horror", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["Evacuation plans are put on hold when Madison turns up missing. In searching the island for her, the friends discover more bodies. Trish smooths over her tense relationship with Henry while his brother stews in jail, but a strange invasion there allows JD to escape. Sheriff Mills is seriously injured while trekking through the woods and is cared for by an old acquaintance, but the help is short lived when a fire breaks out. Abby receives a phone call from the kidnapped Madison, who says she'll be killed if any of them try to flee the island. Sully wants to leave anyway, but Cal talks the others out of it. Abby and Jimmy head for the marina, where Abby witnesses someone else die, with cryptic last words.—Anonymous", "Sheriff Mills questions JD in prison about Cole Harkin and JD tells him his whereabouts in the woods. Sheriff Mills goes to the woods but hits a trip wire and is hit by an arrow in the thigh. When he comes through he's in Cole's cabin and Cole tells him that he believes there is someone imitating Wakefield's crimes as he found a journal which would make it easy to do so. Before he can say anymore Cole is killed. Elsewhere, J.D. escapes from prison after Deputy Garrett is shot dead. Meanwhile, most of the wedding guests make it off the island but the main guests stay behind to look for the missing Madison. Whilst out looking for Madison, Henry & Abby find Richard's speared body masted to a tree and straight after Abby receives a call from Madison telling her if the rest of the guests leave the island Madison will be killed. Jimmy & Abby rescue Sheriff Mills and goes down to the marina where Abby finds a stabbed J.D. who tells her the killings are all about her before he dies. From behind her a distraught Henry appears covered in J.D.'s blood.—Anonymous"], "genres": "N/A", "imdbID": "1381356", "rating": 7.7, "votes": 389, "number_of_episodes": 13}