{"cast": {"0144187": "Elaine Cassidy", "0330913": "Christopher Gorham", "1556320": "Katie Cassidy", "0724460": "Cameron Richardson", "0968405": "Adam Campbell", "0859702": "C.J. Thomason", "0064769": "Jim Beaver", "1204778": "Matt Barr", "1248373": "Gina Holden", "1600059": "Cassandra Sawtell", "0006419": "Claudette Mink", "1564963": "Brandon Jay McLaren", "0970805": "Ben Cotton", "1650932": "Ali Liebert", "0254379": "Beverley Elliott", "1558628": "Michael J Rogers", "1365460": "Julia Benson", "0719678": "Callum Keith Rennie"}, "geners": ["Drama", "Horror", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["Madison's words ostracize Abby from the group, but they all determine to leave the island. Henry and Abby stop to pick up Cal and Chloe but are dismayed to learn that the sheriff is gone. When state troopers arrive for custody of JD, they get an unpleasant surprise. Trish is let in on the secret of the attic. An attack on the marina leaves Henry injured but spells worse for Jimmy. Henry tries to shield Abby from accusations as the group holes up in Cannery Row bar, where the killer mounts a fresh attack and leaves a surprise. Chloe exchanges a tender goodbye with Cal before he and Sully depart on a desperate mission. Sheriff Mills makes a shocking confession to his daughter; Madison admits a lie; a killer is revealed.—Anonymous", "Documentation and tunnel maps found in the missing sheriff's room make even Abby fear he's the killer and Madison's manipulative 'new friend'. Henry gathered the survivors to leave the island by yacht, but when two state troopers arrive to collect J.D., they are snipered, the yacht booby-trapped with the sheriff's oxygen, which almost blows up Shane. Jimmie, who was with him, is later delivered alive to Henry's barricaded party, with a cryptic message which seems to summon Abby. While brave Cal and driver Sully nearly die during a medical evacuation, the sheriff dies explaining to his daughter about a deal and the real killer.—KGF Vissers"], "genres": "N/A", "imdbID": "1381346", "rating": 7.9, "votes": 395, "number_of_episodes": 13}