{"cast": {"0369954": "Keeley Hawes", "0621382": "Michael Nardone", "0869750": "Steve Toussaint", "0566049": "Vicky McClure", "1161994": "Martin Compston", "0686029": "Tony Pitts", "2925304": "Christina Chong", "0001160": "Adrian Dunbar", "1650174": "Briege Roche", "6306441": "Gavin Neilly", "0410160": "Andrea Irvine", "0642321": "Tara Lynne O'Neill", "6306440": "Roseanna Barry", "2935576": "Jeany Spark", "1022566": "Liz White", "1326440": "Mark Bonnar", "2447755": "Henry Pettigrew", "0045661": "Claire Hackett", "0064155": "Ian Beattie", "1982264": "Niall Macgregor", "0404711": "Richard Huw", "0942712": "Philip Wright", "1676496": "Mark Asante", "2911170": "Laurence Doherty", "0283428": "Daniel Flynn", "5961306": "Chrissie Harris", "6519232": "Christine Harris", "3033499": "Hugh Irvine", "5504790": "Simon Millar"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["Following the tragedy at the hospital, AC12's Kate Fleming is planted undercover in Lindsay Denton's Missing Persons Unit. But Lindsay in turn gathers compromising evidence against the anti-corruption team.", "Following the deaths of Georgia and the witness it is Steve who gets a grilling as to the police presence at the hospital whilst Lindsay is accused of attacking her neighbour, which she denies. Steve discovers that a nurse on the witness's ward, Claire Tindall, was threatened into giving the killer access by a man she knows as Joe, but whom she is unable to identify. Lindsay continues to search for vanished teenager Carly Kirk and Kate is drafted in as her assistant - in reality a move to try and get Lindsay to admit her guilt - but Lindsay sees through the ruse. After Kate's cover is blown Lindsay is questioned again and claims that she rang the hospital to ask that the witness exonerate her but she is disbelieved and Hastings arrests her for conspiracy. At her interview she points out that Steve visited Claire unofficially and Hastings has financial problems and a broken marriage that could make him just as culpable but she is nonetheless held in custody. Meanwhile DCC Dryden finds himself in the frame for a driving offence supposedly committed by his wife.—don @ minifie-1"], "genres": "N/A", "imdbID": "3162272", "rating": 8.5, "votes": 1444, "number_of_episodes": 37}