{"cast": {"0621382": "Michael Nardone", "0562262": "David Maybrick", "3210821": "Antonio Magro", "0369954": "Keeley Hawes", "1326440": "Mark Bonnar", "0571476": "Allison McKenzie", "0869750": "Steve Toussaint", "1022566": "Liz White", "1161994": "Martin Compston", "0566049": "Vicky McClure", "0001160": "Adrian Dunbar", "2935576": "Jeany Spark", "3565962": "Jessica Raine", "0942712": "Philip Wright", "1982264": "Niall Macgregor", "0045661": "Claire Hackett", "0064155": "Ian Beattie", "0410160": "Andrea Irvine", "0642321": "Tara Lynne O'Neill", "0404711": "Richard Huw", "0189987": "Marty Cruikshank", "1328998": "Julia Krynke", "2447755": "Henry Pettigrew", "2911170": "Laurence Doherty", "5961306": "Chrissie Harris", "6519232": "Christine Harris", "0571160": "Gina McKee", "5177309": "Glen Robertson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["A brutal ambush on a police convoy leaves three officers dead and a protected witness fighting for his life. AC-12 turn their spotlight on Lindsay Denton, the officer who led the convoy but escaped unscathed.", "A police convoy escorting a civilian under a witness protection scheme is attacked, the witness hospitalized and all the police officers killed, except Inspector Lindsay Denton, who organized the operation at very short notice and who only informed DCC Dryden of the route. Ted Hastings asks Steve and Kate to interview her but Kate pulls out, claiming one of the dead officers, Jayne Akers, was a friend - though she has been having an affair with Jayne's husband Rich. Her place is taken by Georgia Trotman, who is troubled that the men are savage with their interrogation, treating Lindsay as a suspect and delving into her finances. Lindsay herself is moved to a missing persons unit but is shown to have a violent streak, attacking a noisy neighbour. Kate follows her to the retirement home where her mother lives and finds she has rung the hospital from a payphone. Georgia and Steve attend at the hospital where somebody is trying to kill the witness and who kills Georgia.—don @ minifie-1"], "genres": "N/A", "imdbID": "3162268", "rating": 8.5, "votes": 1654, "number_of_episodes": 37}