{"cast": {"1569065": "Leanne Best", "0566049": "Vicky McClure", "2468782": "Arsher Ali", "0001160": "Adrian Dunbar", "0971135": "Craig Parkinson", "1161994": "Martin Compston", "0657648": "Lisa Palfrey", "1859822": "Maya Sondhi", "1765073": "Jonas Armstrong", "4681755": "Melissa Dean", "2467286": "Kiran Landa", "0369954": "Keeley Hawes", "0908116": "Polly Walker", "0213140": "Julia Dearden", "0027957": "Adjoa Andoh", "0589152": "Poppy Miller", "0662744": "Shaun Parkes", "5929565": "Ash Cook", "6356905": "James Edlin", "5961306": "Chrissie Harris", "3033499": "Hugh Irvine", "5504790": "Simon Millar", "3953255": "Terry Noble", "6497659": "Kristy Robinson", "7478744": "Aaron Rolph"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["59"],  "plot": ["DS Steve Arnott believes there is a dark secret in Danny Waldron's past. Then the spotlight falls on his questionable conduct in a previous inquiry - the Lindsay Denton case.", "Jackie and Hari tell the AC Unit that Rod killed Danny Waldron but the team are not convinced and later Jackie changes her story, incriminating Hari in Danny and Rod's deaths. As a result Hari goes on the run and Cottan is declared an unlikely hero. Steve finds out from Joe Nash, who was in care with Waldron, that they were abused at a home for boys, whose staff numbered the Murphys, the two recent victims and he also learns the result of Lindsay's retrial.—don @ minifie-1", "Hastings lets Fleming tail Bains, whom she sees watches him meeting with Brickford. Arnott interviews Bains' superior, Bains panics and is observed calling his not-amused contact by payphone. Fleming asks for a second autopsy of Kennedy's, which Cottan intentionally neglects. The photo of Waldron and Ronan Murphy is traced to his time in Sands View boys' home. Arnott identifies Joseph Nash, another boy there, who explains Linus Murphy was the caretaker at Sands View, but both men abused orphan boys at the home, and they were 'rented out' for sexual abused by anonymous visitors at Sands View and for private parties. He identifies then-Councillor Dale Roach, who is unable to stand trial, due to a stroke. Fleming reveals to worried Brickford that Bains has been making phone calls, seemingly to Brickford, which Bains cannot explain. Brickford confesses to AC-12 that Waldron was shot in a struggle involving Brickford and Kennedy. Only Bains saw how it began. Bains claimed Waldron aimed at him, so he grabbed the gun in self-defense. Brickford admits the team's lies about Ronan Murphy's death. Hastings has Brickford fired and warns they may be charged. Arnott orders a second post-mortem on Kennedy, proving murder. AC-12 orders armed arrest of Bains, but warned by contact Cottan, he escapes to the warehouse where Kennedy was hanged, and finds Cottan. As the firearms team approach, Cottan handcuffs and injures himself to fake a fight. Bains is arrested and the police find a noose, supporting Cottan's story that Bains attempted to hang him. The jury finds Denton not guilty of conspiracy to murder, only sabotaging justice, so she is released given time served. She tells Arnott she forgives him, outside the courthouse. Cottan is congratulated but the mobile phones in Bains' home suggest he was acting on orders, and, as Cottan watches on TV Denton's release, mobile phones in his house begin to ring.—KGF Vissers"], "genres": "N/A", "imdbID": "5072082", "rating": 8.4, "votes": 1322, "number_of_episodes": 37}