{"cast": {"0990547": "Daniel Mays", "0578123": "Will Mellor", "0662744": "Shaun Parkes", "0657648": "Lisa Palfrey", "2468782": "Arsher Ali", "1569065": "Leanne Best", "2492327": "Shane Gately", "0001160": "Adrian Dunbar", "1161994": "Martin Compston", "0971135": "Craig Parkinson", "1620622": "Natasha Gordon", "0566049": "Vicky McClure", "4408716": "Aiysha Hart", "2641725": "Rebecca O'Mara", "0908116": "Polly Walker", "2467286": "Kiran Landa", "0189858": "Richard Croxford", "5967490": "Louis Rolston", "7265145": "James Murphy", "4172785": "Roman Beguns", "6289521": "Frank Cannon", "6356905": "James Edlin", "5961306": "Chrissie Harris", "3033499": "Hugh Irvine", "6497659": "Kristy Robinson", "7478744": "Aaron Rolph"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["When a criminal is shot dead by a police armed-response unit led by Sergeant Danny Waldron, AC-12 gather evidence suggesting it was a deliberate killing rather than self-defense.", "Police sergeant Danny Waldron shoots unarmed criminal Ronan Murphy dead and, when his colleagues arrive on the scene, tells them it was an act of self defence, insisting they back him up. A witness disputes his account and he comes before the anti-corruption unit led by Ted Hastings, who is unimpressed by Waldron's arrogance. Kate goes undercover with his team, noting that officer Hari Bains is the weak link, though he will not testify against Waldron. Kate then joins the team's assault on a house, ending in bloodshed.—don @ minifie-1", "Detective sergeant Danny Waldron's team of armed officers must arrest Ronan Murphy, a suspect wanted in connection with a plot to commit a gangland execution. Murphy's car is forced to stop, he runs into a nearby housing estate, where Waldron corners him before the rest of the team arrive. Murphy surrenders his gun, but Waldron shoots him fatally, manipulates the scene to make it look as though Murphy opened fire first and orders his reluctant team to discharge their weapons so as to avoid any trouble, refused only by PC Harinderpal \"Hari\" Bains, who nevertheless agrees to keep the secret. Under interrogation from AC-12, Waldron remains cool until DS Steve Arnott's line of questioning into his private life begins to spook him, the others clearly repeat a rehearsed story. When Arnott confronts him outside, Waldron implies that he knows he will not get away with what he has done. Superintendent Ted Hastings agrees to 'transfer' DC Kate Fleming undercover to Waldron's squad in an attempt to uncover the truth. Waldron's team are tense as a result of being bullied into collaborating with Waldron, and Fleming deems PC \"Hari\" the weakest link, but he too refuses to testify against Waldron. After pressure from AC-12 department lawyer Gill Biggeloe, Waldron's team resumes active duty, raiding the home of a drug-dealer. Waldron pockets an illegal firearm and stops Fleming just in time from accidentally shooting at a child left in the house. Waldron demands Fleming transfer out of his squad 'to avoid unpleasantness', watches Bains' house 'joggging', spies on Ronan Murphy's funeral. He follows Ronan' uncle Linus Murphy home from the funeral to hold and cuff him strip him at gunpoint, with words that reveal that Ronan and Linus were part of a group who harmed him as a child. He admits to killing Ronan for revenge, and tortures Linus to death. In his flat, Waldron leaves a list of names in an envelope addressed to Arnott. When Waldron's team raids another drug house, he orders Fleming to stay downstairs while the rest of the team search upstairs. Fleming hears a shot, and rushes upstairs to find the other squad members standing around Waldron, who bleeds death, shot in the neck.—KGF Vissers"], "genres": "N/A", "imdbID": "4881332", "rating": 8.6, "votes": 1588, "number_of_episodes": 37}