{"cast": {"0369954": "Keeley Hawes", "1161994": "Martin Compston", "0566049": "Vicky McClure", "0971135": "Craig Parkinson", "0908116": "Polly Walker", "0001160": "Adrian Dunbar", "2468782": "Arsher Ali", "4408716": "Aiysha Hart", "1765073": "Jonas Armstrong", "1859822": "Maya Sondhi", "0452950": "Melanie Kilburn", "1635815": "Brian Ferguson", "0607403": "Neil Morrissey", "0182688": "George Costigan", "5929565": "Ash Cook", "6356905": "James Edlin", "5961306": "Chrissie Harris", "6071737": "Ross Moneypenny", "6497659": "Kristy Robinson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["59"],  "plot": ["Fresh testimony launches AC-12 back on the trail of the Caddy, a corrupt officer with links to organized crime.", "Steve is stunned by the aftermath of Lindsay's trial and he and the unit are deceived when Hari is brought in for a double murder. Steve learns from girl-friend Sam the connection between Ronan Murphy and Lindsay's dead informant Tommy Hunter, leading Kate to visit Nigel Morton - a man who consequently goes to see Cottan, who then conducts another underhand deal. In trying to discover more about the sex abuse scandal Kate and Steve call on retired officer Patrick Fairbank, though he is somewhat evasive about the case and gives away nothing.—don @ minifie-1", "Freed, Denton extracts formal apologies from AC-12, reveals a recording of herself and Arnott in a compromising lover mode, usable as evidence of perjury, yet promises not to press charges. Barred from police reapplication, Denton must work as a supermarket cleaner and records an exploitative parole sponsor trying to pressure her into sex. Losing confidence within the department, Arnott meets with Denton seeking the link between Sands View and Hunter. Cottan gets a commendation for perceived bravery in arresting 'corrupt' Bains. He tells Biggeloe and Fleming he is concerned about Arnott's behavior and that Arnott is hiding a firearm. Bains confesses to killing Waldron on the demands of his unknown contact, but not Kennedy. Arnott and Fleming confront Hastings, believing they should question a retired officer on allegedly reporting to a mother that a sexual-abuse complaint of Roach was dealt with, resulting in Roach being charged and sent to prison. The mother saw Roach in the newspaper later, so knew she had been lied to. The death of a former social worker at Sands View, ruled as a suicide, is re-investigated due to allegations that he attempted to report the abuse to police and may have been murdered to cover up. Former Vice Chief Superintendent Fairbank claims to remember no details of the case. He and Hastings share a handshake that Arnott identifies as Masonic. Cottan meets former colleague DC Nigel Morton and threatens to derail his pension if he does not hand over the last known evidence of Cottan's true allegiance - a mobile phone and SIM card with records of calls made to Hunter. Morton tells AC-12 serial killer 'The Caddy' is probably still alive, creating a presumptive profile engineered to fit Arnott. Morton hands the phone and SIM to Cottan, who destroys all in a car park (where Cottan was prepared to kill him otherwise), but it was a duplicate and Morton kept the originals.—KGF Vissers"], "genres": "N/A", "imdbID": "5072086", "rating": 8.4, "votes": 1329, "number_of_episodes": 37}