{"cast": {"1123403": "Mark Stobbart", "3464945": "Andy Kellegher", "5400860": "Scott Reid", "0566049": "Vicky McClure", "1459494": "Henry Miller", "1161994": "Martin Compston", "0001160": "Adrian Dunbar", "1581584": "Vineeta Rishi", "1859822": "Maya Sondhi", "5104710": "Claudia Jessie", "3531173": "Anneika Rose", "0628601": "Thandiwe Newton", "0383467": "Paul Higgins", "0408846": "Lee Ingleby", "6042130": "India Amarteifio", "4023835": "Kwame Che Kandekore", "0280659": "Patrick FitzSymons", "2196406": "Nigel Boyle", "5582078": "Elva Trill", "0914327": "Jason Watkins", "1104892": "Chris Coghill", "3130060": "Gaite Jansen", "3033499": "Hugh Irvine", "5504790": "Simon Millar", "10331106": "Jude North"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["59"],  "plot": ["A dismembered body is discovered, and worries grow when Roz fails to report for duty. After further questioning of Michael Farmer unearths crucial new information, AC-12 challenge the case against him.", "Kate's interview with Michael Farmer exonerates him from one of the murders, the victim's remains being found in woodland, whilst Ted and Steve continue to question Roz, who sticks to her story that Farmer is the culprit. Discrepancies in her account of things lead to her being taken off the case and replaced by Ian Buckells. However, when Ifield is discovered murdered, Roz overrules Steve to take charge of the murders, allowing her to tamper with evidence, incriminate Ifield as the killer and discredit AC-12 . Kate, meanwhile, finds a link between Hana and Ifield, who employed her as his cleaner.—don @ minifie-1", "Interviewed by Fleming, alleged serial killer Michael Farmer, finally remembers the name of the hospital he was in when Leonie Collersdale, the second murder victim, was killed, throwing due doubt on his guilt. DCI Huntley fails to report for duty. A dismembered female body is identified as Collersdale's. When she reappears, Huntley just says she had a bug. Hilton tells Huntley that Hastings will serve her with a Regulation 15 notice. AC-12 interviews Huntley, doubting forensic evidence concerning the attack on Hana Reznikova, which Huntley alleges is by Farmer, saying Huntley failed to present any contrary evidence to the Crown Prosecutor. Hastings says he will be recommending she be taken off the case. Huntley later examines Ifield's laptop in her car. breaking into missing Ifield's flat, Arnott finds his corpse, three fingers amputated. Huntley takes charge of the crime scene, despite Arnott's protests. She notices her own blood spatter on the edge of the kitchen counter, hears the sample being labeled KRG-13, but mistakenly notes it as KRG-30. Huntley obtains a sample of Ifield's blood from her car, labeling it KRG-30. Among the forensic samples she cannot find KRG-30, but realizes her error and over-writes her sample bag as KRG-13. Ifield's mobile phone records reveal communications with Reznikova. Arnott learns from forensics that Ifield probably wore a white forensic oversight at his death. Summarising, he implies to Hastings that Huntley is Ifield's killer. Huntley inserts a further sample of Ifield's blood into forensic submissions for Collersdale's murder, implicating him. She requests further forensic tests, which find the match to Ifield. Fleming passes the Inspector's exam. Hastings informally indicates to Fleming that he will promote Arnott. Huntley tells Hilton that, if AC-12's informant was Ifield, the evidence against him undermines his evidence and thus the case against her. She is convinced Ifield's murder and Farmer's crimes are linked.—KGF Vissers"], "genres": "N/A", "imdbID": "6148516", "rating": 8.1, "votes": 1286, "number_of_episodes": 37}