{"cast": {"0628601": "Thandiwe Newton", "1123403": "Mark Stobbart", "5104710": "Claudia Jessie", "0566049": "Vicky McClure", "2196406": "Nigel Boyle", "1581584": "Vineeta Rishi", "3531173": "Anneika Rose", "1161994": "Martin Compston", "0001160": "Adrian Dunbar", "0383467": "Paul Higgins", "1859822": "Maya Sondhi", "5400860": "Scott Reid", "1459494": "Henry Miller", "7764898": "Lucie Shorthouse", "3597982": "Asha Kingsley", "0408846": "Lee Ingleby", "4817257": "Royce Pierreson", "5582078": "Elva Trill", "3130060": "Gaite Jansen", "3033499": "Hugh Irvine", "5504790": "Simon Millar", "10331106": "Jude North"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["59"],  "plot": ["As shocking new evidence is unearthed, AC-12 step up their investigation into the case against Michael Farmer.", "Convinced that Roz is holding something back Steve persuades Ted, to Hilton's annoyance, to search her office. Evidence suggests Ifield was the serial killer but Steve is still unconvinced and suspects Roz of complicity in his death. Roz however seems to get the upper hand when Michael admits to approaching another young woman out of loneliness and also tries to incriminate Hana, Ifield's cleaner, implying she killed him in self defence after a sexual affair. Steve meanwhile discerns that Roz's husband Nick lied to give her an alibi on the night of Ifield's death but this puts him in very grave danger.—don @ minifie-1", "The IA team seek links between Ifield and Farmer. For access to information from the investigation, AC-12 seize evidence forcibly, Fleming being unable to gain access undercover as suspicious Huntley cuts her off. A security camera shot of masked Ifield purchasing the cutting tools found at his flat can't convince Arnott he was 'Balaclava Man'. Hastings authorizes a second investigation. Arnott theorizes Huntley murdered Ifield given her phone history. DC Taylor notices Fleming checking the forensics (that Huntley had swapped) and tells Huntley. Discovered prostitute Reznikova admits she slept with Ifield. Huntley's husband, Nick Huntley, refuses to confirm or deny his wife's alibi for Ifiled's murder. DC Desford is assigned to assist Arnott. Having heard no response from Nick, Arnott returns to his office to question him and misses voice messages from AC-12 warning him Nick could be dangerous, as his car was spotted near Ifield's flat on the night of his murder. On the way up in the lift, Arnott is attacked by a man in a balaclava, hit in the face with a baseball bat and thrown down the stairs.—KGF Vissers"], "genres": "N/A", "imdbID": "6148492", "rating": 8.6, "votes": 1371, "number_of_episodes": 37}