{"cast": {"3130060": "Gaite Jansen", "3405251": "Rhodri Lewis", "5104710": "Claudia Jessie", "0628601": "Thandiwe Newton", "4023835": "Kwame Che Kandekore", "1123403": "Mark Stobbart", "0914327": "Jason Watkins", "5339108": "Seamus O'Hara", "5400860": "Scott Reid", "1459494": "Henry Miller", "0383467": "Paul Higgins", "3531173": "Anneika Rose", "1161994": "Martin Compston", "0566049": "Vicky McClure", "0001160": "Adrian Dunbar", "1859822": "Maya Sondhi", "0408846": "Lee Ingleby", "4909365": "Harriet Cains", "6042130": "India Amarteifio", "6289521": "Frank Cannon", "5504790": "Simon Millar", "5582078": "Elva Trill"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["When DCI Roz Huntley captures a serial killer, Forensic Coordinator Tim Ifield alerts AC-12 to a possible miscarriage of justice.", "When Hana Reznikova is kidnapped and taken to a house occupied by simple-minded young Michael Farmer inspector Roz Huntley arrests him, charging him also with the murders of two other women. Forensic investigator Tim Ifield however believes that Roz planted evidence to frame Farmer in order to close the murder investigations and approaches AC 12 with his claim. Ted Hastings believes there may be some substance in the allegation and that corrupt ACC Hilton is backing Roz, though of course he denies it. Kate is seconded to Roz's team to find out more whilst Tim confronts Roz , a confrontation that goes horribly wrong.—don @ minifie-1", "DCI Roseanne \"Roz\" Huntley identifies and captures ex-sex crime-con suspected serial killer Michael Farmer, who seems uncooperative under questioning, apparently without an alibi, but he's actually just scared. ACC Derek Hilton pressures DCI Huntley to charge the suspect. FC Tim Ifield warns DCI Huntley in vain concerning objective doubts arising from the forensic evidence, probably proving the suspect's innocence, but Huntley brushes him off, haughtily asserting everywhere 'being in charge' without actually taking responsibility. Ifield insist to personally alert AC-12s hotshot DS Steve Arnott that he believes DCI Huntley is deliberately ignoring forensic evidence proving Michael's innocence, suggesting someone manipulated the crime scene expertly to frame the suspect. Authorised by Superintendent Ted Hastings, DS Kate Fleming goes undercover to investigate DCI Huntley, and interviews the suspect. Arnott informs DCI Huntley that AC-12 investigates, she comes to Ifield's house at night, to accuse him of talking to AC-12, a row breaks out. Huntley causes Ifield to burn his hand, he slaps her, she accuses him of assault, he pushes Huntley who hits her head, apparently fatally. Ifield goes purchase cutting tools to dispose of the body, but while he's preparing to carve her head, she awakes.—KGF Vissers"], "genres": "N/A", "imdbID": "5760408", "rating": 8.4, "votes": 1521, "number_of_episodes": 37}