{"cast": {"0001160": "Adrian Dunbar", "0383467": "Paul Higgins", "1161994": "Martin Compston", "0474904": "Syreeta Kumar", "1123403": "Mark Stobbart", "0628601": "Thandiwe Newton", "5104710": "Claudia Jessie", "3531173": "Anneika Rose", "2196406": "Nigel Boyle", "1859822": "Maya Sondhi", "0566049": "Vicky McClure", "4817257": "Royce Pierreson", "1581584": "Vineeta Rishi", "0049346": "Patrick Baladi", "0408846": "Lee Ingleby", "5400860": "Scott Reid", "1459494": "Henry Miller", "0372269": "Mary Healey", "0914327": "Jason Watkins", "0650284": "Pandora Colin", "0971135": "Craig Parkinson", "0571160": "Gina McKee", "5504790": "Simon Millar", "8975066": "Arlene Martine Morris", "10331106": "Jude North", "0708006": "Sakuntala Ramanee"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["AC-12's future hangs in the balance after Hilton bars them from investigating Roz Huntley. But Roz's problems are building closer to home.", "Hilton orders Ted to recuse the investigation into Roz, citing entrapment, and proposes shutting down AC 12. Ted is now convinced one of his team betrayed Kate with Jamie being the prime suspect. Steve returns to work, temporarily disabled and convinced that Nick was his attacker. He also discovers that the Huntleys' snide solicitor Jimmy Lakewell once acted for Michael and, knowing his previous, has offered him to Roz as the chief suspect. Then more evidence surfaces to vindicate both Michael and AC 12. Nick, meanwhile, genuinely concerned for Roz's injury, takes well-meaning action leading to a bitter retaliation by his wife. Ted confronts Hilton to place Roz in historic malpractice but once more she appears to be one step ahead of him.—don @ minifie-1", "Hastings accuses Hilton of willfully burying allegations, he denies this and demands the recording of DI Matthew \"Dot\" Cottan's dying declaration, in vain. DS Twyler reports biometrics suggest Arnott's masked attacker is the 'Balaclava Man' seen in the area of Collersdale's murder. Huntley retorts Farmer may change his plea to guilty. Twyler tells a colleague Huntley is keen to pin Ifield's murder on Reznikova. Fleming tells Hastings the leak of her cover is likely within AC-12. More female body parts are discovered: from Collersdale. Arnott resumes work in a wheelchair, says Huntley cannot be allowed to mislead the investigation and Hilton didn't forbid investigating Ifield's murder. He doubts Nick Huntley's alibi, Bindra finds it leaky and asks Desford for his username and password, claiming they are being changed, using them to download the recording of Cottan's dying declaration, which she passes to Hilton, then asks early pregnancy leave. Fleming notes the sensitive information access and tells Hastings, who reprimands Desford. Desford claims being scapegoated and requests a transfer. Arnott visits Farmer in prison, suggesting a change of solicitor; Farmer likes his first, Arnott brings Farmer's Nan to the prison, who prevent him from changing his plea. Arnott and Fleming find Farmer's earlier solicitor was Nick's Lakewell, who is uncooperative. Huntley ignores her wrist beginning to stink and the doctor trying to contact her about the swab, faints at home. Nick tells Lakewell Roz is lying and has a wound since Ifield's murder, Lakewell suggests a voluntary interview and immunity. FC Rupal Pandit proves frozen latest remains were buried after both Farmer's incarceration and Ifield's murder, and suggests a team briefing, Pandit goes but no-one has been made aware of the information. Twyler hears this and informs Fleming, stressing anonymity. Arnott's now recalls Jackie Laverty's body was buried after deep freezing and men in balaclava masks with baseball bats were involved. He suggests reopening the unsolved Laverty case, to examine the latest forensics. Nick explains to Roz, her that her hand had to be amputated to save her life. Arnott finds the blood sample of Ifield was contaminated with white forensic oversuit fibers, like the blood spatter on the kitchen counter: both falsified. He believes Roz protects Nick. Hastings waves caution, instructing Fleming to pick up the Huntleys. Taylor picks self-discharged Roz up, telling Lakewell requested a voluntary interview with independent detectives about Ifield's murder, seeking immunity. Roz tells Nick at home she wants a divorce and sole custody, accusing him of amputating her hand in retribution for her affair. He says it was all her lies and she had MRSA in her wound. She arrests him for Ifield's murder, reaches for the holdall she had kept with contaminated items from the scene of Ifield's murder and runs his hairbrush over his jumper. Hastings, Arnott and Fleming tell Hilton evidence was planted to falsely implicate Ifield in Collersdale's murder and Ifield had uncovered a conspiracy to frame Farmer. Hastings wants to arrest Roz for perverting justice. Hilton brushes this aside as AC-12 is recused, and these are Roz's cases. Hastings says only found this while looking again into the disappearance of Laverty. Hilton praises their work, but wants their files to be handed over to an impartial authority. Hilton plays Hastings Cottan's dying declaration saying the top corrupt official who promoted Cottan had a name beginning with \"H\". Hilton tells Hastings, as \"H\", he will be served with a Regulation 15 notice. Fleming finds Arnott physically unable to look after himself. He admits he may never walk again; she consoles him.—KGF Vissers"], "genres": "N/A", "imdbID": "6148560", "rating": 8.5, "votes": 1273, "number_of_episodes": 37}