{"cast": {"0408846": "Lee Ingleby", "0628601": "Thandiwe Newton", "1161994": "Martin Compston", "0001160": "Adrian Dunbar", "5427601": "Carolyn Bracken", "4817257": "Royce Pierreson", "0049346": "Patrick Baladi", "1859822": "Maya Sondhi", "0566049": "Vicky McClure", "0474904": "Syreeta Kumar", "5104710": "Claudia Jessie", "0383467": "Paul Higgins", "1104892": "Chris Coghill", "0708006": "Sakuntala Ramanee", "0280659": "Patrick FitzSymons", "3033499": "Hugh Irvine", "5504790": "Simon Millar", "10331106": "Jude North"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["The discovery of new forensic anomalies appears to provide AC-12 with a major breakthrough. Meanwhile, Nick Huntley comes under scrutiny.", "After the masked clobbering of Arnott, Huntley picks up her husband, advises him to go inside away from CCTV and ask security to look for Arnott, who is only badly injured. Nick Huntley tells Hastings and Desford it was a coincidence that only he knew Arnott was at his office building, without explaining why his car was seen near Ifield's flat when Ifield was murdered. Nick said his wife slept in the spare room, his solicitor Jimmy Lakewell that with no evidence or CCTV, Nick should walk. AC-12 find a CCTV image of a masked man by Nick's offices at the time. Nick and Huntley argue as he had seen her going into Ifield's flat that night, she claims having an affair. In hospital, Arnott can't identify his attacker. In his club, Huntley appeals to Hilton to file an official complaint against AC-12 and close the Farmer case. Hilton says he could give her info to help her with AC-12. She rejects his advances, suggesting they meet again. Huntley and Fleming talk to forensics officer Kevin Gill: KRG. Huntley's worsened wrist injury is examined by a doctor, who takes a swab. Arguing at home, Nick can no longer believe anything his wife says any more and knows she was in the fatal flats, she knocks him down. AC-12 finds an anomaly in the second forensic examination of KRG-13, the blood-spatters sample with the overwritten label: traces of white fibers from a forensic over-suit. Hastings tells Huntley formally he recommends her suspended. She accuses Hastings of sexism, having identified Fleming as his undercover and asks Hastings whether he is a Mason and suggests Fleming was induced to tamper with evidence concerning Ifield's murder, accusing Hastings of a conspiracy perverting justice in the case against her, and brandishes a supporting letter from Hilton, ending AC-12's inquiry. Hilton and Huntley meet again at his club, but she replies she loves Nick, whom she tells he is no longer a suspect. Afterwards, PC Maneet Bindra hands a file to Hilton.—KGF Vissers"], "genres": "N/A", "imdbID": "6148548", "rating": 8.5, "votes": 1317, "number_of_episodes": 37}