{"cast": {"0566049": "Vicky McClure", "0531808": "Kelly Macdonald", "1186830": "Perry Fitzpatrick", "4953780": "Gregory Piper", "0001160": "Adrian Dunbar", "2196406": "Nigel Boyle", "1161994": "Martin Compston", "5647934": "Shalom Brune-Franklin", "0725830": "Elizabeth Rider", "0080372": "Ace Bhatti", "10014228": "Ben Rose", "2925304": "Christina Chong", "8142076": "Rosa Escoda", "0049346": "Patrick Baladi", "1450877": "Andi Osho", "10998313": "Sherise Blackman", "3762596": "Alastair Natkiel", "9742341": "Garry Harper"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["DCI Davidson faces increasing pressure from all sides. AC-12's attempt to interview a key witness goes horribly wrong.", "Buckells is interviewed and charged by AC-12. Wise informs Hastings AC-12 must merge with AC-3 and AC-9 to form one unit and to reduce the staff by 90%, he is offered early retirement to avoid further disciplinary action. A betting shop robber is interviewed by Lomax and Fleming in gathering more information about firearms. As forensic analysis at Jatri's home is completed, Davidson watches before sending another message through her laptop, \"I'm finished\". Arnott asks DI Rogerson to hold off and deletes emails from Occupational Health about his drug test. Arnott recognizes the voice of jailed solicitor Jimmy Lakewell on a recording from Vella's office. Davidson tells Ryan Pilkington she will complete his commendation by Bucknell but honorably discharge him from her team, Arnott learns about his juvenile criminal past and police protector. Arnott and Bishop interview Lakewell in prison, but he's afraid to talk. In moving him into secure custody, the OCG ambush the convoy, PS Ruby Jones is killed by a sniper, whom Arnott kills with his handgun. Pilkington explains to Davidson why he will not be removed from Operation Lighthouse. Lakewell is murdered by OCG prisoner Lee Banks, cellmate Buckells watching. Forensic results from Jatri's house reveal Davidson's fingerprints were found, but that a DNA test found a match to a nominal located on other police databases.—KGF Vissers"], "genres": "N/A", "imdbID": "7814146", "rating": 9.0, "votes": 1548, "number_of_episodes": 37}