{"cast": {"0566049": "Vicky McClure", "1186830": "Perry Fitzpatrick", "0531808": "Kelly Macdonald", "1667723": "Kerri McLean", "4953780": "Gregory Piper", "2573241": "Tommy Jessop", "2407387": "Sara Dylan", "10299362": "Tara Divina", "1161994": "Martin Compston", "0001160": "Adrian Dunbar", "5647934": "Shalom Brune-Franklin", "2381142": "Amy De Bhrún", "8142076": "Rosa Escoda", "1450877": "Andi Osho", "0853583": "Owen Teale", "0080372": "Ace Bhatti", "0725830": "Elizabeth Rider", "1264638": "Maria Connolly", "3531173": "Anneika Rose", "2196406": "Nigel Boyle", "0334318": "Stephen Graham", "9742341": "Garry Harper", "7407610": "Graeme Peacock"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["A new witness comes forward claiming to have crucial evidence in Gail Vella's murder. Kate is torn between her loyalty to Jo and to AC-12.", "On the strength of evidence from a new witness, DCI Jo Davidson brings Terry Boyle back in for questioning about Gail Vella's murder. Kate is torn between loyalty to Jo and wanting to assist AC-12's investigation, and tensions increase when Kate encounters a face from the past with links to organised crime.", "After a witness states Boyle argued with the deceased CHIS regarding Vella's murder, brought in for further questioning he nearly shares new information about a man who \"did [the murder]\", but Davidson halts the interview. Accompanying PC Lisa Patel who is driving Boyle home, constable Ryan Pilkington, diverts to a different route, forces the car into a reservoir, drowns reemerging Patel but can't drown Boyle as unsuspecting Fleming, who tailed them, arrives, notices a window in the vehicle where Pilkington was sitting is open, and reports her findings to AC-12. Arnott recognizes Pilkington and Fleming remembers interviewing him as a juvenile connected with an old AC-12 case. Steph tells Hastings of Arnott's painkiller addiction; Arnott fails to get clean, spends a platonic night with Steph, he searches her house; discovering much cash in the loft. Boyle's freezer is found in a dump, containing samples of Jackie Laverty's blood. In Brentiss Prison, Jatri is violently prevented from talking to AC-12 by an OCG warder breaking her wrist. DSU Buckells and witness Deborah Devereux, who named Boyle, were sex partners. Buckells is handed over to AC-12, his Interim successor Davidson messages an unknown, unresponsive individual on a laptop 'everything has been taken care of'.—KGF Vissers"], "genres": "N/A", "imdbID": "7814148", "rating": 8.2, "votes": 1151, "number_of_episodes": 37}