{"cast": {"4953780": "Gregory Piper", "1161994": "Martin Compston", "5647934": "Shalom Brune-Franklin", "1269412": "Anna Maxwell Martin", "0001160": "Adrian Dunbar", "0566049": "Vicky McClure", "0531808": "Kelly Macdonald", "10530810": "Colette Lennon Dougal", "4240915": "Trevor Kaneswaran", "3307735": "Michael Yare", "1186830": "Perry Fitzpatrick", "8142076": "Rosa Escoda", "1922807": "Pano Masti", "2117474": "Claire-Louise Cordwell", "1264638": "Maria Connolly", "0853583": "Owen Teale", "9742341": "Garry Harper", "0626362": "James Nesbitt"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["As AC-12 struggle to deal with the repercussions of tragic events, Hastings makes one final bid to uncover institutionalized corruption.", "At the industrial estate, AC-12 find Ryan Pilkington, murdered with two gunshot wounds to the chest. Having fled, Fleming and Davidson go to Arnott's home and take his car. Davidson tells Fleming to search the shuttered print shop opposite Boyle's flat. Immediately ambushed by police vehicles, they must surrender. Carmichael assumes control of absorbed AC-12, telling Hastings they were detected so quickly because AC-12 vehicles have tracking devices, as she nor Chief Constable Osborne trusted them. Interviewed first, and shaken to learn the truth of her parentage, Davidson keeps answering 'no comment' and covers for Fleming pretending she had shot Pilkington whilst disarming her. Davidson shares details of coercion by the OCG, although Carmichael tries to steer away from this. Carmichael terminates the interview, Davidson is charged. Fleming is released, now the most senior officer in the MIT, and with Arnott orders the floor to the weapons workshop excavated. Bishop calls them back to AC-12, while police in Spain raiding Thurwell's suspected residence find two decomposed bodies. Being taken to her prison cell, Davidson is confronted by two OCG prison guards, who note the two CCTV cameras monitoring the entrance to her cell and retreat.—KGF Vissers"], "genres": "N/A", "imdbID": "7985702", "rating": 8.2, "votes": 1210, "number_of_episodes": 37}