{"cast": {"5647934": "Shalom Brune-Franklin", "1161994": "Martin Compston", "0566049": "Vicky McClure", "0531808": "Kelly Macdonald", "1186830": "Perry Fitzpatrick", "4953780": "Gregory Piper", "0001160": "Adrian Dunbar", "0853583": "Owen Teale", "0080372": "Ace Bhatti", "2381142": "Amy De Bhrún", "0182688": "George Costigan", "3762596": "Alastair Natkiel", "1269412": "Anna Maxwell Martin", "9742341": "Garry Harper", "0626362": "James Nesbitt"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["AC-12 link Gail Vella's murder with a historic case of police corruption, and Kate hatches a plan to tell once and for all if Jo is bent.", "AC-12 link Gail Vella's murder with a historic case of police corruption, and Kate hatches a plan to tell once and for all if Jo is bent. They are closer than ever to cracking the case, but when Hastings' authority is undermined it leaves his team in a potentially dangerous situation.", "Arnott and Bishop are frustrated the cell where Lakewell was found \"hanged\" lacks CCTV footage. Arnott tells Bishop to look into Lawrence Christopher, whose case Vella was investigating. Lomax debriefs Fleming and Davidson on the potential locations to workshop firearms. Fleming meets AC-12 and is shocked to learn that Davidson has a partial DNA match to Tommy Hunter, the results indicating this arose from incest. After a press briefing by Osborne, Hastings learns from Sindwhani that he should continue to investigate the situation before his retirement. Arnott discovers that the missing £50k from their last case was given to Steph Corbett by Hastings, which he reveals to Fleming. MIT's sting operation against the sites investigated by Fleming finds the first empty, but Ryan Pilkington is unwittingly observed by AC-12 using a concealed phone to contact the OCG, two members of which attempting to remove the machinery are killed by AC-12 AFOs; Fleming is informed of the actions but no arrest is made. Bishop explains to Hastings and Arnott about the Christopher case, leading Arnott to discover that Thurwell was involved in a covered up AC-12 case about child sexual exploitation at Sands View. Davidson attempts to force Fleming to submit a transfer request but she refuses, annoying Davidson who is under orders to \"get rid of her\". Arnott questions Fairbank but gets nowhere; back at the office, Bishop tells him that Vella tried to interview many of AC-12's former adversaries, but only Lee Banks had agreed to talk; Arnott learns from him of Hastings's involvement in \"tipping off\" the OCG about a rat in their team. Davidson lures Fleming to a disused industrial site, but Fleming also tells Arnott. He is delayed due to the arrival of his merger boss DCS Patricia Carmichael; while AC-12 are en route, Fleming and Pilkington have a stand off, weapons drawn: two shots are fired.—KGF Vissers"], "genres": "N/A", "imdbID": "7985700", "rating": 8.9, "votes": 1428, "number_of_episodes": 37}