{"cast": {"3531173": "Anneika Rose", "1186830": "Perry Fitzpatrick", "0531808": "Kelly Macdonald", "2196406": "Nigel Boyle", "0566049": "Vicky McClure", "1944242": "Patrick Buchanan", "10014228": "Ben Rose", "1161994": "Martin Compston", "0001160": "Adrian Dunbar", "5647934": "Shalom Brune-Franklin", "1559688": "Diarmuid Noyes", "8472159": "Loreece Harrison", "0516385": "Tim Loane", "2573241": "Tommy Jessop", "0725830": "Elizabeth Rider", "2925304": "Christina Chong", "2407387": "Sara Dylan", "4861736": "Kwaku Fortune", "9742341": "Garry Harper", "3033499": "Hugh Irvine", "10331106": "Jude North", "1450877": "Andi Osho"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["AC-12 investigate DCI Jo Davidson's apparent mishandling of the murder of an investigative journalist.", "DCI Jo Davidson receives new information about the whereabouts of a suspect in the unsolved murder of investigative journalist Gail Vella. En route to raid the property, she spots an armed robbery in progress and stops the convoy. Suspicious of her motives, AC-12 launch an investigation. Still dealing with the fallout from their explosive investigation into undercover officer John Corbett, AC-12 soon realise they are facing their most enigmatic adversary yet.", "Hillside Lane police station's DCI Joanne Davidson is the Senior Investigating Officer (SIO) of Operation Lighthouse, investigating into the murder of journalist Gail Vella. Fleming joined her team. A gay prostitute 'covert human intelligence source' (CHIS) warned them someone using the alias Ross Turner had boasted of killing Vella and are given his address. DSU Ian Buckells orders them to wait until the morning. Already in a convoy of armed police speeding to the address, Davidson orders it to intercept an apparent hold-up at a betting shop. One suspect is shot dead and the others arrested; the convoy is delayed. Terry Boyle, a man with Down syndrome, who had been abused and coerced into helping the organized crime group in earlier series, is eventually arrested, fitting a vague picture. PS Farida Jatri reports her concerns about Davidson to AC-12's DS Steve Arnott, who informally looks into Davidson's conduct with regard to the betting shop hold-up. Neither her team nor Arnott is aware of Davidson just broke up her lesbian affair with PS Jatri, messily. Two sets of fingerprints are found in both Turner's flat and in Boyle's home: those of Boyle and those of Carl Banks, a known mob hit-man. The corpse of the missing CHIS is discovered. When Hastings orders Arnott to investigate Davidson, Arnott informs Fleming and concludes \"Either you're our CHIS or you're embedded as a UCO (undercover officer). That's why I'm giving you a heads-up, Kate.\" She refuses to commit due to conflicting loyalties.—KGF Vissers"], "genres": "N/A", "imdbID": "7814142", "rating": 7.7, "votes": 1476, "number_of_episodes": 37}