{"cast": {"0001160": "Adrian Dunbar", "1161994": "Martin Compston", "5647934": "Shalom Brune-Franklin", "3531173": "Anneika Rose", "0531808": "Kelly Macdonald", "1186830": "Perry Fitzpatrick", "0566049": "Vicky McClure", "2196406": "Nigel Boyle", "0853583": "Owen Teale", "1450877": "Andi Osho", "0182688": "George Costigan", "2381142": "Amy De Bhrún", "2373081": "Prasanna Puwanarajah", "0725830": "Elizabeth Rider", "0080372": "Ace Bhatti", "4953780": "Gregory Piper", "8490593": "Matthew Forsythe", "8142076": "Rosa Escoda", "3307735": "Michael Yare", "0049346": "Patrick Baladi", "9742341": "Garry Harper", "0767675": "Jimmy Savile"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["AC-12 suspect a cover-up as an officer on DCI Davidson's team appears to have sabotaged the inquiry into Gail Vella's murder.", "Having opened an official inquiry into DCI Jo Davidson and Operation Lighthouse, AC-12 begin to suspect a cover up. Steve and Chloe dig into Gail Vella's controversial reporting for clues to her murder, and find links to previous AC-12 cases. Their investigation takes a shocking turn when they begin to scrutinise Jo's personal life.", "Gail Vella's TV producer Nadaraja tells Arnott and Bishop learn that she developing a podcast about high-level police corruption, and that her home had been ransacked, suggesting an OCG hit, yet Davidson 'ignored' both. PC Ryan Pilkington replaces PS Jatri, who requests a transfer for personal reasons. Carl Banks's corpse's condition indicates an OCG execution, with a knife nearby containing the dead CHIS's fingerprints. Hastings promotes Arnott to temporary DI. Raiding Hillside Lane, AC-12 seize evidence for their investigation, but Davidson reveals she put in a request to restrict access to Operation Lighthouse documents, causing a 24-hour delay in the investigation: Arnott and Hastings realize that Fleming tipped Davidson off. After Arnott sees Hastings with Steph Corbett and drives to her house, she witnesses his suffering and need for painkillers. Davidson is summoned to an AC-12 interview and arrested, but retorts AC-12 should investigate all who had access to the CHIS's information. PS Jatri is jailed when a search of her house reveals a stash of burner phones, tearfully insists being framed and reveals her Lesbian with Davidson. Released, Davidson drives herself alone to take delivery of another burner phone, distraught.—KGF Vissers"], "genres": "N/A", "imdbID": "7814144", "rating": 8.1, "votes": 1187, "number_of_episodes": 37}