{"cast": {"0001505": "Joe Mantegna", "0005460": "Mary Steenburgen", "0848554": "Amber Tamblyn", "0728762": "Jason Ritter", "0919616": "Michael Welch", "0549815": "Christopher Rodriguez Marquette", "0906345": "Becky Wahlstrom", "0688624": "Sydney Tamiia Poitier", "0519366": "Mitch Longley", "0005006": "Elaine Hendrix", "0604608": "Derek Morgan", "0385391": "Aaron Himelstein", "0233562": "David Dorfman", "0001959": "Corinne Bohrer", "0052186": "Jonathan Banks", "0502001": "Dinah Lenney", "0465664": "Thomas Kopache", "1075911": "Avery Clyde", "0786879": "William Seymour", "0700793": "David Purdham", "1033193": "Mageina Tovah", "0319304": "Mary Gillis", "0334560": "David Grammer", "1490218": "Gabriel Cordell", "0008813": "Andrew Ableson", "0843388": "Kevin Symons", "2385240": "Catherine Petra Villalobos"}, "geners": ["Comedy", "Crime", "Drama", "Fantasy"], "runtimes": 0,  "plot": ["God appears to Joan as Rocky, the young boy that she babysat with Cystic Fibrosis. He asks her to read the paper and it turns out to be his obituary. At the cemetery after the funeral, Joan and her mom run into Adam and his father. When Joan learns how Adam's mother died and that Adam is no longer making his art she becomes concerned. Meanwhile the Chief is feeling the ramifications of the FBI corruption investigation. The governor dissolves the city government of Arcadia including the police force and the Sheriff's office will be taking over. While the Sheriff makes Will a job offer, he'd rather do something he's more suited to but there's the problem of supporting his family. Further complicating things, Kevin has finally decided to get back into sports with wheelchair basketball but ends up in the hospital. There he encounters his boss and they finally acknowledge the sexual tension between them. Finally, there's Luke who has to find a new science fair project after is computer is seized by the FBI as part of their investigation.—Havan Ironoak"], "genres": "N/A", "imdbID": "0616120", "rating": 9.1, "votes": 100, "number_of_episodes": 45}