{"cast": {"0001505": "Joe Mantegna", "0005460": "Mary Steenburgen", "0848554": "Amber Tamblyn", "0728762": "Jason Ritter", "0919616": "Michael Welch", "0106755": "Patrick Breen", "0501210": "Kris Lemche", "0121652": "David Burke", "0171583": "Ivonne Coll", "0648339": "Morocco Omari", "0857275": "Deborah Theaker", "0512616": "Stephi Lineburg", "0644172": "Baadja-Lyne Odums", "0063800": "Noah Bean", "1167195": "Spencer Redford", "0132656": "Larkin Campbell", "1484343": "Kimberly Jeppson", "0562848": "Billy Mayo", "0625306": "Dee Nelson", "0005292": "Erik Palladino", "1036014": "Justin Scot", "0798620": "Ruth Silveira", "0316878": "Cal Gibson"}, "geners": ["Comedy", "Crime", "Drama", "Fantasy"], "runtimes": ["60"],  "plot": ["Joan Girardi thinks she hears someone calling to her in her room in the middle of the night, while her police-chief father Will is investigating a murder of a woman. The next day, Joan sees someone spying on her from their yard and Will wonders if it was the murderer, who left behind no clues but a footprint. On the city bus toward school, Joan is approached by a boy about her own age who apologizes for startling her that morning, knows many details about her life - and claims that he is God and wants her to apply for a job at a bookstore in town. Will, trying to learn more about the killer who has struck again, is also trying to reconcile with the fact that his son Kevin won't end up living a life playing sports as they both hoped since the accident that cost him his ability to walk, but his wife Helen wants to see her son move on and figure out what he now wants to do with his life. Joan asks her science-obsessed brother Luke if he believes in God, but he thinks the conversation isn't worth hearing when she wonders if he could be an attractive boy. However, God takes on another form to reach her, and encourages her to do what SHE requested, and leaving her with the choice of what to believe and what to do.—brainybrailler@comcast.net"], "genres": "N/A", "imdbID": "0616128", "rating": 8.0, "votes": 142, "number_of_episodes": 45}