{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0280559": "Leo Fitzpatrick", "0412907": "J.D. Williams", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0931324": "Michael Kenneth Williams", "1307291": "Tray Chaney", "0335723": "Wendy Grantham", "0430107": "Michael B. Jordan", "0216257": "Delaney Williams", "0112343": "Maria Broom", "0467512": "Michael Kostroff", "0629517": "Melanie Nicholls-King", "1725448": "Michael Salconi", "0313462": "Jarvis W. George", "0404924": "Michael Hyatt", "2875569": "Curtis Montez", "1394510": "Edward T. Norris", "1555324": "Benay Berger", "0003494": "Doug Olear", "0739184": "Susan Rome", "0773205": "Stephen F. Schmidt", "1737054": "Perry Blackmon", "0123148": "Pete Burris", "0171348": "Robert F. Colesberry", "0193016": "Terrence Currier", "0213067": "Richard DeAngelis", "5272896": "Larry Derr", "0372542": "De'Rodd Hearns", "2289684": "Mike Lavoie", "0507839": "Toni Lewis", "0671618": "Kirk Penberthy", "2940634": "Eric Ryan", "5609038": "Aaron J. Savage", "2092563": "William Shipman", "0873825": "Dave Trovato", "0923821": "Gary Wheeler"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["66"],  "plot": ["Due to the camera at Orlando's, the detail gather enough information to arrest Avon and many of his people, but, with Wallace dead, they are unable to bring charges against Stringer, who's left on the street. However, disgusted that Avon and Stringer had Wallace killed, D'Angelo flips on the entire organization, giving the detail more information than they could have ever hoped for. As Daniels figures out who the snitch is in the unit, Herc is shocked when he is passed over for promotion in favor of Carver, who scored lower on the sergeant's exam. In Philadelphia, Wee-Bey is arrested and gladly admits to murder after murder. Finally figuring out why Avon has been buying vacant properties in the city, Daniels, McNulty, Freamon and Pearlman take their evidence of political involvement to the FBI. Meanwhile, D'Angelo's mother, Brianna (Michael Hyatt), attempts to convince him to stand with the family.—Bertaut", "Greggs comes out of her coma and manages to identify one of the shooters. She won't play the game of fingering the second shooter, because she didn't see him. The police are rounding up the lower echelons of Barksdale's distribution empire. Bunk and Daniels visit D'Angelo in his New Jersey jail to see what information they might get from him about the murders. He's ready to tell them what he knows but a visit from his mother, Avon's sister, changes his mind. With their investigation coming to an end, McNulty suggests that they take what they have to Feds and Daniels agrees. They don't like what hey hear however. Daniels identifies the snitch in his unit who has been keeping the Deputy Chief informed of their activities. McNulty has a meeting Major Rawls who tells him of his fate.—garykmcd"], "genres": "N/A", "imdbID": "0749441", "rating": 9.0, "votes": 6586, "number_of_episodes": 60}