{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0412907": "J.D. Williams", "0280559": "Leo Fitzpatrick", "0931324": "Michael Kenneth Williams", "0430107": "Michael B. Jordan", "0495831": "Clayton LeBouef", "0216257": "Delaney Williams", "0070359": "Nat Benchley", "1725373": "Shamyl Brown", "1307291": "Tray Chaney", "0335723": "Wendy Grantham", "1248017": "Michael Kevin Darnall", "2875569": "Curtis Montez", "0696808": "Brandon Price", "1237025": "Lance Williams", "0479903": "Aaron Michael Lacey", "2119390": "David L. Marston", "5609038": "Aaron J. Savage", "0810555": "David J. Smolar", "0823507": "Fredro Starr", "0906526": "Angel M. Wainwright", "2934731": "Keith Waters"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["60"],  "plot": ["McNulty's detail finally gets 'clone' pagers to track Barksdale and his gang, but nobody can crack the codes used by the callers.", "Avon Barksdale is becoming paranoid and thinks he's being watched. He's also worried his phone is being tapped. He also thinks there's a snitch in D'Angelo's crew and he's told not to pay anyone until it's sorted. D'Angelo isn't too pleased when he hears Avon has given Stinkum a new territory. Judge Phelan visits the squad to sign the warrants to clone D'Angelo Barksdale's pager. The numbers they're collecting are coded and don't make much sense. Det. Prez Pryzbylewski figures it out however. McNulty and Greggs try to get information from Omar.—garykmcd", "As Avon becomes concerned about his security, Omar moves his operation to the Eastside. Bubbles visits Johnny, but is disturbed by what he finds. Phelan and ASA Ronda Pearlman (Deirdre Lovejoy) approve the detail's affidavit for cloning D'Angelo's pager, plus pen-registers on the pit pay-phones, but the team are puzzled at the nonsensical results. However, Prez begins to redeem himself in the eyes of his colleagues by decrypting the code used in the messages. Stringer warns D'Angelo there may be a snitch in his crew, and outlines a plan to snare them, as he and Avon prepare to take over new territory. Meanwhile, Landsman's instincts on the old murder case prove correct, as the coroner connects the murder to two previous Westside drug executions. Following up on this new information, the detail learns Avon is using a strip club as a front. Later, when McNulty and Greggs tail Omar, they are surprised where he leads them.—Bertaut"], "genres": "N/A", "imdbID": "0749450", "rating": 8.2, "votes": 6269, "number_of_episodes": 60}