{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0732494": "Corey Parker Robinson", "0430107": "Michael B. Jordan", "0412907": "J.D. Williams", "1307291": "Tray Chaney", "0213067": "Richard DeAngelis", "1725448": "Michael Salconi", "0467512": "Michael Kostroff", "0629517": "Melanie Nicholls-King", "0216257": "Delaney Williams", "2011783": "Chris Clanton", "2892364": "Micaiah Jones", "2875569": "Curtis Montez", "1179565": "Tony D. Head", "0495831": "Clayton LeBouef", "1394510": "Edward T. Norris", "0830361": "Dick Stilwell", "2891084": "Katana Lazet Hall", "0739184": "Susan Rome", "0933096": "Brian Anthony Wilson", "0933461": "Christopher Glenn Wilson", "1443243": "James E. Ash", "0171348": "Robert F. Colesberry", "1040046": "Derren Fuentes", "2868656": "John Holt Hall", "2218134": "Julian Salazar"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["56"],  "plot": ["While Greggs' life hangs in the balance, the entire department attempts to hunt down Savino. When Wallace flips, willing to testify that Stringer, Wee-Bey and Bird killed Brandon, Daniels stashes him in his grandmother's house on the outskirts of the city, but he soon becomes restless. Stringer tells Wee-Bey he needs to get out of Baltimore until the Savino investigation cools off, while Avon considers his next move. When McNulty and Pearlman try to pressure Levy into giving up Savino, he proves smarter than they gave him credit for. Meanwhile, when the detail's hand is forced, and a series of city-wide raids are ordered so as to appease Burrell's desire for \"dope on the table,\" McNulty goes to see Phelan for help, but is surprised at his reaction. Daniels decides not to raid the main Barksdale stash house, but when word of his plan gets back to Burrell, he realizes there is a snitch in the detail. Elsewhere, Bubbles finds it increasingly difficult to stay clean.—Bertaut", "With Greggs in the hospital on life support, the police pull out all of the stops in searching for the shooters. They start by bringing in the go-between who led Orlando and Greggs into the trap but find they actually have little to charge him with. McNulty is blaming himself for all that's happened and Major Rawls is surprisingly supportive of him. Greggs' fellow officers are all keen to find her shooters but the Commissioner wants to stage huge raids, including one on the recently discovered stash house. Daniels and McNulty realize that someone in the squad is feeding information to the Deputy Chief. D'Angelo thinks he's had it when Stringer sends him off on an errand with Wee-Bay. Wallace meanwhile is living at his grandmother's but is staying in contact with his friends the pit.—garykmcd"], "genres": "N/A", "imdbID": "0749449", "rating": 8.8, "votes": 6212, "number_of_episodes": 60}