{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0280559": "Leo Fitzpatrick", "0412907": "J.D. Williams", "0425215": "Hassan Johnson", "0732494": "Corey Parker Robinson", "0247351": "Steve Earle", "0430107": "Michael B. Jordan", "0931324": "Michael Kenneth Williams", "0112343": "Maria Broom", "1725448": "Michael Salconi", "0216257": "Delaney Williams", "1307291": "Tray Chaney", "0495831": "Clayton LeBouef", "0696808": "Brandon Price", "0712603": "Donnell Rawlings", "2824088": "Jimmie Jelani Manners", "0593541": "Lizan Mitchell", "0805037": "Robin Skye", "0823507": "Fredro Starr", "0171348": "Robert F. Colesberry", "0265431": "Tony Fair", "1152833": "Christopher H. Myers", "0926086": "Isiah Whitlock Jr."}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["59"],  "plot": ["Tipped off by the wire, Greggs, Herc, Carver, and Freamon make a bust, but the incident makes Avon and Stringer suspicious.", "Burrell reluctantly sides with Daniels in the disagreement with Rawls, giving the detail more time to make a case against Avon, despite his fears the operation is beginning to sprawl. McNulty and Pearlman present the detail's findings to Phelan, who signs an affidavit for a further thirty days of electronic surveillance. Using information from the wire on the pit pay-phones, the detail catch a runner on his way to the pit with a re-up. However, they elect not to arrest the driver, Anton 'Stinkum' Artis (Brandon Price), so as to avoid giving up their evidence in the charging documents. Stinkum's apparent free pass from the police convinces Avon and Stringer that their operation has been compromised, and Stringer introduces a new set of operating procedures. Rawls gives Det. Michael Santangelo (Michael Salconi) a choice; acquire information that he can use against McNulty or solve some of the department's open homicides, whilst the owner of Avon's strip club, Wendell 'Orlando' Blocker (Clayton LeBouef), has a proposal for D'Angelo. Meanwhile, Bubbles and Johnny attend an NA meeting, and Bubbles is moved by a speech given by recovering addict Walon (Steve Earle). Investigating the murder of the witness in D'Angelo's trial, with some help from Omar, the detail target Barksdale hitman Marquis 'Bird' Hilton (Fredro Starr).—Bertaut", "The squad decide to make an arrest when their taps reveal that the low-rise projects are about to be re-supplied. They get the runner and as planned, let Avon's man Stinkum get away. Avon is convinced there is a snitch in the pit but D'Angelo days everyone is clean. They decide to change their routine which messes up the police wiretaps. Major Rawls keeps the pressure on and McNulty knows he has only a week to report back to the homicide squad or he's out. Rawls is also after Det. Santangelo to either come up with useful information on McNulty or start clearing cases. He chooses the latter but his own way of going about it. McNulty and Bunk make an arrest in their murder case.—garykmcd"], "genres": "N/A", "imdbID": "0749438", "rating": 8.4, "votes": 6061, "number_of_episodes": 60}