{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0931324": "Michael Kenneth Williams", "0412907": "J.D. Williams", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0430107": "Michael B. Jordan", "0732494": "Corey Parker Robinson", "0213067": "Richard DeAngelis", "1725448": "Michael Salconi", "0216257": "Delaney Williams", "0070359": "Nat Benchley", "0704015": "Tom Quinn", "0335723": "Wendy Grantham", "0112960": "Al Brown", "1179565": "Tony D. Head", "0696808": "Brandon Price", "1307291": "Tray Chaney", "0003494": "Doug Olear", "1248017": "Michael Kevin Darnall", "1237025": "Lance Williams", "1743485": "William F. Zorzi", "1202270": "Enrique Chicas", "2875569": "Curtis Montez", "4004720": "Aaron Moss", "2353855": "Rob Stull"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["55"],  "plot": ["The early-morning 'field interviews' by Herc, Carver, and Prez result in a minor riot.", "After two weeks on the job, the team still doesn't have a photo of their principal target, Avon Barksdale. Freamon has a solution when he hears Avon was a Gold Gloves boxer. In the aftermath of the near riot at the towers, Lt. Daniels stands by his men even though he thinks they were stupid to do what they did. He's ordered to lead a raid on the low-rise units in the projects but McNulty rebels and refuses to participate in a raid that's just being put up for show. Dissatisfied with the antiquated equipment they have to work with, McNulty asks his friend at the FBI to lend them listening devices. His friend also has some information for him about Lt. Daniels. D'Angelo isn't around when a gang led by someone called Omar robs his stash.—garykmcd", "Prez's brutal actions lead to a minor riot, bad publicity for the detail, injury to Herc, and Prez himself placed on office duty. However, when Daniels agrees to stand by Prez during the subsequent Grand Jury investigation, he gains the support of Prez's father-in-law, Southeastern District commander, Maj. Stanislaus Valchek (Al Brown), who loans the detail a surveillance van. As Maj. William Rawls (John Doman) tries to play down the witness motive in the recent murder, Daniels tells Burrell the case may take more than buy-busts to clear, but Burrell assures him he should need just three weeks to make some token arrests and put some \"dope on the table.\" However, when Burrell forces Daniels's hand regarding a raid of the pit, McNulty becomes curious as to why the crew are using pagers instead of mobile phones. Meanwhile, D'Angelo gives young dealers Wallace (Michael B. Jordan) and Preston 'Bodie' Broadus (J.D. Williams) a lesson about their place in the Barksdale hierarchy whilst teaching them to play chess, the detail gets its first look at Avon when Det. Lester Freamon (Clarke Peters) obtains an old picture, Det. Leander Sydnor (Corey Parker Robinson) goes undercover with Bubbles, and stick-up man Omar Little (Michael Kenneth Williams) and his crew take advantage of security lapses in the pit, stealing the Barksdale re-up stash.—Bertaut"], "genres": "N/A", "imdbID": "0749446", "rating": 8.1, "votes": 6766, "number_of_episodes": 60}