{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0732494": "Corey Parker Robinson", "0430107": "Michael B. Jordan", "0931324": "Michael Kenneth Williams", "0112343": "Maria Broom", "1725378": "Antonio Cordova", "0335723": "Wendy Grantham", "1944119": "Eric G. Ryan", "1307291": "Tray Chaney", "0495831": "Clayton LeBouef", "0696808": "Brandon Price", "0712603": "Donnell Rawlings", "2293252": "Jeffon Avin", "2497106": "Jerome Ro Brooks", "2011783": "Chris Clanton", "0171348": "Robert F. Colesberry", "2958837": "Denise Hart", "1179565": "Tony D. Head", "2892364": "Micaiah Jones", "0456926": "Karen Kirschenbauer"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["56"],  "plot": ["An unlikely source gives McNulty the tag of Stringer Bell's car. Later, Omar earns his 'loose cannon' reputation.", "McNulty uses his children to tail Stringer after a chance encounter in a local market, with one of them getting his license plate. As the detail discuss the implications of the pit pay-phones being disconnected, speculating the crew are going to start using phones outside their immediate area of operations, Herc and Carver prepare for the sergeant's exam. Stinkum, Roland 'Wee-Bey' Brice (Hassan Johnson), and Savino Bratton (Chris Clanton) raid Omar's pad, but he is nowhere to be found. Avon is unhappy when he learns of Orlando's proposal to D'Angelo. Meanwhile, Greggs and Carver arrest a driver picking up a large amount of cash from the towers, but are surprised to learn he is an aide to State Senator Clay Davis (Isiah Whitlock Jr.). Burrell is furious with this turn of events and confronts Daniels about the direction in which the case is heading, giving him one week to charge Avon and/or Stringer. Phelan, however, tells Burrell he wants the full thirty days of surveillance assigned by the court. As Wee-Bey and Stinkum attempt to take over new territory, they encounter an unanticipated problem.—Bertaut", "On an outing with his kids, McNulty manages to get Stringer's license plate number. Omar goes after Stinkum, who killed his boyfriend Brandon. Using information they've gotten off the wire, the squad busts someone who collects $20,000 in cash. The man turns out to a driver for someone with enough influence to get the money returned to him. The Deputy Chief hits the roof and Lt. Daniels fears for his career. He also orders the investigation shut down but Judge Phelan steps in.—garykmcd"], "genres": "N/A", "imdbID": "0749433", "rating": 8.5, "votes": 6044, "number_of_episodes": 60}