{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0861361": "Callie Thorne", "0931324": "Michael Kenneth Williams", "0412907": "J.D. Williams", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0430107": "Michael B. Jordan", "0732494": "Corey Parker Robinson", "0216257": "Delaney Williams", "0629517": "Melanie Nicholls-King", "1725448": "Michael Salconi", "1307291": "Tray Chaney", "0696808": "Brandon Price", "0704015": "Tom Quinn", "0070359": "Nat Benchley", "1248017": "Michael Kevin Darnall", "2238423": "Caroline G. Pleasant", "1725378": "Antonio Cordova", "1237025": "Lance Williams", "1782153": "Gbenga Akinnagbe", "3544362": "Philip Byron", "1889399": "Thomas Fraser", "0878424": "Kim Tuvin", "2515812": "Jeorge Bennett Watson"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["59"],  "plot": ["McNulty and Greggs try to get Hardcase to turn informant as arraignment begins for those caught in the raid.", "Bodie walks out of detention pretending to be a janitor but Patty is recovering in hospital and is pleased that his injuries will result in a medical pension. Avon Barksdale puts a contract out on Omar and others who robbed him. He wants to make sure everyone on the street knows he's not to be messed with. Judge Phelan keeps the pressure on and Daniels recommends to the Deputy that they need a wire. McNulty suggests they get a warrant to clone the pagers the drug runners use. Det. Fremon is one step ahead of everyone having already found D'Angelo Barksdale's pager number.—garykmcd", "McNulty and Greggs try to get some of the hoppers arrested during the pit raid to flip on their superiors. After punching Det. Patrick Mahone (Tom Quinn), Bodie receives a stern beating from the police. Waking up in a Washington, D.C. juvenile detention facility, he manages to escape just as Herc and Carver arrive to interrogate him. Back in Baltimore, Avon discusses the loss of the pit's re-up stash, and marks Omar and his crew for death, doubling the bounty when he learns Omar is homosexual, and fellow stick-up man Brandon Wright (Michael Kevin Darnall) is his lover. As Stringer becomes concerned there may be a snitch in the pit, Burrell tries to appease Phelan, but the judge is unimpressed with the progress made thus far. Meanwhile, Freamon has a break-through regarding the crew's use of pagers, and, acting on a tip from Sgt. Jay Landsman (Delaney Williams), McNulty and Bunk investigate an old murder in which D'Angelo may have been involved.—Bertaut"], "genres": "N/A", "imdbID": "0749437", "rating": 8.2, "votes": 6555, "number_of_episodes": 60}