{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0280559": "Leo Fitzpatrick", "0412907": "J.D. Williams", "0425215": "Hassan Johnson", "0732494": "Corey Parker Robinson", "0247351": "Steve Earle", "0430107": "Michael B. Jordan", "0931324": "Michael Kenneth Williams", "1307291": "Tray Chaney", "0335723": "Wendy Grantham", "0495831": "Clayton LeBouef", "1725448": "Michael Salconi", "2889462": "Maurice Blanding", "1160841": "Jefferson Breland", "1429854": "Robert F. Chew", "2011783": "Chris Clanton", "1737054": "Perry Blackmon", "2925459": "Stanley Boyd", "2497106": "Jerome Ro Brooks", "0204555": "Eisa Davis", "1029488": "Tyreeka Freamon", "2892364": "Micaiah Jones", "2934343": "Rico Whelchel"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["57"],  "plot": ["Barksdale plays an expensive game of one-upmanship with an east-side rival.", "D'Angelo speaks to Wallace, who tells him he wants to go back to school and get out of the Game. However, Malik 'Poot' Carr (Tray Chaney) discovers Wallace has started using cocaine to help him deal with his guilt over Brandon's murder. Freamon gets Sydnor and Prez started on the complex Barksdale money trail, including possible political connections, and they are surprised to find Avon's corporations have been buying up vacant buildings in run-down parts of the city. Greggs and Freamon approach D'Angelo's girlfriend, Shardene Ennis (Wendy Grantham), who works at Orlando's, in the hopes they can turn her into a CI. After Bubbles narrowly avoids a beating whilst stealing a package that turns out to be stepped on, he decides to try to get clean. Avon and Eastside kingpin 'Proposition' Joe Stewart (Robert F. Chew) stage the annual East vs. West basketball game, but when the detail follows Avon afterwards, they get something they never expected. Meanwhile, having already killed Stinkum, Omar sets in motion a plan to gain revenge on Avon for Brandon's death.—Bertaut", "The team begins to trace Avon Barksdale's money and find that through a variety of dummy companies, he's invested in a wide variety of businesses and properties. They also find that he's been making fairly large political contributions. Omar is continuing his vendetta and this time makes a deal that he hopes will let him get Avon himself. Whe the squad learn from the wire of another money drop, Carver and Herc are sent to intercept it. They succeed but are short $7,000 when they turn the cash in.—garykmcd"], "genres": "N/A", "imdbID": "0749429", "rating": 8.7, "votes": 6264, "number_of_episodes": 60}