{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0430107": "Michael B. Jordan", "0732494": "Corey Parker Robinson", "0335723": "Wendy Grantham", "0412907": "J.D. Williams", "1307291": "Tray Chaney", "0404924": "Michael Hyatt", "0467512": "Michael Kostroff", "0097445": "LaTonya Borsay", "1179565": "Tony D. Head", "1725448": "Michael Salconi", "0926086": "Isiah Whitlock Jr.", "1309667": "Ingrid Cornell", "0313462": "Jarvis W. George", "0731042": "Doug Roberts", "2880518": "Giselle Watts", "1040046": "Derren Fuentes", "0314739": "Joe Gerety", "2156966": "Justin Hinnant", "2387655": "Mikel Miller", "1403718": "Marcis Turner", "5281990": "Michael Way", "5738859": "Aaron Lee Wright"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["56"],  "plot": ["Kima slowly recovers in the hospital. Stringer changes operations in the pit and the towers, rendering the wiretaps and clones useless, and prompting Burrell to begin dismantling the detail. Avon and Stringer meet Levy to discuss where their organization is vulnerable. Unbeknownst to the detail, Wallace returns to the pit to resume work. When Prez starts pulling political campaign finance reports, Pearlman is called to a meeting with a worried State's Attorney, and an angry Clay Davis confronts Daniels. Meanwhile, Stringer issues a difficult order to Bodie and Poot. With Shardene's help, the detail are able to install a camera in the strip club.—Bertaut", "Stringer reorganizes everything after the raids: no telephones, no pagers and more importantly, no dope now that their main stash has been seized. Avon and Stringer start to target anyone who could do them harm and are cleaning house. Shardene gets contact lenses and agrees to wear a wire at the club. With the wire dead, the Deputy Chief wants some of the men on Daniels' squad returned to regular duties. Wallace has returned to the pit but Stringer thinks he may be the snitch they've been worried about. Everyone is getting nervous about the squad looking into campaign contributions including the DA and Senator Clay Davis. The Deputy Chief orders an end to the investigation and the arrest of Avon Barksdale. Freamon and Prez finally figure out why Avon has been buying abandoned commercial properties. D'Angelo is arrested but breaks away from Avon when he hears about Wallace.—garykmcd"], "genres": "N/A", "imdbID": "0749424", "rating": 9.1, "votes": 6765, "number_of_episodes": 60}