{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0861361": "Callie Thorne", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0425215": "Hassan Johnson", "0661449": "Neko Parham", "0732494": "Corey Parker Robinson", "0247351": "Steve Earle", "0430107": "Michael B. Jordan", "0931324": "Michael Kenneth Williams", "0335723": "Wendy Grantham", "0495831": "Clayton LeBouef", "0629517": "Melanie Nicholls-King", "1725448": "Michael Salconi", "2011783": "Chris Clanton", "0213067": "Richard DeAngelis", "0467512": "Michael Kostroff", "0216257": "Delaney Williams", "1725373": "Shamyl Brown", "1429854": "Robert F. Chew", "1394510": "Edward T. Norris", "2515812": "Jeorge Bennett Watson", "0102997": "Barry Bradford", "2892364": "Micaiah Jones", "0926086": "Isiah Whitlock Jr.", "0933461": "Christopher Glenn Wilson", "2497106": "Jerome Ro Brooks", "1534784": "Bobby J. Brown", "0171348": "Robert F. Colesberry", "1017942": "Kosha Engler", "2424941": "SiSi Kache", "0479903": "Aaron Michael Lacey", "1774277": "Manuel Poblete"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["56"],  "plot": ["With Wallace in custody, McNulty and Daniels must figure out what to do with him in the time before he testifies.", "Avon, Stringer and Wee-Bey discuss how best to deal with Omar after the attempted hit on Avon, deciding to let him think they want peace, whilst secretly planning to kill him. As such, Omar and Stringer meet for a parley, with security provided by Prop Joe. Meanwhile, Stringer insists on decreasing Avon's visibility in light of the detail's attempt to follow him after the basketball game. An irritable Phelan signs an affidavit for the new phone being used by the pit crew, and Pearlman tells McNulty that he is not up for automatic re-election, possibly because of the feathers he has ruffled due to his involvement with the Barksdale case. D'Angelo tries to understand why Shardene has left him, and after being clean for three days, Bubbles gets some advice from Waylon, before turning to Greggs for support. Meanwhile, McNulty attempts to flip Wallace, and the detail identifies Barksdale's main stash house. However, when Orlando's attempt to purchase weight gets him a lot more than he bargained for, Burrell sees an opportunity for a dangerous undercover operation.—Bertaut", "Orlando is still itching to get in on the action and tries to make a buy only to find that the seller is actually an undercover State policeman. Once arrested, he's keen to make a deal and finger Avon Barksdale. At the same time, the Deputy Chief is fed up with the length and growing complexity of the investigation and orders Lt. Daniels to set up a drug buy using Orlando as the go between. Daniels isn't too keen feeling they will get a conviction with the information from the wire. Greggs accompanies Orlando on the buy but walks into a trap. Greggs' confidential informant, Bubbles, has gone three days without drugs and decides to try and go straight. Omar meanwhile decides to get out of town for a while and goes to New York. McNulty reaches out to Wallace when he hears the young man was shaken by Brandon's killing.—garykmcd"], "genres": "N/A", "imdbID": "0749447", "rating": 9.2, "votes": 7215, "number_of_episodes": 60}