{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0280559": "Leo Fitzpatrick", "0412907": "J.D. Williams", "0430107": "Michael B. Jordan", "0732494": "Corey Parker Robinson", "0931324": "Michael Kenneth Williams", "0070359": "Nat Benchley", "0213067": "Richard DeAngelis", "1725448": "Michael Salconi", "0216257": "Delaney Williams", "1248017": "Michael Kevin Darnall", "0335723": "Wendy Grantham", "0467512": "Michael Kostroff", "2238423": "Caroline G. Pleasant", "1725378": "Antonio Cordova", "1394510": "Edward T. Norris", "1944119": "Eric G. Ryan", "0933096": "Brian Anthony Wilson", "1307291": "Tray Chaney", "1028970": "Gil Deeble", "0217529": "Erik Dellums", "0696808": "Brandon Price", "1534784": "Bobby J. Brown", "0171348": "Robert F. Colesberry", "6651655": "Tia Latrell", "2035230": "Vito Pietanza"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["59"],  "plot": ["McNulty and Greggs ask for a delay in a murder bust in order to preserve the wiretap.", "Avon takes care of Omar's man Brandon but Wallace, who saw Brandon in the arcade, isn't too comfortable when he sees what they've done to him. Avon gives D'Angelo and Wallace a bonus for their good work. The police meanwhile get authorization to place taps for the pay phones used by D'Angelo and his crew but can only listen in when one of their suspects is using it meaning they'll have to keep the phones under constant observation. McNulty is in a tight spot when Major Rawls gives him a week to report back to his old job. When he realizes the connections McNulty's made in the various shootings, he announces he's going to arrest the Barksdales for murder and threatens to mess up the drug investigation.—garykmcd", "Brandon's mutilated body is discovered in the pit, and Wallace is left shaken when Avon rewards him for his part in identifying the victim for Stringer. McNulty tries to get back on Rawls's good side, who gives him one week to close the Barksdale case. The detail gets a wire running on the pit pay-phones, but Herc is unimpressed when he learns it can only be activated when the phones are being used by known drug suspects, meaning they must be physically watched at all times. Daniels clashes with Rawls over the approach to the murders McNulty and Bunk linked to the Barksdale organization, with Rawls wanting to get his clearance stats up by pressing weak murder charges against D'Angelo, meaning the detail would have to give up their evidence to Barksdale attorney Maurice Levy (Michael Kostroff), despite the unlikelihood of a conviction. Meanwhile, McNulty lets Omar view Brandon's body, and Johnny proves a bad influence on Bubbles.—Bertaut"], "genres": "N/A", "imdbID": "0749452", "rating": 8.5, "votes": 6441, "number_of_episodes": 60}