{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0280559": "Leo Fitzpatrick", "0412907": "J.D. Williams", "0425215": "Hassan Johnson", "0430107": "Michael B. Jordan", "0495831": "Clayton LeBouef", "0629517": "Melanie Nicholls-King", "0003494": "Doug Olear", "0216257": "Delaney Williams", "0213067": "Richard DeAngelis", "0335723": "Wendy Grantham", "0467512": "Michael Kostroff", "1725448": "Michael Salconi", "1309667": "Ingrid Cornell", "1372765": "Larry Hull", "1347017": "Lucy Newman-Williams", "2000040": "Michael Stone Forrest", "5981149": "Nikki Bell", "3409681": "Ronald P Boone Jr.", "3477619": "Kamal Bostic-Smith", "1534784": "Bobby J. Brown", "1307291": "Tray Chaney", "1202270": "Enrique Chicas", "2011783": "Chris Clanton", "0171348": "Robert F. Colesberry", "4004720": "Aaron Moss", "0696808": "Brandon Price", "1255795": "Stephen Szibler", "0931591": "Ron A. Williams"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["62"],  "plot": ["Baltimore detective Jimmy McNulty gets assigned to a new task force.", "Baltimore Det. Jimmy McNulty finds himself in hot water with his superior Major William Rawls after a drug dealer, D'Angelo Barksdale who is charged with three murders, is acquitted. McNulty knows the judge in question and although it's not his case, he's called into chambers to explain what happened. Obviously key witnesses recanted their police statements on the stand but McNulty doesn't underplay Barksdale's role in at least 7 other murders. When the judge's raises his concerns at the senior levels of the police department, they have a new investigation on their hands. Lt. Cedric Daniels is put in charge with Kima Greggs as the lead detective. As for Barksdale, he finds himself demoted to a low-level dealer after his arrest and he obviously has to prove himself yet again.—garykmcd", "Homicide detective Jimmy McNulty (Dominic West) observes the murder trial of mid-level drug dealer D'Angelo Barksdale (Lawrence Gilliard Jr.), and sees the prosecution's star witness recant her testimony. McNulty recognises drug king-pin Russell 'Stringer' Bell (Idris Elba) in court and believes he has manipulated proceedings, so he circumvents the chain-of-command by talking to the judge, Daniel Phelan (Peter Gerety), who then places pressure on the police to investigate the Barksdale drug-dealing organisation, which, McNulty claims, has gotten away with ten murders in the last year. Meanwhile, D'Angelo is welcomed home by his uncle, Barksdale patriarch Avon (Wood Harris), who's frustrated with him for placing himself in a situation where the police could charge him. Nevertheless, Avon allows him to return to work, but in what D'Angelo sees as a demotion, he is moved to a low-rise housing project known as \"the pit\". Shortly after D'Angelo commences working, homeless drug addict Reginald 'Bubbles' Cousins (Andre Royo) tutors another addict, Johnny Weeks (Leo Fitzpatrick), in an ill-conceived scam with severe consequences.—Bertaut", "In Baltimore, when the drug dealer D'Angelo Barksdale is considered not guilty by the jury in a murder case, Det. James 'Jimmy' McNulty is summoned by Judge Daniel Phelan to his office to discuss how the case was lost by the prosecutor. McNulty explains that the criminal is the nephew of the drug kingpin Avon Barksdale and the witnesses have been coerced by Avon and his right-hand Russell 'Stringer' Bell. Further, McNulty discloses that there are seven other murder cases committed by Avon's crew that have not been investigated by the Police Department. Judge Phelan contacts the Powers That Be from the Police Department that are forced to assign a team under the command of Lt. Cedric Daniels, including McNulty, to investigate the cases. But soon Lt. Daniels see that the task will not be easy with the available manpower.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0749451", "rating": 7.8, "votes": 8951, "number_of_episodes": 60}