{"cast": {"0922035": "Dominic West", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0747420": "Andre Royo", "0812308": "Sonja Sohn", "0314253": "Peter Gerety", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0676370": "Clarke Peters", "0874082": "Jim True-Frost", "0112343": "Maria Broom", "0412907": "J.D. Williams", "0425215": "Hassan Johnson", "0430107": "Michael B. Jordan", "0732494": "Corey Parker Robinson", "0704015": "Tom Quinn", "1725448": "Michael Salconi", "0216257": "Delaney Williams", "0213067": "Richard DeAngelis", "0070359": "Nat Benchley", "1725373": "Shamyl Brown", "1307291": "Tray Chaney", "0217529": "Erik Dellums", "0467512": "Michael Kostroff", "0696808": "Brandon Price", "0873825": "Dave Trovato", "1861065": "Dakota Anderson", "2011783": "Chris Clanton", "0171348": "Robert F. Colesberry", "0313462": "Jarvis W. George", "0387627": "Rodney J. Hobbs", "1372765": "Larry Hull", "2892364": "Micaiah Jones", "2824088": "Jimmie Jelani Manners", "4004720": "Aaron Moss", "5609038": "Aaron J. Savage", "1476916": "Walter Simpson III"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["58"],  "plot": ["McNulty feels the heat when a witness who testified against D'Angelo is killed.", "Lt. Daniels puts his team together but the extra help he's asked includes several less than stellar officers. It also includes McNulty, who is obviously in the doghouse. When one of the witnesses against D'Angelo Barksdale is found dead, McNulty and his homicide partner 'Bunk' Moreland bring him in for questioning. They have no evidence that he had anything to do with the killing but their instincts tell them otherwise. When news of the witnesses death hits the press, Major Rawls is convinced that McNulty is again responsible. Three of the newly assigned detectives, Hec, Prez and Carver decide to go to the towers and flex a little muscle only to have it turn into a major disaster.—garykmcd", "The witness who testified against D'Angelo is killed and the Barksdale organization is suspected. In light of Phelan's pressure, a detail is formed to investigate their activity in the towers and the pit. However, the detail's lieutenant, Cedric Daniels (Lance Reddick), is concerned with the quality of the team assigned by Deputy Commissioner of Operations Ervin Burrell (Frankie Faison), while McNulty is unimpressed with the department's plan for the investigation, believing the approach of \"buy busts\" won't get them anywhere near the high-ranking members of the organization. The operation begins with Daniels's protégé, Det. Shakima Greggs (Sonja Sohn), using Bubbles to identify who's who on the street. Meanwhile, McNulty and his partner, Det. William \"Bunk\" Moreland (Wendell Pierce), try an unusual interrogation approach with D'Angelo, whilst Burrell tries to keep the death of the witness out of the press. Later, Daniels's suspicions about the detail prove correct when an unauthorized late-night foray into the towers by Det. Thomas \"Herc\" Hauk (Domenick Lombardozzi), Det. Ellis Carver (Seth Gilliam) and Ofc. Roland \"Prez\" Pryzbylewski (Jim True-Frost) goes awry.—Bertaut", "When the witness that accused the drug dealer D'Angelo Barksdale in court for committing the murder is found dead, Det. McNulty leaks the information to Judge Phelan that releases the information to the press. Lt. Daniels sets his worthless team in motion while trying to get better detectives for the investigation. Meanwhile Det. McNulty and his partner Det. William 'Bunk' Moreland bring D'Angelo Barksdale to the Police Department to press him to be whistle blower and disclose the murderer in his organization that killed the witness.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0749448", "rating": 8.2, "votes": 7232, "number_of_episodes": 60}