{"cast": {"0922035": "Dominic West", "0061777": "Chris Bauer", "0070115": "Paul Ben-Victor", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0676370": "Clarke Peters", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0752407": "Amy Ryan", "0812308": "Sonja Sohn", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0874082": "Jim True-Frost", "0710447": "James Ransone", "1032567": "Pablo Schreiber", "1059240": "Kristin Proctor", "0861361": "Callie Thorne", "0931324": "Michael Kenneth Williams", "0112960": "Al Brown", "1726292": "Richard Burton", "1836096": "S. Robert Morgan", "0002474": "Charley Scalies", "0216257": "Delaney Williams", "1725373": "Shamyl Brown", "0178228": "Luray Cooper", "0533053": "Michael Mack", "0615112": "Kevin Murray", "1556708": "Ernest Waddell", "1731346": "Kelli R. Brown", "1731401": "Edwina Findley", "0282436": "Keith Flippen", "0305288": "Jon Garcia", "1407380": "Tel Monks", "1443243": "James E. Ash", "0070359": "Nat Benchley", "3388872": "Eric Buarque", "0152918": "Antonio D. Charity", "1202270": "Enrique Chicas", "1725378": "Antonio Cordova", "0217529": "Erik Dellums", "2239487": "R. Andrew Doan", "0330301": "Jeffrey Pratt Gordon", "2119390": "David L. Marston", "0629517": "Melanie Nicholls-King", "2106400": "Jonathan Pope", "0714720": "Jill Redding", "1944119": "Eric G. Ryan", "1179698": "Jonathan Watkins", "0926086": "Isiah Whitlock Jr."}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["58"],  "plot": ["Lt Cedric Daniels lets it be known he is going to leave the department. McNulty pursues the identity of the Jane Doe found floating in the harbor. A pair of young longshoremen, Frank Sobotka's son Ziggy and nephew Nick, heist a container and sell its contents, digital cameras, to men working for The Greek.—Anonymous", "Freamon and Moreland have been put in charge of the of the suffocated women case. They travel to Philadelphia to interview the ship's crew but language proves to be a major barrier. Jimmy continues his own informal investigation into the women's death but his former partners are a few steps ahead of him. Lt. Cedric Daniels has been put in charge of the evidence room but tells Jimmy McNulty he'll soon be retiring. Officer Russell is detailed to Baltimore homicide as liaison with the port police. Major Valchek has to deal with the missing surveillance van. The investigation into Sobotka is leaderless and Valchek confronts acting Commissioner Burell. Under orders from Avon Barksdale, Stringer Bell Bell sets up the prison guard whose been causing him grief. Nick Sobotka is under financial pressure so he and his cousin Ziggy hijack a truckload of electronics which they sell to the Greek.—garykmcd", "Concerned over how to provide for his girlfriend and their daughter, Sobotka's nephew Nick (Pablo Schreiber) reluctantly joins his errant cousin Ziggy (James Ransone) in stealing containers for the Greeks. Having returned to Baltimore, Omar recruits an unusual new crew. Bunk and Freamon are assigned the Jane Does, assisted by Russell. Meanwhile, having spoken to Prez, Valchek realises Burrell has assigned humps to his Sobotka detail, and threatens to disrupt Burrell's campaign for promotion unless a new detail is assembled. In prison, Avon goes to extreme measures to deal with a CO who is hassling Wee-Bey and selling drugs to inmates.—Bertaut"], "genres": "N/A", "imdbID": "0749432", "rating": 8.0, "votes": 5175, "number_of_episodes": 60}