{"cast": {"0922035": "Dominic West", "0061777": "Chris Bauer", "0070115": "Paul Ben-Victor", "0231283": "John Doman", "0252961": "Idris Elba", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0676370": "Clarke Peters", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0752407": "Amy Ryan", "0812308": "Sonja Sohn", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0874082": "Jim True-Frost", "0710447": "James Ransone", "1032567": "Pablo Schreiber", "0112960": "Al Brown", "0629517": "Melanie Nicholls-King", "0412907": "J.D. Williams", "0216257": "Delaney Williams", "0039317": "Chris Ashworth", "0178228": "Luray Cooper", "1724278": "Jeffrey Fugitt", "0713209": "Bill Raymond", "1563373": "Teddy Cañez", "1407380": "Tel Monks", "3231115": "The Nighthawks", "0634753": "Elisabeth Noone", "0002474": "Charley Scalies", "2482617": "Harold J. Abell Sr.", "0046087": "Jennifer Badger", "1737054": "Perry Blackmon", "1726292": "Richard Burton", "2095248": "Jeffrey Coleman", "0171348": "Robert F. Colesberry", "0330301": "Jeffrey Pratt Gordon", "0339580": "J. Valenteen Gregg", "0372542": "De'Rodd Hearns", "0397173": "Bus Howard", "1620679": "Kevin Jiggetts", "1087200": "Doug Lory", "1705425": "Jeremy Nichols", "0671420": "Richard Pelzman", "2845800": "David Peters", "2106400": "Jonathan Pope", "0714720": "Jill Redding", "1632771": "Avo Shirazee", "1745029": "Addison Switzer", "2934343": "Rico Whelchel", "2752006": "Jonathan D. Wray"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["59"],  "plot": ["Detective Jimmy McNulty--exiled to police boat duty--makes a shocking discovery in the Baltimore harbor.", "Detective Jimmy McNulty finds the body of a woman floating in the water while carrying out his new assignment of Harbor Patrol. Major Valchek has his gift to a local parish trumped by Frank Sobotka, his rival in the local stevedores union. And on the waterfront, a shipping container destined for 'The Greek' bakes in the sun with perishable cargo.—Anonymous", "Officer Jimmy McNulty is on harbor patrol duty, the one assignment he said he didn't want. They find the body of a woman, perhaps a suicide victim, floating in the harbor. The autopsy however confirms that she was dead before she went into the water. He learns that the homicide squad has arranged for the case to be transferred to another jurisdiction but Jimmy takes care of that. Frank Sobotka is in charge of the Baltimore docks and he decides who gets what. He's paid for a new stained glass for his church - much to the chagrin of police Major Valchek who also wanted to contribute a window. He also has a deal, no doubt one of many, with someone known as The Greek about certain shipping containers. A Port police officer finds one of the Greek's containers full of dead women. Avon Barksdale is still running his drug empire from prison and he sends Stringer Bell to New York to collect a debt.—garykmcd", "The detail has been dismantled; McNulty has been demoted to the Marine Unit, Daniels is in the evidence archive dungeon, Prez is chafing at the bit in the suburbs, Greggs is stuck behind a desk in forfeiture, Carver is working traffic, Herc is back busting small-time Eastside dealers, and Sydnor has returned to auto theft. Only Freamon is where he wants to be - back in homicide, as Bunk's new partner. However, McNulty continues to make trouble; when he discovers a corpse in the harbour, he pays back the newly promoted Col. Rawls by proving city homicide bear responsibility for the investigation. Meanwhile, Valchek feels slighted when Frank Sobotka (Chris Bauer), the boss of a stevedore union, donates a more impressive gift to a local Polish church. Sobotka is determined to renew the docks, but in an effort to generate enough cash to curry political favour, finds himself smuggling containers for a Greek criminal organisation. When they fail to collect a particular container, MPA officer Beatrice Russell (Amy Ryan) finds it, discovering the horrific contents. From prison, Avon sends Stringer on a mission to New York to find out what has happened to their drug supply, which they paid for, but never received.—Bertaut"], "genres": "N/A", "imdbID": "0749428", "rating": 7.7, "votes": 5731, "number_of_episodes": 60}