{"cast": {"0922035": "Dominic West", "0061777": "Chris Bauer", "0070115": "Paul Ben-Victor", "0231283": "John Doman", "0252961": "Idris Elba", "0265670": "Frankie Faison", "0319142": "Lawrence Gilliard Jr.", "0365445": "Wood Harris", "0522479": "Deirdre Lovejoy", "0676370": "Clarke Peters", "0682495": "Wendell Pierce", "0714698": "Lance Reddick", "0752407": "Amy Ryan", "0812308": "Sonja Sohn", "0319121": "Seth Gilliam", "0518511": "Domenick Lombardozzi", "0874082": "Jim True-Frost", "0710447": "James Ransone", "1032567": "Pablo Schreiber", "0404924": "Michael Hyatt", "0713209": "Bill Raymond", "0112960": "Al Brown", "0425215": "Hassan Johnson", "0216257": "Delaney Williams", "0112343": "Maria Broom", "0178228": "Luray Cooper", "0217529": "Erik Dellums", "0002474": "Charley Scalies", "0039317": "Chris Ashworth", "2424498": "Gerard Ender", "1724278": "Jeffrey Fugitt", "0947092": "Brook Yeaton", "0070359": "Nat Benchley", "0152918": "Antonio D. Charity", "2095248": "Jeffrey Coleman", "0171348": "Robert F. Colesberry", "1615536": "Paul D'Elia", "1676527": "Kelvin Davis", "1472646": "Leslie Elliard", "0330301": "Jeffrey Pratt Gordon", "2365051": "Bill Heneghan", "0397173": "Bus Howard", "2119390": "David L. Marston", "4503561": "David Ian McKendry", "1705425": "Jeremy Nichols", "0714720": "Jill Redding", "1488137": "Jennifer Rouse", "1775221": "Schuster Vance", "0916100": "E. Parker Webb", "0932407": "Michael Willis"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["59"],  "plot": ["Major Valchek gets back at Sobotka for the church gift fiasco, and a feud begins. Avon Barksdale continues to run his empire from a prison cell. On the waterfront, Port Police Officer Beatrice Russell gets stuck investigating the contraband in the The Greek's container. McNulty lends a hand with the investigation.—Anonymous", "Frank Sobotka is not happy about the deaths of the 13 women in the shipping container. He pays a visit to the Greek who provides him a dose of reality. There seems to be little interest in investigating the deaths after its ruled that they all suffocated and are therefore accidental deaths. It leaves the paperwork in the hands of port police officer Beatrice Russell, who discovered the bodies. McNulty thinks the woman he found floating in the harbor may be related to the case and discovers the the air pipe into the container was purposely crushed. Suddenly, there are 14 murders to solve and no jurisdiction wants to take it on. Meanwhile, Major Valchek approaches Sobotka about the stained glass window but unable to get him to come around to his way of thinking, mounts an investigation into the union local's activities.—garykmcd", "With the authorities believing the deaths of the thirteen women in the container to be accidental, Russell is assigned the case instead of a CID detective. McNulty digs a little deeper, however, and again ensures the case goes back to city homicide, much to the entire department's chagrin. Meanwhile, Valchek strikes a deal with Burrell; in return for supporting Burrell's aspirations for promotion, Valchek asks him to set up a detail to investigate Sobotka. From prison, Avon secures a new drug supply from Atlanta. However, his relationship with D'Angelo is becoming strained.—Bertaut"], "genres": "N/A", "imdbID": "0749425", "rating": 8.1, "votes": 5335, "number_of_episodes": 60}