{"cast": {"0000190": "Matthew McConaughey", "0000437": "Woody Harrelson", "1157358": "Michelle Monaghan", "0693446": "Michael Potts", "0457796": "Tory Kittles", "0070115": "Paul Ben-Victor", "0761587": "Jay O. Sanders", "3827455": "Lili Simmons", "0924154": "Shea Whigham", "3561942": "Gabe Begneaud", "2684369": "Kerry Cahill", "6314814": "December Ensminger", "0263625": "JD Evermore", "4009721": "Henry Frost", "4158239": "Dana Gourrier", "0352513": "Rio Hackford", "6314815": "Tim Hanks", "0381043": "Louis Herthum", "1775520": "Tony Molina Jr.", "3929195": "Erin Moriarty", "1282278": "Tom O'Connell", "2227898": "Daniel Ross Owens", "1767737": "Azure Parsons", "3276835": "Brighton Sharbino", "0947742": "Don Yesso", "5815595": "Janet Lynn Carey", "5646304": "Sadarias Harrell", "5732089": "Amanda McElroy", "5732100": "Art McElroy", "5716568": "Peter Mortillaro", "5890344": "Andrew j Spinks", "6314385": "Sarah Stout"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["59"],  "plot": ["Cohle's activities in 2002, when his partnership with Hart disintegrated and he quit the force, are recalled by Maggie.", "Martin tells Detectives Gilbough and Papania that back in 2002, Cohle started investigating something he wasn't aware of. Their last case as partners was that of Charmaine Boudreau who killed her child. Cohle gets a confession out of her but Martin thinks it contributed to his deteriorating condition. Cohle was in fact pursuing a lead about the Tuttle schools, an initiative to provide Christian education as an alternative to public schools. He learns that back in 1988, there had been accusations of child molestation at the school. Kelly, the girl he and Martin rescued from Reggie Ledoux in 1995, tells him of another man with scars who made her watch what they did to the boy who was held prisoner with her. Cohle is convinced that killings are going unreported or unconnected and that they simply didn't get everyone involved in the Dora Lang killing in 1995. When he starts talking conspiracy and the possible involvement of Billy Lee Tuttle his commander, Maj. Leroy Salter, shuts him down. In the present day, the detectives also question Maggie, now long-divorced from from Martin, about what Cohle might have been up to in 2002. She's had no contact with Cohle since that time and has positive recollections about him. In fact, an incident involving the three of them led directly to the breakup of her marriage and the two detectives as partners.—garykmcd"], "genres": "N/A", "imdbID": "2790238", "rating": 9.2, "votes": 25652, "number_of_episodes": 31}