{
  "cast": {
    "0186505": "Bryan Cranston",
    "0348152": "Anna Gunn",
    "0666739": "Aaron Paul",
    "0606487": "Dean Norris",
    "1336827": "Betsy Brandt",
    "2666409": "RJ Mitte",
    "1362980": "Max Arciniega",
    "0468697": "John Koyama",
    "2916821": "Shane Marinson",
    "2944601": "Jason Byrd",
    "1753919": "Anthony Wamego"
  },
  "geners": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "runtimes": [
    "48"
  ],
  "plot": [
    "Walter and Jesse scramble to deal with the consequences of their first cook, leading to a tense and unexpected dilemma. Meanwhile, Skyler grows suspicious of Walter's strange behavior.",
    "Walt and Jesse manage to get their RV - the mobile meth lab - pulled out of the ditch but face another problem when they realize that Krazy-8, one of their attackers, is still breathing. They face grim choices and losing the coin toss, Walt is the one who has to get rid of him while Jesse will have to get rid of the dead Emilio's body. Walt's wife Skyler is puzzled by her husband's strange behavior and begins snooping, starting with his laptop. Demanding to know what is going on, Walt tells her her Jesse sells him marijuana. She confronts Jesse - just as he is removing Emilio's body from the RV. The day gets worse when Jesse ignores Walt's very specific instructions on how to get rid of the body.—garykmcd",
    "Walter and Pinkman have a big problem with the corpses of Krazy-8 and his cousin Emilio. Walter plans to dispose them using acid to get rid of the bodies. But the problem increases when Krazy-8 awakes dazed and confused and flees from Pinkman's house. Meanwhile Skyler finds Walter's attitude strange and snoops his notebook, finding Pinkman's address. She presses Walter and he says that he buys marijuana with Pinkman. Skyler goes to his house when he is transporting Emilio's body from the RV to his house. She threatens Pinkman if he continues to sell marijuana to her husband. Walter returns to Pinkman's house with Krazy-8 but he does not have enough courage to execute him. Meanwhile Pinkman does not follow Walter's instructions to use acid in a plastic container and has a huge surprise at home.—Claudio Carvalho, Rio de Janeiro, Brazil"
  ],
  "genres": "N/A",
  "imdbID": "1054724",
  "rating": 8.6,
  "votes": 37827,
  "number_of_episodes": 62
}