{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0324134": "Adam Godley", "0372961": "Jessica Hecht", "2804503": "Matt Jones", "0827429": "William Sterchi", "0609631": "Marc Mouchet", "2611012": "Kiira Arai", "0020309": "Bill Allen", "0371128": "Loren Haynes", "2967320": "Kyle Swimmer", "2961828": "Robert Arrington", "2427168": "Frederic Doss", "2965562": "Juanita Trad", "2994640": "William T. Johnson"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["Walter and Skyler attend a party at the home of his wealthy former colleagues, reigniting tensions over his past. Meanwhile, Jesse struggles to find legitimate work.", "Jesse tries to get a regular job and put his drug dealing behind him but he finds that there are few opportunities for someone with his education and experience. Jesse tries to cook a new batch of meth but can't come anywhere near Walt's standard. After attending a birthday party at a now very rich friend's house, Walt reconnects with his one-time business partner Elliott who offers him a job. It turns out Skyler told Elliott about his condition and Walt is not very pleased. Walt Jr. tries to get someone to buy him a six-pack but is busted in the process. He calls his uncle Hank to pick him up and Hank learns from Skyler that it's Walt senior who admitted smoking marijuana. Finding his behavior bizarre, the family sets up a intervention where they all get to tell Walt what they think about the situation.—garykmcd", "Jesse looks for a honest job in sales but he has neither experience nor college education to fulfill the requirements and is offered a silly \"marketing\" position dressing a promotion plate. He sees that the drug dealer Badger, who knows him, is working in this job as part of his probation and Badger proposes to be his partner to cook high-quality crystal meth like his last batch. However, Jesse is unsuccessful and does not reach Walt's standard. Meanwhile, Skyle and Walt go to the birthday party of his former partner Elliott Schwartz, who owns the successful company Gray Matter and the name is a combination of Schwartz and While last names. They also see Elliott's wife Gretchen, who seems to have a past with Walt. Elliott proposes a job to Walt but, when he mentions the health insurance plan, Walt discovers that Skyler told his condition to Elliot and refuses the job. Skyler joins the family to say Walt's position and Kank and Marie agree with him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1054727", "rating": 8.3, "votes": 34493, "number_of_episodes": 62}