{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0190441": "Raymond Cruz", "2366374": "Steven Michael Quezada", "0784831": "Carmen Serano", "2484601": "Pierre Barrera", "1889973": "Charles Baker", "2636838": "Jesus Jr.", "1075323": "Cesar Garcia", "2964889": "Vivian Nesbitt", "2964765": "Judith Rane", "2727678": "Seri DeYoung", "0445022": "Dennis Keiffer", "4050593": "Andrea Good"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["As his illness worsens, Walter adopts a more ruthless approach to the drug trade, while Jesse struggles to keep up. Meanwhile, Skyler grows increasingly suspicious of Walter's behavior.", "Walt begins his chemotherapy and returns to cooking crystal meth with Jesse. Soon Jesse is selling their superior product on the street but he only manages to sell an ounce making each of them only $1300. Walt pushes him to be more imaginative and find a distributor to whom they can sell in bulk. Against his better judgment, Jesse approaches Krazy 8's replacement as a drug wholesaler, a big time operator named Tuco who doesn't quite do business the way he had expected. It's left to Walt to sort it all out, telling Tuco his name is Heisenberg. Walt's having a hard time dealing with his chemo and is frequently ill. DEA agent Hank traces the gas mask they found in the desert to Walt's high school and makes an arrest.—garykmcd", "Walt cooks crystal meth with Jesse and has side effects with the chemotherapy, such as vomiting, losing hair and dizziness, and Jesse notes that he has cancer. Meanwhile, janitor Hugo helps Walt at school cleaning his vomits. Jesse sells the meth in small doses and does not make enough money with his selling. Walt forces him to seek out the great drug dealer Tuco, who replaced Krazy-8 in business. However, Tuco steals the 500 g of meth in possession of Jesse and beats him, sending Jesse to the hospital with concussion and broken ribs. Meanwhile, Hank visits Walt at the high school since the gas mask was traced and pointed to the school, and he checks also Walt's lab inventory and finds that other items are missing. Hugo, who has a past record for using marijuana, takes the blame and is arrested. When Walt learns what happened to Jesse, he shaves his hair and pays a visit to Tuco, to receive his money and charge indemnity for what happened to his partner.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1054728", "rating": 9.3, "votes": 40586, "number_of_episodes": 62}