{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "1362980": "Max Arciniega", "0372961": "Jessica Hecht", "2366374": "Steven Michael Quezada", "0784831": "Carmen Serano", "2485687": "Anna Felix", "2928008": "Julia Minesci", "2005989": "Daniel Serrano"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["Walter is forced to make a life-altering decision as he and Jesse deal with the fallout of their actions. Meanwhile, Skyler's suspicions continue to grow, and Hank begins to take notice of Walter's unusual behavior.", "Jesse and Walt clean up the mess caused by Jesse's chosen method to get rid of Emilio's body. Walt still has has the dilemma of what to do with Krazy 8 who is still chained in the basement and seemingly getting better. He draws up a list of the pros and cons of killing him but actually ends up developing a rapport with him and tells him of his lung cancer. He soon realizes exactly what Krazy 8 is up to. Jess is smoking more meth than he's selling. Walt's wife Skyler is concerned that his admitted marijuana use is the cause of his recent personality change. She broaches the subject with her sister who jumps to the conclusion that it's Walt Jr. who is on grass and she gets her husband Hank, a DEA agent, to have a chat with the young man.—garykmcd", "Walter and Jesse need to clean the mess with blood and remains of Emilio in the house. Krazy-8 wakes up and tells Walter that Jesse told him about his personal life and Walter confronts Jesse that is high with Methamphetamine and leaves the house. Meanwhile, Skyler asks Marie about marijuana for her new story and Marie assumes that Walter Jr. is smoking grass and asks Hank to talk to him. Walter makes a balance whether he shall kill Ktazy-8 or not and while bringing him a sandwich, he faints in the basement. When he wakes up, he collects the pieces of the broken plate and brings a new sandwich to Krazy-8. He also brings a six-pack and engages in a conversation with Krazy-8. Walter asks him to convince him that he shall not murder the drug dealer. Walter decides to let him go but when he goes to the kitchen to catch the key of the bike lock, he notes that a piece of the plate is missing in the garbage and Krazy-8 wants to kill him. Meanwhile, Hank and DEA agents find Krazy-8's car abandoned in the desert with a bag of meth that Walter has cooked and the mask the Indian girl has found.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1054725", "rating": 8.7, "votes": 36510, "number_of_episodes": 62}