{
  "cast": {
    "0186505": "Bryan Cranston",
    "0348152": "Anna Gunn",
    "0666739": "Aaron Paul",
    "0606487": "Dean Norris",
    "1336827": "Betsy Brandt",
    "2666409": "RJ Mitte",
    "1362980": "Max Arciniega",
    "0468697": "John Koyama",
    "2366374": "Steven Michael Quezada",
    "2256387": "Marius Stan",
    "1341364": "Aaron Hill",
    "0153767": "Gregory Chase",
    "0784831": "Carmen Serano",
    "2944460": "Evan Bobrick",
    "1684152": "Roberta Marquez Seret",
    "0218713": "Christopher Dempsey",
    "2944617": "Allan Pacheco",
    "2944601": "Jason Byrd",
    "0817435": "Linda Speciale",
    "2944532": "Jesus Ramirez",
    "2944324": "Joshua S. Patton",
    "2773191": "Stephanie Marie Delgado",
    "2186394": "Ed Duran",
    "4050593": "Andrea Good",
    "1415992": "Sergio Kato",
    "2657853": "Benjamin Lax",
    "3269230": "Norm Lee",
    "2967578": "William E. Marshall",
    "2374731": "Peggy Ann O'Neal"
  },
  "geners": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "runtimes": [
    "58"
  ],
  "plot": [
    "After being diagnosed with terminal lung cancer, a struggling high school chemistry teacher makes a drastic choice to secure his family's future--turning to the drug trade with a former student.",
    "Days after his 50th birthday, chemistry teacher Walter White's life of quiet desperation completely transforms when he's diagnosed with inoperable lung cancer. To support his pregnant wife and their son, he partners with Jesse, a former student, to turn an old RV into a mobile meth lab. But their first attempt at unloading their product takes a deadly turn when Jesse introduces Walt to his unstable business associates.—Anonymous",
    "In Albuquerque, New Mexico, high-school chemistry teacher Walter White lives with his pregnant wife Skyler and their handicapped teenage son Walter Jr. and has a second job at a car wash. On his 50th birthday, he faiths and is diagnosed with lung cancer, and the doctor gives the maximum of two years to live. When he asks his brother-in-law Hank Schrader, a DEA agent married to Skyler's sister Marie, if he can come with him on a drug raid, he discovers that a former student, Jesse Pinkman, is a drug dealer but he keeps the secret. Later Walter seeks Pinkman out and tells him that he wants to cook and sell crystal meth to secure his family's future, thus beginning a criminal life.—Claudio Carvalho, Rio de Janeiro, Brazil",
    "Unassuming high-school chemistry teacher Walter White discovers he has lung cancer. Desperate to secure his family's financial future, and finally free from the fear that had always inhibited him, Walt teams up with a former student to turn a used RV into a mobile drug lab.—TheDearHunter1878",
    "Walter White is a high school chemistry teacher who learns that he has lung cancer. With a new lease of life, Walter sets up a mobile meth lab with a former student and becomes a drug dealer in order to secure his family's financial security."
  ],
  "genres": "N/A",
  "imdbID": "0959621",
  "rating": 9.0,
  "votes": 51810,
  "number_of_episodes": 62
}