{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0002128": "Tess Harper", "2366374": "Steven Michael Quezada", "0091480": "Michael Bofshever", "1531180": "Kyle Bornheimer", "1264549": "Benjamin Petry", "1450145": "David House", "2726231": "Jon Kristian Moore", "2691147": "Tish Rayburn-Miller", "1889973": "Charles Baker", "2968788": "Rodney Rush", "3214766": "Robert Anthony Brass", "2743432": "Tavia Stroup"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["Walter reveals his cancer diagnosis to his family, triggering a range of emotional reactions. Meanwhile, Jesse struggles with his past as he attempts to reconnect with his parents.", "At a briefing, Hank presents his theory that Albuquerque has a new kingpin. At a barbecue, Skyler breaks down and Walter reveals to Hank, Marie and Walter, Jr. that he has cancer. Walter, Jr. doesn't respond well. The hole in Jesse's ceiling raises some questions. The meth is also making Jesse extremely paranoid. Skyler makes Walter go see a top oncologist. The doctor says it is possible to cure Walter, but it will be expensive. Walter does not want to risk leaving Skyler in debt. When Walter tries parking his car outside MESA, a narcissistic yuppie in his shiny, expensive, convertible BMW with the vanity plate \"KEN WINS\" cuts into a just-vacated square Walter was waiting for to park into. Ken's just messed with the wrong man.—Toni Tapola, Finland", "Hank and his team find Krazy-8's car abandoned in the desert with high-quality meth hidden in the panel. They have a meeting and Hank believes there is a new kingpin in Albuquerque since Krazy-8 and Emilio whereabouts are unknown. During a barbecue, Skyler forces Walt to disclose to Hank, Marie and Walt Jr. that he has lung cancer. Skyler contacts an expensive oncologist to examine Walt, and he uses the money he won selling meth to pay US$ 5,000.00 to see the doctor. He proposes an expensive treatment to Walt that may cure him with the possibility of many side effects, but Walt is worried about the debt to be paid later. Jesse visits Walt and gives US$ 4,000.00 relative to half the profit of his production of meth crystals.—Claudio Carvalho, Rio de Janeiro, Brazil", "Having finally told his wife Skyler about his lung cancer, she breaks down at a family barbecue forcing Walt to break the news to Skyler's sister, her husband Hank and his own son, Walt Jr. Skyler immediately sets about finding a top notch oncologist and is ready to pay anything for Walt's treatment; he, on the other hand, is worried about saddling his family with huge debts should the treatment be unsuccessful. Having found Krazy 8's car and a small amount of very high quality meth hidden in the dash, Hank tells his fellow DEA officers that they are likely dealing with a new crystal meth producer in the area. Jesse returns to his parents' house but finds himself in conflict with them when a joint is found in his room. Walt re-evaluates whether he should continue working with Jesse when he gets his half of the profits from their first batch of crystal meth.—garykmcd"], "genres": "N/A", "imdbID": "1054726", "rating": 8.2, "votes": 35107, "number_of_episodes": 62}