{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0190441": "Raymond Cruz", "0784831": "Carmen Serano", "1544010": "Beth Bailey", "0729060": "Geoffrey Rivas", "1450145": "David House", "1075323": "Cesar Garcia", "2636838": "Jesus Jr.", "1256275": "Mike Miller", "2618727": "Lorri Oliver", "2770822": "Kristen Loree", "2287032": "Dave Colon", "2314794": "Carrie Fleming", "0656275": "Matthew Page", "2891774": "Jacob O'Brien Mulliken", "2968678": "Charles Dowdy III", "1193643": "Samantha Anastasiou", "2705806": "Cliff Gravel", "0760923": "Clark Sanchez"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["Walter takes a bold step in expanding his operation, forcing Jesse to secure crucial supplies in a risky heist. Meanwhile, Skyler's suspicions continue to grow.", "Having made a deal with Tuco to provide him with two pounds of crystal meth the following week, Walt learns from Jesse that they may have problems getting a key ingredient. Enjoying his new Heisenberg persona, Walt delivers only half a pound to Tuco but demands the entire amount of cash with the promise that he'll deliver four pounds the following week. Jesse reels, but Walt has a plan that involves breaking into a pharmaceutical supply warehouse. Skyler's sister Marie throws a baby shower for her and her gift is a baby's tiara. Deciding that it's too extravagant, Skyler tries to return it to the store with surprising results.—garykmcd", "The DEA has a meeting at Walt's high school to say that they believe there are other people involved in the theft of the laboratory's components. Walt and Jesse have a tense meeting with Tuco in a junkyard and Walt promises the kingpin to provide four pounds of crystal meth in one week. Jesse says later that one chemical component is the neck of the bottle to make four pounds, but Walt proposes an alternative method of fabrication. But there is the need of a component, and they break into a warehouse to steal a metallic cask from a pharmaceutical company. There is a baby shower for Skyler and her sister Marie gives an expensive tiara to the baby. Skyler decides to go to the shop to pick up the money for another shopping and learns that Marie is a shoplifter. Walt learns how brutal Tuco is.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1054729", "rating": 8.8, "votes": 35292, "number_of_episodes": 62}