{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0002128": "Tess Harper", "0091480": "Michael Bofshever", "0221430": "Dan Desmond", "0452622": "Tom Kiesche", "1988958": "Drew Waters", "1851920": "Shauna McLean", "3314530": "Liam Ruggles", "2655177": "Caleb Landry Jones", "2121737": "Argos MacCallum", "3039227": "Jamie Haqqani"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["As Jesse faces the consequences of his actions, Walter struggles to keep his double life from falling apart. Meanwhile, Skyler's growing distrust pushes their marriage to the breaking point.", "Walt and Jesse appear to be in the clear but Jesse has no money and Walt can't leave the room without Skyler wondering where he is. Jesse's parents are still fed up with him and his drug use so they order him out of the house - it turns out they own it, not Jesse. He finds himself not only without a place to stay but with few friends who will put him up for the night. He ends up tracking down his RV and spends the night. Walt's overly correct behavior sets Skyler of on a binge of not telling him anything about what she's up to or who she's seeing. She's fed up with Walt's behavior and wants to know what is really going on.—garykmcd", "Jesse's parents own the house where he lives and evict him since his mother saw his laboratory in the basement. Without any money, since Hank took his bag with money, Jesse looks for a place to spend the night, but his few friends reject him. While calling Walt asking for money, Jesse's motorcycle is robbed. He goes to the place where his RV is parked and breaks into the place. However, while jumping the fence, he falls into a chemical toilet and sleeps completely dirty with a gas mask to bear his smell. Meanwhile, Skyler is estranged to Walt and goes out every day without telling him where she goes. Walt cannot leave the house to avoid making the situation worse, and Skyler is tired of the erratic behavior of Walt and feels that he is not telling the truth.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232251", "rating": 8.2, "votes": 30734, "number_of_episodes": 62}