{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0001803": "Danny Trejo", "1269983": "Krysten Ritter", "2804503": "Matt Jones", "0184086": "Christopher Cousins", "1889973": "Charles Baker", "2968788": "Rodney Rush", "0307267": "J.D. Garfield", "0856086": "Todd Terry", "1503313": "Rio Alexander", "3578462": "Jonathan Ragsdale", "1697030": "Catherine Haun", "2519097": "John Christopher Hicks", "3714202": "Gabriel Berrelleza", "3714123": "Martiniano Berrelleza Alvarado", "3134589": "Paul J. Porter", "3549411": "David T. Quan", "3180234": "Sebastian Tyler Rose"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["As Walter's growing reputation in the drug trade sparks dangerous attention, Jesse tries to prove himself as a leader. Meanwhile, Skyler makes an unexpected connection at work, and Hank struggles to adjust to his new assignment.", "Walt's been having trouble getting in touch with Jesse who's been avoiding him since his encounter with Spooge. He's also not providing product to his dealers so Walt arranges to deliver it. He learns that Jesse's reputation as a killer has spread and they're having no problem at all collecting payment. Walt decides the time has come to expand their territory and put Jesse's new reputation to good use. Skyler decides to get a job and goes back to her old employer. Hank starts his new job on the task force. He's told his wife Marie it's just a desk job but he's on the front lines and very soon learns just how dangerous it can be.—garykmcd", "Rumors fly about Jesse's recent actions as he and Walt discuss expanding their business into new territories. Hank struggles to fit in with his new co-workers in El Paso. Skyler pursues a new job opportunity that reconnects her with a former colleague. Jesse gets to know his landlord, Jane.—TheDearHunter1878", "Based on the dreadful murder of Spooge, Jesse is traumatized at home without contacting Walt. He visits Jesse, who is recovering from the experience, and refuses to distribute meth to his dealers Badger, Skinny Pete and Combo. Walt delivers the drug to the trio and learns that there is a rumor that Jesse killed Spooge and his reputation on the streets is that he is a badass killer. Walt believes they may expand their business based on Jesse's reputation. Meanwhile, Skyler looks for a job at the company she worked for and meets the son of her employer that hires her. Hank is having problems with his team since he does not speak Spanish, and his former behavior is not convincing his new colleagues. When he goes to the field with them, he learns how dangerous his new assignment is.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232254", "rating": 8.6, "votes": 30201, "number_of_episodes": 62}