{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0702809": "DJ Qualls", "1269983": "Krysten Ritter", "2804503": "Matt Jones", "2366374": "Steven Michael Quezada", "0662669": "Tina Parker", "2824200": "Jimmy Daniels", "1698612": "Shenoah Allen", "3228373": "Drew Pollock", "3480659": "Casey Cerutti", "4050593": "Andrea Good"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["After running into legal trouble, Walter and Jesse turn to a flamboyant criminal lawyer, Saul Goodman, for help. Meanwhile, Hank's investigation brings him closer to their operation.", "Walt and Jesse have yet another problem to deal with when one of their dealers, Jesse's friend Badger, is arrested by the Albuquerque police. They end up hiring a shady lawyer, Saul Goodman, who has a unique way of ensuring that Badger gets off with a light sentence without having to give away Jesse or Walt's identity. As Walt learns however, it may come at a very high price. Walt's brother-in-law Hank, the DEA Agent, is suffering from post-traumatic stress following the shooting in Juarez. He puts on a brave face but is having trouble just getting out of bed in the morning. Walt has some suggestions for him.—garykmcd", "While selling drugs, Badger is lured by Albuquerque police detective Getz and arrested by the police. Hank and his right hand in DEA Steven Gomez become interested in Badger since he is in possession of the pure blue meth and may have information about Heisenberger. Badger hires the criminal lawyer Saul Goodman and Walt goes to his office to pay his fees. However, Saul explains that Badger will be sent to prison, unless he denounces his supplier. Walt offers ten thousand dollars to Saul to release Badger without the denouncement, but the lawyer does not accept the deal. Now Jesse and Walt meet the lawyer with a different proposal, and he gives an alternative arrangement that ill cost eighty thousand dollars to them. Marie calls Skyler, but Walt answers the phone call. He learns that Hank is suffering from post-traumatic stress after the incident in Juares and Walt gives some advice to him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232255", "rating": 9.2, "votes": 35808, "number_of_episodes": 62}