{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "1269983": "Krysten Ritter", "1450145": "David House", "2370673": "Jeff Fenter", "0560893": "Marcus M. Mauldin"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter takes Jesse on an extended cook in the desert, hoping to secure his family's future--but an unexpected crisis puts their survival at risk.", "Walt is convinced that his medical condition is deteriorating. He continues to have coughing fits and is now coughing up blood. After his attorney and new business partner crunches the numbers, he realizes that there isn't much money left for his family. He and Jesse set off for the desert for a marathon cooking session over an extended weekend. Jesse just continues to put his foot in it, this time by leaving the keys in the ignition and inadvertently draining the battery. They find themselves in the middle of the desert, cold and without much water. Walt's knowledge of chemistry saves the day again.—garykmcd", "Walt has coughs with blood and believes he will die soon. He meets Saul Goodman and tells him that he has only sixteen thousand dollars of dirty money. They conclude that is not enough money for his family. Walt lures Skyler, telling her that he will spend four days visiting his mother, but goes with Jesse to the desert to cook a large quantity of meth instead. However, Jesse leaves the RV key in the ignition and drains the battery. Stranded in the desert, Jesse accidentally burns the portable generator to the ashes, dropping gasoline on it. He uses their water to extinguish the fire, instead of using the fire extinguisher. Now Walt needs to use his knowledge of chemistry to load the battery to start their van. Later Walt and his family visits Dr. Delcavoli, who has analyzed the results of his exams.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232256", "rating": 9.2, "votes": 34102, "number_of_episodes": 62}