{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "1269983": "Krysten Ritter", "0184086": "Christopher Cousins", "0209496": "John de Lancie", "2366374": "Steven Michael Quezada", "0784831": "Carmen Serano", "0767580": "Carl Savering", "0566608": "Shannon McCormick", "3195149": "Ka Beesler"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["As Walter celebrates a turning point in his illness, his growing pride threatens to pull him deeper into the drug trade. Meanwhile, Jesse finds a new connection that offers a glimpse of a different life.", "Despite the good news about his condition, Walt is feeling out of sorts and is generally unhappy, verging on anger. Skyler decides to throw a party to celebrate the news and thank all of their friends for their support, but Walt gets drunk and then into an argument with Hank that puts a damper on things. He's embarrassed about his behavior and tries to make amends all around but it's proving to be a challenge. He tries to channel his energies but eventually realizes what the problem is. Walt also tells Jesse the good news and tells him that he is finished with their little enterprise. Jesse's relationship with Jane continues to grow but he's taken aback when her father drops in to see her and she doesn't introduce him as her boyfriend. The ensuing confrontation clarifies their relationship.—garykmcd", "While celebrating the great news of Walt's remission, a drunken Walter gets into a fight with Hank regarding a bottle of tequila and Walter Jr. Janes father visits, and Jane keeps her relationship a secret, much to the shock and disappointment of Jesse.", "Skyler decides to invite her friends to celebrate the improvement of Walt's health, and she thanks the friends and particularly Gretchen and Elliot Schartz for paying Walt's treatment. Walt gets drunken and forces Walt Jr. to drink tequila, despite Hank's advice. Then he meets Jesse and tells him the news. Walt apologizes to Hank later and decides to fix his house, buying a new boiler and replacing rotten pieces of wood. Jane receives her father Donald at home and treats Jesse in a cold way. Later she says that it was for his own protection.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232245", "rating": 8.4, "votes": 29403, "number_of_episodes": 62}