{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0190441": "Raymond Cruz", "2366374": "Steven Michael Quezada", "2636838": "Jesus Jr.", "1075323": "Cesar Garcia", "2367549": "Isaac Kappy", "2619114": "Ryan Lee", "2002316": "Vic Browder", "3039227": "Jamie Haqqani"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["After a violent encounter with Tuco, Walter and Jesse realize the dangers of their business and plot their next move. Meanwhile, Skyler grows more suspicious of Walter's behavior.", "Having completed their deal with Tuco in the junkyard, Walt and Jesse realize just how crazy and violent he can be. Jesse is convinced that he's seen Tuco's black SUV going up and down his street. Walt puts it down to paranoia - until he sees a black SUV parked just down the block from his house. Jesse's solution is to shoot Tuco before he kills them but Walt has a better idea. However, panic sets in when they think Tuco is killing his associates. Hank reviews the security surveillance footage of the warehouse break-in without realizing it's Walt and Jesse. Skyler tells Hank about Marie's shoplifting and gets a surprising reaction.—garykmcd", "After beating No-Doze, Tuco leaves the junkyard with Gonzo, and Walt and Jesse realize how dangerous the drug kingpin is. Walt calculates how much money he needs to make to provide his family with a comfortable life and concludes they need to cook meth for eleven weeks. Then they may be out of business. Out of the blue, Tuco returns and asks Walt to save No-Doze, but he is already dead. The Christian Gonze asks to bury No-Doze, but Tuco leave him below a car in the junkyard. Jesse buys a revolver for self-protection, but Walt says that this is a stupid attitude. But when he sees a SUV parked near his house, he becomes worried about and plots a scheme to kill Tuco with Ricin in his drug. Meanwhile, Skyler refuses to answer Marie's calls, Hank visits her, and she discloses that her sister is kleptomaniac. However, Hank knows and says that Marie is under therapy. Soon, Hank finds Gonzo and No-Doze dead in the junkyard and concludes that Gonzo tried to move No-Doze's body and his arm was accidentally crushed, and he bleed to death. But Walt and Jesse are not aware and believe Tuco killed them. Walt is with Skyler at home, and he receives a phone call from Jesse, who is parked outside his house. He goes there to talk to his partner, but Tuco is hidden on the back seat and asks Walt with a pistol to enter the car.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232244", "rating": 8.6, "votes": 31993, "number_of_episodes": 62}