{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "1269983": "Krysten Ritter", "0184086": "Christopher Cousins", "0573481": "Sam McMurray", "1889973": "Charles Baker", "2968788": "Rodney Rush", "1450145": "David House", "3089692": "Angelo Martinez", "2608171": "Mike Seal", "3128797": "Antonio Leyba", "3612763": "Reis Myers McCormick", "3613578": "Erin Miller-Gibbs", "3612872": "Ashley Kajiki", "0084497": "Jeremiah Bitsui", "1799682": "Maggie Fine", "2838849": "Kate Schroeder", "3375786": "John Augustini", "2490197": "Karen M. Hudson", "2246560": "Z. Ray Wakeman"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["A shocking event forces Walter and Jesse to rethink their business, leading them to a high-stakes meeting with a mysterious new player. Meanwhile, Skyler faces an unexpected dilemma at work.", "With the rapid improvement in his medical condition, Walt's doctors now recommend surgery as the final step to making him cancer free. It will all cost $170,000 however. Walt and Jesse have another problem when one of their dealers is shot on the street and Jesse believes someone is trying to take over. With only Skinny left as a dealer, Jesse and Walt have to find a solution to selling their product. Their lawyer-partner, Saul Goodman, suggests they get someone more experienced in the trade to help them out with the large quantities they have on hand. Jesse finally tells Jane, a recovering drug addict, what he does for a living. Skyler's doctor recommends that she have a C-section and they schedule the birth for the following week. At work however, she discovers her boss has been fiddling with the accounts.—garykmcd", "When Combo is shot to death at the new territory he is working. Skinny Pete quits his position as a dealer. Meanwhile, Dr. Delcavoli introduces the surgeon Dr. Victor Bravenec to Walt and Skyler, and he says that the surgery must be carried out in a few weeks since Walt has improved his condition. He estimates the cost is between US$ 170,000 and US$ 200,000. But now Walt and Jesse need to find a means to distribute their meth. Their new partner Saul says that they need someone that buys in bulk and contacts a person that knows another person who knows a cautious distributor. Walt and Jesse go to the Pollo diner, but the man does not contact them. Meanwhile, Skyler finds embezzlement in the balance sheets and discusses with her boss Ted Beneke. Jane, who was recovering from drug addiction, falls again in the addition.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232246", "rating": 8.9, "votes": 30273, "number_of_episodes": 62}