{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0546797": "Mark Margolis", "0342881": "Harry Groener", "0928795": "Michael Shamus Wiles", "2804503": "Matt Jones", "0452622": "Tom Kiesche", "2366374": "Steven Michael Quezada", "1450145": "David House", "2928008": "Julia Minesci", "0856086": "Todd Terry", "0218713": "Christopher Dempsey", "0768237": "Kat Sawyer", "2998245": "Sheran Goodspeed Keyton", "3467035": "David Priemazon", "0930609": "Ramsey Williams", "2859696": "Michael-David Aragon", "3039227": "Jamie Haqqani"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter and Jesse scramble to cover their tracks after their ordeal with Tuco, each taking drastic measures to avoid suspicion. Meanwhile, Hank grows increasingly determined to uncover the truth.", "Having gotten away from Tuco, Walt and Jesse now have to get home and explain where they have been. Walt has a plan and they split up. He goes to a supermarket and takes off all of his clothes while walking around the aisles. He's hospitalized and claims to have no memory of where he's been for the last few days. Jesse returns to his house to clean out the basement and get rid of the RV. When the DEA also track him down, he claims that he's been shacked up with a prostitute for the weekend. The police don't believe him and think they know how to nail him: they bring in Tuco's uncle to identify him. With some of his problems now behind him, Walt is keen to start cooking again.—garykmcd", "Walt and Jesse cross the desert and plot a plan to justify their disappearance in the last days. Walt gets a ride to a supermarket and takes off his clothes, wandering naked inside. He is sent to the hospital dehydrated and posing confusing. Meanwhile, Jesse asks his friend Badger to help him to remove his laboratory from the basement to his trailer. Then Badger's cousin tows the trailer to a safe place. Jesse goes to the motel and stays with Wendy in a room. When the DEA raids the motel, she gives the necessary alibi to Jesse. Hank does not buy and brings Tuco's uncle to the station to recognize Jesse, but he does not help the DEA. However, Jesse loses all his money that was in a bag in the trunk of his car, and Hank mocks him. When Walt is discharged from the hospital, Skyler questions him about his second cell phone.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232250", "rating": 8.3, "votes": 30677, "number_of_episodes": 62}