{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "1269983": "Krysten Ritter", "0184086": "Christopher Cousins", "0209496": "John de Lancie", "3622132": "Tomas Potts", "1720311": "Cyd Schulte", "2537446": "Tony Whitecrow", "3622416": "Wendy Scott", "0090693": "Erik J. Bockemeier"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter struggles to balance his growing empire with his responsibilities at home. Meanwhile, Jesse's relationship takes a turn that threatens to derail everything.", "Just as Skyler goes into labor, Walt has to deliver his 38 lbs. of meth to the wholesaler who has agreed to buy the lot for $1.2 million. Jesse and his girlfriend are now both doing heroin and when Walt races to Jesse's house to collect their stuff, he's stoned out of his mind. When Jesse wakes up the next morning, he has no recollection that Walt had been there the night before to get their stuff and freaks out thinking he's been robbed. Walt lets him stew for the day. Jane's father learns that she and Jesse are back on drugs and insists that she return to rehab or he will call the police. She agrees but Jesse has told her about his windfall and she knows exactly what to do. Walt's biggest problem is that he has all of this money but can't spend it because everyone thinks he's on the verge of bankruptcy. Walter Jr may have provided him with the solution.—garykmcd", "Walt concludes his business and delivers his meth, receiving 1.2 million dollars, but loses the delivery of his daughter Holly. When he goes to the hospital, he meets Mary, Skyler and the baby. Meanwhile Jesse and Jane are using heroin and when he wakes up and does not find the meth in the kitchen, he believes he was robbed. He calls Walt but he does not give any explanation to him. Walt has a serious problem since he has money but cannot spend it since everybody from his family believes he is broken. Walt Jr. builds a website to collect donations for Walt's treatment and Saul Goodman sees the solution to laundry his money. Walt holds Jesse's money ordering him to go to rehab first; otherwise, he will spend his money in drugs. When Donald discovers that his daughter is using drugs again with Jesse, he calls the police, but she promises to go to rehab on the next morning. Jesse tells her that Walt has to give him his share of US$ 480,000, and she calls Walt and blackmails him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232247", "rating": 9.3, "votes": 34114, "number_of_episodes": 62}