{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "1269983": "Krysten Ritter", "2804503": "Matt Jones", "2366374": "Steven Michael Quezada", "0928795": "Michael Shamus Wiles", "0225460": "Dale Dickey", "1352845": "David Ury", "0452622": "Tom Kiesche", "1889973": "Charles Baker", "2968788": "Rodney Rush", "1450145": "David House", "2964765": "Judith Rane", "0890073": "Lawrence Varnado", "2743432": "Tavia Stroup", "2844337": "Malcolm Ullery"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["As Walter expands his operation, Jesse takes on more responsibility--but struggles to maintain control. Meanwhile, Hank grapples with PTSD from his recent encounter, and Skyler makes a bold decision.", "Walt continues his treatment and is starting to feel better but is concerned at the growing medical bills. Jesse begins to re-establish himself paying off his debts and getting a new place to live. He's interested in the renter however, Jane Margolis, who lives next door. Walt and Jesse soon rev up the RV and are cooking again. Jesse's not keen on selling the stuff on the street and suggests he and Walt take over Tuco's role as a distributor. Hank and the DEA have come across the name Heisenberg and aren't sure if he's real or just an urban legend. Hank is promoted and soon appointed to a tri-State drug task force. He may have health issues of his own however.—garykmcd", "Tensions and bills mount at the White household. Hank makes progress at work, but struggles with some residual effects from his encounter with Tuco. Jesse takes charge and assembles a crew of dealers to get their product out on the streets.—TheDearHunter1878", "Walt is getting better in accordance with his doctor, but his and Skyler's medical bills scare him. Meanwhile, Jesse pays his debts with Badgers cousin Clovis that increases the value to a large amount and finds a new house to live in, renting from Jane Margolis, who lives next door. Soon Walt and Jess cook meth again in the RV but Jesse is in charge of the distribution through his friends Badger, Skinny Pete and Combo. When Skinny Pete is lured and robbed by a client, Jesse shares the loss with Walt that becomes angry, but Jesse gives an economic lesson to him. Meanwhile Hank is promoted in the DEA, but he is not feeling well and seems to have health problems.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232252", "rating": 8.2, "votes": 29958, "number_of_episodes": 62}