{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0190441": "Raymond Cruz", "0002128": "Tess Harper", "0546797": "Mark Margolis", "2366374": "Steven Michael Quezada", "0316708": "Nigel Gibbs", "3535733": "Dana Cortez"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["Walter and Jesse find themselves trapped in a deadly standoff with Tuco, fighting to survive. Meanwhile, Hank's search for the missing duo leads him closer to the truth.", "Having been kidnapped by a crazed Tuco, Walt and Jesse are held prisoner by him in a desert shack where he often hides out and takes care of his sick uncle. Walt's brother-in-law Hank and the DEA have rolled Tuco's entire organization and he thinks that his two prisoners may have been a source of information. Walt tries to feed Tuco the poison he prepared. Walter Jr. meanwhile takes a bit of time off to look for Walt. Skyler is sick with worry and has been distributing handbills with Walt's photo. He remembers that Jesse Pinkman was Walt's source of marijuana and tries to track him down. Tuco finally realizes that his prisoners are up to something and is obviously going to kill Jesse. After a fight in which Tuco is shot, Hank shows up looking for Jesse.—garykmcd", "Tuco kidnaps Walt and Jesse and keeps them prisoners at his sick uncle's house in the middle of the desert. He believes Gonzo is an informer since there was a DEA's raid at his hideout and his gang was destroyed, but Gonzo was missing. Walt and Jesse realize that Tuco has not killed Gonzo. Meanwhile, Skyler provides information to a DEA agent regarding the disappearance of Walt. Then, Walt Jr. prints leaflets with his father's photo and Marie and Skyler distribute them. Walt tries to give the poisoned drug to Tuco, but he finds the smell weird. Jesse tells him that they have added chili to the formula and Tuco says that he hates chili. Now he intends to travel with Walt and Jesse to cook meth in Mexico. But his uncle witnessed the attempt of Walt and Jesse to poison Tuco and is trying to communicate with his nephew.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232249", "rating": 9.3, "votes": 36572, "number_of_episodes": 62}