{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0372961": "Jessica Hecht", "0225460": "Dale Dickey", "1352845": "David Ury", "0784831": "Carmen Serano", "1889973": "Charles Baker", "3365195": "Dylan Carr", "4078207": "Brandon Carr", "2072060": "Cocoa Brown", "3131234": "Andrew Lutheran"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Jesse tracks down a drug thief, leading to a harrowing encounter. Meanwhile, Walter manipulates his way out of a problem at home as his double life puts further strain on his marriage.", "Skinny Pete has been ripped off by a drug addicted couple and Walt has made it plain to Jesse that unless he does something about it, word will get around pretty quick that they are an easy mark. Jesse isn't a very effective informer however and is quickly in over his head. Walt goes back to work but not all is going smoothly. Walt's story starts to unravel when Skyler gets a call from Gretchen Schwartz and she thanks her for paying for Walt's treatment. Gretchen doesn't give him away but his bitterness at their past relationship - personal and business - comes out.—garykmcd", "Jesse finds the whereabouts of the drugged couple that stole the meth from Skinny Pete and goes to the derelict house where they live. However, he stumbles upon a dirty and starving young boy that is the son of the woman. He gives some food to the boy and plays with him. When the couple arrives, Jesse subdues them with his revolver and the man, Spooge, proposes to pay him after opening an ATM that he has stolen. Meanwhile, Walt returns to high-school and Skyler receives a phone call from Gretchen Schwartz. She thanks her friend for paying for Walt's treatment and invites Gretchen to visit her. Gretchen visits Skyler and then Walt meets her at a restaurant where their past is partially disclosed.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1232253", "rating": 8.8, "votes": 32801, "number_of_episodes": 62}