{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "0052186": "Jonathan Banks", "0184086": "Christopher Cousins", "2366374": "Steven Michael Quezada", "0784831": "Carmen Serano", "0928795": "Michael Shamus Wiles", "1066346": "Jolene Purdy", "0084497": "Jeremiah Bitsui", "1697030": "Catherine Haun", "0361331": "Mark Hanson", "3883776": "Parker Sisty", "2490197": "Karen M. Hudson"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter spirals out of control as Skyler's actions push him to his breaking point. Meanwhile, Jesse seizes an opportunity, and tensions rise within the drug trade.", "Walt loses control as he reacts to Skyler's admission, endangering his job and his relationships with Saul and Jesse. Meanwhile, Hank believes he finally has a strong lead on his investigation into Heisenberg's blue meth as an empowered Jesse adopts a new attitude.—AMC Publicity", "Walt's behavior grows ever more erratic, especially when he learns that Skyler is having an affair with her boss. He causes an incident at Skyler's office and then gets into a fight with Saul when the lawyer reveals he's had his house bugged. He seems almost comatose in the classroom where he just stares at the wall, not speaking to his class. He soon finds himself suspended but runs into Jesse who has been cooking again in the basement of his house. Jesse again tries to convince Walt to get back into business with him and proudly shows off the blue meth he has made on his own. Walt isn't impressed however. Meanwhile, Hank is about to leave for a new job on a task force in El Paso when the local Sheriff tells him they've come across some blue meth. He decides to investigate and may have a lead.—garykmcd"], "genres": "N/A", "imdbID": "1615554", "rating": 8.2, "votes": 28246, "number_of_episodes": 62}