{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "0052186": "Jonathan Banks", "0001803": "Danny Trejo", "0546797": "Mark Margolis", "0184086": "Christopher Cousins", "0003740": "Julie Dretzin", "0334462": "Javier Grajeda", "2366374": "Steven Michael Quezada", "0922899": "Stoney Westmoreland", "1616991": "Luis Moncada", "3718379": "Daniel Moncada", "2655177": "Caleb Landry Jones", "0261066": "James Espinoza", "4442634": "Daniel Champine", "0722526": "Shari Rhodes", "2490197": "Karen M. Hudson", "2077124": "Keith Jardine", "1269983": "Krysten Ritter", "0824180": "Gary Ray Stearns"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter refuses to leave the house, escalating tensions with Skyler as she makes a bold decision. Meanwhile, Jesse struggles with loneliness, and a dangerous presence lurks in the shadows.", "Walt moves into the house and tells Skyler he has no intention of leaving. She won't hear of it but Walter Jr. is thrilled that his Dad is back. It doesn't stop her from calling the police however in an attempt to have him thrown out. She also decides to pursue her own interests. Jesse is still having trouble coming to terms with his girlfriend's death but has moved back into his house and seems ready to get down to work. Unbeknown to Walter, Gus has arranged a meeting with his Mexican cartel counterparts and makes it clear that he wants him left alone, at least for now. Hank is still stressed and lashes out in a bar.—garykmcd", "Walt and Jesse each return home: Walt over Skyler's strenuous objections, which drives Walter Jr. away from her, and Jesse in spite of his parents. Tuco's cousins, up from Mexico, are intent on murdering Walt. Hank may be returning to El Paso. Mike bugs the White's house; Skylar calls the cops on Walt, then she seeks to level the battlefield.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "1615187", "rating": 8.4, "votes": 28135, "number_of_episodes": 62}