{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0002064": "Giancarlo Esposito", "0209496": "John de Lancie", "0122716": "Jere Burns", "0003740": "Julie Dretzin", "0784831": "Carmen Serano", "1616991": "Luis Moncada", "3718379": "Daniel Moncada", "3578462": "Jonathan Ragsdale", "3846175": "Taylor Dearden", "0213142": "Robin Dearden", "2342362": "Galen Hutchison", "1515377": "Jesus Mayorga", "3535850": "Lorél Medina", "4436706": "Mario Moreno", "2826321": "Maria Bethke", "4166739": "Cicelo Solano", "1044752": "Ashleigh Banfield", "4436728": "Marla Tellez", "3869830": "Jeff Maher", "3535733": "Dana Cortez", "4914704": "Erik Beacham", "4155968": "Kathryn Dove", "5823619": "Will Ontiveros"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["As Walter deals with the fallout of a devastating tragedy, he is faced with a difficult choice about his future. Meanwhile, Skyler takes a stand, and Jesse struggles to come to terms with his actions.", "As Walt copes with the aftermath of the plane crash and Skyler's anger, Jesse comes to a new realization about himself. A new adversary tracks the elusive Heisenberg, Walter White's kingpin alter ego. Skyler seeks advice on the state of her marriage and confronts Walt.—AMC Publicity", "All of Albuquerque is in shock in the aftermath of the mid-air plane collision. Walter White is living in his home alone, at least for a while longer. His wife Skyler has moved out with their son and newborn daughter to give Walt a chance to pack his things. She speaks to a divorce lawyer about making the split permanent but seems unsure when the attorney says she will uncover any money Walt may have hidden. When she confronts Walt about the divorce, she also uncovers for the first time just how he made his money. Walt's former business partner, Jesse Pinkman, is in rehab trying to overcome his addiction. He feels remorse over the events that led to the mid-air collision and learns not to shy away from them. When all is said and done, Walt decides to get out of manufacturing and tells his principal contact, Gus, that he's getting out of the business. Gus has an attractive offer however. Meanwhile, two dangerous looking men cross over into the US from Mexico.—garykmcd"], "genres": "N/A", "imdbID": "1528116", "rating": 8.5, "votes": 29014, "number_of_episodes": 62}