{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0002064": "Giancarlo Esposito", "0644022": "Bob Odenkirk", "0052186": "Jonathan Banks", "0002128": "Tess Harper", "0546797": "Mark Margolis", "0184086": "Christopher Cousins", "2366374": "Steven Michael Quezada", "0091480": "Michael Bofshever", "0221430": "Dan Desmond", "1616991": "Luis Moncada", "3718379": "Daniel Moncada", "0084497": "Jeremiah Bitsui", "3979839": "Kaija Bales", "2522871": "J. Taylor", "5105035": "Lorena Fernández", "4526368": "Rodger Larance"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter tries to repair his fractured home life, but his actions only push Skyler further away. Meanwhile, Jesse makes a fresh start, and a new threat quietly looms over Albuquerque.", "Walt tries to reconcile with Skyler, but when his advances are rejected he takes drastic action to bring his family back together. A confused and angry Walter, Jr. lashes out at his mother. With the help of Saul, Jesse makes a significant investment.—AMC Publicity", "Walt is having difficulty adjusting to his new life. He doesn't want to be the bad guy and refuses to get into drug manufacturing again. He has an encounter with a police officer but manages to avoid charges courtesy of brother-in-law Hank's intervention. Skyler still won't let him set foot in the house and Walt Jr. in particular is having trouble understanding how his mother can treat him this way. His sleazy lawyer-partner Saul Goodman wants him to start producing meth again and takes steps to encourage him in that direction. Unbeknown to him, the Mexican cousins now know where he lives. Jesse meanwhile stops by his old house to find that his parents have had it renovated and have put it up for sale. Relations are still cool between them but Jesse approaches Saul with a plan.—garykmcd"], "genres": "N/A", "imdbID": "1615186", "rating": 8.6, "votes": 28406, "number_of_episodes": 62}