{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "0052186": "Jonathan Banks", "0546797": "Mark Margolis", "0184086": "Christopher Cousins", "1986960": "Emily Rios", "0122987": "Bill Burr", "1072611": "JB Blanc", "1530474": "Ray Campbell", "1089417": "Lavell Crawford", "0662669": "Tina Parker", "3970678": "Ian Posada", "5518772": "Christopher King", "4223746": "Grizelda Quintana"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter scrambles to secure his safety as pressure mounts from all sides. Meanwhile, Skyler faces a devastating setback, and Jesse finds himself caught between loyalty and survival.", "Hank has Walter drive him to the chicken ranch for regular stakeouts then suggests a detour to check out an industrial laundry. How can Walter get out of this one? Ted refuses to pay the IRS, so Skyler turns to Saul who sends his A team. Although Walter has continued to cook while getting no word on what's happened in Mexico to Jesse, Jesse has had his own six-mile walk with Gus through the desert to the Texas border. When circumstances prevent Walter from cooking for four days, he realizes that someone has been doing the job without him; Gus confirms Walter's suspicions with a nasty set of threats. Now Walter is truly desperate.—<jhailey@hotmail.com>", "Gus has planned well for the elimination of Don Eladio and the other Cartel leaders. With Mike recovering from his wounds, he and Jesse return to Albuquerque. Gus tells Jesse that he's now ready to cook on his on but Jesse makes it quite clear that if Walt is killed, he will cook for no one. Skyler again visits her old boss Ted telling him to pay off the IRS but he refuses and even offers to return her money. She turns to Saul Goodman to fix things but it doesn't quite go down as planned. Walt meanwhile is still chauffeuring Hank around only this time he wants to check out an industrial laundry. Realizing that Hank is getting too close to finding the lab, he has to think quickly. When Gus tells him his services are no longer required, Walt decides it's time to go into hiding. There's just one problem however.—garykmcd"], "genres": "N/A", "imdbID": "1683086", "rating": 9.7, "votes": 48045, "number_of_episodes": 62}