{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "0052186": "Jonathan Banks", "0064769": "Jim Beaver", "2804503": "Matt Jones", "1986960": "Emily Rios", "1889973": "Charles Baker", "2256387": "Marius Stan", "1530474": "Ray Campbell", "0428622": "Tank Jones", "3970678": "Ian Posada", "2519097": "John Christopher Hicks", "1035045": "Jefferson Arca", "2075924": "Sarah Minnich", "1986228": "David Robinson Jr.", "4096851": "Martin Palmer"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["46"],  "plot": ["As Walter prepares for the worst, tensions between him and Jesse reach a breaking point. Meanwhile, Skyler takes bold steps to expand her influence, and Hank struggles to move forward.", "Shaken by Gus's calm violence, Jesse cokes up; bleary-eyed and jittery, he throws a party. Walter, believing it's kill or be killed, buys a snub-nosed .38 on the black market, intent on shooting Gus and Mike. Skyler looks to launder money at a car wash, and, to Hank's increasing irritation, Marie insists on cheering his every step. Men deliver boxes of minerals and pick up boxes of crystal.—<jhailey@hotmail.com>", "Convinced that Gus will eventually kill him, Walt begins to prepare for the inevitable by purchasing a small revolver that he can easily conceal. He's clearly thinking about striking first but Mike makes it clear that he will never see Gus again. His suggestion that they work together on eliminating the threat gets him a beating and a nasty black eye. Jesse has got himself a new sound system and decides that the best way to spend his time at home is to constantly party. Tired of husband Hank's surliness, Marie Schrader takes to visiting open houses. Skyler's attempt to buy the car wash from Walt's old boss does not go well.—garykmcd"], "genres": "N/A", "imdbID": "1683089", "rating": 8.2, "votes": 28400, "number_of_episodes": 62}