{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "0052186": "Jonathan Banks", "0316708": "Nigel Gibbs", "1859626": "Jennifer Hasty", "0122987": "Bill Burr", "0397386": "Jeremy Howard", "2256387": "Marius Stan", "1089417": "Lavell Crawford", "1530474": "Ray Campbell", "0017556": "Ralph Alderman", "0584329": "Delana Michaels", "2156799": "Jonathan Richards", "4556123": "Stephen Braddock"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["46"],  "plot": ["As Skyler pushes forward with her plan, Walter grows increasingly reckless. Meanwhile, Jesse seeks distractions to cope with his guilt, and Marie's struggles take an unexpected turn.", "Skyler finds a way to pressure the car-wash owner into selling, while Marie goes on a series of visits to realtors' open houses. Her antics get her in trouble, and Hank has to pull a few strings. One of his cop friends helps Marie out and, in turn, asks Hank to look at a notebook found at the scene of a murder. Meanwhile, Jesse's round-the-clock open houseparty brings no mirth.—<jhailey@hotmail.com>", "Skyler is alarmed by Walt's bruises and he manages to convince her that his life is not in danger. She is intent on buying the car wash despite the owner's outlandish request. Lawyer Saul Goodman suggests they try another type of business but she is quite adamant. Skyler comes up with the perfect scheme to get the business at a very good price. Jesse meanwhile realizes that constant partying does not lead to better quality of life. At the Schraders, Marie finds herself in trouble and Hank has to use his police connections to make it go away. In return, Hank is asked to look over a file found in the home of a recent murder victim, Gale Boetticher. Of particular interest are notes suggesting the existence of a super meth lab.—garykmcd"], "genres": "N/A", "imdbID": "1683090", "rating": 8.0, "votes": 28928, "number_of_episodes": 62}