{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0002064": "Giancarlo Esposito", "0052186": "Jonathan Banks", "0184086": "Christopher Cousins", "0173997": "Maurice Compte", "0744690": "Carlo Rota", "0000874": "Steven Bauer", "1530474": "Ray Campbell", "0662669": "Tina Parker", "2909754": "Rick A. Ortega Jr.", "1591725": "Stephen Eiland", "4464042": "Flora Amanda", "1856005": "Michelle Greathouse", "2951500": "Gabriel Nunez", "0854882": "Tenaya Torres"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Jesse is sent on a high-stakes mission with Gus and Mike, while Walter deals with the fallout of his latest actions. Meanwhile, Skyler takes a bold step to protect her family.", "Jesse, Gus, and Mike fly to Mexico where Jesse will cook a batch of crystal meth for Don Eladio's skeptical team. If Jesse succeeds, then what? Walter is recovering from a beating and misses his son's 16th birthday; Walter Jr. comes to his dad's place to find out what's wrong. Skyler discovers that Ted Beneke is not using an anonymous windfall to repay the IRS; she calls on Ted. By the end, we're back poolside at Don Eladio's villa where they toast each other's health with well-aged tequila.—<jhailey@hotmail.com>", "Walt is at home recovering from the beating Jesse gave him after their argument. As a result, he misses Walt Jr.'s birthday and the surprise gift Skyler suggested they get him. Walt Jr. is particularly worried about his dad and isn't too impressed with the gift he's received. Skyler gets Saul Goodman to arrange to give her former boss the more than $600,000 he needs to pay off the IRS but is particularly incensed when she realizes he's spending the money on himself and the business. It's high noon for Gus, Mike and Jesses who travel to Mexico to make a batch of blue meth for the Cartel. Jesse does a good job but is a bit taken aback when he's told he will be staying on permanently. Mike assures him they will either all stay or all leave together. Gus has a plan, one that will not only rid him of his problem but settle an old score as well.—garykmcd"], "genres": "N/A", "imdbID": "1683085", "rating": 9.6, "votes": 40571, "number_of_episodes": 62}