{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0292182": "Laura Fraser", "0687146": "Jesse Plemons", "2804503": "Matt Jones", "1889973": "Charles Baker", "1089417": "Lavell Crawford", "0662669": "Tina Parker", "1537818": "Pedro García", "5826452": "Cheryl Ford-Mente", "0662201": "Debi Parker", "1080822": "Chad Brummett", "0625971": "Joe Nemmers", "0214916": "Wayne Dehart", "5870985": "Brett Shane Cooley", "5870986": "Ray Chavez", "5633192": "Taber Cross", "5987281": "Moira Bryg MacDonald", "5376869": "Jyl Murray"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Hank grapples with a shocking discovery, forcing Walter to act quickly. Meanwhile, Jesse struggles with his conscience, leading him down a dangerous path.", "Hank is reeling from the information he found in Walt's bathroom, so much so that he has a panic attack on his way home from Walt's house. He decides to stay home for a few days but has boxes of evidence sent to him. As he sifts through the paper, he realizes the extent to which he's been had. Walt meanwhile has kept his promise to his Skyler and is no longer in the business. He works at the car-wash and suggests that they buy another one. His cancer has returned however and he's undergoing chemo again. Jesse is feeling guilty about some of the things he's done and tries to get Saul to get money to the families of some of their victims. Saul knows better and gets Walt to calm him down. A desperate Jesse resorts to other ways of getting rid of the money. When Walt realizes the book from his bathroom is missing, he visits Hank.—garykmcd", "Hank has just made a huge discovery about his brother-in-law, and while he attempts to piece everything together, he has trouble accepting the truth. Walt is determined to stay out of the business, and Jesse wants to get rid of his \"blood money.\"—Anonymous"], "genres": "N/A", "imdbID": "2301471", "rating": 9.4, "votes": 39673, "number_of_episodes": 62}