{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0052186": "Jonathan Banks", "0292182": "Laura Fraser", "2366374": "Steven Michael Quezada", "0928795": "Michael Shamus Wiles", "0919256": "Norbert Weisser", "0615645": "Wolf Muser", "3212315": "Carrington Vilmont", "3130683": "James Ning", "3979839": "Kaija Bales", "5518772": "Christopher King", "0002773": "Norma Maldonado", "1833916": "Debrianna Mansini", "2338649": "Trine Christensen", "5176004": "Mathias Kaesebier", "3889264": "Brennan Foster", "5171987": "Lillian Presley Leyba", "6526402": "Frank Sandoval", "4001157": "Ryan Schaefer"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter looks to expand his empire as he forges a new partnership. Meanwhile, Mike faces pressure from all sides, and the DEA intensifies its investigation.", "In Germany, the head of a multinational company's fast food division - which includes Gus' franchised chicken restaurants - commits suicide when the police come to question him. With Jesse fretting over what happened with the poison cigarette intended for Gus Fring, Walt plans an elaborate ruse to let him find it in his house. With that out of the way, they approach Mike to join them in starting up the business but he refuses. Mike is also approached by a woman, Lydia - obviously involved in Gus Fring's drug business - who is worried about the number of people who could have their arms twisted to testify against them and wants them eliminated. Mike declines but when someone goes after him, he knows the source.—garykmcd", "Skylar's taken to bed, still shocked at Walter's murderous play. He convinces Jesse to cook again, and they invite Mike to become a full partner: he says no. Mike's also approached by Lydia, an uptight MBA and partner of Gus, who wants him to kill 11 people with knowledge of the operation. Meanwhile, the FBI is doing its homework - with Gus's German supplier and with offshore banks. They too put the pressure on Mike.—<jhailey@hotmail.com>", "Walt and Jesse seek out an unlikely partner for a new business venture. The DEA follows up new leads in its investigation.—AMC Publicity"], "genres": "N/A", "imdbID": "2301457", "rating": 8.8, "votes": 33025, "number_of_episodes": 62}