{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0052186": "Jonathan Banks", "5725487": "Fred Cruz", "2804503": "Matt Jones", "1986960": "Emily Rios", "0687146": "Jesse Plemons", "2099399": "Mike Batayeh", "0743404": "Franc Ross", "1889973": "Charles Baker", "1089417": "Lavell Crawford", "3970678": "Ian Posada", "2093099": "Miguel Martinez", "0293803": "Chris Freihofer", "1433853": "Kristin Hansen", "1790494": "Alex Knight", "3106150": "Mike Ostroski"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter and Jesse set up a new operation, but tensions with Mike threaten their partnership. Meanwhile, Skyler struggles under the weight of Walter's actions.", "Walt, Jessie, and Mike's business starts back up. Walt finds an ingenious solution to the problem of where to set up the lab, Jesse makes a decision about his personal life, and Mike visits each of his crew to ensure that they stay mum, even with the feds pressuring them. Hank goes back to work. Skyler remains numb, and Marie badgers her about what's wrong. Walt is in for a surprise when Mike divides the money from the first cook.—<jhailey@hotmail.com>", "Having joined Walt and Jesse in their new drug venture, Mike goes around ensuring that his crew understand they're going to be taken care of and they have no reason to strike a deal with the police. The new venture's first priority is to find a suitable place where Walt and Jesse can cook. Saul shows them several possible locations none of which are suitable. Walt then comes up with an idea that may be exactly what they need and they're back in business. Walt is none too pleased however when he realizes the size of his cut. Walt has decided move back into his house with Skyler and the kids. She's not quite sure she's comfortable with that. When her sister Marie stops by the car-wash to visit, Skyler breaks down, sobbing uncontrollably. A worried Marie demands that Walt tell her what is going on.—garykmcd"], "genres": "N/A", "imdbID": "2301459", "rating": 8.8, "votes": 32412, "number_of_episodes": 62}