{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0052186": "Jonathan Banks", "0292182": "Laura Fraser", "0687146": "Jesse Plemons", "2366374": "Steven Michael Quezada", "0122987": "Bill Burr", "0574535": "Jamie McShane", "0914223": "Myk Watford", "2093099": "Miguel Martinez", "2523921": "Mary Sue Evans", "3476022": "Sam Webb", "3144639": "Ryan Begay"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["48"],  "plot": ["Walter, Jesse, and Mike plot a risky heist to secure a crucial supply. Meanwhile, tensions rise within the group as unexpected complications threaten their plan.", "A boy on a motorbike finds a large tarantula in the desert. Walter pays a visit to Hank in the new office; Walt's intentions are not entirely above board. The team's search for methylamine continues, with Michael and Lydia at odds, and Jesse wanting to obtain the chemical without resorting to murder. They hatch an elaborate plan involving buried tanks, a train trestle, and a stalled truck. The children remain with Hank and Marie to Junior's increasing anger and frustration. Skyler lays more of her cards on the table. What price success?—<jhailey@hotmail.com>", "Walt visits Hank's office under some pretext but places a bug in the room. It's all because Mike wants to eliminate Lydia who he is convinced put the tracking device on the barrel of chemicals in the warehouse. A phone call and an intercepted conversation clarifies the situation. Lydia has a suggestion on how they can get a huge supply of the chemicals they need. It involves robbing a train however and they will not only have to stop the train in a precise location but will have only a few minutes to take what they need. At home, Skylar lays down the law as far as the children are concerned.—garykmcd"], "genres": "N/A", "imdbID": "2301463", "rating": 9.7, "votes": 47196, "number_of_episodes": 62}