{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0052186": "Jonathan Banks", "0184086": "Christopher Cousins", "2366374": "Steven Michael Quezada", "0064769": "Jim Beaver", "0359969": "Larry Hankin", "1072611": "JB Blanc", "2196176": "James Harris", "3156214": "Monique Candelaria", "5159396": "Gail Starr", "3153914": "Breanna Perera", "4316356": "Todd Sopher"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["43"],  "plot": ["Walter moves quickly to cover his tracks in the aftermath of his bold plan. Meanwhile, Jesse and Mike struggle to adapt to the new reality, and the DEA closes in on the operation.", "Flash ahead to Walter's 52nd birthday: he's at a Denny's, disheveled, hair and beard unkempt, using a false name and a New Hampshire driver's license, paying a guy for a car with weapons in the trunk. Back to the immediate aftermath of Gus's death: Skyler is dazed at Walt's murderous success, Walt and Jesse make peace, and Hank visits the burned-out lab. Walt remembers the surveillance cameras Gus used at the lab, so they turn to an angry Mike for help. Can they get rid of the digital evidence in police custody? Is hubris going to trip up Walt?—<jhailey@hotmail.com>", "In the aftermath of having eliminated Gus, Walt now has to deal with the consequences. Mike goes after him but Walt convinces him they are all better off. He is concerned about surveillance system Gus had set up in the lab and learns from Mike that Gus used his laptop as the monitor. Unfortunately, it's now in the police evidence room but Jesse has a possible solution: a very large magnet. The police also find a new piece of evidence. At home, emotions are running high and blowing up Gus hasn't made Skyler any less afraid of Walt. Skyler learns the her old boss Ted and awakened from his coma and Walt learns from Saul for the first time about Skyler's loan to pay off the IRS.—garykmcd"], "genres": "N/A", "imdbID": "2081647", "rating": 9.2, "votes": 37552, "number_of_episodes": 62}