{"cast": {"0186505": "Bryan Cranston", "0348152": "Anna Gunn", "0666739": "Aaron Paul", "0606487": "Dean Norris", "1336827": "Betsy Brandt", "2666409": "RJ Mitte", "0644022": "Bob Odenkirk", "0292182": "Laura Fraser", "0687146": "Jesse Plemons", "2366374": "Steven Michael Quezada", "0100889": "Michael Bowen", "0710271": "Kevin Rankin", "4577760": "Patrick Sane", "1324884": "Tait Fletcher", "0335636": "Saginaw Grant", "5597998": "Matthew T. Metzler", "0737276": "Hank Rogerson", "0516952": "Billy Lockwood", "5950809": "Patricio Delgado", "3628707": "Carlos Telles", "4526368": "Rodger Larance", "5987281": "Moira Bryg MacDonald", "0781913": "Noah Segan", "0909124": "Moira Walley-Beckett"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["47"],  "plot": ["Walter faces the devastating consequences of his actions as his world unravels. Meanwhile, Jesse's fate takes a dark turn, and the fallout threatens everyone he cares about.", "Walt survives the gun battle in the desert but others do not. Jesse survives but Walt wants him dead and expects Todd's uncle Jack to go through with their deal. Something far worse is in store for Jesse and Walt takes the opportunity to tell him about Jane's death. Meanwhile Hank's wife Marie visits her sister Skyler at the car-wash to tell her Walt has been arrested. At Marie's insistence, Skyler tells Walt Jr. about his father's secret. By the time Skyler and Walt Jr. get home Walt is already there and wants them to pack and leave with him. He soon realizes it's all over and leaves, but takes baby Holly with him. With the police now involved, Walt makes one last phone call to Skyler.—garykmcd", "In 'Ozymandias' we discover the result of the confrontation in the desert - who died and who is in imminent peril, fighting hard until the end. Walt pleads with the Nazis, he offers them millions of dollars to spare a life. Alas, evil is implacable, they take the money while leaving another dead body behind.—Anonymous"], "genres": "N/A", "imdbID": "2301451", "rating": 10.0, "votes": 249792, "number_of_episodes": 62}