{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0058372": "Roger Bart", "1058987": "Kenneth Mitchell", "0147661": "Fulvio Cecere", "0006956": "Jesse Vint", "4662646": "Paul Root", "3969893": "Ricki Bhullar", "0552511": "Jessica Erin Martin", "0277547": "Ryan Findley", "3185725": "Ron Carrier", "0382953": "Rodney Hicks", "5098378": "Romeo Castellanos", "4933358": "Tim Becker", "3962397": "Sophie Soong", "5098101": "Aliina Sconiers", "8877736": "Brenda Braxton", "1696978": "Andy Gates", "0029690": "Paul Angelo", "1408752": "Douglas Tait", "4645964": "Jace Daniel", "3094593": "Jayme S. Hall", "4107927": "Suzanne Stoker", "4423255": "Conrad Wrobel"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Episodes of vicious attacks by Bigfoot-like Wesen known as Wildermann are suddenly rampant. Nick and Monroe discover that the errant Wesen are connected to a psychologist performing medical experiments to help the Wesen control their urges.—Rudy1957", "Yet another party of forest passersby is gruesomely attacked by a creature they describe as 'bigfoot' but looks human on a hazardous video. Just thereafter, Monroe finds on his couch old friend Larry McKenzie, bloody, exhausted, unable to morph back to his human form properly and desperate to remove something from his back. Nick helps Monroe find out there are more feral creatures with such Jeckyl and Hyde problems. The discover the common factor is psychotherapist Constantine Brinkerhof, who tries to develop a cure for their morphing.—KGF Vissers", "Three Bigfoot hunters are looking for Bigfoot in the forest. Out of the blue, a creature attacks them and only the woman survives. Meanwhile, the horses' breeder Thom Carson sees something attacking the horses and he shoots with his gun. He finds one horse wounded and he calls the veterinary Juliette Silverton. Soon they find the bodies of the two hunters and Juliette summons Nick. They find the girl that survived the attack and she tells that the Bigfoot attacked them. Meanwhile Monroe is awakened during the night and he finds his friend Larry inside the house shot in the leg in the Wildermann form. Larry tells that he can not get back to the human form. Monroe calls Nick and Larry dies. Soon there are other attacks in the city and in common, all the Wildermann are client of the psychologist Constantine Brinkerhof. Nick decides to investigate the psychologist and soon he discovers that Brinkerhof is performing medical experiments with the Wildermann to help them to control their impulses.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2373011", "rating": 8.0, "votes": 1308, "number_of_episodes": 123}