{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0333982": "Currie Graham", "3004295": "Amy Gumenick", "1309643": "Claire Coffee", "2782444": "Parker Bagley", "1703101": "Ayanna Berkshire", "2992197": "Alexander Mendeluk", "0123632": "Kate Burton", "0774187": "Eric Schniewind", "3763642": "Rich Cashin", "2558128": "Jodie Harwood", "4644446": "Robbie Clark", "1915690": "Ethan Atkinson", "4084861": "Jake Street", "4757641": "Keith Cox", "4757576": "J.J. Morris", "1290743": "Matt Baker", "6653608": "Amy Belisle", "5816024": "Jacob Block", "4194039": "John R. Lewis", "6646364": "Elizabeth Rhoades", "6375907": "Asha Sawyer", "4522423": "AJ Taylor"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["A case of breaking and entering introduces Nick and Hank to a mysterious family whose cultural background blurs the line of right and wrong. Meanwhile, Nick tasks Monroe with safeguarding Aunt Marie.", "Rocky Babb goes missing after breaking into lawyer Frank Rabe's desolate Forrest home with his girl-friend Gilda Darner, who escaped and urges the PPD to investigate. Nick believes her and Grimm-senses Frank's adolescent son Barry can change into a bear. Eddie Monroe Blutbad accepts grudgingly to guard aunt Marie Kessler in hospital while Nick and Hank check out Barry and his motorbike buddies, Jason and T.B. Colbert, who kidnapped Rocky for a grim sunset initiation hunt.—KGF Vissers", "Rocky Babb and his girlfriend Gilda Darner break in an isolated manor in the woods to have fun. They wear of the owners' clothes, drink wine and have sex on their bed. Out of the blue, the owner returns home and Gilda escapes, jumping from the veranda; however Rocky does not succeed and goes missing. The lawyer Frank Rabe, who owns the house, reports to the police while Gilda asks Nick to investigate what has happened to Rocky. Meanwhile a woman tries to kill Marie in the hospital and Nick asks Monroe to guard her and he shows a bear claw that belongs to Marie to him. Monroe explains to him that the claw is used by Jägerbars in a hunting named roh-hatz that is their rite of passage. Nick suspect of Rabe's son Barry and his two friends T.B. and Jason Colbert.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2021147", "rating": 7.5, "votes": 1966, "number_of_episodes": 123}