{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1309643": "Claire Coffee", "3231354": "Nick Thurston", "0755185": "Sharon Sachs", "0387432": "Judith Hoag", "3643173": "Amelia Rose Blaire", "1197118": "Danny Belrose", "2950078": "Will Cuddy", "3271563": "Aaron Landon", "1416531": "Chase Offerle", "1042054": "Ted deChatelet", "4805482": "Shelley B. Shelley", "1428690": "Russell Hodgkinson", "0116461": "Danny Bruno", "4522576": "Tommy Hestmark", "4714899": "Gregory Miller", "5816024": "Jacob Block", "3542131": "Joshua Lee Frazier", "1436561": "Alistair McKenzie", "3173191": "Rian Turner", "4423255": "Conrad Wrobel"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick investigates the death of a music teacher who was eaten alive by rats whille locked in his own car. Nick and Hank are led to a expelled music prodigy who has a strange sort for vengeance against those who wronged him.", "Nick investigates the death of popular Seattle private prep school music teacher, who was seemingly bitten to death by rats in his car. The popular crowd suggest the only feasible suspect is recently suspended outsider Roddy Geiger, a gifted violinist but son of ruffian junk yard keeper Ephram. Near the fatal car are found cages used by Roddy to keep his pet rodents. As Nick recognizes the knave as feral rat, Monroe tries to give 'fatherly' guidance. However when his father is falsely arrested and abused in jail, the boy snaps and sets a trap for the rich kids who constantly abuse and sometimes bully him. In his anonymous feline DJ mask, he lures them to an underground rave, where his biting army is ready for the kill.—KGF Vissers", "At the Von Hamelin Music Institute, music teacher Paul Lawson is directing a string quartet formed by Sarah Jennings, Carter Brimley, Trey Harrison and Marvin. After the practicing, Lawson enters in his car and is eaten alive by the rodents. Nick and Hank investigate the case and the police find cages in the bushes tagged Geiger Pest Control. They seek out the students and they learn that the student Roddy Geiger was suspended a couple of days ago. Nick and Hank discover that Roddy is the popular DJ Retchid Kat that was in a rave at the same time. When the coroner finds fibers in the rat stomach, Nick and Hank decide to investigate the students.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nick and Hank's investigation of a dead high school teacher leads them to the school's outcast, Roddy. Nick realizes that there's more to Roddy than meets the eye, and enlists Monroe's help to get through to the troubled teenager before he exacts revenge on the students who wronged him. Meanwhile, Nick learns that his presence is beginning to affect the creature world.—NBC Publicity"], "genres": "N/A", "imdbID": "2058314", "rating": 7.9, "votes": 1718, "number_of_episodes": 123}