{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0000684": "Nana Visitor", "1309643": "Claire Coffee", "0755185": "Sharon Sachs", "1706025": "Mary Ann Jarou", "0429479": "Wrick Jones", "0513490": "Shelly Lipkin", "3100795": "Linn Bjornland", "1508214": "Michael J. Prosser", "3295770": "Stephen Lange", "0606885": "Rich Morris", "4776628": "Michelle Danilson", "4776615": "Claire Doody", "3277555": "Austin Hillebrecht", "3501643": "Marzell Sampson", "0522137": "Heath Lourwood", "4776377": "Kacey Griffin", "3173191": "Rian Turner"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["During a flash-mob on a bus, a lawyer is killed with a stunning overdose of bee venom, but it fits no geographical origin. Monroe and the Grim records help Nick work out it must be the work of a feral bee queen, the sworn enemy of Hexenbiests like Adalind. Trailing a professor-beekeeper and the other twelve attendants of a bee-keeping convention, Nick and his partner Hank find them congregating and get attacked by an unnatural bee swarm.—KGF Vissers", "A group of people boards a streetcar and they dance \"YMCA\" on the boombox of a teenager. When the flash mob leaves the streetcar, the conductor finds the body of a young woman. Nick and Hank investigate the case and the coroner tells them that the victim, the lawyer Serena Dunbrook, died of anaphylactic shock caused by a large quantity of bee venom. Nick interrogates the owner of the boombox, Doug, and he finds that Doug is a Mellifer. Nick and Hank follow Doug and his friend John to an abandoned facility where they meet a woman, but they are attacked by a swarm of bees and the suspects flee. Nick reads the journals of Marie in the trailer and summons Monroe. They discover that the bee queen and her swarm are enemies of Hexenbiests. But who is his enemy and who is coming?—Claudio Carvalho, Rio de Janeiro, Brazil", "The station is abuzz as Nick and Hank are called to a case where an innocent flash mob results in a gruesome homicide. As Nick delves further into the investigation, he learns more about his unique family history, and finds himself at odds when he and Hank are assigned to protect a dark character from his recent past.—NBC Publicity"], "genres": "N/A", "imdbID": "2056075", "rating": 7.5, "votes": 1852, "number_of_episodes": 123}