{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0953882": "David Zayas", "0523825": "Henri Lubatti", "0122913": "Traber Burns", "0116461": "Danny Bruno", "3283936": "Kyle Vahan", "5036778": "Kevin Carroll", "0628409": "Eric Newsome", "3988969": "Bruce Blanchard", "1963622": "David Loftus", "0082747": "Chino Binamo", "4134560": "Marissa Price", "3284532": "Pat Janowski", "3981885": "Tracy Pendergast", "0361322": "Lester B. Hanson", "0142169": "Hank Cartwright", "4822487": "Lisa Carswell", "4956826": "Andrew D. Ford", "3122432": "Timothy Dean Lee", "3854431": "Fred Swink"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick searches for the potential witness to the murder of a bridge construction contractor caused by a troll-like wesen.", "Nick investigates the murder of a bridge construction contractor who is a beaver (Eisbiber), by a building inspector who is a troll (Hasslich). The contractor's refusal to pay tribute to the inspector potentially disrupted long history of trolls controlling bridges.—Rudy1957", "Investigating the murder by cement-mixer of contractor Robert Grosszahn, Nick and Monroe son work out he was killed for refusing the 'toll' traditionally levied against his fellow beavers by another species, the Hasslich. They soon find beaver Arnold Rosarot witnessed the murder by Portland's chief building inspector Salvadore Butrell and his goons, but he's afraid and the rest of the beavers are as well. Monroe can't resist a dinner invitation from grateful Juliette, despite the danger of table conversation. Butrell hires from Germany two reapers to eliminate Nick, but that backfires in every sense.—KGF Vissers", "The businessman Robert Grosszahn meets the construction surveyor Salvadore Butrell underneath a bridge under construction and they have an argument. Salvadore drowns Robert in cement, but Arnold Rosarot witnesses the murder and calls the police. Nick and Hank investigates the crime and Nick finds that the constructor Robert is an Eisbiber and Salvadore is a Hässlich. Nick seeks out Arnold, but the beaver community is afraid to let Arnold go to testify against the dangerous Hässlich. Meanwhile two Reapers arrive in Portland seeking out Nick to kill him and Salvadore helps them to trap Nick.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2356209", "rating": 8.5, "votes": 1452, "number_of_episodes": 123}