{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0920038": "Titus Welliver", "0755185": "Sharon Sachs", "0127437": "Jordi Caballero", "0810770": "Alan Smyth", "3456797": "Brian Sutherland", "3071303": "Robert Cohn", "1968601": "Aaron Blakely", "4932951": "Cherif Khazem", "3151231": "Kevin Warren", "4933358": "Tim Becker", "5492167": "Steven Sukul", "5816024": "Jacob Block", "2124931": "Jake Brock", "3542131": "Joshua Lee Frazier", "0386944": "Adolf Hitler"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Jeweler Sam Bertram was murdered by three European killers, of rival feral species, to steal the rarest Ancient gold coins from his safe. Two are dead, the third steals a uniform from a cop he murders. The coins are found on the elusive Farley Kolt, who is arrested and tells Nick enough to work out he was late aunt Marie's true love. The coins, minted on Zakynthos, with swastika's and lions heads, are poisonous and magically attract great power and utter disaster. Captain Sean Renard keeps them and starts an ambitious 'campaign against crime' amidst dreams of absolute power in Nazi style.—KGF Vissers", "There is a heist in a traditional jewelry store and the owner Sam Bertram hides from the three thieves in the vault. The coroner finds that the \"causa mortis\" are three ancient coins inside his stomach. Hank brings the coins as evidence to the police department and changes his behavior. Captain Sean Renard keeps the coins with him and summons the press to release a campaign against crime. Meanwhile the thieves seek the coins and a stranger named Farley Kolt sneaks around their house and two of them accidentally kill each other. Nick and Hank arrest Farley and soon Nick learns that the coins attract power to its owner. Meanwhile the third thief goes to the police station wearing the clothes he stole from a police officer that he murdered.—Claudio Carvalho, Rio de Janeiro, Brazil", "A failed jewelry store robbery results in a murder that finds Nick and Hank immersed in a hunt for rare coins. Nick soon learns that these coins have an unsettling effect on whoever possesses them, as Hank and Captain Renard begin to exhibit unusual behavior. Meanwhile, a mysterious old friend of Aunt Marie's comes to Nick with information about his family and what led to his parents' death.—NBC Publicity"], "genres": "N/A", "imdbID": "2127825", "rating": 8.5, "votes": 1552, "number_of_episodes": 123}