{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0160004": "Claudia Christian", "0740360": "Ted Rooney", "4656224": "Anna Evelyn", "2367227": "Mike Dunay", "2310612": "Drew Barrios", "2759801": "Mary Jon Nelson", "1422609": "Robert McKeehen", "3535236": "Damon Kupper", "3246296": "Matthew Dibiasio", "3399212": "Shawn Law", "0116461": "Danny Bruno", "1356713": "Shawn Telford", "0606991": "Victor Morris", "5000910": "Troy Loney", "3173191": "Rian Turner", "3644851": "Madeleine Young"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["When a hiking couple is saved from a drug trafficker from what appears to be a \"Feral Beast\" nick investigation into it leads to the suspicious that it is linked with a 10-year old missing persons case.", "A drug trafficker was murdered without apparent motive deep in the forest. Helped by unusually enthusiastic Monroe, Nick soon works out the killer must be a feral and after tracing her it's a girl. Then follows traces indicating she may be a long-missing child having nearly grown up in the woods, and suggesting a link with recluse tracker James Addison, but there are others involved.—KGF Vissers", "While hiking in the woods, the young couple Dustin and Lauren is captured by a drug dealer who is planting weeds in the forest. However, a rope wraps around his neck and he is murdered. The couple flees and soon Nick and Hank are investigating the death of the drug dealer in the crime scene and Nick sees a female Blutbad running in the woods. Meanwhile the two brothers of the drug dealer come to the police station requesting information about their deceased brother. Meanwhile Sergeant Wu tells Hank that the DNA matches with seven year-girl Holly Clark, who disappeared nine years earlier. While Nick visits Monroe expecting clarifications about the case, the brothers of the drug dealer kidnap Dustin to find who killed their brother.—Claudio Carvalho, Rio de Janeiro, Brazil", "A mysterious homicide deep in the woods leads to Nick and Hank reopening a long-aborted missing persons case. When Nick suspects this abducted person might be a feral creature, he asks Monroe to help remind this wild child of her human nature.—NBC Publicity"], "genres": "N/A", "imdbID": "2075676", "rating": 7.9, "votes": 1622, "number_of_episodes": 123}