{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1395858": "Valerie Cruz", "0755185": "Sharon Sachs", "0754512": "Daryl Sabara", "2000954": "Hannah Marks", "4884031": "James Maxey", "2396800": "Donald Fisher", "3940044": "J.J. Johnston", "0378020": "Tyrone Henry", "4026526": "Beth Furumasu", "4593065": "Karen Tucker", "0589639": "Dana Millican", "4883799": "Logan Loughmiller", "4354704": "Aris Juson", "4086992": "Randy Sean Schulman", "0486822": "Jennifer Lanier", "0401352": "Endre Hules", "1812286": "Steven Beckingham", "1035414": "Chris Gann", "2280396": "Jeff Richardson", "13552909": "Athena", "5816024": "Jacob Block", "1436561": "Alistair McKenzie"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["While investigating the death of a homeless teen, Nick and Hank uncover a ring of Geiers harvesting human organs. Also, the Verrat threaten Captain Renard to keep the Grimm under control.", "Teenage street kid buddies Steven Bamford and Kevin Standish disappear in the forest. One's corpse is found, missing various organs. Nick realizes from his legacy book that may be the work of Geiers, crypto-vultures who take sadistic pleasure in the agony of victims whose organs they 'harvest' to sell as feral creatures medicine. Monroe shows Nick the fox-feral pharmacist-client. Nick and his girlfriend take pity on street kid siblings Hanson and Gracie, who tell them when treated to a dinner about their missing mates. Both trails connect in a free clinic treating the homeless.—KGF Vissers", "The teenagers Kevin Standish and Steven Bamford are running in the woods trying to escape from their pursuers. Steven jumps in the river but Kevin is captured by the men. However he is too weak due to the loss of blood and dies. Nick and Hank investigate the case and note that the teenager wears a shell necklace and was homeless. They locate his PO Box and Nick discovers who sold the necklace to him. He befriends the homeless siblings Gracie and Hanson and learns that Steven and Kevin had each received a job offer to work in the forest. Further he discovers that they had gone to a nearby medical clinic for homeless. Soon Nick realizes that the vulture-like creatures Geiers sell human organs in black-market to pharmacies for creature enhancement.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2090876", "rating": 8.0, "votes": 1526, "number_of_episodes": 123}