{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1303038": "Amanda Walsh", "0462735": "Frederick Koehler", "3367387": "Gavin Hoffman", "0808076": "Ebbe Roe Smith", "0186803": "J.W. Crawford", "4864875": "Jill Westerby", "2558263": "Doug Brooks", "4448867": "Enrique Arias", "4863958": "Tai Sammons", "4864336": "Aaron Fitzgerald", "0349880": "Leigh Guyer", "4864153": "Brandi Hicks", "3357633": "Diego Velazquez", "4863900": "Ellia White", "4134656": "Jerry Bell Jr.", "5909945": "Adam Lau"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["A man named Leonard \"Lenny\" Drake is found dead in a garbage truck and Nick and Hank investigate the case. They find blood in the dumpster near his building and a trail of blood to the parking garage. The manager explains that the tenant was a violent man that lived in his apartment with the gorgeous Natalie Havershaw. On the previous night, they had an argument and the tenants Marty Burgess first and the lawyer Mason Snyder then had come to protect her. Marty returned to his apartment while Lenny and Mason continued to argue. Then Mason escorted her to her car and she left the building to check in a hotel. Nick and Hank visit Marty at his junk shop and Nick sees that Marty looked like a mouse. Then they visit Mason and Nick sees that the lawyer looked like a snake. Nick visits Monroe and learns that the creatures are the harmless and cowardly Mauzhertz and the dangerous and lethal Lausenschlange respectively. Then Monroe receives a phone call relative to work and Nick leaves him, but Monroe receives a message instead. When another man is found dead in the dumpster of a repair shop in the same \"modus-operandis\" Nick believes the cases are connected.—Claudio Carvalho, Rio de Janeiro, Brazil", "While investigating a gruesome homicide, Nick learns that a seemingly mild-mannered resident could be festering a potential monster created from a dark childhood. Meanwhile, Monroe is sent an unsettling message by the creature community, who are beginning to wonder if his priorities lie with them or a Grimm.—NBC Publicity"], "genres": "N/A", "imdbID": "2075677", "rating": 7.5, "votes": 1504, "number_of_episodes": 123}