{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0279209": "Patrick Fischler", "0755185": "Sharon Sachs", "0523825": "Henri Lubatti", "1564397": "Haley Talbot", "1508744": "Bevin Kaye", "1296521": "Tim True", "3737820": "Lanie Hoyo", "1177148": "Casey McFeron", "2812183": "Josh Mead", "4782159": "Quyona Anderson", "4103071": "Kate Mentesana", "3811620": "Cecily Crow", "3173191": "Rian Turner"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick learns that a series of disappearances, rapes-and possibly murders-of beautiful women in the Portland area is connected to a honeymoon hotel where the owner harbors a hypnotic power.", "Nick discovers that several disappeared women were raped, a few also killed, after a stay in Billy Capra's romantic, honeymoon-oriented hotel. After a Grimm-flash shows him Bill as a goat, Nick enlists Eddie Monroe to help him identify the feral type, which uses irresistible seduction pheromones, and to prepare a hotel intrusion to save the latest victims. Meanwhile Captain Sean Renard gives an uninvited French reaper a terrible welcome.—KGF Vissers", "A woman flees from a building and is hit by a car while crossing a nearby bridge. While the driver calls 911 a stranger kills the woman. Nick and Hank investigate the case, identify the woman, Faith Collins, and the coroner tells them that she was murdered by asphyxiation. They find a picture on her social network page of a Bed and Breakfast place named Bramble Haus located close to the bridge. Nick and Hank go to the place and the owner Billy Capra explains that Faith had been there but did not stay there. When Hank accidentally steps on a toad, Nick sees Billy's face changing and soon he realizes that Billy is a Ziegevolk. When Billy goes to the Blue Moon Bar, Hank investigates the Bramble Haus while Nick asks Monroe to help him again.—Claudio Carvalho, Rio de Janeiro, Brazil", "After investigating a strange cluster of female deaths and disappearances, Nick sends Monroe undercover to get a whiff of a hypnotic suspect. In the meantime, a stranger shows up looking to avenge the death of his friend at the hands of a Grimm, but he'll have to get past Captain Renard.—NBC Publicity"], "genres": "N/A", "imdbID": "2059726", "rating": 7.6, "votes": 1715, "number_of_episodes": 123}