{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1263939": "Danielle Panabaker", "0000838": "Daniel Baldwin", "0017519": "Don Alder", "0275356": "Michael Fetters", "0855061": "Rusty Tennant", "5002481": "Richard Turner", "4189288": "Dennis Fitzpatrick", "0143102": "David Cascadden", "5140952": "Anthony Casanova", "3783046": "Mia Allen", "2692314": "Daniel Knight", "4522576": "Tommy Hestmark", "5816024": "Jacob Block", "4264966": "Sandra Doolittle", "3542131": "Joshua Lee Frazier"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["When heavily burned bodies appear, Nick learns of the existence of dragons in the world of wesen and a charismatic fire-dancer tries to spark a flame between herself and Nick, hiding a deadly true agenda.", "Nick is puzzled by several corpses with unusual semi-internal combustion symptoms. After Nick and Hank are attacked by a fire-breathing dragon, which fits the riddle, Monroe teaches Nick about the suspect feral breed, not actual dragons but close, and brings him in contact with a member, Ariel Eberhart, fire-breather at his favorite nightclub. She seems however more interested in Nick than is safe for his relationship with Juliette, and is the daughter of the murdering 'dragon'.—KGF Vissers", "Nick and Hank investigate the murder of two copper thieves that have been completely burnt. A witness describes the possible murderer and the police drawer prepares an identikit. The man is identified as Fred Eberhart, a missing welder and veteran of war. Nick visits his daughter Ariel in a nightclub and soon Monroe explains that they are dragon-like creatures called Dämonfeuers. Soon Ariel abducts Juliette to give the chance to his father, who is terminal, to die with dignity.—Claudio Carvalho, Rio de Janeiro, Brazil", "While investigating an arson-related homicide with Hank, Nick finds himself in the heated world of Portland fire-dancing where he meets a woman who might just be too hot to handle. With Monroe's help, Nick will have to find out if he can investigate the case without getting himself or those close to him burned.—NBC Publicity"], "genres": "N/A", "imdbID": "2202951", "rating": 8.0, "votes": 1537, "number_of_episodes": 123}