{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0046730": "Tim Bagley", "1309643": "Claire Coffee", "1703101": "Ayanna Berkshire", "0123632": "Kate Burton", "4747617": "Joy Flatz", "2771672": "Tierra Valentine", "0743287": "Burl Ross", "3885943": "Sophia Mitri Schloss", "2365770": "Julie Vhay", "4747590": "Mark Lewis", "4747585": "Casey Vann", "4748293": "Danny Hernandez", "6653608": "Amy Belisle"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick Burkhardt, a promising Portland homicide detective, told nobody he's been seeing visions of people 'transforming' into monsters when he looks at them. While investigating the murder and disappearance of two girls, he realizes it's a Grimm family gift, which passes from his aunt Marie Kessler when she is dying from cancer. She also gives him a mysterious key. Nick becomes her attacker's next target, narrowly escaping. Nick discreetly uses his gift to track down a postman, who turns out to be a descendant of werewolf lineage, and who helps him find the violent monster.—KGF Vissers", "In Portland, Detective Nick Burkhardt and his partner Hank Griffin investigate the murder of a college girl that was slaughtered by a beast while jogging in the local park. Nick lives with his girlfriend Juliette Silverton and they are in love with each other. He has visions of people turning into monsters but he does not disclose his secret to anybody. When his beloved aunt Marie Kessler unexpectedly comes to his house, Nick learns that Marie is dying of cancer. Further, she tells him that he is a descendant of the Grimm Brothers and he has the ability of seeing monsters, and she gives a mysterious key to him. When the little girl Robin Howell vanishes while walking to her grandmother's house, Nick suspects the Blutbad Monroe. But soon he learns that Monroe is not evil and he helps Nick to seek-out Robin. Will Nick find the little girl and rescue her?—Claudio Carvalho, Rio de Janeiro, Brazil", "After the mysterious brutal attack of a local college co-ed, Portland homicide Detective Nick Burkhardt discovered he is descendant of an elite line of criminal profilers known as \"Grimms,\" charged with keeping balance between humanity and the mythological creatures of the world. As he tries to hide the dangers of his new found calling from his fiancé, Juliette Silverton, and his partner, Hank Griffin, he becomes ever more entrenched in the ancient rivalries and alliances of the Grimm world. With help from his reluctant confidant, Monroe, a reformed Grimm creature himself, Nick must navigate through the forces of a larger-than-life mythology.—NBC Publicity"], "genres": "N/A", "imdbID": "1940498", "rating": 7.8, "votes": 2493, "number_of_episodes": 123}