{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0377034": "Brad William Henke", "0628120": "Jaime Ray Newman", "0736263": "Daniel Roebuck", "2362878": "Jack Sneed", "0234560": "Matt Dotson", "4522576": "Tommy Hestmark", "1436561": "Alistair McKenzie"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Blutbad Hap Lasser coincidentally survives a cunning arson attack which makes his home explode, two months after his brother died in a similar fire. Monroe reluctantly takes him in, also as a favor to Hap's sister, Monroe's own ex-lover Angelina. She returns to revenge both brothers and hates Grimms but resumes nocturnal hunt fun with Monroe. Lieutenant Peter Orson didn't call either case arson, but lost his own brother in a fire which may be a Blutbad's doing.—KGF Vissers", "When the house of the strong Hap Lasser blows-up, Nick and Hank learn that the trailer of his brother had recently exploded and Hap has inherited the insurance. Soon Grimm discovers that Hap is a Blutbad and friend of Monroe that accepts to temporarily lodge him at his home. When Grimm is visiting Monroe, a female rider arrives and attacks Grimm, but she is Hap's sister Angeline Lasser that is Monroe's ex-girlfriend but Monroe explains to her his relationship with Grimm. Grimm investigates Angeline while she goes with Monroe to the park to make love. Meanwhile a hit man executes Hap and soon Nick discovers that Lieutenant L.L. Orson is a Bauerschwein and might be the killer.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nick is called to a suspected arson case, which exposes a longstanding family feud that brings Monroe face-to-face with characters from his troubled past. While Monroe wrestles with restraining his wild side, it's up to Nick to keep everything from going up in flames.—NBC Publicity"], "genres": "N/A", "imdbID": "2056972", "rating": 8.0, "votes": 1643, "number_of_episodes": 123}