{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1134641": "David Clayton Rogers", "0776040": "Amanda Schull", "0942875": "Tom Wright", "0403080": "Trish Hunter", "4738381": "Niene Pugliano", "1655779": "Orianna Milne", "0930381": "David Williams Jr.", "5041118": "Felicia Tuck", "0675949": "Robert Pescovitz", "1769070": "Vladimir Tevlovski", "5492167": "Steven Sukul"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["After a man and his wife are scammed out their fortune by a Madoff-like fraudster, the husband approaches his wife's evil stepmother for financial assistance. But she refuses and is soon after murdered by a Murcielago - a bat-like creature that kills with a sonic scream.—Rudy1957", "Nick and Monroe realize the murder of businessman Arthur Jarvis's extremely rich mother in law Mavis, who meanly refused to save his ailing firm financially, by mysterious auditive means, is not mechanical, the official death cause, but the work of a feral bat species called Murcielago. They must find out whether Arthur's wife Lucinda or her sisters are and killed.—KGF Vissers", "The crook Bernard Aidikoff commits suicide when the police officers come to arrest him for a Ponzi scheme. The investor Arthur Jarvis summons his friend Spencer Harrison and explains that he had invested all the money with Aidikoff and he is broken. Spencer tells him to borrow money from Mavis Kerfield that is the stepmother of his wife Lucinda. Arthur visits his mother-in-law and she refuses to lend money to him. During the night, Mavis is visited by a frightening creature that emits a loud scream and she falls over the balcony of her house and dies in the middle of broken crystals from her chandelier. On the next morning, her daughter Tiffany finds her body and Nick and Hank investigate the case. They interview her two sisters and Arthur, Lucinda and Spencer, and nick suspects of Spencer, who is a bat-like creature named Murciélado Matraca. Meanwhile Juliette snoops around the murder of Nick's parents and the detective in charge of the investigation tells that the case was reclassified as homicide many years ago and sends the pictures of the four suspects.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2373013", "rating": 7.8, "votes": 1326, "number_of_episodes": 123}