{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1468061": "Eric Edelstein", "0209815": "Anthony De Longis", "4776377": "Kacey Griffin", "3195158": "Jon Ashley Hall", "0046617": "Glen Baggerly", "2305663": "Ellen Bloodworth", "2788604": "Juan Canopii", "4854235": "Lex Damis", "0106875": "Jan Brehm", "4194039": "John R. Lewis", "1436561": "Alistair McKenzie"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Highly respected judge Logan Patterson is murdered, and shortly after several other people who played some part in the conviction and incarceration of an escaped giant of unnatural strength. Nick is badly wounded, out of action. Monroe however shows unusual enthusiasm to help out while Hank follows the paper trail.—KGF Vissers", "A strong man breaks in the house of the respected Judge Logan Patterson and brutally kills him with his gavel. The police find a fingerprint that matches with the sailor Vince Chilton and Nick, Hank and Captain Renard go to his apartment and find him dead with a severed hand. They find an old watch on his mutilated arm and Nick and Hank go to visit Monroe to identify the owner. Soon he informs that the owner is the retired DA Mary Robinson and Hank recognizes the name. They discover that she is also murdered at home. Hank identifies the killer as Oleg Stark, who has just escaped from prison and does not feel pain and has dense bones. In his trial, Judge Partterson, DA Mary Robinson and the jury foreman Vince Chilton were the responsible for his conviction. Soon Monroe identifies Oleg as a Siegbarste, a.k.a. ogre, and the only way to vanquish him is using a rare poison. Further, Oleg is hunting Nick and Hank down.—Claudio Carvalho, Rio de Janeiro, Brazil", "An escapee returns to Portland seeking revenge against those who put him behind bars. His unusual strength and high tolerance for pain makes Nick take notice. As the case escalates Nick and Juliette are put in danger, and Monroe is called into action to help put an end to the convict's deadly rampage.—NBC Publicity"], "genres": "N/A", "imdbID": "2087188", "rating": 8.1, "votes": 1581, "number_of_episodes": 123}