{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0005439": "Azura Skye", "0709620": "Josh Randall", "0717502": "Eric Riedmann", "2459165": "Michael Sheets", "0089382": "Tim Blough", "5816024": "Jacob Block", "3542131": "Joshua Lee Frazier"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick and Juliette go away for a little R & R. They meet a couple who turns out to be not human. Juliette meets the wife and senses she's being abused. Nick learns the man is a being who abuses women.", "Nicks takes his first holiday since he realized being a grim, to propose to Juliette in a romantic country setting. They end up in a lodge next to the home of feral Timothy Steinkellner, who they soon rightly suspect of nasty business with his wife Robin, also a feral but avian. It turns out sheriff Munson, whom Nick could only inform, given jurisdiction, is in the plot for a golden egg. Meanwhile Hank, supposed to mind the fort, only stalks Analind, who continues luring men under Renard's orders. The secrecy now exacts a high price for Nick.—KGF Vissers", "Nick buys an engagement ring and travels to the countryside with Juliette to propose her in a romantic environment. On the arrival, Nick asks information to the neighbor Timothy Steinkellner and Juliette notes that his wife Robin is abused by Timothy. Nick calls the local Sheriff Munson and he believes that the domestic violence is resolved. But he learns that Timothy is a violent creature and Robin is an avian that can deliver a golden egg. Meanwhile Hank is obsessed by Adaling that provokes him as part of the plan of Captain Renard. Will Nick have the chance to give the ring to his beloved Juliette?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2208573", "rating": 7.9, "votes": 1397, "number_of_episodes": 123}