{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0009918": "Amy Acker", "0327764": "Nicholas Gonzalez", "0755185": "Sharon Sachs", "0002604": "Robert Blanche", "3155258": "Will Grimme", "4898047": "Jake Mager", "3737820": "Lanie Hoyo", "0206582": "Shannon Day", "0557086": "Mike Massa", "3283936": "Kyle Vahan", "0116461": "Danny Bruno", "4898308": "Nelda Reyes", "1011675": "Ryan McCluskey", "4678949": "Nicole McCullough", "0949430": "Dalene Young", "2766012": "Jewel Robinson", "3613254": "Michelle Damis", "0228857": "James Dixon", "2781344": "RJ Belles", "5816024": "Jacob Block", "3542131": "Joshua Lee Frazier"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick and the police department goes on the hunt for a mysterious wesen woman who first seduces men and then gruesomely murders them in a \"Arachnid\"-related death.", "A mysterious woman seduces men, then kills them in a way too gruesome to watch. Nick must uncover this new and rare creature's secret and find her before she kills again. Concurrently, Nick takes (admittedly belated) action to stop the (Wesen) creatures from rumor-mongering and stalking his home; in this show of power, Nick is slowly coming into his own as a Grimm - and defending house and home.—Michelle Levine", "Nick is confronted with male corpses whose organs were consumed internally. Monroe explains that must be the work of a feral spider, even the rare black widow-like kind, which eats its mates, and presents him to centennial Lena Marcenko. While Nick must take action against Wesen (feral creatures) after vandalism against his mobile home also endangers his lover Juliette, it becomes clear there's a whole family of lethal spiders to deal with.—KGF Vissers", "Nick and Hank investigate a murder case of a mummified man with the internal organs drained and surveillance cameras show the man with a mysterious woman. They also find one finger of the killer and discover that his Rolex was stolen. Then they find a second victim with the same finger prints at the crime scene. Their further investigation shows additional cases related to the fingerprint, three victims each five years. Meanwhile Nick meets Monroe and he takes him to a Wesen nursery home where they visit the Spinnetod Charlotte and Nick learns that they need to suck the life out of young men to avoid accelerated aging. Nick also visits the Eisbibers that are stalking his house and warns them to stop with the action. When the Rolex is found at a school, Nick knows that he has found the killer.—Claudio Carvalho, Rio de Janeiro, Brazil", "Nick and Hank find themselves on the hunt for a deadly heartbreaker leaving behind a web of dead bodies. Meanwhile, Nick's growing recognition among the creature world is starting to threaten not only his safety but Juliette's as well, and it may be time for him to take action to keep her safe.—NBC Publicity"], "genres": "N/A", "imdbID": "2104400", "rating": 7.8, "votes": 1521, "number_of_episodes": 123}