{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0974575": "Brian Tee", "1445952": "Scott Michael Morgan", "0002604": "Robert Blanche", "0001512": "Mary Elizabeth Mastrantonio", "1468135": "Ben Gonio", "3195983": "Alycia Delmore", "2066990": "Richard Carmen", "5102493": "D'Emmanuel Ball", "3644805": "Jacqueline Gault", "5816024": "Jacob Block"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["A Schakal Wesen wreaks havoc while searching for the ancient Zakynthos gold coins, while a mysterious woman in black tracks his movements. Nick informs a dubious Juliette of his heritage just before she collapses and is hospitalized because of a poisonous scratch from Adalind's cat.—Rudy1957", "Just when Nick gets information on his parents' feral killer Akira Kimura, the fiend arrives in Portland, leaving corpses again on his bloody quest for the golden Zakinthos coins. Captain Sean Renard is captured to be tortured for them, but saved last-minute by cops arriving in the investigation for Kimura's latest victims. When Juliet refuses to take Nick's panic-warnings serious after being scratched by Alinda's cat, he tries to show her, even enlisting Monroe's reluctant help, his Grimm legacy. He ignores it includes a surprisingly resurfacing relative.—KGF Vissers", "The private detective Nathaniel Adams follows and takes photos of Nick, Hank, Renard and Monroe. The wesen Akira Kimura, who killed Nick's parents, arrives in Portland searching for the Zakynthos gold coins. He meets Nathaniel in the hotel room and he tells to Akira that Renard, Hank or Nick might have the coins. Akira kills Nathaniel and chases Renard. When the body is found by the chambermaid, Nick and Hank see the photos and send Sergeant Wu to Renard's apartment, but Akira is torturing him. A mysterious woman in black is tracking Akira's steps. Meanwhile Juliette is scratched by Adalind's cat in her clinic. When Nick is aware of the happening, he wants to take Juliette to a hospital, but she refuses to go. Nick decides to bring Juliette to his trailer and disclose his secret to her to convince Juliette how dangerous Adalind is. What will be the reaction of Juliette?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2383907", "rating": 8.7, "votes": 1514, "number_of_episodes": 123}