{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0002604": "Robert Blanche", "3094583": "Paul Glazier", "1731757": "Sean Cook", "0116461": "Danny Bruno", "4086992": "Randy Sean Schulman", "4747585": "Casey Vann", "5816024": "Jacob Block", "3542131": "Joshua Lee Frazier", "5512657": "Matt Musgrove", "5492167": "Steven Sukul"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["45"],  "plot": ["Nick investigates the robbery of a spice shop, that is owned by wesen, discovering that the thieves were after a dangerous drug.", "Herbalist Freddy Calvert is murdered in his spices shop by two intruding ferals, who are chased off by the alarm he still manages to trigger. Monroe and Freddy's sister and heir Rosalee tell Nick the murders must be addicts after a mind-poisoning drug. On captain Renard's orders, seductress Adalind Schade bakes magically spiked cookies to put a spell on Hank, then tries to dispose gruesomely of sergeant Wu, but Rosalee knows a cure.—KGF Vissers", "Two addicted creatures break into the spice and tea shop of Freddy Calvert to rob a powerful drug called \"J\". Freddy activates the alarm and is murdered by one of them. His sister Rosalee comes from Seattle to Portland to meet Nick and Hank and then to the investigations of Nick and Monroe. Meanwhile Captain Renard asks Adalind to seduce Hank using a powerful spell but Sergeant Wu is affected by the magic.—Claudio Carvalho, Rio de Janeiro, Brazil", "After the grisly murder of a familiar shop owner, Nick joins forces with Monroe to help solve the murder. When the shop owner's sister, Rosalee, comes to town, Nick thinks he may have found a new ally in the creature world. Elsewhere, Captain Renard enlists Adalind to cast a spell on Hank. Meanwhile, Sgt. Wu unwittingly becomes entangled in Adalind's dastardly plan.—NBC Publicity"], "genres": "N/A", "imdbID": "2200281", "rating": 8.1, "votes": 1422, "number_of_episodes": 123}