{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "1309643": "Claire Coffee", "0013037": "Shohreh Aghdashloo", "0198620": "Bertila Damas", "0310887": "Gill Gayle", "0116461": "Danny Bruno", "0568056": "Mary McDonald-Lewis", "0414585": "Peter Anthony Jacobs", "4013788": "Nicole Santora", "0824498": "Brian Steele", "5816024": "Jacob Block"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["60"],  "plot": ["A young geologist is gruesomely burned after collecting rock samples from a nearby volcano, and it finds Nick and the rest trying to stop a demonic Beast who is literally hot to the touch.", "While Hank goes on vacation, Nick and Renard team up to investigate the death of a local geologist who was cooked from the inside out after taking volcanic rock samples from Mount Hood. Meanwhile in Austria, Frau Pech takes Adalind to a Gypsy woman to learn the value of her baby, but the former Hexenbiest desires something other than money.—M.D. McKean", "Nick, Wu, Renard and Monroe investigate the death at home by extreme heat without clear source of a vulcanologist who reported shortly before an 'attack' by strange mountain-dweller Marcus Hemmings. Nick notices it's a feral and comes to believe his warning for similar executions by a supernatural fire-creature on everyone who 'violates' the volcano's rocks, which are magically linked to the 'ring of fire' around the Pacific. The murder of her boss confirms the theory, so they decide to set a daring trap. From Vienna, crone Pech takes Aalid to the Roma gypsy queen and her sons to ascertain the value of her baby, depending on royal lineage and gender, a painful process, but she wants her Hexenbiest powers back, not the 'going' cash price. Pilar instructs Juliette how to break her stifling clutter of memories of Nick, which made her cause a car crash, by stepping into one made vivid enough.—KGF Vissers"], "genres": "N/A", "imdbID": "2800992", "rating": 7.9, "votes": 1188, "number_of_episodes": 123}