{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0240043": "Anne Dudek", "0219206": "Alexis Denisof", "3288551": "Christian Lagadec", "0002604": "Robert Blanche", "0699851": "Damien Puckler", "0293175": "Gene Freedman", "2600911": "Spencer Conway", "3962397": "Sophie Soong", "0413974": "Richard Lee Jackson", "5813521": "Rafael Miguel", "2305308": "Susannah Mars", "4967522": "Rob Lauta", "6359114": "Jim Lapan", "0552456": "James Martin", "10327935": "David Hendrick", "0619873": "Henry Noble", "5562350": "Brad Hackworth", "9813472": "Sam Z. Morrison", "6256967": "Arlene East", "2149591": "Ira Kortum", "3201821": "Kendall Wells", "0852172": "Cooper Taylor", "6891772": "Dave Kosloski"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Nick, Hank and Juliette learn what the Wesen Community already know, the Wesen were GODS in ancient Egypt Meanwhile, Adalind and Meisner again run for their lives after a tortured Sebastien reveals the location where he dropped them off. Sgt. Wu, still fighting for his sanity is visited by Juliette. She tells Wu of her ordeal, which seems to have helped him because Wu is later picked up and taken home by Nick and Hank.—Horace M.", "Nick and Hank are on the trail of a Wesen who appears to be trying to steal an Egyptian mummy from the university archeology lab, but a familiar face sent by the Wesen Council comes to Portland with an unexpected message for the Grimm. Meanwhile, Viktor searches for Adalind and the resistance members who helped her escape, and Juliette tries to help Wu (Reggie Lee) come to grips with his frightening experiences.—M.D. McKean", "After Portland university archeology Vera Gates is called to collect an atypical jackal-shaped Egyptian mummy found walled-in, two feral Wesen brothers break in to steal it for ritual purposes, one of them getting fatally shot by the security agent. Monroe explains to Nick that Anubis was just one one many Egyptian zoomorph gods who actually were venerated Wesen. Then arrives a Wesen Council envoy to 'help' Grimm's team handle the case. Viktor tortures prisoner Sebastian for the resistance hideout whereabouts of Adalind. Despite Wu's monster nightmares, his therapy is considered successful enough to be released home.—KGF Vissers"], "genres": "N/A", "imdbID": "3475758", "rating": 8.1, "votes": 1044, "number_of_episodes": 123}