{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0219206": "Alexis Denisof", "1362980": "Max Arciniega", "1595801": "Alyssa Diaz", "0745194": "Will Rothhaar", "2400472": "Bernhard Forcher", "1271152": "Philip Anthony-Rodriguez", "0002604": "Robert Blanche", "1444543": "Andrew Harris", "6980303": "Evonne De La Fuente", "3176278": "Shawn Lee", "3767598": "Ruben Del Rio", "0547045": "Michele Mariana", "6980302": "Chester-Castillo Morales", "0703778": "Brandon Quinn", "6777740": "Raul Espericueta"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["44"],  "plot": ["An unsuspecting traveler brings a blood-sucking legend with him to Portland, and Nick (David Giuntoli) and Hank (Russell Hornsby) find themselves investigating the gruesome trail of \"El Chupacabra.\" Meanwhile, Monroe (Silas Weir Mitchell) and Rosalee (Bree Turner) prepare to leave for their long-overdue honeymoon as they are met with more threats regarding their marriage. Elsewhere, Viktor (guest star Alexis Denisof) and Adalind (Claire Coffee) decide to take a trip of their own, while Wu (Reggie Lee) decides to confront Nick about what he has been seeing.", "Nick and Hank investigate a murder involving the legendary Chupacabra and discover that it is connected to the Wesen. Meanwhile, Wu continues to ask questions, Juliette's illness continues, and the Resistance asks Renard what he knows about Diana's disappearance.—foster Ntim", "Dr. Diego Hoyos returns to Portland after being bitten by a mosquito in the Dominican Republic and turns into a legendary Latino nocturnal avenging monster, \"El Chupacabra\". Monroe and Rosalee postpone their honeymoon again to prepare an antidote, required with 48 hours, but Diego has infected his beloved and a rare ingredient suffices only for one dose. Sergeant Wu considers resigning after Renard dismisses his doubts about many of Nick's closed cases, but is finally initiated in the feral Grimm bestiary. While prince Viktor and Adalind embark on the search for her baby, Renard receives Resistance emissary Hans Tavitian, determined to shield Nick's mother and his own.—KGF Vissers"], "genres": "N/A", "imdbID": "4044196", "rating": 8.4, "votes": 1128, "number_of_episodes": 123}