{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "0518321": "Louise Lombard", "0909578": "Brigid Brannagh", "1014989": "David Julian Hirsh", "3240106": "Jakob Salvati", "1352845": "David Ury", "0017519": "Don Alder", "0824498": "Brian Steele", "6913125": "Kanon Havens", "1627602": "Kevin T. Williams", "0589639": "Dana Millican", "1693186": "Jon Bebe", "6913126": "Nathan Crosby", "4233145": "Clancy Bundy", "3184418": "Adam Dunlap", "6913127": "Ryan Wren Barret", "5336526": "Paul Sobrie", "5802718": "Alexandra Marlene", "2119396": "Jean-Luc Boucherot", "0767837": "Meg Savlov", "6262118": "Joseph Thomas Bailey"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["44"],  "plot": ["A rabbi raises a golem to protect his nephew, but he can't control it. Elizabeth successfully recreates Adalind's spell, but it still requires a key ingredient.", "Nick (David Giuntoli) and Hank (Russell Hornsby) are called to an unusual crime scene with a victim who appears to have died from clay-induced asphyxiation. At the precinct, Wu (Reggie Lee) begins to grow more suspicious of Trubel's (guest star Jacqueline Toboni ) presence. At the Spice Shop, Elizabeth (guest star Louise Lombard) makes a major breakthrough with regards to restoring Nick's powers, while Monroe (Silas Weir Mitchell) and Rosalee (Bree Turner) experience cultural backlash as a result of their inter-Wesen marriage. In Europe, Adalind (Claire Coffee) hopes that putting trust in her mysterious visitor will help her escape the dungeon.", "Renard's Hexenbiest mother Elisabeth joins Monroe's shop team to work out Adalind's curse on Nick and device a cure to restore his Grimm powers. Wu keeps inquiring about Nick's erratic behavior. Angry about the bullying of his nephew , rabbi Ben Fisher invoked cabalistic protection, but now finds it actually created a Golem (magical clay giant), who kills anyone endangering young David. In Austria, a mysterious old fellow prisoner offers Adalind a way out, but she is lured back by faces in the walls promising to lead to her baby.—KGF Vissers"], "genres": "N/A", "imdbID": "3882292", "rating": 8.0, "votes": 1077, "number_of_episodes": 123}