{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "0219206": "Alexis Denisof", "0518321": "Louise Lombard", "0042805": "Erick Avari", "1926337": "Toni Trucks", "1271152": "Philip Anthony-Rodriguez", "3154566": "Lucas Near-Verbrugghe", "3969893": "Ricki Bhullar", "6421264": "Khushi Dayal", "6947338": "Amitesh Prasad", "1874126": "Tarun Shetty", "3832591": "Daniel Brockley", "5697251": "Joseph Gibson", "0820195": "John Srednicki", "6947339": "Tyler Irwin", "4292683": "Doug Deibele", "6432149": "Todd E. Williams"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["44"],  "plot": ["With Monroe and Rosalie are dealing with a growing problem from Wesen purists, Nick and Juliette must decide if a normal life is really what they want.", "The justification for Nick to become a grim again is made much clearer in the wake of the most recent attack against Monroe and Rosalee. At work, Nick and Hank are called to a stretch of highway that acts as a staging area for a horrifying Wesen ritual. In Vienna, Vicktor meets with a completely broken Adalind. Meanwhile, Trubel is surprised by the sudden arrival of an old friend.", "As Rosalee and Monroe receives more threats Nic and Juliette are ready to try to get Nic's Grimm back. It does not work out the way they expected. Murders along Rt406 is unsolved for years until Nic and his team arrives. Prince Victor and Adalind resume the search for her baby.—hanni5", "Monroe and Rosalee deal with another attack from a Wesen marriage purist group while Nick and Juliette go through the process of trying to get Nick's Grimm powers back. After a kidnapping on a local highway, Nick realizes it's connected to one of his first cases.—Ice Alien", "Nick's powers don't return after the ritual sex therapy, but kick in later, while he and Hank investigate another highway kidnapping and sacrificial murder, which fits the pattern of an Indian Kali-devoted feral, a whole lair of which is found at a car junk yard. Monroe and Rosalee may have to postpone their honeymoon plans, being targeted by an old feral purist movement violently opposing mixed weddings like theirs. Trubel gets a surprise visit from her desperate young friend Josh, a Grimm's powerless son. In Vienna, prince Viktor receives Adalind, also wanting her baby.—KGF Vissers"], "genres": "N/A", "imdbID": "3986098", "rating": 8.5, "votes": 1120, "number_of_episodes": 123}