{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0903677": "Arnold Vosloo", "0004731": "Garcelle Beauvais", "0219206": "Alexis Denisof", "1271152": "Philip Anthony-Rodriguez", "0572651": "Sharonlee McLean", "1116155": "Dana Green", "0116300": "Corey Brunish", "3784051": "Kevin Newland Scott", "0403820": "Nurmi Husa", "2600911": "Spencer Conway", "3744018": "Kenajuan Bentley", "5271390": "Jason McBeth", "2499815": "Karen Corona", "7111786": "Jeffrey Wade Gilbert", "7276789": "Ijeoma Agu", "4292683": "Doug Deibele"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["44"],  "plot": ["Nick and Hank investigate a series of murders that lead back to the Wesen Council and a mysterious bounty hunter.", "The Wesen Council has sent a bounty hunter to Portland to take out lawbreakers. Naturally the murders attract the attention of the Grimm. Nick, unable to let them go even against the order of the council forces them to order a hit on him instead.—Matt Johnson", "Nick and Hank investigate a series of murders that lead back to the Wesen Council and a mysterious bounty hunter. Elsewhere, Juliette's meeting with Henrietta brings about more disturbing news than she was expecting. Meanwhile, Adalind and Viktor make their way back to Portland.—richie027", "Nick (David Giuntoli) and Hank (Russell Hornsby) investigate a series of murders that lead back to the Wesen Council and a mysterious bounty hunter (guest star Arnold Vosloo). Elsewhere, Juliette's (Bitsie Tulloch) meeting with Henrietta (guest star Garcelle Beauvais) brings about more disturbing news than she was expecting. Meanwhile, Adalind (Claire Coffee) and Viktor (guest start Alexis Denisof) make their way back to Portland.", "Nick's police and feral teams must identify and deal with a \"maréchaussée\", a lethal bounty hunter sent by the Wesen council, while prince Viktor brings Adalind back to Portland. Even Renard's recommended magical-feral therapist Henrietta is appalled how badly Juliette is affected by the irreversible spell, leaving her a Hexenbiest, which she still hides even from Nick.—KGF Vissers"], "genres": "N/A", "imdbID": "4178078", "rating": 8.6, "votes": 1141, "number_of_episodes": 123}