{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0736263": "Daniel Roebuck", "0219206": "Alexis Denisof", "0256297": "Gideon Emery", "0364744": "Hank Harris", "1271152": "Philip Anthony-Rodriguez", "5463230": "John Murray", "0302834": "Allen Galli", "7124260": "Jordan Roske", "4903415": "Madison Wray", "3744018": "Kenajuan Bentley", "2608901": "Jessica A. Caesar", "7124261": "Antonio D. Richardson", "6653608": "Amy Belisle", "9814837": "Tim Bennett", "6891772": "Dave Kosloski", "5901738": "Jason Loitz"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["42"],  "plot": ["While Nick and Hank investigate the deaths of two teenagers in an arson case they realize they need the help of someone that Nick had arrested several years ago.", "An ancient Phoenix-like Wesen strikes in Portland at an outdoor sporting goods store killing two kids. Detectives Nick and Hank along with Sargeant Wu then look to an old coworker who was incarcerated to help them solve their and his own past case. Meanwhile, an overzealous Adalind makes her move on Juliette to get some answers as to her babies' whereabouts. Unfortunately for her this meeting pushes Juliette's patience past breaking point igniting.", "When an arson case looks to have Wesen origins, Nick (David Giuntoli) find himself reluctantly having to ask an old foe for help. Elsewhere, Viktor (guest star Alexis Denisof) teaches Adalind (Claire Coffee) the effectiveness of well-played diplomacy. Meanwhile, Juliette (Bitsie Tulloch) finds herself in a confrontation sooner than expected.", "When a store burns down with two people inside, Nick investigates. And when things appear to be odd, like there's no accelerant or primary source. Nick goes to see imprisoned arson investigator and Bauerschwein, Peter Orson. When Orson sees the photo, he says he encountered this before. A similar fire and he even thinks he saw the one who started it, thing is the man disappeared. Nick looks through his books and thinks they're dealing with a wesen that is like a Phoenix, who can literally turn into fire. Viktor and Adalind arrive in Portland and they learn that Juliet aided Nick's mom to disappear with Adalind's baby. So Adalind goes to see her.—rcs0411@yahoo.com", "The Portland police soon suspects insurance fraud when Johan and son Andy Harrison's outdated warehouse burns down, shortly after upgrading the policy, but the expert finds no normal fire source or accelerator. Nick turns to the feral ex-cop he had to imprison for a murder, as the expert who was competently investigating the first of a series of similar arson cases, Bauerschwein Peter Orson, and convinces him to enjoy a short leave from prison to help them out. They find the intermediary lawyer murdered in his car, then identify and trap the 'phoenix', which self-ignites, after Monroe and Rosalee devise a protective creme and sort of a weapon tactic. Juliette is surprised to be confronted by Adalind, whom prince Viktor brought to Portland on the royal baby quest.—KGF Vissers"], "genres": "N/A", "imdbID": "4219170", "rating": 8.8, "votes": 1252, "number_of_episodes": 123}