{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0266611": "Mark Famiglietti", "2436567": "Briana Lane", "0219206": "Alexis Denisof", "2328961": "Brian J. Saville Allard", "5647317": "Lauren Crowe-Mueller", "2396134": "Darius Jones", "3234572": "Claudine Mboligikpelani Nako", "0470782": "Dan Kremer", "1241291": "Michael Fisher-Welsh", "0258453": "Duffy Epstein", "6493908": "Ricard Foyé", "5438913": "Morgen Johnson"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["44"],  "plot": ["Nick (David Giuntoli) and Hank (Russell Hornsby) are called to investigate a one night stand turned deadly when a man finds himself in the middle of a very bizarre love triangle. Captain Renard (Sasha Roiz) hopes Monroe (Silas Weir Mitchell) and Rosalee (Bree Turner) can help him deal with recurring episodes of phantom bleeding. Meanwhile, Adalind (Claire Coffee) makes a discovery that might turn the tables in her favor and Juliette (Bitsie Tulloch) makes a big decision that could change the course of her relationship with Nick.", "Nick, Wu and Hank investigate the latest in a series of robbery-murders apparently committed by elusive couples seducing male victims in rented rooms, which fits a rare feral species' incomplete description. Helped by Monroe, who reluctantly acts as undercover bait for the couple, which operates under the names Linus and Stacy Balouzian, Nick rightly suspects the use of transvestite bars is more key then clue. Suffering from violent phantom bleeding during and after nightmares, Renard turns to Monroe and Rosalee's apothecary practice, but finds this requires the magic of his mother's grimoire, which can only be opened with Hexenbiest blood, which he collects as rent from Juliette who needs a host having left Nick indefinitely. Adalind is desperate, knowing she's pregnant again, when king Frederick wants to leave her I the search party in Portland while dragging Victor, whom she wants to act as father, back to Vienna.—KGF Vissers"], "genres": "N/A", "imdbID": "4292174", "rating": 8.0, "votes": 1064, "number_of_episodes": 123}