{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "0699851": "Damien Puckler", "5483400": "Madeline Brewer", "0003928": "Bob Clendenin", "0759229": "Gabriel Salvador", "0116461": "Danny Bruno", "0500333": "Anne Leighton", "1128780": "Elizabeth Tulloch", "3283936": "Kyle Vahan", "5036778": "Kevin Carroll", "0142169": "Hank Cartwright", "3089373": "Jim Crino", "8877736": "Brenda Braxton", "2384402": "Jessica Bork", "0232840": "Tony Donno", "4149192": "Peter Jang", "0390584": "Logan Holladay", "7650702": "Joseph Mueller", "5427467": "Baraka Noel", "3173191": "Rian Turner"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Monroe is in danger when Wesen business owners are targeted in a string of attacks being investigated by Nick and Hank. Trubel catches Nick and Adalind up on her recent activities. Captain Renard endorses a political candidate.", "A riot targeting Wesen leaves a shopkeeper dead and a friend of Monroe and Rosalee missing, but Nick's investigation suggests it's just a prelude to what's coming. Trubel reveals to Nick and Adalind what she's been doing for the last several months.—M.D. McKean", "Nick (David Giuntoli) and Hank (Russell Hornsby) investigate a wave of coordinated Wesen gang vandalism that results in the death of a local business owner and the kidnapping of Monroe (Silas Weir Mitchell) and Rosalee's (Bree Turner) friend. As they dig deeper, they learn that Portland wasn't the only city hit with a wave of violence. Meanwhile, Truble (guest star Jacqueline Toboni) fills Nick and Adalind (Claire Coffee) on what she has been up to. Elsewhere, Capt. Renard (Sasha Roiz) dips his toes into politics as he endorses a local candidate."], "genres": "N/A", "imdbID": "4981514", "rating": 8.5, "votes": 1084, "number_of_episodes": 123}