{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0602267": "Danny Mora", "1928515": "J.J. Soria", "0500333": "Anne Leighton", "0346144": "Chavo Guerrero Jr.", "1296521": "Tim True", "0002604": "Robert Blanche", "7611933": "Thomas Lemieux", "0145076": "George Castillo", "0214376": "Barbara Deering", "6037304": "Joel Robert Walker", "7533278": "P.E. Ingraham", "3553805": "Joshua Sawtell", "2459165": "Michael Sheets", "7834581": "Luis Arambul", "3979887": "Cody Burns", "6889324": "Elsa Faith", "4455984": "Matthew Salinas", "4205603": "Jason Yates"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["A down on his luck Luchador receives a special mask that will make him the star he's always wanted to be. Misuse, however, leads to terrible consequences. Meanwhile, Eve believes something is amiss with Dixon's assassination.", "A local maskmaker is targeting Wesen to create Luchador masks that bestows great power to its wearer. As Nick (David Giuntoli), Hank (Russell Hornsby), Monroe (Silas Weir Mitchell) and Rosalee (Bree Turner) work to stop the killings, Capt. Renard (Sasha Roiz) considers an offer that will bring him closer to claiming his destiny. Meanwhile, Eve's (Bitsie Tulloch) further investigation of a recent incident raises new questions.", "When ambitious young \"luchador\" (Mexican costumed wrestler) Goyo is tired of playing the staged loser, old mask artist Benito makes and gives him a winner's mask. Goyo ignores the warning never to wear it outside the ring, and comes under its murderous influence, and it sort of fuses with his skin. Unable to bear the pain, Goyo begs to be relieved, but the possessive spirit turns on both, leaving only Monroe able to perform the antidote rite once Nick's team has traced the killing in Goyo's trail. Meanwhile mayoral candidate Dixon's murder by feral hit-man Marwan Hanano is investigated and Renard offered to take his place.—KGF Vissers"], "genres": "N/A", "imdbID": "5241162", "rating": 7.4, "votes": 932, "number_of_episodes": 123}