{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0699851": "Damien Puckler", "6452826": "Jacqueline Toboni", "3303074": "Mason Cook", "4953698": "Eric Osovsky", "5645167": "Emma Rose Maloney", "5411105": "Juliocesar Chavez", "6102048": "Steven Michael West", "4555998": "Michael Cahill", "2174561": "Jason Adkins", "5487128": "Kirsten Foe", "1169549": "Jason Wilkinson", "7743546": "David Drews", "1589928": "Lolly Ward", "7743547": "Declan Tucker", "4521479": "Adalberto Angulo", "9814837": "Tim Bennett", "10672077": "Shane Edward Thompson"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Rosalee goes missing after a band of orphaned children target her as the mother figure they have always wanted. With a furious Monroe by their side, Nick and Hank race against the clock to find Rosalee.", "When the body of a woman who went missing a few years ago turns up, they try to find where she's been and who took her. What they don't know is that she was taken by four orphan kids who want a mother. And when they meet Rosalee they choose her to be their next mother.—rcs0411@yahoo.com", "Having accepted his role as father, Nick moves with Adalind and their baby son into a remote private 'fortress' home, without 'marital' relationship, yet accepts even to move into a single bedroom 'for now'. Meisner tells Renard about king Frederick's fatal helicopter 'accident' and Viktor's succession with tactical Resistance-support 'for now', not that he's keeping Trubel captive. The Portland PD finds Wendy Henley's corpse, whose death in the woods suspiciously resembles a case two years earlier. Husband Ben is cleared, leaving it an apparent mystery. Until Rosalee is first robbed I the feral pharmacy, then kidnapped as 'mother' to Peter's gang of orphan Wesen who don't even realize what they are.—KGF Vissers"], "genres": "N/A", "imdbID": "4903278", "rating": 7.7, "votes": 1031, "number_of_episodes": 123}