{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "0869467": "Shaun Toub", "0500333": "Anne Leighton", "0002604": "Robert Blanche", "8075458": "Hannah R. Loyd", "0130904": "Tony Calvino", "3257915": "Jake Ynzunza", "2161495": "Lodric D. Collins", "3937013": "Kacy Owens", "3290049": "Ben Whitehair", "1212115": "Steve Kim", "3082253": "Dan Kyle", "2382101": "Patrick Kwan", "7319789": "David M. Drury", "4292683": "Doug Deibele", "7842735": "Peter James DeLuca", "5054233": "Brandon Thomas", "10672077": "Shane Edward Thompson"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["42"],  "plot": ["The war with Black Claw escalates as Nick and his friends are targeted for elimination.", "Black Claw makes a strategic move against Hank (Russell Hornsby) that shocks everyone and sends Nick (David Giuntoli) on a war path. Hadrian's Wall ramps up their investigation as they seek out a mysterious man named Bonaparte (guest star Shaun Toub). Meanwhile, Adalind (Claire Coffee) and Capt. Renard (Sasha Roiz) must learn to deal with their new and very unpredictable reality with Diana (guest star Hannah R. Loyd). Part 2 of 2.", "Bonaparte now goes all the way to get the book, listing all Grimms, by torturing Nick, who is arrested for attacking Renard in the precinct, with nightmares and threats to his abducted baby son Kelly. His Black Claw ferals ravage Hadrian's Wall, then search and find, after Nick's escape, having tailed Monroe, the hideout, where preparations are made for a defense, distraction and flight trough the tunnel. Renard and Adalind regret being on the opposite side, even attempt to turn Diana's magic against Bonparte, and Sean bravely surprises everyone crucially.—KGF Vissers"], "genres": "N/A", "imdbID": "5547152", "rating": 9.3, "votes": 1592, "number_of_episodes": 123}