{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0846480": "Cary-Hiroyuki Tagawa", "0500333": "Anne Leighton", "0455058": "Matthew Yang King", "3487329": "Christopher Meyer", "0012962": "Keiko Agena", "8075458": "Hannah R. Loyd", "0563944": "Scarlett McAlister", "1870581": "Nathan Kornelis", "5098101": "Aliina Sconiers", "8118119": "Kyler Morrison", "6755249": "Joel Ambo", "0513490": "Shelly Lipkin", "4292683": "Doug Deibele", "1963622": "David Loftus"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Local youths are in danger from a Japanese Wesen looking for revenge; and Adalind crosses paths with Eve.", "When a boy who was reported missing is found beheaded and his body buried up to his neck. Nick learns that he and another boy were suspected of killing another boy. And it seems that the dead boy's family threatened him. Eve tells Adalind to watch herself.—rcs0411@yahoo.com", "Investigating teenager Brian Johnson's ritual decapitation, before his mate Roger is abducted, Nick finds it's the work of a Japanese 'ghost dog', who avenges all evil doe to the Japanese family of the feral Akagi couple whose son Kuma the knaves accidentally shot dead. By transforming into Renard's Black Claw campaign manager, Eve discovers -in bed- they are lovers. While Adelind postulates for her lawyer job back, Monroe and Rosalee sneak into the secret tunnel to Nick's home and happen to hear her warned off by Eve, and she still doesn't tell Nick her Hexenbeast cure wears off.—KGF Vissers", "When the severed head of a young man is found under a bridge, Nick and Hank find themselves on the case of Japanese Wesen acting on an ancient tradition of revenge. Elsewhere, Adalind decides to go back to work at her old law firm and has her first face-to-face with Eve.—ahmetkozan"], "genres": "N/A", "imdbID": "5337472", "rating": 7.9, "votes": 886, "number_of_episodes": 123}