{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0699851": "Damien Puckler", "0003082": "Bailey Chase", "0500333": "Anne Leighton", "0615645": "Wolf Muser", "3553805": "Joshua Sawtell", "2459165": "Michael Sheets", "2759814": "Ben Newman", "4690593": "Alexander Smith", "4797413": "Aaron Ross", "2059742": "Joseph Kathrein", "1631897": "Igor Korosec", "1670367": "Billy Louviere", "6760147": "Jamie Pederson", "4292683": "Doug Deibele", "6965145": "Donovan Etzel", "1370624": "Damian Fannin", "7271271": "Eric Hepperle", "12245034": "Rebekah A. Morin", "8095853": "Eric Sahlstrom"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Nick and Monroe discover the hidden treasure in the Black Forest. A figure from Rosalee's past comes back to haunt her. The hexenbiest suppression on Adalind begins to wear off. Renard, Hank, and Wu hunt down an assassin.", "Nick (David Giuntoli) and Monroe (Silas Weir Mitchell) find a treasure in the Black Forest in Germany that has been hidden for centuries. Back in Portland, Capt. Renard (Sasha Roiz) joins Hank (Russell Hornsby) and Wu (Reggie Lee) to track down a deadly assassin who has thrown Portland into havoc. Little do they know that Eve (Bitsie Tulloch) is on a hunt of her own for the same man. Meanwhile, someone from Rosalee's (Bree Turner) past tracks her down.—Eric Hepperle", "Nick and Monroe find the crusade era treasure trove in the crypt, elude the priest's outsmarted feral 'militia' and bring it home, where all loyal friends participate excited in an attempt to use the seven keys. After mayoral candidate Andy dies from his shot wound, Renard considers the offer to stand in his place. The hit-man is chased by the police and trapped by Meisner's team, but a lack of coordination sabotages the plan to trail him to the Black Claw.—KGF Vissers"], "genres": "N/A", "imdbID": "5162084", "rating": 8.8, "votes": 1048, "number_of_episodes": 123}