{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "0869467": "Shaun Toub", "0495095": "Sharon Leal", "0699851": "Damien Puckler", "0002604": "Robert Blanche", "6917327": "Dan Crisafulli", "0513490": "Shelly Lipkin", "4566190": "Sarah Siadat", "5932423": "Leah Huebner", "8075458": "Hannah R. Loyd", "8109044": "Seth Rue", "6995948": "Ezekiel Boston", "6375907": "Asha Sawyer", "10672077": "Shane Edward Thompson"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Wu discovers he is infected with lycanthropia after being attacked by a Skalengeck from Black Claw. Trubel returns and Adalind leaves Nick to join Renard/Black Claw in order to protect not only her children but Nick as well.", "Suffering from the bite he sustained, Sgt. Wu (Reggie Lee) becomes entangled in a surprising altercation that may land him in hot water. After meeting the mysterious Bonaparte (guest star Shaun Toub), Adalind (Claire Coffee) is faced with a difficult decision that could change her and Nick's (David Giuntoli) lives forever. Meanwhile, Hank (Russell Hornsby) gets even closer to Zuri (guest star Sharon Leal) and their relationship begins to take shape. Back at HW, Eve (Bitsie Tulloch) senses that a new force may jeopardize the entire operation.", "Adalind is forced by Black Claw to make a decision that could jeopardize her relationship with Nick. Nick learns about Diana's presence in Portland through Eve who tries to warn him about Adalind. Wu's condition seems to have worsened when another dead body turned up. Hank's decision to start a relationship with Zuri might take a different turn. Meanwhile, Diana tries reaching out her mother.", "After a public episode and metamorphosis in hospital, Wu's condition becomes clear to Nick's teal and is diagnosed by Monroe as atypical reaction to a werewolf bite. The potion has painful memory arousal effects, including how he killed petty dealer Theo Delano. Black Claw chief Conrad Bonaparte arrives, trusting he can manipulate mayoral candidate Renard and lawyer Adalind into helping control Diana, who abuses her irresistible powers to commander her parents, but also has a mind links with Juliette, painful but intriguing.—KGF Vissers", "Nick leans on Monroe and Rosalee as he worries that he may lose everything as he continues to battle Black Claw. Renard ramps up his campaign as election time nears. Elsewhere, Adalind is faced with a very difficult decision in order to protect her children. Meanwhile, Hank's relationship with Zuri takes an unexpected turn and Wu tries to gain control of his new reality.—ahmetkozan"], "genres": "N/A", "imdbID": "5449842", "rating": 8.3, "votes": 919, "number_of_episodes": 123}