{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "0699851": "Damien Puckler", "0653959": "Rick Overton", "0635297": "Carsten Norgaard", "6889196": "Adam O'Byrne", "0500333": "Anne Leighton", "3094567": "Lucy Paschall", "2459165": "Michael Sheets", "2759814": "Ben Newman", "4354704": "Aris Juson", "4935043": "Dylan Boye", "4292683": "Doug Deibele"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Monroe receives a call from a relative in Germany that will bring Nick closer to his ancestors. Complications arise when the nefarious group Black Claw also takes an interest in this discovery.", "Monroe (Silas Weir Mitchell) gets a call from a relative in Germany that will bring Nick (David Giuntoli) closer to his ancestors. Things get complicated when the nefarious group Black Claw is also after the same artifacts. Elsewhere, Capt. Renard (Sasha Roiz) helps a mayoral candidate get an edge on his opponent. Meanwhile, Trubel (guest star Jacqueline Toboni) confronts Eve (Bitsie Tulloch) about Nick and Adalind (Claire Coffee).", "Monroe's uncle who is an antique dealer in Germany calls him to tell him he found something which could be of interest to his friend, the Grimm. He sends some photos which Monroe shows Nick who says he's interested. When he arrives, he tells Nick what he wants and Nick tries to get it. In the meantime some people who want what he found are following him.—rcs0411@yahoo.com", "Monroe is delighted to be contacted by his German uncle, antiquary Felix, startled he's offering for sale a chest full of Grimm books, from a murdered feral Czech's legacy, which turns out also to contain hidden compartments with arms and an unexpected treasure dating back to the crusades, richer then Nick's family's. However Felix was followed and is murdered by Black Claw, while Meisner hunts them down and Renard commits to Andrew Dixon's mayoral campaign.—KGF Vissers"], "genres": "N/A", "imdbID": "5120310", "rating": 8.9, "votes": 1168, "number_of_episodes": 123}