{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0544611": "William Mapother", "5116901": "Daniel di Tomasso", "1391090": "Walter Perez", "1561547": "Melinda Page Hamilton", "0500333": "Anne Leighton", "8059406": "Damien Geter", "0569199": "Ehren McGhehey", "2759814": "Ben Newman", "2233544": "Ben Blair", "3195930": "Darragh Kennan", "1700833": "Bob Olin", "8877736": "Brenda Braxton", "7363756": "Brandon Baity", "1457945": "Irene Doukas Behrman", "4292683": "Doug Deibele", "9715407": "Cassandra Frost", "5054233": "Brandon Thomas"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["Nick investigates a traveling preacher who uses his wesen identity to gain followers after one of his bodyguards winds up dead, while a religious sect is seeking to capture him. Eve uses Renards body to further investigate the Black Claw.", "An evangelical preacher (guest star William Mapother) has a tent revival unlike any other when he uses his Wesen identity to gain more believers. Nick (David Giuntoli) and Hank (Russell Hornsby) are called to the scene as things escalate when a group of \"true believers\" are hell bent on saving the preacher and his flock by any means necessary. Meanwhile, Capt. Renard (Sasha Roiz) takes further steps to gain power in local government. Elsewhere, Eve (Bitsie Tulloch) uses Adalind's (Claire Coffee) ol' hat trick to gain more access to Black Claw.", "Travelling evangelical 'wonder' preacher Dwight Eleazer pretends to cure people by taking their sins from a devil he dares to possess him, which is actually just a rare, usually shy feral kind's typical vogue. Nick's party is soon convinced he means well despite people being roughed up, one even killed, by overzealous 'guards' shielding against attempts to record the sessions, while a ruthless rival sect plans to cure the 'devil caller' the hard way. Meanwhile Renard officially stands for mayor, arousing doubts about his intentions, possible Black Claw connection and political capacities, with Eve impersonating him and probably sabotage the Hexenbeast way.—KGF Vissers", "An evangelical preacher has a tent revival unlike any other when he uses his Wesen identity to gain more believers. Nick and Hank are called to the scene as things escalate when a group of \"true believers\" are hell bent on saving the preacher and his flock by any means necessary. Meanwhile, Capt. Renard takes further steps to gain power in local government. Elsewhere, Eve uses Adalind's ol' hat trick to gain more access to Black Claw.—ahmetkozan"], "genres": "N/A", "imdbID": "5279178", "rating": 7.6, "votes": 890, "number_of_episodes": 123}