{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "0264579": "Patrick Fabian", "1485069": "Jonathan Patrick Moore", "0500333": "Anne Leighton", "2759814": "Ben Newman", "5512378": "Amber Stonebraker", "8041855": "Claire Rigsby", "2443134": "Lauren Bair", "2442262": "Anya Ruoss", "2365770": "Julie Vhay", "0589639": "Dana Millican", "7099778": "Noah Greene", "3553805": "Joshua Sawtell", "2459165": "Michael Sheets", "6486206": "Julie Coles", "7533278": "P.E. Ingraham", "4194039": "John R. Lewis", "4928273": "Peter Simpson", "8687145": "Tamara Szalewski", "4205603": "Jason Yates"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["43"],  "plot": ["A beauty regimen proves deadly for a young woman, who seems to have aged 70 years when Nick and Hank find her lifeless body. As they search for proof of Wesen involvement, they are led to a local doctor, and end up enlisting Rosalee's help in their investigation. Meanwhile, Eve takes a bold step to learn more about Capt. Renard's nefarious dealings.", "Photographer Malcolm Caulfield promises beautiful people a shot at a model career, but vogueing after a photo-shoot sucks out their life force in liquid form, which he sells to Dr. Eugene Forbes to market as ultimate facial creme. In fact it's highly addictive and causes extreme aging causing early death. Nick's team soon finds out about several cases and tracks down the doc as common factor, so Rosalee goes undercover as 'rich patient', but the doc already used the 'fountain of youth' and hysterically demands more from reluctant Malcolm, whose kind i-was recorded i Egypt. Meanwhile Renard formally accepts to run for mayor, while Eve resorts in agony to magically impersonating him.—KGF Vissers"], "genres": "N/A", "imdbID": "5267086", "rating": 7.8, "votes": 905, "number_of_episodes": 123}