{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "0699851": "Damien Puckler", "0750916": "William Russ", "1889973": "Charles Baker", "0326988": "Carlos Gómez", "2632919": "Alissa Jessup", "1469230": "Anna Campbell", "8786255": "Chris Franklin", "5334014": "Jacob Bean-Watson", "5462785": "Heath Koerschgen", "0026269": "Tobias Anderson", "8470922": "Benjamin Johnston", "9222997": "Tracy Salsbery"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["42"],  "plot": ["A grisly murder in a hotel leads to a guest who claims to be haunted by a terrifying creature in the night; at the Spice Shop, Monroe, Rosalee and Eve investigate the origins of the symbols on the cloth.", "Nick (David Giuntoli), Hank (Russell Hornsby) and Wu (Reggie Lee) investigate a local hotel after a grisly murder leads to one of its guests who claims to be haunted by a frightening creature in the night. At the Spice Shop, Monroe (Silas Weir Mitchell), Rosalee (Bree Turner) and Eve (Bitsie Tulloch) continue to research the origins of the symbols on the cloth and may be getting closer to unlocking its mystery. Meanwhile, Capt. Renard (Sasha Roiz) continues to be haunted by his past transgressions.", "An ordinary man beats a passerby to death unprovoked, having left his shabby hotel in underwear and full panic. Nick's team believes his story about a nightmarish monster which comes whenever he falls asleep and soon realizes it's the work of a feral who operates from that same hotel decades apart in a cycle, so they must act quickly. Monroe is forced to accept acting as bait. Meanwhile Renard waves Black Claw Anselmo Baledin's hostile questioning while 'nightmare' Meisner warns Sean about a mugging bunch and promises to leave him alone for having dealt with that scum. Monroe and the girls work out the scribbles Juliette made are an intercultural astronomical 'map' pointing to an impending future.—KGF Vissers"], "genres": "N/A", "imdbID": "5858434", "rating": 7.9, "votes": 903, "number_of_episodes": 123}