{"cast": {"1365912": "David Giuntoli", "0395203": "Russell Hornsby", "1128780": "Elizabeth Tulloch", "0593734": "Silas Weir Mitchell", "1501388": "Sasha Roiz", "0498046": "Reggie Lee", "0877430": "Bree Turner", "1309643": "Claire Coffee", "6452826": "Jacqueline Toboni", "1505157": "Wil Traval", "3594887": "Kevin Joy", "1490478": "Nicole Steinwedell", "8075458": "Hannah R. Loyd", "0002604": "Robert Blanche", "0123632": "Kate Burton", "0001512": "Mary Elizabeth Mastrantonio", "1157771": "Andrew Morgado", "1408752": "Douglas Tait", "5048948": "Stephen Douglas Butler", "4292683": "Doug Deibele", "10386091": "Daniel Vasic"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery"], "runtimes": ["42"],  "plot": ["Nick faces off against his greatest foe yet, as it seems no weapon can defeat him. Monroe, Rosalee and Eve search for answers that may help them in the fight. Renard and Adalind try to keep Diana and Kelly safe.", "Facing his greatest foe yet, Nick looks to his ancestors for strength to save the world from a terrifying end; Monroe, Rosalee and Eve find a rare potion that might help in the fight; Capt. Renard and Adalind try to keep baby Diana and Kelly safe.—Flash Reverse", "Zorestër has wiped out the police station , as everyone is now dead. The gang finds out a spell requiring the blood of three Wesen, Hexenbeast and a Grimm. Trubel shows up at the station and Nick tells her to go to the cabin where Monroe, Rosalee , Adalind, Renard, Diana and Kelly. By the time Nick shows, Zorestër has been tracking him by his piece of the staff. As Zorestër starts killing all the people Nick Loves. If he surrenders the piece Zorestër will return all to life with the World as the deal. As Nick gets weak , Zorestër returns Trubel to life. Will Nick allow the World to be destroyed? What will happen and why is he seeing dead people appear?—stephen scialli"], "genres": "N/A", "imdbID": "5858480", "rating": 8.9, "votes": 1971, "number_of_episodes": 123}