{"cast": {"1429380": "Britt Robertson", "0215281": "Thomas Dekker", "0363736": "Gale Harold", "2100081": "Phoebe Tonkin", "2645189": "Shelley Hennig", "2498781": "Jessica Parker Kennedy", "3024712": "Chris Zylka", "0000449": "Natasha Henstridge", "0484880": "Joe Lando", "3012064": "Grey Damon", "2145177": "Alexia Fast", "2960352": "Tim Phillipps", "0364227": "Adam J. Harrington", "4229518": "Jaime M. Callica", "8047458": "Chandy Krapes", "4025263": "Felipe Viana"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Romance"], "runtimes": ["43"],  "plot": ["While the school conducts a casino night fundraiser, John's search for sway raises suspicions, and a love triangle turns deadly.", "Tensions arise between Adam and Cassie over what her father John is so eagerly searching for in the abandoned house - the 'sway' Adam and Nick safely retrieved earlier, used to steal a witch's power. She insists to take it to John and tends to believe his explanation that he needs it to protect her circle from evil witch hunter Eben by outing the traitor of sixteen years ago. Jake shares Adam's concern and stresses that Eben could only triumph over the parents' circle if one of them betrayed them, and the logical suspects are John himself and Adam's father Ethan, whom the Blackwells later confront without final resolution. At the school's \"casino\" fundraiser, John firmly refuses to side with doting Dawn again. Lee attends with Faye, but is caught and confronted aside by his deranged ex Eva, who now has powers. Handsome Aussie world traveler Grant patiently charms grumpy 'off-men' Diana. The kids learn the true danger of black magic while unaware of a curse concerning Conants and Blackwells.—KGF Vissers", "Cassie catches Blackwell sneaking around the abandoned house. After confiding in Adam, he tells her he knows Blackwell was looking for a device to drain witches' powers and is clearly back to his old ways. Faye shows up at Lee's house to invite him to the school fundraiser but is taken aback when Eva greets her at the door claiming to be Lee's girlfriend. Meanwhile, Melissa encourages Diana to date a normal guy and points her in the direction of a new, handsome Aussie in town. Dawn runs into Blackwell at the school but the reunion isn't quite what she hopes for.—CW Publicity"], "genres": "N/A", "imdbID": "2117626", "rating": 7.7, "votes": 381, "number_of_episodes": 22}