{"cast": {"1429380": "Britt Robertson", "0215281": "Thomas Dekker", "0363736": "Gale Harold", "2100081": "Phoebe Tonkin", "2645189": "Shelley Hennig", "2498781": "Jessica Parker Kennedy", "3024712": "Chris Zylka", "0000449": "Natasha Henstridge", "0484880": "Joe Lando", "2960352": "Tim Phillipps", "0745353": "Sammi Rotibi", "1742119": "Jared Keeso", "0469671": "Stepfanie Kramer"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery", "Romance"], "runtimes": ["41"],  "plot": ["After Faye is attacked by the Witch Hunters, Jake, Melissa and Adam set out to save her. Blackwell tells Cassie and Diana that the only way to stop the Witch Hunters is to use their Balcoin blood to unleash the Crystal Skull. Diana is reluctant, but Cassie convinces her its the only way to help their friend, but she'll need to tap into her dark magic to do it. Meanwhile, Dawn and Charles are faced with a new way to get their power back... but at a very high cost.—Anonymous", "After Eben and his witch hunters capture Faye, he demands a crystal as ransom, so the skull can't be formed to destroy him. John convinces the circle that the only hope is making the skull, which he does with daughters Cassie and Diana, who sense it unique power to magnify pure magic potential. John however overpowers and pins down his rebellious Blackwell girls, revealing he cares not for the other witches, just to use the skull as ultimate black magic tool, and breaks the circle. Jake's party tries to liberate Faye, but get caught too and bound on a modern stake by vindictive Eben. A senior witch grants Charles and Diana, who desperately want their magic back to save the children, her power. Charles draws the demons from Even, who is thus defeated, but can't handle all that evil inside. John must still be stooped from executing the actual plan he revealed to the girls: forming a perfect black circle with them and four secretly raised other Blackwell siblings.—KGF Vissers"], "genres": "N/A", "imdbID": "2117632", "rating": 8.2, "votes": 467, "number_of_episodes": 22}