{"cast": {"0005042": "Jason Isaacs", "0020751": "Laura Allen", "0004996": "Steve Harris", "1910255": "Dylan Minnette", "0000703": "BD Wong", "2288842": "Michaela McManus", "0005519": "Wilmer Valderrama", "0427728": "Cherry Jones", "0005041": "Laura Innes", "3299616": "Daniela Bobadilla", "0362862": "Mark Harelik", "0102128": "Paul McCarthy-Boyington", "0182824": "John Cothran", "0479801": "Carlos Lacamara", "0032399": "Phyllis Applegate", "2614826": "Patrick Cox", "0937824": "Kelly Wolf", "0832472": "John Storey", "1594244": "Steven Lee Allen", "0446964": "Leonard Kelly-Young", "2340558": "Thor Knai", "4236578": "Don Guevara", "0599841": "Liz Montgomery", "5026870": "Melissa Bales", "2451280": "Alan Gray", "2999525": "Stephen Janousek"}, "geners": ["Drama", "Fantasy", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["In three days, Michael and Hannah move to Oregon: they visit with Emma and her parents to offer to be supportive, but the parents articulate a different decision for Emma. Hannah isn't convinced this is what Emma wants. Meanwhile, Michael is closing out cases while the captain urges her underworld partner to be patient. In Michael's other reality, a double murder looks like a theft gone bad; then, they find evidence in a dumpster that sends them searching for other answers.—<jhailey@hotmail.com>", "Detective Efrem Vega sweetly showers Mike with gratitude and insists on throwing a send-off party. With only three days on the job, Britten must work in his partner/successor in a complex drug case while they handle a seemingly simple double murder case, which turns out not a robbery but a major real estate plot. Michael finds that late Rex's girl friend Emma is pregnant, and keeping the child, so his wife insists to meet her family, senses Emma is pushed by her parents to give it away and offers the Brittens adopt it. Mike decides to withdrew his resignation and hold the move, which makes him a murder target again for the captain's drug trade cahoot, whose stock can't be stored quality-safely much longer.—KGF Vissers"], "genres": "N/A", "imdbID": "2199829", "rating": 7.8, "votes": 284, "number_of_episodes": 13}