{"cast": {"0375138": "Sofia Helin", "0091035": "Kim Bodnia", "0540216": "Dag Malmberg", "0385026": "Ellen Hillingsø", "2361583": "Christian Hillborg", "0470886": "Magnus Krepper", "0770087": "Puk Scharbau", "3643896": "Emil Birk Hartmann", "2115450": "Maria Sundbom Lörelius", "1142392": "Rafael Pettersson", "0511474": "Anette Lindbäck", "2234835": "Said William Legue", "1180874": "Kristina Brändén Whitaker", "0391105": "Dietrich Hollinderbäumer", "0369165": "Morten Hauch-Fausbøll", "0159867": "Nicolaj Kopernikus", "0137839": "Julie Carlsen", "0392339": "Yaba Holst", "0841152": "Lennart R. Svensson", "2214587": "Lea Høyer", "2966647": "Toke Græsborg", "0252432": "Mats Eklund", "4703617": "Anton Frost Barlach", "4703604": "Freja Frost Barlach", "1281135": "Magnus Schmitz", "4695476": "Mia Blihagen", "4696623": "Gabriel Flores Jair", "1402303": "Rasmus Hammerich", "0840897": "Sune Svanekier", "0674147": "Sevik Perl", "1595716": "Thomas Chaanhing", "3804405": "Fanny Ketter", "4075362": "Lena Kronberg", "6195479": "Lovisa Håkansdotter Wallin"}, "geners": ["Crime", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["After the murder on the bridge, the killer makes his presence known and chooses a tabloid journalist to act as a contact with the outside world.", "The bomb in Daniel Ferbé's car did not go off. Instead, the car's CD player put out a disc that contains a message from the murderer, which is also published on a website. He deplores five grievances of society, the first of which shall be highlighted by the murders. Norén traces back the website of the murderer to a server of the Danish CID and Rohde reopens the case of the second victim, a Danish prostitute who disappeared more than a year ago, and obtains her diary. Eventually Charlotte Söringer manages to get her beloved husband his heart transplant. Shortly after Göran wakes from anesthesia he suffers a relapse, but not before telling Charlotte that he wants to split up. While Rohde copes with tensions between his current family and his elder son and Norén picks up a guy in a bar, Daniel Ferbé is contacted by the murderer. He provides Ferbé with material to support his accusations. Ferbé publishes his findings and by this triggers a public discussion about the murderer's motives. Stefan Lindberg by chance discovers the record of a young homeless woman and recognizes her as his little sister Sonja. He starts searching for her, but just as he finds her she collapses. Just when Norén discovers a lead on the corpse, Ferbé is contacted by the murderer a second time.—laloschifrin"], "genres": "N/A", "imdbID": "1829103", "rating": 7.8, "votes": 1411, "number_of_episodes": 38}