{"cast": {"0375138": "Sofia Helin", "0511892": "Thure Lindhardt", "0083616": "Mikael Birkkjær", "0090360": "Sarah Boberg", "0474650": "Maria Kulle", "0137839": "Julie Carlsen", "1142392": "Rafael Pettersson", "2017961": "Anders Mossling", "2784943": "Fanny Leander Bornedal", "5359848": "Iris Mealor Olsen", "5632525": "Pontus T. Pagler", "4558335": "Erik Enge", "6162837": "Alexander Behrang Keshtkar", "2143583": "Lisa Linnertorp", "0855562": "Leonard Terfelt", "1125938": "Thomas W. Gabrielsson", "0468110": "Michalis Koutsogiannakis", "5393492": "Selma Modéer Wiking", "0405114": "Jesper Hyldegaard", "9528061": "Alva Ingvarsson", "2818741": "Sandra Yi Sencindiver", "4569986": "Elliott Crosset Hove", "4696623": "Gabriel Flores Jair", "0835563": "Lena Strömdahl", "0039575": "Michael Asmussen", "1514468": "Nicolai Dahl Hamilton", "0261928": "Regitze Estrup", "9236218": "Stina Nordberg", "1717138": "Adam Pålsson", "7629024": "Smilla Bak", "2866541": "Holly Lars Bjarke", "7514724": "Johannes Lindkvist", "10729513": "Candice van Litsenborgh"}, "geners": ["Crime", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["Henrik and his new colleague, Jonas, continue to investigate Margrethe Thormod's murder. Their two main leads are the radical leftist group, Red October, and the missing refugee, Taariq.", "Henrik and his new colleague, Jonas, continue to investigate Margrethe Thormod's murder. Their two main leads are the radical leftist group, Red October, and the missing refugee, Taariq, who has gone underground after having his asylum application rejected. Margrethe's husband Niels Thormod is grieving and doesn't think that the police are doing enough to find Margrethe's killer. Saga is in the hospital. She has now been declared innocent and wants to start working again. Henrik wants to have her on the investigation and Lillian finally accepts this. Saga quickly engages in the investigation and works almost twenty-four hours a day. Another murder victim is found in Sweden. There are connections to Red October, and a connection to Margrethe Thormod's murder as well - Henrik can't stop thinking about his missing daughters, but he wonders if he will have to, in order to move on. Saga doesn't listen to Henrik's doubts and continues to try to investigate what happened to them. She finds new information about Henrik's wife, Alice, that she has to look into."], "genres": "N/A", "imdbID": "7677222", "rating": 7.8, "votes": 863, "number_of_episodes": 38}