{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0005484": "Alan Thicke", "2747668": "Andrew Santino", "5007768": "Da'Vine Joy Randolph", "0574468": "Gerald McRaney", "0849689": "Richard Tanner", "1461279": "Lisa Schurga", "0169581": "Mark Cohen", "1896018": "Brian Oblak", "7919715": "Faithe Herman", "8082633": "Eris Baker", "4263976": "Yimmy Yim", "4033978": "Chris Grace", "2954288": "Caitlin Thompson", "4338487": "Alena Savostikova", "5302567": "Sydney Schafer", "5395063": "Jill Johnson", "1652276": "Brandon Ford Green", "5135948": "Stefanie Malouf", "6097296": "Vanessa Hernandez", "8455052": "Mark August Jaime", "8455053": "Steven Harrison", "1029058": "Wendi De Barros", "0808359": "Greg 'Christopher' Smith", "3574153": "Peter Bonilla", "3149894": "Lisa Domico Petrucci", "0530249": "Mario Lopez", "8234144": "Matthew Café", "3251090": "Elise D'Orazio", "4999374": "Ashley Zoe Fox", "2848609": "Darrell Keith Harris", "5367048": "Jedediah Jenk", "2226919": "Stephanie Ray", "7901092": "Carol Ann Van Natten"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca goes into an early labor; Randall finds his biological father; Kevin faces a personal and professional crisis; Kate finds herself at a low point.", "Those that are celebrating their 36th birthday today include: Jack, whose wife Rebecca is expecting triplets, which will be their first children; Randall, who has made a financial success of his life despite being abandoned by his unknown father at a firehall when he was a newborn; and twins Kevin and Kate, whose lives have taken divergent paths based solely on appearance, with \"model good looks\" actor Kevin having a lucrative lead role in a mindless sitcom called \"Man-ny\", the role which often requires him to be shirtless, and obese Kate wallowing in the difficulties in her life, those difficulties because of her weight. On this specific day, Rebecca goes into labor, six weeks premature, meaning that the children will have the same birthday as Jack. The stress from what is already considered a difficult pregnancy is ratcheted up a notch when Rebecca's regular doctor becomes incapacitated, leaving her in the care of a doctor she's never met, Dr. Katowski - \"Dr. K\" - he a septuagenarian at that. Regardless, Jack lets Dr. K know in no uncertain terms that losing either Rebecca or any of the three children is not an option. Through the work of a private detective, Randall discovers the name and whereabouts of his biological father, William. Randall had not thought through the implications of this discovery, including the impact on his and his family's life IF he decides to take the next step in meeting/confronting his father. Kevin and Kate have generally taken the path of least resistance to get to where they are. Each may end up taking a chance divergent from that normal path, Kevin's with regard to his career, and Kate's with regard to romance in the form of a wisecracking fellow support group member named Toby.—Huggo", "This day is a very special day for Jack, Kate, Kevin and Randall... it's their birthday! Rebecca, Jack's wife, goes into premature labor and has some concerns about delivering 6 weeks early. An abandoned baby is brought to the hospital by a fireman. Jack has a brilliant idea that will change their life. Randall searches for his birth father and finds him, but struggles with the idea of meeting him. Kevin is celebrating outwardly but inside he's lonely. Kate struggles with her weight and finds comfort in a support group.—Carrie DeCosta"], "genres": "N/A", "imdbID": "5734500", "rating": 9.2, "votes": 7537, "number_of_episodes": 106}