{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "2243196": "Jermel Nakia", "2581729": "Amanda Warren", "3109964": "Brian Tyree Henry", "8082633": "Eris Baker", "7919715": "Faithe Herman", "6807858": "Lonnie Chavis", "2484632": "Jennifer C. Holmes", "0809590": "Peter James Smith", "2904269": "Lee Simpson", "0924854": "Harrison White", "1902531": "Tinpo Lee", "1046197": "Felice Heather Monteith", "1721054": "Marcus T. Thomas", "6504985": "Frank Lui Geo", "12325288": "Marcus C. Allen", "8523970": "Angel Joy Lewis", "7309484": "Kimberly Ryans"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Randall and William take a road trip to Memphis, where Randall learns about William's past.", "Beth is wary of Randall's plan to drive to Memphis with William, his hometown where many of his, and thus by association Randall's surviving biological relatives still live. Beth's concern is solely because of Randall's nervous breakdown happening one week ago and he only having been out of the hospital for five days. But the trip is a go on the okay by Randall's psychiatrist. With biological father and son alone on the drive, their differences - William being carefree whereas Randall is regimented - may be highlighted. Beyond Randall meeting the family he never knew, he will find that William has some very specific things he needs to do on this trip, Memphis where he has not been in approximately forty years. Due to the reasons behind some of the things he needs to do, William may find that his homecoming is not all heartwarming, mostly around not why he left Memphis for Pittsburgh, but rather he having abandoned his responsibilities in Memphis. Randall will also discover that William has ulterior motives for this trip. Along the way, the spirit of Jack enters into the fray in more ways than one.—Huggo"], "genres": "N/A", "imdbID": "6142668", "rating": 9.5, "votes": 5429, "number_of_episodes": 106}