{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0005030": "Jon Huertas", "2857778": "Janet Montgomery", "5007768": "Da'Vine Joy Randolph", "6807858": "Lonnie Chavis", "0002878": "Ric Sarabia", "1002960": "Kate Blumberg", "7919715": "Faithe Herman", "8082633": "Eris Baker", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "5395063": "Jill Johnson", "2954288": "Caitlin Thompson", "4033978": "Chris Grace", "2971227": "Julia Cho", "8492984": "Danielle Pinnock", "3285753": "Carlin James", "5189419": "Dan Considine", "2226919": "Stephanie Ray"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["As Jack and Rebecca face a disastrous Thanksgiving, the family gather at Randall's house for the occasion.", "As Jack, Rebecca and the three kids make their way to Rebecca's parents' house for their traditional Thanksgiving holiday, an unforeseen detour occurs. Kate makes two drastic life changing decisions. Kevin brings Olivia to Randall's house for Thanksgiving. Randall's heart is broken when he learns about a lifelong secret his mother has kept from him.", "It's Thanksgiving Day, with the Pearson clan congregating at Randall and Beth's house. In addition to Randall's family including William, Rebecca and Miguel will be attending, Kevin has invited Olivia who doesn't generally do Thanksgiving with her family due to bad memories, and Kate and Toby will be flying in from Los Angeles. The day is a special one for the Pearsons, replete with well kept family traditions specific to the Thanksgiving when Randall, Kevin and Kate were nine. Prior to that specific Thanksgiving, the Pearsons spent the day at Rebecca's parents' house with their extended family, those annual events which the kids eventually admitted to their parents that they hated not only for the way their grandmother acted, but for the way that Rebecca acted around her. That specific Thanksgiving started out being a Murphy's law of a day, but actions by Jack under the bad circumstances made the day into how they now like to celebrate, which includes listening to Paul Simon's \"Graceland\", going on a 3.4 mile hike, watching Police Academy 3: Back in Training (1986) played on VHS, simulating a picnic with picnic blankets on the floor, having within their dinner home made cheese dogs on a stick, and each saying at dinner what they are thankful for while passing around an unraveling ball of yarn. The role that was played by Jack, complete with the \"hat\", now alternates annually between Kevin and Randall, this year falling on Kevin. This year, Randall wants to ensure that William keeps to his own happy traditions seeing that it will probably be his last Thanksgiving. Beyond this happiness, there are issues bubbling under the surface. Beth secretly confronts Rebecca about her knowing William's whereabouts since the siblings were born, a piece of information which Beth pressures Rebecca into telling Randall before the end of the day, or else. Kevin has not yet fully accepted Miguel as a member of the family, despite Miguel being a close family friend since they were kids. Despite his obvious feelings for her, Olivia may not be prepared to be what she believes Kevin wants her to be. And Kate and Toby's relationship is facing some issues which they may not be able to overcome. Kate makes a major life decision on the spur of the moment based on something that happens during her flight.—Huggo"], "genres": "N/A", "imdbID": "6072390", "rating": 9.0, "votes": 3749, "number_of_episodes": 106}