{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "1020036": "Alexandra Breckenridge", "0870794": "Sam Trammell", "0648846": "Peter Onorati", "1157053": "Jeremy Luke", "0600717": "Debra Mooney", "2744939": "Meryl Hathaway", "0668139": "Sara Paxton", "0602170": "Shaun Duke", "1119455": "Darren Richardson", "0631146": "Laura Niemi", "2893525": "Joe Conti", "2618797": "Ricky Saenz", "3798424": "Hesley Harps", "2692472": "Josh Tessier", "0429144": "Robert Dominick Jones", "2512423": "Crispin Alapag", "1186842": "Richard Gleason", "0041528": "Erik Aude", "0226936": "Sean Dillingham", "1249826": "Kym Jackson", "8807615": "Nicholas F. Philipp", "4379401": "Pablo Ramos", "3518466": "Anna Ross"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Jack attempts to meet Rebecca and make things right; Kate, Kevin and Randall make important decisions about their respective futures.", "1972. Jack has recently returned from the Vietnam War, where he worked as a mechanic. He has been working odd jobs for whatever he will be paid in pursuit of his many goals: to open a garage with his friend Darryl, to move out of his parents' house so that he never has to deal with his abusive father again, and to get his mother out from his father's control. Jack comes to the conclusion that he has to reach for what he wants as opposed to letting life come to him. This attitude takes Jack into some uncharted territory, some risky and dangerous, and others just unexpected. Meanwhile, Rebecca, whose friends are largely getting married or starting families, is focusing on her singing career, she just having produced a demo and singing regularly at open mic nights at bars on the weekends. Because of the small percentage of performers who make it big, Rebecca's friends encourage her to \"diversify\", namely to place some energy into finding a nice guy to marry which may entail going on some of those blind dates on which her family and friends are always trying to set her up, something she has and is still resisting. Back in 1996, Kate has convinced her father to drive the two hours to Cleveland to watch Rebecca perform in her first out-of-town gig with the band, and in the process to make things right with her. The events of that evening will have a profound effect on Jack and Rebecca's marriage. And in present day, each of Kevin, Kate and Randall come to pivotal points in their lives, the latter two, channeling Rebecca and Jack respectively, who make decisions on where they want certain aspects of their life to go.—Huggo"], "genres": "N/A", "imdbID": "6142670", "rating": 8.6, "votes": 2882, "number_of_episodes": 106}