{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0641354": "Denis O'Hare", "0005030": "Jon Huertas", "2168927": "Milana Vayntrub", "0801051": "Jimmi Simpson", "4685894": "Nadia Quinn", "0511051": "Nancy Linari", "0930617": "Gareth Williams", "0689708": "John Pollono", "6807858": "Lonnie Chavis", "0410893": "Brittany Ishibashi", "0574468": "Gerald McRaney", "7919715": "Faithe Herman", "8082633": "Eris Baker", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "7919761": "Juliana Sada", "3034204": "Millie Trachtenberg", "4119820": "Becki Dennis", "1552318": "Talia Toms", "3708005": "Eric Satterberg", "6637287": "Gabriel Baca"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["At Christmas, Jack and Rebecca are unexpectedly reunited with an old friend, while Kevin, Randall and Kate face different holiday dramas.", "It's Christmas Eve, a day that, at least philosophically, nothing bad ever happens in the Pearson family. The family is convening at Randall and Beth's for dinner, including Rebecca with whom Randall has made up, he at least understanding why she did what she did. However, things for the family members don't go according to the plan to make it to Randall and Beth's - that \"nothing bad\" which may not apply this year. Before dinner, Randall and Beth themselves are attending an annual work function, at which Randall, going through a mid-life crisis associated with all that is going on in his life, has purchased a boat from his business colleague, Andy. William is attending a Narcotics Anonymous meeting, not so much for the meeting itself, but to reconnect with someone from his recent past, that reconnection which may take priority over spending Christmas Eve with his biological family. Kevin has given his last-minute regrets to Randall, as he, out of \"owing her one,\" has to attend Hanukkah dinner with Sloane and her family. Part of that obligation is because they have just learned that the show is shutting down since Olivia walked out on the production after the fallout with Kevin at Thanksgiving. Kate, with a worried Rebecca at her side, has a meeting with her physician to discuss the good, and perhaps more the bad, of proceeding with the gastric bypass surgery. The emotions of the meeting lead to Kate canceling on dinner at the last minute, and Rebecca and Kate talking about joint events in their life which has led to where they currently are as mother and daughter, those events including Kate's ninth Christmas when a bout of appendicitis resulted in her and the rest of the family spending Christmas Eve at the hospital. But perhaps everything that happens today was meant to be, just as Kate's appendicitis on Christmas Eve was meant for Jack and Rebecca to reconnect with Dr. K at the hospital, he whom they had not seen since the children were born.—Huggo"], "genres": "N/A", "imdbID": "6115034", "rating": 8.9, "votes": 3474, "number_of_episodes": 106}