{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0004951": "Brad Garrett", "0005030": "Jon Huertas", "0005408": "Katey Sagal", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "7919715": "Faithe Herman", "8082633": "Eris Baker", "2954288": "Caitlin Thompson", "5395063": "Jill Johnson", "0258030": "Sergio Enrique", "2083743": "Lak Rana", "4263976": "Yimmy Yim", "3117374": "Lucas Acosta", "3251090": "Elise D'Orazio", "2226919": "Stephanie Ray", "4143590": "Will Sterling"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca struggle with raising a family; Beth grows suspicious of William; Kate stresses over her weight loss; Kevin faces fallout from his meltdown.", "Jack and Rebecca's kids are now eight, and Jack and Rebecca are having and have had continuing issues concerning all three. On top of it all, Rebecca has been doing all the heavy lifting keeping peace in the family, while Jack has been the best dad whenever he has been around, which is not very often, and becoming less and less so on his own initiative in not wanting to deal with the problems while he drowns his sorrows at a bar with Miguel. The question becomes if their family can withstand all these stresses on it. Meanwhile, Kevin discovers that leaving \"Man-ny\" is not as easy as just saying that he is quitting the show, as he has a binding two year contract. He is forced to attend a Hollywood party to ask the network bigwigs for forgiveness, something, because of his utter contempt for the show, he isn't sure he can do despite the consequences on his lucrative career. He wants Kate to go to the party with him for support, something she is resisting if only because of feeling self-conscious at a function where all the gorgeous people will be in attendance, while Toby wants her to go and take him with her so as not to make their relationship all about the common issue that brought them together, namely their weight problems. And Randall has welcomed William to his home so that he can help William get some proper health care for his advanced stomach cancer. Although she outwardly supports her husband in the matter, Beth can''t help but not trust William, believing he is using the \"bus fare\" that Randall provides him to buy drugs on what end up being his hours' long absences each day.—Huggo", "With the stresses of parenting three 8 year olds, Jack and Rebecca find themselves going through the motions. Not only is it the stress of parenting, but for Rebecca, Jacks drinking becomes an issue. He's absent a lot of the time leaving her to bear all the weight of the family. Randall's birth father William has been acting strange leaving Beth to uncover the truth. Kevin realizes that leaving the \"Man-ny\" may not be possible because of his contract. Kate struggles with the decision of whether or not to go to a party of the rich and famous.—Carrie DeCosta"], "genres": "N/A", "imdbID": "5924012", "rating": 8.5, "votes": 4112, "number_of_episodes": 106}