{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0005030": "Jon Huertas", "3292425": "Virginia Kull", "1896018": "Brian Oblak", "2243196": "Jermel Nakia", "6807858": "Lonnie Chavis", "0086806": "Susan Blakely", "0604541": "Chad Morgan", "1460740": "Mike Bradecich", "0574468": "Gerald McRaney", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "0804035": "Stewart Skelton", "6097296": "Vanessa Hernandez", "4412702": "Kraig Dane", "0809724": "Rob Chester Smith", "8717165": "Max Matenko", "0323020": "John Gloria", "0787307": "Erica Shaffer", "0396826": "Fitz Houston", "8040172": "Victoria Macabu"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["45"],  "plot": ["As Rebecca's pregnancy drags on, she forgets Jack's birthday, Nathan copes with his grief, and Randall inadvertently intervenes in a difficult marriage.", "It's August 31, 1980. Three parallel stories are told. In story one, Rebecca is thirty-three weeks pregnant, and the small pleasures which both she and Jack found in her early pregnancy have changed at least for Rebecca to what seems to be the constant verge of a total emotional breakdown. Regardless, Jack is still trying to keep her spirits up in any way he can. On this day, all Rebecca wants is to be alone, she banishing Jack from the house. In doing so, she doesn't realize that it is his thirty-sixth birthday, he who was looking forward to her annual birthday gift of a sexy Marilyn Monroe styled dance to him wearing only his birthday suit. In his banishment, Jack turns to Miguel for support and advice, Miguel, a father already, who may be able to provide some wisdom out of experience. In story two, Dr. K is both looking forward and not looking forward to a visit from one of his sons, Peter, and his family. Dr. K knows that Peter and his wife Alli will once again try to get him to move on with his life, his wife of fifty-three years, Caroline, who passed away fourteen months ago from cancer. Still talking to Caroline at the breakfast table every morning and having not thrown out any of her prescription medications, Dr. K is closer to wanting to end his life than he is to moving on without Caroline, despite an old friend, Anne, offering him her friendship. In story three, Joe, a fireman, looks to God to repair his long broken marriage to his wife, Samantha. He still loves her, or at least loves the memory of how he felt the first day he met her. That sign from God he believes is something he finds that is left outside the fire hall that day. These three stories will intersect by the end of the day, which will vastly change what looked to be the trajectory of each of the individual stories at the beginning of the day.—Huggo", "A very pregnant Rebecca forgets Jacks birthday & feels absolutely horrible about it. Especially since she freaked out on him & told him to leave & adjust his attitude before coming home. Jack leaves per Rebecca's request & goes to see Miguel. While out with the guys, Jack has an epiphany. Back in reality Jack & Rebecca have to come to terms with the loss of their baby. We get a look into the life of Dr. K outside of the hospital & it's not what is expected of a surgeon. But under the circumstances Dr. K has been through, time seems to be the only hope & solution. But how much time is what is worrying his family. Dr. K is on the verge of losing it when his pager goes off. The firefighter that brought Randall to the hospital is having issues in his personal life. He's feeling so hopeless & unwanted that he seeks guidance from a priest. When he realizes his nightmares might be coming true, he heads to the firehouse for some space & winds up with a bundle of joy. Wanting to keep the baby he heads home, only to have his wife convince him otherwise.—Carrie DeCosta"], "genres": "N/A", "imdbID": "6142658", "rating": 8.8, "votes": 3460, "number_of_episodes": 106}