{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "2168927": "Milana Vayntrub", "1020036": "Alexandra Breckenridge", "0223561": "Hari Dhillon", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8383168": "Mackenzie Hancsicsak", "4369276": "Adam Bartley", "0410893": "Brittany Ishibashi", "0689708": "John Pollono", "8733808": "Sophia Coto", "8468119": "Cyndi Melendez", "7104202": "Casey Zwicker", "8488923": "Eric Michael Johnson", "3817912": "Alex Marshall-Brown", "3055481": "Devon Ogden", "7736982": "Saphina Chanadet", "6495693": "Joe P. Harris", "5178898": "Energy Lewis", "0698596": "Regina Prokop"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca throw three separate birthday parties; Toby helps Kevin with a romantic gesture; Kate gets a new plan; Randall helps William with his bucket list.", "It's Kevin, Kate and Randall's 10th birthday. Unlike the joint parties their parents usually throw them complete with children's games like pin-the-tail-on-the-donkey, Kevin and Kate request separate preteen bordering on teenaged-themed parties, with which Randall goes along. This request, which their parents oblige, marks what Jack in particular sees as a turning point in their lives as a family. On Jack's initiative, Jack and Rebecca contemplate having more children seeing that their first three are moving onto another stage of their lives. Beyond what Jack and Rebecca see as issues with the resulting parties - some which affect them more than their children, and some which affect their children more than them - the goings-on mark some true turning points in their family dynamic. Kevin, in particular, has what will end up as a defining moment in his life. And Jack and Rebecca decide by the end of the parties if another child is what they really want at this point in their lives. In present day, Kate, seeing Toby having gone through heart surgery, decides to forgo gastric bypass surgery at least for now, in favor of a month-long extreme weight-loss boot camp recommended to her by her doctor. Kate ends up being surprised by the camp in more ways than one, including getting an offer which for most of her life would have been a foreign concept. With Kate away, Toby is left to his own devices in New York, a city which he doesn't know at all. As such, Kate arranges for Kevin to be his companion in her absence. Kevin decides to treat Toby as his new Kate, i.e. his support, which he feels he needs after dumping Olivia, and Sloane in turn dumping him. Toby does offer Kevin a fresh perspective on his love life - trying to get him to choose between Olivia and Sloane as his true love - which he takes to heart. And after Randall sets a twenty-four hour deadline for what could be a career-defining project - that deadline which he is working against an internal competitor - he has to decide if a last-minute request by William is more important, he who has gone off chemotherapy and has renewed energy no longer being affected negatively by the chemicals, but whose days are numbered as a result.—Huggo"], "genres": "N/A", "imdbID": "6142662", "rating": 8.6, "votes": 3089, "number_of_episodes": 106}