{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0870794": "Sam Trammell", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "0223561": "Hari Dhillon", "1570774": "Wynn Everett", "8082633": "Eris Baker", "7919715": "Faithe Herman", "4952695": "Hannah Zeile", "4369276": "Adam Bartley", "0689708": "John Pollono", "0004958": "Marla Gibbs", "8488923": "Eric Michael Johnson", "6001174": "Megan West", "0921975": "Caryn West", "0661229": "Randi Cee", "1635034": "Connie Jackson", "2262487": "Adam Roa", "2468438": "Candace Hammer", "1655978": "LynNita Ellis", "6495693": "Joe P. Harris", "3829565": "Nathan Orton"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca receive shocking news, Randall feels pressure both at work and at home, Kate's plans are thrown off kilter, and Kevin tries to win over Sophie.", "Toby throws a wrench in Kate's weight loss journey; Randall struggles to accept William's deteriorating health; Miguel and Shelley's devastating news has Jack and Rebecca worried about their own relationship; Kevin examines his romantic past.", "It's the mid-1990s. Miguel and Shelly drop a bombshell of news on Jack and Rebecca. Although Jack and Rebecca are confident in the strength of their marriage, the news does make them reflect on the entire course of their relationship in different ways, Rebecca's thoughts which include the external issue of the band being offered an east coast tour, on which she, deep in her heat, wants to go despite she knowing that Jack has taken up much of the slack at home during her nighttime gigs. In present day, Randall, Beth and William learn that William probably has only a couple of months left to live. Randall and Beth have to devise coping mechanisms, not only for themselves, but perhaps more importantly for Tess and Annie. Randall, however, has added work pressures, which he has to balance with what become last minute family commitments. After having made the first contact after twelve years, Kevin continues his campaign to win back Sophie. That campaign may have an uphill battle as he may be unaware how damaged she was following their break-up and how much animosity she felt about his betrayal of their marriage. He hopes that he can focus on the good times in their long past in winning her back, but an occasional thought about the bad times is apt to creep in. And Toby sends Kate a care package at the weight loss camp. Based on information Toby discovers about what is happening at the camp, he makes a small last minute tweak to that care package, which in turn affects Kate's emotional journey at the camp.—Huggo"], "genres": "N/A", "imdbID": "6142660", "rating": 8.2, "votes": 2660, "number_of_episodes": 106}