{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0641354": "Denis O'Hare", "2857778": "Janet Montgomery", "2168927": "Milana Vayntrub", "0001610": "Elizabeth Perkins", "0748270": "John Rubinstein", "0648846": "Peter Onorati", "0574468": "Gerald McRaney", "0631146": "Laura Niemi", "0888654": "Kiff VandenHeuvel", "6651162": "Darren Barnet", "8277173": "Ava Castro", "0003320": "Michael Albala", "2971227": "Julia Cho", "0885828": "Floyd Van Buskirk", "7023010": "Tyler Wiseman", "0818045": "Nefetari Spencer", "1794660": "Duncan Bravo", "1542745": "Jeffrey Muller", "2930633": "Char Sidney", "3059474": "Suzanne Willard", "8040172": "Victoria Macabu", "4322779": "Baker Wiles"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Jack and Rebecca receive surprising news, Kate tries to help Toby, Randall feels conflicted about William and Jessie, while Kevin must make a choice.", "Jack and Rebecca's first instincts upon learning of Rebecca's pregnancy are for Rebecca not to turn out like her judgmental passive/aggressive mother who still drives her crazy, or for Jack not to turn out like his physically and emotionally abusive father. Jack is estranged from his widowed father, who knows nothing about Jack's current life. By the end of Rebecca's first trimester by which time they've prepared somewhat for their new life as parents including renting a two bedroom sixth floor walk-up apartment they can ill afford, they learn that Rebecca is carrying triplets. Knowing that the apartment is impractical for three babies and not having the financial means for three children at this time, each of Jack and Rebecca make decisions about their life as parents for which they may not be emotionally prepared, but which they know they have to do to make it under the circumstances. In present day, things with the play seem to be going well with Kevin and Sloane now co-financing the production, and Ron complimenting them on their performances, which is probably aided by the fact that they are in a relationship off the stage, one however that is still undefined. Their lives are thrown for a loop when Olivia returns, she stating as a changed woman, one who not only wants back in on the production but who wants to resume her personal relationship with Kevin. After Kevin decides what to do about the dilemma, one statement that he makes to Olivia may define what ultimately happens. Randall admits that he is having a hard time with William's news that he is bisexual and was in a committed relationship with Jessie, the two who have resumed that relationship. Not understanding why he is having such a hard time, Randall may come closer to the truth than his initial assumption that he is homophobic. And Toby, who is in the hospital, learns that his collapse was a heart arrhythmia caused by the fact that he has a small hole in his heart. The affliction can be treated by medication or repaired by what is now a standard surgery, which still has its risks in that is heart surgery. A scared Toby and Kate have to decide not only what to do in dealing with the issue, but with their relationship in light of it, complicated by a declaration that Toby makes.—Huggo", "When Jack & Rebecca learn they are having triplets, they are both excited & nervous. They struggle with the news since they just started getting settled with the idea of 1 baby. Rebecca dreads telling her condescending & judgmental mother the news. When she does tell her mother, the reaction she gets is predictable yet surprising. As Rebecca tries to keep from losing it, Jack is dead set on figuring it out any way he can. Toby learns he had a heart attack & has an arrhythmia. With further tests the doctor recommends surgery, but Toby doesn't want it. Kate has a hard time dealing with Toby's humor during a serious situation but ultimately learns about Toby's true feelings. Randall isn't sure how to feel about William's friend Jesse, so he tries to get to know him better. Feelings of abandonment arise when William spends more & more time with Jesse, so Randall confides in Beth. Kevin finds himself in a \"relationship\" with Sloan but Olivia returns. Kevin doesn't know what to do so he seeks his siblings for advice... sort of—Carrie DeCosta"], "genres": "N/A", "imdbID": "6142654", "rating": 8.3, "votes": 2780, "number_of_episodes": 106}