{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "1313656": "Ryan Michelle Bathe", "2857778": "Janet Montgomery", "0162233": "Natalia Cigliuti", "2168927": "Milana Vayntrub", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "7919715": "Faithe Herman", "8082633": "Eris Baker", "8523346": "Grace Hosman", "7173878": "Ava DeVoe", "5102384": "Geraldine Uy", "5758136": "Caspian Diament", "0921513": "Laura Wernette", "1980323": "Ozzie Rodriguez", "2854589": "Patrice Harris", "5718997": "Yolanda English", "0748270": "John Rubinstein", "3306380": "Wesley Sellick"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca take their kids to the community pool; Kevin experiences his first NYC audition; Kate stalks Toby's ex; William's past sends Randall spinning.", "Jack and Rebecca's kids are now eight. A heatwave is sweeping through the region, so Jack, to take refuge from the heat, suggests the family spend the day at the public pool. At the overcrowded pool, Jack and Rebecca not only display the continuing problems they feel they are having parenting three diverse kids the same age, but the three kids deal with their own issues with Kevin, whose problems may be the least obvious, shows partly why he has always felt some animosity toward Randall. In present day, a growing rift of sorts forms between Randall and William with Randall dealing with life as a black man having been raised in a middle class white household in a middle class white neighborhood, while William, still attired in his somewhat shabby clothes, is now living in an upscale neighborhood having long fought for the rights of the underprivileged black population. Randall may get a feeling of his childhood as the family attends Tess' school production. Kevin goes for his first Broadway play audition. Although he states he doesn't want to bring the baggage of a Los Angeles actor into his new stage life, he may not be able to put behind that Hollywood acting perspective as hard as he tries, and in the process may hit the realities of Broadway in its good and bad. And now unemployed Kate faces another crisis of self doubt when she sees from afar Toby's ex-wife, a skinny, successful woman. In Kate dealing with her feelings about the issue, an unexpected opportunity occurs for her while Toby demonstrates that he too has issues with which he needs support from people in his life like Kate.—Huggo", "Rebecca and Jack take the kids to the local community pool so they can all beat the heat. With the kids now 8, Rebecca and Jack have a hard time keeping track of them. While at the pool, the kids all start showing signs of personal struggles... Kate needs a tshirt over her bathing suit so the other girls don't make fun of her, Randall sneaks away to play with other kids like him and Kevin struggles for any kind of attention. William decides to go for a stroll in his new neighborhood, but it turns out to be a problem of sorts. Kevin auditions for his first play, Kate struggles with Toby's ex wife and Randall relives his childhood at the school play.—Carrie DeCosta"], "genres": "N/A", "imdbID": "6085956", "rating": 8.7, "votes": 3832, "number_of_episodes": 106}