{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0005030": "Jon Huertas", "2243196": "Jermel Nakia", "0574468": "Gerald McRaney", "7919715": "Faithe Herman", "8082633": "Eris Baker", "0027055": "Larry Anderson", "0122073": "Jernard Burks", "2484632": "Jennifer C. Holmes", "7460849": "Aaron Bray", "8432867": "Peridot Marlett"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca pays a surprise visit, Kevin makes plans to move, and Toby prepares a special day for Kate.", "Jack and Rebecca have just taken the babies home from the hospital. While Jack is focused on moving on with their lives, Rebecca can't help but think about the one they lost and if their adopted son, who they've named Kyle - all the babies named after Dr. K - is a replacement for the one who didn't make it. As such, Rebecca is having problems bonding with Kyle, while Kevin and Kate seem truly to be parts of each other and of her and Jack. Rebecca believes that the man she spots at the hospital may help her alleviate at least part of her apprehension about taking Kyle as their own. Back in present day, Rebecca and Miguel's surprise visit places a slight crimp in Randall's plan in how he was going to tell his mother about finding his biological father. Although Randall doesn't believe she said anything unforeseen, Randall knows that something Rebecca said to William in the private conversation she requested with him has something to do with William's change in behavior. William having been in their house for a week now, Beth reminds Randall that they still know basically nothing about him beyond his stomach cancer. Randall will soon have to make a decision about how much he will let William into their lives for what time he has left. And Kate learns that what she believed was Kevin's flippant comment about moving to New York to try and get work on Broadway was indeed what he plans to do, which in their world means her also moving to New York being both his personal assistant and soul mate of a twin. Kate's focus on her brother doesn't sit well with Toby, who wants Kate to do things for Kate, especially when he catches her in a unguarded moment. Toby believes he has yet another way to make Kate feel the special person that he believes she is, in this case with her being able to do something for herself instead of Kevin.—Huggo", "Rebecca is having trouble bonding with baby Kyle and seeks help from professionals. Jack is thrilled to have all 3 babies home and is looking forward to the future. However, Rebecca can't help but wonder about baby Kyle's birth parents and it is brought even more to the forefront when she sees a man at the hospital. Things get a little uncomfortable for Randall when his mother and Miguel show up unannounced. While William decides to hideout in his room, Rebecca seeks him out. With Kevin's decision to move to New York for a stint on Broadway, Kate finds herself with a huge decision to make herself. Does she stay and explore her relationship with Toby or move to New York with Kevin?—Carrie DeCosta"], "genres": "N/A", "imdbID": "6099382", "rating": 8.5, "votes": 3831, "number_of_episodes": 106}