{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0641354": "Denis O'Hare", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2168927": "Milana Vayntrub", "0223561": "Hari Dhillon", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0503624": "Ken Lerner", "0689708": "John Pollono", "3112508": "Amanda Leighton", "2971227": "Julia Cho", "0545748": "Anthony Marciona", "6001174": "Megan West", "0159273": "Bill Chott", "0000165": "Ron Howard", "8383965": "Laurel Noone"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca argue before the beginning of her tour, Kevin faces another opening night, while the entire family gathers at Randall's for an unusual party.", "Rebecca is about to head off on her first two-week tour with the band, and the emotional wall that Jack places between him and her because she never told him about having dated Ben when they were younger is noticeable, Rebecca accusing him of being passive-aggressive in his behavior toward her. Kate can see that strain the more than the other kids and does whatever she can to encourage her dad to make things right with her mom before things get out of hand. In present day, Kevin is having his second opening night of the play. He knows that a good review from influential critic Brandon Novak is crucial in whether the play is a success or not. The problem is that Novak has made his intention of not showing known because he attended the first opening which didn't happen, he assumes because Hollywood television star Kevin, used to multiple takes, was ill-prepared for a one-take environment. Kevin has to try and convince Novak to give him a chance for this second opening night. And the entire family is congregating at Randall and Beth's house for William's memorial. William has made his surprising memorial wants known in a note he left hidden at the house. The way that William left for Memphis knowing he was going to die without saying anything leaves one member of the family feeling left out. Rebecca and Randall have to decide if they will discuss the elephant in the room, namely the strain in their relationship due to Rebecca not having told Randall of William's whereabouts as he was growing up. A memorial service of a father may provide the impetus for Kate to open up to Toby about Jack's death. Randall wants his life to show some tangible legacy of William. The events of the day show Randall at least which path not to take to honor his biological father.—Huggo"], "genres": "N/A", "imdbID": "6142666", "rating": 8.9, "votes": 3089, "number_of_episodes": 106}