{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2168927": "Milana Vayntrub", "0223561": "Hari Dhillon", "0870794": "Sam Trammell", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "4369276": "Adam Bartley", "0689708": "John Pollono", "0183698": "Katie Couric", "2971227": "Julia Cho", "2301384": "Sean Bolger", "3652721": "Ashli Dowling", "0401235": "Karen Huie", "1785223": "Roni Geva", "1237219": "Dar Dixon", "1046431": "Hal Perry", "8468119": "Cyndi Melendez", "2997668": "Krys Marshall"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca's Valentine's Day goes south; Toby and Kate dig deep; Kevin preps for opening night; A tightly wound Randall begins to unravel.", "It's the mid-1990s on Valentine's Day. Rebecca has decided to go on tour with the band, for which she has Jack's full support, or so he says. In reality, Jack is already feeling overwhelmed with Rebecca's evening gigs at the bar, which is only exacerbated with both Kevin and Randall going through issues that need to be addressed. As has always been the case, Jack feels he has to be the perfect husband and father, which in his mind means not showing any weakness in doing it all on his own. This day, Miguel - wanting to get back out in the social scene after his breakup with Shelly - will accompany Jack to the bar to hear Rebecca perform with Jack as Miguel's wingman before Jack and Rebecca go out for their annual ritual of their Valentine's Day dinner. An incident at the bar may change Jack's perspective on the entire matter. In present day, each of Jack's three offspring are having issues that channel their deceased father in some aspect. As Jack had felt on that Valentine's Day, Randall too is feeling totally overwhelmed in his general modus operandi of doing it all on his own in being the perfect father, husband, son, and employee. Randall, who has had a nervous breakdown before from internalizing everything, is feeling added pressure from William dealing with a new home care nurse, Beth having to take an emergency trip to DC to assist her injured mother, and Randall himself having an important business meeting at which he doesn't want Sanjay once again to appear better than him. Kate has decided what to do about Duke's offer, which leads to her and Toby deciding that they truly have to get to know each other better in the holistic sense, each of Kate and Toby who have long had a burning question that they've wanted answered about the other. And the opening day of the play has arrived, with Kevin, as always, doubting everything about himself before the curtain goes up. Kevin turns to one person after another for words of encouragement, with all his usual supports - including Kate, Rebecca and now Randall and Sophie - dealing with their own issues to be able to help him. He ultimately receives advice from who he would consider an unexpected source, that advice which affects what he does at curtain time.—Huggo"], "genres": "N/A", "imdbID": "6142664", "rating": 8.9, "votes": 3317, "number_of_episodes": 106}