{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0005030": "Jon Huertas", "1570774": "Wynn Everett", "2078516": "Reggie Watkins", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "7919715": "Faithe Herman", "8082633": "Eris Baker", "8277173": "Ava Castro", "0888654": "Kiff VandenHeuvel", "1339320": "Danielle Langlois", "5395063": "Jill Johnson", "2671776": "David Leach", "4706806": "Cesar Sebastian", "7460849": "Aaron Bray", "3251090": "Elise D'Orazio", "8165956": "Arjuna Maximus McLellan", "2226919": "Stephanie Ray", "7113048": "Alan Trujillo"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Jack and Rebecca disagree about the future, Toby makes a gesture to Kate which backfires, Beth surprises Randall, while Kevin and William have a heart-to-heart.", "The story behind the love for the Pittsburgh Steelers is revealed; Rebecca and Jack argue about starting a family; Randall and Beth experience an unexpected turn of events.", "Jack and Rebecca are thirty and twenty-nine respectively. They believe their life as a couple is going great. Not wanting to be her mother in any respect, Rebecca has gotten Jack to teach her all about football, and she is now arguably the most die-hard Steelers fan, the team which is in this year's Super Bowl. Jack and Rebecca are always making snide little comments about how tied down couples with children are, and in contrast how free and happy they are. But it is at the start of a Super Bowl party that Rebecca makes a flippant comment about not ever wanting to have kids that leads to Jack wanting to have *the* talk about starting a family, and have the talk now, as they always mention having the talk in the future, with his perspective being that the future has to be the present at some time. If Rebecca is true to what she said, it could be a deal breaker in their marriage. In present day, it's the start of the NFL season and Kate is going to watch the Steelers' season opening game on TV by herself, it an important ritual in her life. Toby wants to be more a part of that life, so he transforms the event into something that includes him. What he may not understand is why Kate feels the need to keep to certain rituals about watching football on TV. And after two days of Kevin being an uninvited guest, Randall and Beth ask him when he will be leaving. When Kevin states that his luxurious hotel suite just feels too lonely, Randall and Beth make the bilateral decision to have an overnight vacation of their own at Kevin's suite, while Kevin and William look after the girls, this decision despite neither Kevin or William having any experience looking after kids on their own. While Randall plans what he and Beth will do with their free time minus kids, information that Beth provides may change the entire fabric of the hotel stay and make them evaluate what they saw for their future. Back at Randall and Beth's house, Kevin has to memorize some lines, and enlists William and the girls to read lines with him. The adult themes of the play may inadvertently get translated into the real life of the household for good or bad, while Kevin finds a new ego booster to replace Kate in that respect.—Huggo"], "genres": "N/A", "imdbID": "6098130", "rating": 8.6, "votes": 3678, "number_of_episodes": 106}