{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "2857778": "Janet Montgomery", "2168927": "Milana Vayntrub", "1313656": "Ryan Michelle Bathe", "0817340": "Aaron D. Spears", "1563421": "Nick George", "2243196": "Jermel Nakia", "6807858": "Lonnie Chavis", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "12462611": "Ellis Middleton"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["As Jack and Rebecca deal with Randall's questions about his parents, the siblings head to the family cabin for a post-Thanksgiving trip.", "It's the day after Thanksgiving, and Randall is still reeling over the revelation that Rebecca knew where William was his entire life. Randall's anger is primarily directed at Rebecca but is not limited to her, as he realizes that William had some part in the decision. Randall believes that Jack didn't know about William's existence, and may or may not be aware that Jack tried to provide male black role models for him when he was growing up and looking for \"who he was\" inherently. Based on news from Rebecca during Thanksgiving dinner that she is selling the family cabin - a place Kevin, Kate and Randall love but haven't been to in years - they feel it is an appropriate time for an overnight sibling getaway, which will allow them also figuratively to get away from all their issues. The figurative memo about it being a getaway for three doesn't reach Kevin, who casually invites Olivia, who in turn brings an ex named Asher, and Sloane if only because she is the one with a car. Under this situation, the getaway becomes a bunch of mini therapy sessions, where individuals provide their objective perspective of what they see of others around them, or venting about issues concerning others. Randall's primary therapist at the cabin may give him a better view of his life and his mother. Kate, while reverting to her old role as Kevin's protector, turns to familiar territory for support. Kate also gets some wanted and unwanted perspectives of her life, especially with regard to her decision to have gastric bypass surgery. And within this setting, Kevin may have a clearer picture of his feelings for Olivia.—Huggo", "Randall is still reeling from learning his mom knew about William. That's when he and his siblings decide to take a trip to the cabin they went to with their parents. While there Olivia shows up with some people. And Kate doesn't like her. We see when Randall was younger how his parents were advised to find him a black role model. And while at the cabin Randall gets a visit from someone who helps him with anger towards his mother.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "6034056", "rating": 8.6, "votes": 3263, "number_of_episodes": 106}