{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0870794": "Sam Trammell", "0005030": "Jon Huertas", "5007768": "Da'Vine Joy Randolph", "6807858": "Lonnie Chavis", "6026551": "Logan Shroyer", "2964567": "Niles Fitch", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "7919715": "Faithe Herman", "8082633": "Eris Baker", "5380239": "A.J. Rivera", "6001174": "Megan West", "1382044": "Terryn Westbrook", "6133846": "Nikiva Dionne", "3597656": "Andrew Adams", "0429888": "Clint Jordan", "1563444": "Travis Guba", "4841796": "Hollie Bahar", "3361173": "Alex Lewis", "8040172": "Victoria Macabu", "1024878": "Seth Meyers", "2226919": "Stephanie Ray"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Old tensions between Kevin and Randall resurface, Beth discovers a secret, while Toby makes a change which knocks Kate off course.", "Jack and Rebecca's kids are in their mid-teens. Kevin and Randall are still sharing a bedroom, as they've done all their lives. Kevin's animosity toward his brother over what he sees as especially his mother's favoritism toward him has continued, although Kevin has never mentioned his feelings to anyone, let alone his mother or Randall, while Randall has tried to be his brother's friend to no avail. Kevin being a good football player, the one area that has been his domain alone among his siblings, changes when Randall makes his school's team. Their feelings toward each other may hit new heights on the gridiron. And now that the kids are grown, Rebecca resumes her singing career, she having put it on hold as she played full-time mom. This area of her life may be more important to her than she lets on. In present time, Kevin and Randall have a dinner planned with their mother. Rebecca cancels at the last minute, leaving the brothers to have dinner together by themselves. This \"two for dinner\" scenario may be an uncomfortable one, as Beth has noticed that ever since Kevin has been staying with them, the brothers never spend time together just by themselves, they always needing at least a third as a buffer. With the brothers out, Beth gets a chance to spend some quality time with William. That time takes a few unexpected turns. And Kate is outwardly happy for Toby in he making his monthly weight loss goal early, while she has been working hard on her own weight loss, only to be inwardly disappointed that it has only resulted in a marginal weight loss. The differences between Toby and Kate with regard to their weight loss regimen may be a relationship breaker, but not quite in the expected way.—Huggo"], "genres": "N/A", "imdbID": "6115024", "rating": 8.4, "votes": 3055, "number_of_episodes": 106}