{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0429171": "Ron Cephas Jones", "0000415": "Jami Gertz", "0005030": "Jon Huertas", "1313656": "Ryan Michelle Bathe", "2857778": "Janet Montgomery", "2168927": "Milana Vayntrub", "0353243": "Molly Hagan", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "7919715": "Faithe Herman", "8082633": "Eris Baker", "3228379": "Ariana Vail", "0718920": "Jill Remez", "2641287": "Toni Christopher", "0264571": "Kevin Fabian", "7428736": "Frederick Falk", "5474353": "Suzanne LaChasse", "0748270": "John Rubinstein"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Rebecca face a dilemma, Randall puts his foot down, Kate lands a new job, and Kevin finds himself in an unusual situation.", "Jack and Rebecca's kids are nine. Randall has just tested as being academically gifted, which belies his average report card marks. The school administration recommends to Jack and Rebecca that they send him to a private school for gifted children. Jack balks at the notion, not wanting Randall to feel even more obviously different in what he considers an even whiter environment than their own local public school, where Randall is already the only black child but who has at least his two siblings. Beyond the fact that Jack admits that he worries about how to pay for a private school, especially as he was considering forgoing a promotion to form his own company, Jack may not want to admit that he has ulterior motives regarding Randall's private school opportunity that relate to more personal issues in his own being. In present day, Randall begins to feel that he and his work as a weather commodity trader are not the match he always thought it was as he prepares to give a talk at career day at Tess' school. Part of that feeling is learning that William has a musical background, something that Randall places as a romantic ideal for himself. Kate applies for what she believes is the perfect job for her, that as assistant to Marin Rosenthal, who runs a foundation. Kate is excited to get the job. However, she begins to feel that Marin had ulterior motives for hiring her. As such, Kate makes a risky on-the-job move. And Kevin is having problems feeling the grief associated with a certain scene in the play. Olivia believes she knows what Kevin needs to feel that grief: a party.—Huggo"], "genres": "N/A", "imdbID": "6072420", "rating": 8.4, "votes": 3159, "number_of_episodes": 106}