{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0648846": "Peter Onorati", "7132577": "Lyric Ross", "2954288": "Caitlin Thompson", "9368032": "Joaquin Obradors", "9336806": "Donnie Masihi", "0424453": "Adam Johnson", "1746141": "Phillip Daniel", "2226919": "Stephanie Ray", "4475648": "Kevyn Bashore", "3251090": "Elise D'Orazio", "3022139": "Jack Landron", "3806054": "Sherry Mandujano", "7172606": "Margaret Newborn"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin and Randall attend a charity fundraiser for Sophie's hospital; Jack takes the boys camping; Rebecca deals with some unexpected news.", "The kids are ten years old. Jack has decided to take Kevin and Randall on a camping trip in an effort to get them to bond, which he and Rebecca know is more an issue for Kevin because Randall truly craves his brother's love. Jack plans to treat the outing like he's coaching a football team in emphasizing the need for teamwork. In the absence of the Pearson men, Rebecca has planned a girls' day for her and Kate, specifically a movie and a manicure. Things for both Jack and Rebecca don't go quite according to plan with Kevin not understanding how his actions affect his brother. In light of what Rebecca has to do, a specific outing when Jack himself was a child is shown. In present day, Kevin is in New York to attend a gala fundraiser for the hospital where Sophie works, where he will be auctioned off as part of that fundraising. While in New York, Kevin tries to hide his problems from his loved ones, in the process making things worse for himself and those around him. Déjà, after a month of living with the Pearsons, makes a declaration to her foster parents about something she really wants to do. Despite Beth not thinking it a good idea, Randall wants to oblige Déjà's request and be the one to accompany her because he realizes that she has bonded the least with him compared to the women in the house. And Kate, eight weeks in, tells Toby her/their big news. She has one request for Toby in light of the news, that request which Toby may have a difficult time keeping. Kate's encounter with someone she doesn't really like might give her a change of focus about the situation.—Huggo"], "genres": "N/A", "imdbID": "6439856", "rating": 8.3, "votes": 2649, "number_of_episodes": 106}