{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0651075": "Arianna Ortiz", "7132577": "Lyric Ross", "0001610": "Elizabeth Perkins", "0004976": "Brian Grazer", "3117364": "Eliza Shin", "0899487": "Tom Virtue", "4972241": "Sasha Matthews", "1106407": "Jason Sims-Prewitt", "3700600": "Nick Smoke", "6671935": "Shawn Patrick Clifford", "5154066": "Melissa Oliver", "8906075": "Sarah Grace Parker"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Randall and Beth adjust to a new family dynamic; Kate books her first big gig; Kevin suffers a setback; Jack and Rebecca are visited by an unwelcome guest.", "It's the middle of winter when the Big Three are ten years old. Kevin and Kate come down with a case of chicken pox. The doctor recommends that Randall too try to get infected to get the pain over with in the household in one fell swoop. Randall takes the words to heart because he doesn't want an illness like chicken pox to interfere with him participating in an upcoming science fair. Jack and Rebecca, the latter who had to call her mother to confirm, have both had it when they were children, meaning that they do not have to worry about coming down with it now. Regardless, they know that they will be overwhelmed looking after two sick and complaining children and one who is trying to get sick. The situation gets even worse when Rebecca's telephone call has unintended consequences, which is only exacerbated by something that happens to Jack. In present day, Randall and Beth are having an issue with Déjà two weeks into her stay. Because of the general role reversal with Randall at home and Beth going to work, Randall wants to take the lead in dealing with Déjà's issue. Randall does not fully comprehend either the situation with which Déjà is facing or the complete dynamic of the parenting within their household. Kevin has been hiding his knee injury from the movie producers. Producer Brian Grazer eventually does find out. As such, Kevin may have made the situation worse in hiding it than it would have been had he been up front about it. Toby is tasked with being his caregiver as he recuperates as Kate is busy focusing on herself, she exercising and watching her food intake in order to fit into a specific dress for her first paid singing gig, a bar mitzvah. Kate, however, isn't being totally forthright about the reason for her being so diligent to the health routine this time around.—Huggo"], "genres": "N/A", "imdbID": "6439852", "rating": 8.2, "votes": 2478, "number_of_episodes": 106}