{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0000427": "Pam Grier", "2874472": "Joy Brunson", "2243196": "Jermel Nakia", "7132577": "Lyric Ross", "1274545": "Reynaldo Gallegos", "0750468": "Debra Jo Rupp", "2484632": "Jennifer C. Holmes", "1412505": "Mandi Moss", "0797406": "Eve Sigall", "9678984": "Ciera Hart", "9368032": "Joaquin Obradors", "8645912": "Makenzie Lee-Foster", "9336806": "Donnie Masihi", "0688432": "Jeris Poindexter", "0752708": "Marty Ryan", "3638592": "Clay Von Thomas", "4968973": "Nicco Annan", "0504183": "Sonya Leslie", "6097296": "Vanessa Hernandez", "0574468": "Gerald McRaney"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Déjà's life unfolds from the very beginning; Randall and Beth welcome visitors to their home.", "Déjà and by association Shauna's life is presented from the time of Déjà's birth to the immediate aftermath of Randall and Beth finding that Déjà and Shauna are now living in Shauna's car. Key moments in their lives are juxtaposed against similar or comparable situations within the extended Pearson family or those associated with the Pearsons, such as Randall's own short-lived childhood with William. Being pregnant at age 16, Shauna had difficulties in letting go of her childhood to be a responsible single mother to Déjà, relying on her own parental figures to do that parenting for her. And even when Shauna tried to do the right thing for her and Déjà, something would always go wrong, whether it be a matter of circumstance or a subsequent bad decision by Shauna herself. It was in one of those latter situations that Déjà first met Linda with Child Services, which started her long string of foster care. It was during one of those early foster home situations that Déjà learned the \"wisdom\" of a fellow foster child Raven about what is considered tolerable versus the alternative. In dealing with the Pearsons, Shauna and Déjà may come to some conclusions about if they are able to get themselves to a place of both love and survival as mother and daughter.—Huggo"], "genres": "N/A", "imdbID": "6439880", "rating": 7.8, "votes": 2548, "number_of_episodes": 106}