{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "1462513": "Stefanie Black", "0416856": "James Read", "3112508": "Amanda Leighton", "0726164": "Matt Riedy", "4295230": "Isabel Durant", "1556548": "Rebecca Metz", "2068219": "Michael Woodley", "0731826": "Elise Robertson", "0811341": "Yolanda Snowball", "3474884": "Austin Mincks", "3350918": "Christine Hassay", "4147600": "Carlos E. Campos", "0696446": "Jordan Preston", "1225479": "Jesse Mackey", "0286595": "Andy Forrest", "5526876": "Lisa Linke", "0363954": "Herbert Russell", "3989558": "Reasha Honaker", "9676976": "Ismael Sanchez"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin goes back to his high school to accept an award; Jack and Rebecca get excited about their kids' futures.", "Kevin's story, the first of the three to enter Jack and Rebecca's outside world life and the one who has generally done things first among the three children, is presented. Kevin's current life continues to spiral downward in his alcohol and prescription painkiller abuse in dealing with the physical pain of his knee and the emotional pain that is his life that he associates with the knee. In wallowing in his self loathing, Kevin in New York is reminded at the last minute that he has agreed to attend an event at McKinley High, his alma mater, in Pittsburgh tomorrow as one of this year's recipients of a distinguished alumni award. He will find out if his celebrity and the general love that he felt by his classmates when he was a student at McKinley can get him through the event with his reputation intact, especially because he truly believes other recipients, such as Charlotte Everly, a former classmate who is now a plastic surgeon largely working on burn cases, is more deserving than him of such awards. Through the process, he can't help but think of his high school days, especially when he and his siblings were applying to colleges. Then, Kevin had no doubt that he would not only get a scholarship to his preferred school, Notre Dame, but that he would go on to a successful and lucrative football career, causing him to be openly hostile to any other option much to his parents' chagrin, especially Jack's.—Huggo"], "genres": "N/A", "imdbID": "6439848", "rating": 9.1, "votes": 3453, "number_of_episodes": 106}