{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0651075": "Arianna Ortiz", "3112508": "Amanda Leighton", "4049375": "Jason Michael Snow", "2074315": "Vince Cefalu", "0770934": "Wendy Schenker", "1827430": "Jason Rogel", "9420684": "Sydnee Parker Anderson"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Kate and Toby's lives take an unexpected turn; Rebecca encourages Kate's singing aspirations.", "Kate's story, she the second of the three to enter Jack and Rebecca's outside world life, is presented, that story concurrent to the one already told for number one, Kevin. Kate's euphoria in planning for the baby comes to a complete halt when she miscarries. Kate does not want to talk about it, which means that she and Toby have to deal with their emotions on their own. It also means that they each decide on their own if they will try to eliminate any possible triggers of the baby or the miscarriage from their lives, not knowing how the other will feel about their unilateral actions. Kate also receives several telephone calls from her mother, who she does not want to talk to in her emotional state. Kate may not realize that Rebecca may be the one person in her life who truly does understand through what she is going. That hesitance to reach out to her mother stems from not ever having that connection, something which Rebecca acknowledged to Kate when Kevin and Randall were applying to colleges, while Kate would not divulge her own plans, Rebecca assuming that silence meaning that Kate had not yet found her passion in life.—Huggo"], "genres": "N/A", "imdbID": "6439860", "rating": 8.6, "votes": 2581, "number_of_episodes": 106}