{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0005176": "Wendie Malick", "0491357": "Dan Lauria", "4927489": "Melanie Liburd", "7132577": "Lyric Ross", "2954288": "Caitlin Thompson", "7021141": "Iantha Richardson", "2078516": "Reggie Watkins", "1476559": "Alan Heitz", "3585556": "Angela Fornero", "5395063": "Jill Johnson", "1361619": "Alden Ray", "1721577": "Erik Marion", "2226919": "Stephanie Ray", "0926355": "Sewell Whitney", "2278177": "Kevin Covais", "0508131": "Laura Leyva", "3280366": "Donald Barrett", "4475648": "Kevyn Bashore", "5224790": "Hashim Lafond"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin and Randall struggle to pull off the big day; Kate is flooded with memories of Jack; Deja struggles to adjust to her new living situation.", "It's the weekend of Kate and Toby's wedding, the event which is being held on the grounds of the Pearson family cabin, which has both Kevin and Randall acting as the wedding planners so that Kate, who has no people standing up for her (although Madison may disagree), doesn't have to worry about anything, and which Beth's younger cousin Zoe has been hired to photograph. But some people are bringing some baggage into the weekend which may interrupt the smoothness of the proceedings in one way or another. Ever since finding out that her mother is relinquishing all parental rights, Déjà has been acting like the whole world, including Randall and Beth, who will be adopting her, is her enemy. Rebecca, knowing how fragile her and Kate's relationship is at least from Kate's perspective, doesn't want to do anything that may set Kate off on her big day. Toby's parents, who have long been divorced from each other, don't get along, they who have to spend the weekend together in this confined setting. Kevin doesn't want to fall into old habits and stereotypes of ending up in bed with anyone from the wedding before, during or after the proceedings, one person in particular he knowing of who he needs to stay clear. But the biggest issue may be the triangle that is Toby, Kate and Jack. Toby has bent over backward to make Kate happy - something that is not lost on a few looking in from the outside - which includes adding whatever Kate feels she needs of her father into the proceedings, however unusual. Kate has to decide if she has grieved enough of her father out of her life to make room for Toby. Dreams Kate has had over the last few weeks may give her some indication where she stands on that issue.—Huggo"], "genres": "N/A", "imdbID": "6439882", "rating": 8.6, "votes": 2575, "number_of_episodes": 106}