{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0750468": "Debra Jo Rupp", "0027402": "Sam Anderson", "2243196": "Jermel Nakia", "7132577": "Lyric Ross", "2874472": "Joy Brunson", "0005148": "Delroy Lindo", "1197574": "Cinda Adams", "0106328": "Conni Marie Brazelton", "0074375": "Susan Berger", "6583994": "Tiffany Commons", "1600158": "David Trice", "0648406": "Sharon Omi", "0173228": "Ken Colquitt", "0996359": "John Lee Ames", "2263081": "Jon Paul Burkhart", "2580734": "Benjamin Seay", "8885922": "Róisín Román"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Randall adjusts to the foster system; Kate and Toby take the next step in their relationship; Jack and Rebecca finalize Randall's adoption.", "It's about a year after the Big Three's birth. Jack and Rebecca are going through Randall's adoption process, which requires a social worker to make occasional home visits, some of those surprise visits to catch them unprepared. They are buoyed to learn from the social worker, Paula, that her report is a glowing one, with the final step, typically a formality, being for Jack and Rebecca to appear before a judge to swear that they want to adopt Randall. That appearance and the remaining process until Randall legally becomes theirs is not quite as straightforward as Paula had said and as Jack and Rebecca would have liked. In present day, Kate and Toby have decided it's time to tell their loved ones about her pregnancy. Kate makes another decision based on something that happens during that process. Toby, who wants to please Kate, isn't sure that what Kate decides is really what she wants, so Toby turns to someone who knows Kate better for some advice on the matter. Kevin is spiraling downward in his addiction to his prescription painkillers. He has been putting off a trip to New York and an eventual permanent move to be with Sophie. But he can only delay the inevitable for so long. And in a court-ordered process, Randall hesitantly takes Déjà to the prison for a visit with her mother, Shauna. That visit doesn't go quite according to expectation which leads to Randall and Beth making some decisions about Déjà's future. This situation hearkens back to William's own first arrest for drug possession, the court process which has unknown connections to Randall's adoption.—Huggo"], "genres": "N/A", "imdbID": "6439854", "rating": 8.7, "votes": 2552, "number_of_episodes": 106}