{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0123632": "Kate Burton", "0414052": "Sonia Jackson", "1635061": "Gary Kraus", "9151826": "Sanjay Orlando", "6063305": "Preston Bradley", "0797329": "Gary Sievers"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Pearsons come together under unexpected circumstances; Jack surprises the family.", "It's been one month since Kevin has been in court-ordered rehab for substance abuse due to the DUI, during which he has had no contact with the family, which is the longest he and Kate have ever been without being in touch with each other. All the adult members of the family go to the facility to go into a group therapy session with Kevin, each with his/her own agenda. Rebecca and Kate just want to help Kevin in any way they can. Despite Beth's anger over Kevin putting Tess' life at risk along with everyone else who may have been on the road that day, Randall wants to support Kevin if only because Kevin was there for him during his own most recent breakdown. Barbara, Kevin's therapist at the facility, and Kevin have their own agenda which may be uncomfortable for the rest of the family. What Kevin brings up in this first group session, based on his earlier sessions with Barbara, relates to the events when the Big Three were ten and Jack surprised the family with a vacation to the Poconos because he had access to a cabin from a co-worker. On that vacation, Jack and Rebecca had to deal with certain issues concerning their children, not always as successfully as they would have liked. In this first group session, the spouses are not included, leading Miguel, Beth and Toby to head off to a bar where they discuss their Pearson outsider status. Miguel has a slightly different perspective as the only one of the three who knew \"perfect\" Jack, his best friend.—Huggo"], "genres": "N/A", "imdbID": "6439862", "rating": 9.2, "votes": 3012, "number_of_episodes": 106}