{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0001610": "Elizabeth Perkins", "1570774": "Wynn Everett", "1515989": "Mark Proksch", "0086806": "Susan Blakely", "3112508": "Amanda Leighton", "0574468": "Gerald McRaney", "5050721": "Isabel Oliver Marcus", "2136107": "Tom Lommel", "1798624": "Tyson Power", "1866720": "Trappy", "9868066": "David Horton"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The history of the Pearsons told through the life of the family car; Rebecca finds solace with an old friend.", "Key moments in the Pearsons' lives associated with their vehicle, a Jeep Grand Wagoneer, are presented from the time of the vehicle purchase when the kids were 10 to the end of the day of Jack's memorial service. This specific vehicle, new at the time, was an unexpected purchase in that it was more expensive than they could afford compared to a used vehicle they were expecting to buy, with the argument Jack uses to get the salesman, Mel Buchanan, to give them a good deal framing the events to come. The funeral itself has an unexpected attendee, an old friend, who could shed some light to Rebecca on Jack as husband and father, which leads Rebecca to decide to keep to Jack's wishes on how to end the day. The events between the purchase and the funeral include: Jack and Rebecca heading somewhere quiet to await news of some medical tests; a few of the several times they crossed a bridge that Rebecca was terrified of, knowingly irrationally so; Randall and Kevin's first driving lesson with their father; Jack surprising teenaged Kate by driving her somewhere she should not have been going; and a shopping trip a few days before Jack's death to buy Super Bowl party supplies, with Jack having made five additional purchases at the time unknown to the kids. It is not so much the events in and of themselves that are important but specific incidents within those events that shape their lives to come.—Huggo"], "genres": "N/A", "imdbID": "6439884", "rating": 9.2, "votes": 2954, "number_of_episodes": 106}