{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "2243196": "Jermel Nakia", "0875810": "Brett Tucker", "3112508": "Amanda Leighton", "2657102": "Ashley Loren", "4192167": "Krishna Smitha", "1331714": "Tod Nakamura", "5050721": "Isabel Oliver Marcus", "0168825": "Bryan Coffee", "3016639": "Adam Wang", "2965320": "Jully Lee", "0056214": "Dana Lyn Baron", "0000165": "Ron Howard", "5474353": "Suzanne LaChasse"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Big Three celebrate their 37th birthdays, and make changes in their lives; Jack and Rebecca pick up the pieces after their fight.", "The season two premiere picks up during the Big 3's 37th birthdays as Randall and Beth debate a big life change, Kate takes the first step in pursuing a new passion and Kevin balances the demands of his career and relationship. Meanwhile, Jack and Rebecca deal with the fallout of their big fight.", "In the mid 1990s, Rebecca has asked Jack to move out temporarily to live with Miguel as she believes he is part of the problem of not feeling fulfilled, his fight with Ben and his resulting words which show that he does not fully support her career. Beyond dealing with the issues between the two of them, Jack and Rebecca have to deal with telling the kids, who, in turn, have their own feelings about the situation, Kevin's which has more to do about Randall. In current day, the Big 3 are celebrating their thirty-seventh birthdays. Randall, following William's death, wants to honor both his fathers by adopting a child. What he thought was Beth's support in the matter is not quite what he initially believed, Beth who turns to old comforts to look for answers to Randall's needs in the matter with which they can both live. Kevin, Sophie, Kate and Toby are planning a double date birthday celebration in Los Angeles, where Kate now lives, where Kevin is filming a movie directed by Ron Howard and to where Sophie is planning on flying specifically for the birthday. That birthday celebration isn't quite as each of the four anticipates based on what happens this day, including Kate's plan to go on her first singing audition on Toby's urging, and incidents between Kate, Toby and Kevin coming out of that audition.—Huggo"], "genres": "N/A", "imdbID": "6439846", "rating": 8.7, "votes": 2979, "number_of_episodes": 106}