{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0123632": "Kate Burton", "0606541": "Garrett Morris", "0001550": "Cathy Moriarty", "0507097": "Dawnn Lewis", "2954288": "Caitlin Thompson", "0692493": "Lidia Porto", "5050721": "Isabel Oliver Marcus", "2660638": "Ericka Kreutz", "1403237": "Tarina Pouncy", "2458187": "Christina Karis", "8705226": "Eden Gamiz", "0660013": "Carl Paoli"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kate goes wedding dress shopping; Kevin embraces a new lifestyle; Randall explores William's past; Jack and Rebecca take the kids to the mall.", "Released from rehab, Kevin, based on Barbara's advice, decides not yet to jump back into his Hollywood life but rather spend time with his mother, both of whom need to process the many difficult things said and heard in family therapy to strengthen their relationship. The one problem in Kevin's mind is Miguel, whom Kevin has had open animosity toward, which has existed since Miguel and Rebecca got together, but Miguel will protect his wife at all cost. Kate, having admitted to her junk food binges of late following her miscarriage, wants to move forward with life, the next joyous yet difficult step being to buy a wedding dress. She gets some unexpected help in the matter. In the process, Kate hears an unspoken shout for help, signs which answer a lot of questions. And Randall has two tasks this day: first to pick up a box of William's items found by William's old friend Lloyd, and second to go to a job interview. Beth doesn't want the first task to overshadow the second, wanting him to go back to work in any suitable job solely to bring him back into reality and out of the clouds where he has been since William's death. Randall can't help but follow-up on something he finds in the box, placing the job search in a lower priority. These things happening in the three siblings present day lives hearken back to a time when they were teenagers, specifically a family trip to the mall with each person having a different priority for that trip.—Huggo"], "genres": "N/A", "imdbID": "6439866", "rating": 8.2, "votes": 2342, "number_of_episodes": 106}