{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0124798": "Jason Butler Harner", "2747668": "Andrew Santino", "8733808": "Sophia Coto", "0169581": "Mark Cohen", "0791350": "John Shelton", "4723974": "Abigail Zoe Lewis", "0456627": "Ajgie Kirkland", "2136107": "Tom Lommel", "0268368": "Abe Farrelly", "4049375": "Jason Michael Snow", "1410077": "Elizabeth Bond", "2752699": "Liv Mai", "3763519": "Albert Minero Jr."}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Pearson family visits Kevin on set in Los Angeles for a \"Manny\" taping; Jack confronts his demons.", "In the 1990s, Rebecca is able to convince Jack to come home, her want for him to do so despite his admission that he has been drinking again. The last that she knew of his drinking was approximately a decade earlier when he decided to figure out his own way to cope without alcohol. She wants them to fight his problem together this time. In present day, everyone in the family is convening on Los Angeles for a live taping of Kevin's guest appearance on The Manny, he who wants to be the big man in doing the producers this favor despite his acrimonious departure from the show. Kevin is also doing it as he feels his appearance, based on the script, is both classy and funny. Despite never having liked the show and never having thought Kevin funny, Beth is an attendee, with an added reluctance being the focus of she and Randall wanting to take in a foster child, and how and when to tell Tess and Annie. Randall, however, has kept to himself thus far that he doesn't know if he or they will be prepared to take in a fully formed human being with potential problems, as opposed to his original want of adopting a baby who they could mold. Kate is not looking forward to her mother's arrival in Los Angeles, Rebecca who is blissfully unaware of how inadequate she has always made her daughter feel. This issue is potentially heightened as Kate tries to start a singing career. And Kevin has to decide what to do when a last second script change makes his appearance on the show less classy than he was anticipating. All these issues come to a head as the taping begins, and has ties back to a talent show the Big Three were preparing for at school when they were ten.—Huggo"], "genres": "N/A", "imdbID": "6439842", "rating": 8.3, "votes": 2509, "number_of_episodes": 106}