{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0569079": "Jack McGee", "0606541": "Garrett Morris", "0507097": "Dawnn Lewis", "2913119": "Lena Waithe", "3112508": "Amanda Leighton", "0198450": "Jane Daly", "5050721": "Isabel Oliver Marcus", "0692493": "Lidia Porto", "1303211": "Bruno Xavier", "5853531": "Curtis Webster", "0989070": "Marlynne Frierson Cooley", "7327212": "Orlando Flanagan"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin helps Randall and Beth with a project; Kate contemplates a big gift for Toby; Jack and Rebecca talk about their future.", "In 1998, Jack and Rebecca are preparing for Super Bowl Sunday, the last one they will have with their kids before they head off to whatever their post-secondary life hopefully to some sort of educational institution. All five of them have a different agenda this day besides the game, especially as the Steelers aren't playing, those agendas which will affect them spending time together as a family watching the game. In present day, Kevin is working his way down the list of the people to who he has to make amends, placing a check mark next to the name when completed. He realizes that to a few of those people he will have difficulty in making those amends, they not being just names to him next to which to place a check mark. As the new owners of William's old apartment building, Randall and Beth have their first group meeting with the tenants. Although Randall and Beth walk into the meeting on the same page, they walk out on divergent viewpoints. As the day progresses and comes to an end, they will discover if either of their viewpoints is the wrong one. And Kate catches Toby secretly watching something on his computer. She decides to act upon what she finds he was watching, but ultimately isn't sure if she can take that action to its natural end based on her own baggage.—Huggo"], "genres": "N/A", "imdbID": "6439868", "rating": 9.3, "votes": 3656, "number_of_episodes": 106}