{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0000230": "Sylvester Stallone", "1570774": "Wynn Everett", "0750468": "Debra Jo Rupp", "0591703": "Kristin Minter", "7132577": "Lyric Ross", "0646852": "Gwendolyn Oliver", "2694809": "Eli Bildner", "6019128": "Alejandro Barrios", "0048260": "Betsy Baker", "0367018": "Sean Hartman", "0000165": "Ron Howard", "0660013": "Carl Paoli"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca and Jack struggle to reconnect; Kate visits Kevin on set of his movie; Randall and Beth get exciting news.", "In the 1990s, Jack has been attending AA meetings now for three weeks and although is still sober, not all is right with him and his relationship with Rebecca. Jack still finds it difficult to talk to her - their limited exchanges in the form of cold niceties - and they haven't had sex in quite a while. Based on advice from Shelly, Rebecca decides to take the bulls by the horns and assume the role always taken by Jack and sweep him off his feet in a romantic night out. The evening doesn't go quite the way Rebecca hopes. In Jack and Rebecca's problems, they are unaware that Randall has placed an ad in the newspaper in an effort to locate his birth parents. He has to decide what to do about the one response he does receive. In present day, Kevin has invited Kate onto the movie set for the first day of shooting with Sylvester Stallone, a family favorite actor. Jack's spirit pervades the set this day, and not always in a good way especially for one. And after three weeks of being approved as foster parents, Randall and Beth receive news that a foster child will be entering their home today for the first time, she being twelve year old Déjà, whose mother has been in and out of jail, her current status being in jail, hence the immediate nature of Déjà needing to be placed. Unlike before, Randall is confident that this experience will be easier than what people in general have stated. Beyond Randall's theory being tested, everyone in the household may find that Déjà's entrance into the family is somewhat akin to another recent stranger having arrived.—Huggo"], "genres": "N/A", "imdbID": "6439850", "rating": 8.3, "votes": 2454, "number_of_episodes": 106}