{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "1168813": "Josh Braaten", "0083586": "Jeremiah Birkett", "3825890": "Charley Koontz", "0481573": "Ronobir Lahiri", "2511058": "Christine Rodriguez", "0435071": "Judy Kain", "1632930": "Brandee Steger", "4626185": "Michael I. Goode", "2358314": "Alexander Kanellakos", "10598278": "Cadence Murray", "9272316": "Matthew Price"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Trick-or-treating with the kids goes awry for Jack and Rebecca; The Big Three have life-changing Halloweens.", "Two Halloweens 18 years apart are presented. The first is in 1990 when the kids are 10. An incident leads to Rebecca accusing Jack of coddling Kate; Jack, in turn, accusing Rebecca of coddling Randall. Rebecca's concern with Kate is that she will not be able to endure all the disappointments in her life as she becomes an adult, especially as Jack will not always be there for her. A difference between what Randall wants to do and what Kate and Kevin want to do in approaching their trick-or-treating leads to Jack taking Kevin and Kate and Rebecca taking Randall. Jack's and Rebecca's time with their respective charges for the night gives them a clearer perspective of their spouse's accusation. The second is 2008: It's been two months since Randall's nervous breakdown, and it's the day before Beth will be induced into labor with their first child. Although Randall has always come through for her, Beth is still concerned about having a child now with what happened to Randall, which is why Rebecca is coming this day before the arrival of the baby. Randall, who knows the reason for his mother's presence, unburdens himself to someone he thinks that can help. Kate is still in Pittsburgh working as a waitress while Kevin, living in Los Angeles, has been working in a salon to make ends meet while he waits for his big acting break. His friend and roommate Zeke has just been cast in a big budget movie. Both Kate and Kevin decide to take a chance within their individual situations, despite both knowing deep in their hearts that what they are doing may not only not work out but may make their lives holistically worse.—Huggo"], "genres": "N/A", "imdbID": "6439858", "rating": 8.3, "votes": 2594, "number_of_episodes": 106}