{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "1020036": "Alexandra Breckenridge", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "0429171": "Ron Cephas Jones", "0410347": "Bill Irwin", "7132577": "Lyric Ross", "3112508": "Amanda Leighton", "7021141": "Iantha Richardson", "5050721": "Isabel Oliver Marcus", "3806054": "Sherry Mandujano", "1721577": "Erik Marion", "8218569": "Jonny Berryman", "2137962": "Jinny Chung", "1679575": "April Betts"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["46"],  "plot": ["Randall hosts a Super Bowl party; Kevin and Kate reconnect with their past.", "It's Super Bowl Sunday, what was Jack and Rebecca's favorite day of the year and what is now the anniversary of Jack's passing. As usual, Rebecca, Kevin, Kate and Randall will have their individual Super Bowl ritual, which differs between the four based not only on the fact of Jack's death but also how they were in relation to him when he died. Rebecca and Kevin's vastly different Super Bowl routines will have to have some compromise due to them spending the day together, which is largely affected by all that Kevin has gone through of late which has brought him emotionally closer to the memory of his father. Regardless of what happens with Kevin, Rebecca still hopes that Jack's annual gift of an unexpected laugh will occur. Kate's ritual hits a snag due to aging technology. In the process of what she has to go through with Toby's help, Kate may feel ready to share her father with her fiancé. And Randall's ritual now centers largely on his daughters whether they want it to or not. The day for them is affected by what happens with Mr. McGiggles, and an admission by Tess about something she's been doing in light of all that has happened in their lives the past year.—Huggo"], "genres": "N/A", "imdbID": "6439870", "rating": 9.7, "votes": 6655, "number_of_episodes": 106}