{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "1726032": "Rob Morgan", "2883943": "Tim Jo", "2954288": "Caitlin Thompson", "1664127": "James Moses Black", "0732025": "Shelley Robertson", "8633113": "Ami Park", "10227978": "Kim Kim", "0446964": "Leonard Kelly-Young", "5307921": "Jason Her", "10321093": "Jalin Bruhil", "0453582": "Kim Kim"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kate struggles with Toby's depression; Randall makes time for Kevin, who obsesses about Jack's past.", "In 1993, the talk at the Pearson house is boxing when Jack comes home with a black eye because Rebecca had no idea that he even did anything remotely boxing-related besides use the punching bag at the gym. While Rebecca wants to stop Jack from fighting actual people even in a boxing format, Randall, manufacturing a lie, persuades his father to teach him how to box without telling Rebecca. The real reason for Randall wanting to learn to box does eventually come to light having to do with Kevin's physicality with him. In present day, Kate passes along the happy news that she is pregnant, which is tempered with the fact that Toby, despite now being back on his anti-depressants, still has not gotten out of his debilitating depressive state. While Toby fears that Kate will eventually leave him because of his depression, Kate discovers just how ready she is to be a mother as she deals both with Toby's depression and an issue with Audio. Kevin becomes obsessed with the photograph of the woman and his father from Jack's Vietnam days. With Zoe taking some alone time after finishing her documentary, Kevin turns to another person to figure what he should do about this obsession. Randall does an unofficial campaign stop, which doesn't go quite the way he wanted it to thanks to Councilman Brown. Randall stumbles upon what he believes may be a gold mine of votes, which leads to him building his campaign team. And Beth discovers that getting fired has repercussions on her family that she didn't even contemplate. When Beth hits her breaking point, she gets words of wisdom from an unexpected source.—Huggo"], "genres": "N/A", "imdbID": "6439896", "rating": 8.3, "votes": 1601, "number_of_episodes": 106}