{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0429171": "Ron Cephas Jones", "1726032": "Rob Morgan", "1446060": "Hunter Parrish", "0501534": "Charles Robinson", "0648846": "Peter Onorati", "1462340": "Yetide Badaki", "0082517": "John Billingsley", "0599019": "Sumalee Montano", "0002350": "Jim Meskimen", "0434223": "Jane Kaczmarek", "1405436": "Terry Gross", "0631146": "Laura Niemi", "1339320": "Danielle Langlois", "0888654": "Kiff VandenHeuvel", "8277173": "Ava Castro", "8899185": "Kya Kruse", "8291648": "Drew Olivia Tillman", "2369055": "Becky Wu", "0174913": "Edward Conna", "2395002": "Jennie Page", "4763470": "Adrian Snow", "5363645": "Alexander Michael Helisek"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Pearsons rally around Kate as she undergoes a medical procedure.", "1972. Jack, heartbroken in seeing Rebecca with another man, instead focuses on an aspect of his home life he wants to rectify, namely getting his mother out from under the abuse of his father. Conversely, Rebecca has to decide between the somewhat known quantity of Alan and a life in New York, which would work toward her dream of a music career, versus taking a chance on Jack, with who she has only spent so far four hours of her life. In present day, the success that ends up being Kevin's movie premiere is somewhat overshadowed by an issue between Kate and Randall concerning her comment that she is the only one who can pass on a piece of their father. As Randall tries to make amends, Beth faces her own crisis of uncertainty, one where she has to turn to another for support and one where she has to decide when she will confide in Randall seeing as to the other issues which preoccupy his thoughts, not only with Kate but with the recreation center in Philadelphia. In making the media rounds, Kevin not only negotiates his relationship with Zoe but comes to a realization of how little he knows about one key aspect of his father's life. And Kate is nervous in going into the first surgery which will be part of the development of what will hopefully be the embryos. Under the anesthesia, the insecurities that Kate has experienced most of her life surface to the top of her subconscious, which may or may not be helped by additional thoughts of her father.—Huggo"], "genres": "N/A", "imdbID": "6439890", "rating": 8.5, "votes": 1766, "number_of_episodes": 106}