{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0429171": "Ron Cephas Jones", "0029400": "Michael Angarano", "2883943": "Tim Jo", "2874472": "Joy Brunson", "2199657": "Yara Martinez", "2519996": "William Rubio", "3983629": "Porter Duong", "0641354": "Denis O'Hare", "6968802": "Peter Falls", "9308415": "Anthony Ramirez", "2731235": "Alvin Cowan", "5772891": "Derrell Coakley", "0629050": "Long Nguyen", "10188950": "Tan Ly", "2021965": "Eric Normington", "6403925": "Ricky Hunt", "1222076": "Bob McDuff Wilson", "8244110": "Matt Christian", "2338656": "Kalina Vanska"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["44"],  "plot": ["The Pearsons have an unconventional Thanksgiving dinner; In the past, Jack, Rebecca and the big three spend Thanksgiving with Miguel.", "Six Thanksgivings, covering close to 50 years, are presented. The first is in Vietnam where Jack has recently arranged for Nick to join his company as a medic. Nick is harboring some anger for reasons unknown to Jack. That reason comes to light as Jack tries to help a struggling family in the village consisting of an old man, a young woman, and the woman's son. The second is in 1997. Because Shelley has taken their kids, Andy and Amber, to have Thanksgiving with her family, Miguel is invited for the first time to spend Thanksgiving with the Pearsons. Miguel has largely been an absent father while trying to provide for the family and believes Shelley is now turning their children against him. Seeing the happy Pearsons is difficult for him to handle, including Randall working on what he considers the flawed question he has to answer for a college entrance application. The third is the first Thanksgiving spent together by William and Jessie, who are still feeling each other out mostly only knowing each other from the drug addiction support group. And the remaining Thanksgivings take place in present day. Kate and Toby, who is just on the road to resuming a stable mental state out of his depression, are cooking dinner at Randall and Beth's, while Randall and Beth's entire family heads to a campaign event volunteering at a soup kitchen. One person who ends up not going is under-the-weather Tess. What is actually happening with Tess leads to a point of connection between her and Aunt Kate. The campaign event is just the latest of several points of contention between Jae-won and Beth, the latter who Randall has appointed campaign field director. The end of the event will demonstrate how Randall really views Beth as part of his campaign team. The event will also bring up some painful memories for Déjà, which turns to being bittersweet with a text she receives. And Miguel and Rebecca will have dinner at Amber's with Amber and Andy's respective families, including Miguel's newly adopted grandson, before heading to Randall and Beth's in time for dessert. Miguel still has a strained relationship with his offspring which leads to a need to set some ground rules in what is and is not acceptable in the way they deal with each other.—Huggo"], "genres": "N/A", "imdbID": "6439886", "rating": 8.1, "votes": 1593, "number_of_episodes": 106}