{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "1404034": "Assaf Cohen", "2954288": "Caitlin Thompson", "2262592": "Elena Campbell-Martinez", "0430186": "Shirley Jordan", "9881728": "Trinity L Beals"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Tensions run high as the Pearsons await news about Kate's pregnancy.", "All the adult members of Kate's family, including their significant others, and Madison have eventually made their way to the hospital, Kate's water which broke at twenty-eight weeks. Beyond the initial news of Dr. Monroe being able to delay labor in the realm of hours and not weeks as would be ideal, they have heard little about Kate or the baby's condition or prognosis, whether it be from Toby who has been by Kate's side the entire time, Dr. Monroe, or any of the other hospital staff, none of the family members having ostensibly left the waiting room since their arrival, some who have been there since Kate's admission now just over twenty-four hours ago. As such, everyone is on pins and needles, which only makes the elephants in the room more palpable. Those elephants include Kevin's recent drinking binge which everyone is now aware of including Zoe who will have to evaluate their relationship based on this information, and the tiff between Randall and Beth in he asking her to delay her dream of teaching dance to look after their children which everyone else does not yet know, but which Beth may not be able to contain in her frustration. In being on pins and needles, every little thing seems to set one person or another off. While Miguel tries to play his usual role in diffusing the situation, Rebecca seems like she has gone into a trance, noticing all the minute details of their surrounding, which hearkens back for her to another hospital and another waiting room.—Huggo"], "genres": "N/A", "imdbID": "6439916", "rating": 8.2, "votes": 1666, "number_of_episodes": 106}