{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "2883943": "Tim Jo", "1726032": "Rob Morgan", "1462340": "Yetide Badaki", "1483927": "La Monde Byrd", "1664127": "James Moses Black", "4817345": "Augie Isaac", "8633113": "Ami Park", "0375461": "Bonnie Hellman", "0392409": "Debra D. Holt", "5382771": "Jan Jeffcoat", "2010454": "Kyle Chapple", "1973626": "Roy Nowlin"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Randall's campaign comes to a close. Kevin meets someone from Zoe's past. Kate and Toby get ready for the baby.", "The lives of the Big Three in the final seven weeks of the election campaign are presented, starting on the day after Jae-won tells Randall that the campaign is effectively over in he having no chance of winning, and after Beth tells Randall that she no longer supports him in the campaign in they needing to focus on Tess and what she has divulged to them about her life. Randall continuing with the campaign may be a sticking point between him and Beth. Randall also has to decide what to do with some damaging information Jae-won discovers about Brown, information which could effectively derail his campaign. Through it all, Randall cannot help think about the time Jack accompanied him to Howard, and what Jack stated that he envisioned for his future. Kevin and Zoe have made it back from Vietnam with the discovery that his Uncle Nick was not killed in the war in Vietnam. In Kevin and Zoe's search to find out what happened to Nick and if he is still alive, Kevin gets to see a part of Zoe's past, what Beth earlier mentioned to Kevin as Zoe's troubled history. That past may effect whether there is a future for them. And Kate and Toby have decided that it's time to redecorate the room they will use as the nursery. Due to a specific incident, they talk about what material of their own past, especially from their childhood, they can pass on to their child.—Huggo"], "genres": "N/A", "imdbID": "6439892", "rating": 8.4, "votes": 1555, "number_of_episodes": 106}