{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "2883943": "Tim Jo", "0625529": "Kirsten Nelson", "0858776": "Eddie Kaye Thomas", "1020036": "Alexandra Breckenridge", "1787882": "Maury Morgan", "9368032": "Joaquin Obradors", "8277173": "Ava Castro", "8733808": "Sophia Coto", "1570753": "Kim Estes", "2322636": "Jaxy Boyd", "0349824": "Joyce Guy", "3580041": "Adrian Bustamante", "6864295": "Kaori NeVille", "5595590": "Nick G. Hunter", "3278954": "Kenny Cooper", "1255080": "Lissa Pallo", "9881728": "Trinity L Beals"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Beth and Randall adjust to their new normal. Kate and Toby spend time with baby Jack. Zoe and Kevin work on their relationship.", "It's the end of the school year 1992, and Rebecca and Jack have agreed to be one of the chaperons at what will be the Big Three's first school dance. Kevin's goal of having a first kiss with Sophie is a little more obvious than Randall's goal for the evening, he who has agreed to be Kate's friend Jessica's date. Rebecca has an impromptu goal of her own when she learns that Jack never attended a school dance when he was young. In present day, Kate and Toby are dealing with Baby Jack's precarious situation differently, he who is still existing in an incubator and going through a plethora of daily tests which require him to be continually poked and prodded. Zoe has convinced Kevin not only to attend AA meetings again, but to go into couples therapy to address the issue not only of his recent drinking binge but the lies he told to hide it. Something that comes up in therapy may be a deal breaker for a long term future between the two, Kevin who turns to old supports to find the answers. And Randall and Beth have embarked on their shared housework and child rearing in light of Randall starting his work as a councilman and Beth continuing to teach dance to feel fulfilled, they trying to be there for the other when required in those professional situations. But they may only be able to keep up this pace for so long before something will give.—Huggo"], "genres": "N/A", "imdbID": "6439912", "rating": 8.0, "votes": 1427, "number_of_episodes": 106}