{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0429171": "Ron Cephas Jones", "4188767": "Rachel Hilson", "5252984": "Isaac Faulkner", "3323881": "Tommy Dickie", "0039415": "Chuck Askerneese"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["A history of Beth and Randall through the ages.", "In light of their potentially marriage-ending fight concerning the voice message Randall left when he thought Beth wasn't showing up for the political dinner, Randall and Beth are shown at key points in their relationship, starting with the first time Randall ever laid eyes on her at college. That relationship exists largely on Randall's persistence because their first date, at least from Beth's perspective, was a total disaster that highlighted their fundamental differences. The one thing that Beth did not want was either to be consumed by the other and their life. The bad of their relationship is analogous to the way they share a plate of nachos, her favorite food, with Randall having been able to sweet talk his way out of every bad situation thus far and Beth feeling that she ultimately has had to give every time. The good of their relationship is epitomized by the way they ultimately wrote their wedding vows - each having difficulties on their own leading up to their wedding day - and the underlying emotions to those words. In their current impasse, they have to find a way to get back to the emotions contained in the vows for their marriage to survive.—Huggo"], "genres": "N/A", "imdbID": "6439904", "rating": 8.7, "votes": 1639, "number_of_episodes": 106}