{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0029400": "Michael Angarano", "0629006": "Dustin Nguyen", "7870063": "Nate Boyer", "3983629": "Porter Duong", "1476151": "Kirk Zipfel", "0956531": "Yvonne Zima", "6968802": "Peter Falls", "1007108": "Peggy Goss", "0094007": "Paul Bond", "7060129": "Andrew Hollinger", "8807948": "Hung Wins", "9228818": "Adam Kroeger", "4159115": "Robert Werner", "4322704": "Elia Cantu", "4931447": "Mary Tran", "10258687": "Le Thi Quynh Nhu", "10258688": "Dang Thi Tu Trinh", "10258689": "Julie Louise Williams", "2946431": "Jon Gillette", "3878725": "Moses Storm"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin and Zoe land in Vietnam; in the past, Jack and Rebecca take a road trip to Los Angeles; Jack's war story continues to be revealed.", "Two times in Jack's life in the early 1970s is presented. One is in Vietnam, just as soon he meets up with Nicky. Their complicated war coexistence is shown, where Jack still wants to be his protector, while Nicky seems to have a death wish. Jack does whatever he can to have Nicky transferred to his platoon, while he himself has an uncomfortable incident en route back to his squad located in a small fishing village. Two is one week after Jack and Rebecca meet, she who has convinced him to accompany her to Los Angeles where she has an exploratory meeting with a record company executive arranged by her friend, Nicole. Vietnam hangs like a cloud over their road trip, Jack who refuses to speak to her about it, even as he has a special albeit painful task of his own in Los Angeles related to his time in Vietnam. The unspoken nature of Vietnam ends up bringing Jack and Rebecca closer together in an odd way. In present day, Kevin and Zoe have themselves arrived in Vietnam, it still a few days until they make their way to the fishing village. While Kevin makes an early discovery which could kibosh finding out about the woman and the necklace, he and Zoe make some admissions to one another as they navigate their relationship.—Huggo"], "genres": "N/A", "imdbID": "6439898", "rating": 8.3, "votes": 1628, "number_of_episodes": 106}