{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0029400": "Michael Angarano", "3983629": "Porter Duong", "0001162": "Griffin Dunne", "5772891": "Derrell Coakley", "6968802": "Peter Falls", "2731235": "Alvin Cowan", "9308415": "Anthony Ramirez", "10188950": "Tan Ly", "0629050": "Long Nguyen", "9368032": "Joaquin Obradors", "9336806": "Donnie Masihi"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca and the Big Three reckon with secrets Jack kept from them; Jack's Vietnam story continues to be revealed.", "Two road trips, nearly thirty years apart, to 2125 Songbird Road, Bradford, Pennsylvania are shown. The first, in 1992, is by Jack after receiving what is listed as the final postcard from Nick, the trip under the guise of a business trip to Trenton. Because of that postcard, Jack feels the need to have one last conversation with his little brother to tie up loose ends. The second, in present day, is by the Big Three, as Kevin has just told the rest of the family that Nick was not killed in the war as Jack had told them, and Kevin who discovered that Nick was still living at that address as recently as one year ago. Rebecca, emotionally, cannot handle making the trip as she deals with her role in Jack's lie, whether it was an all-out lie or the real truth of it being a lie partly out of omission. The Three are uncertain if Nick is still there, and if he is, what he will say if he does talk to them. Jack and the Three, on their respective trip, will end up having the same dilemma on their way home. Nick himself reflects on a specific incident in Vietnam which makes Jack's lie of saying that he died in the war not completely untrue, at least figuratively.—Huggo"], "genres": "N/A", "imdbID": "6439906", "rating": 9.1, "votes": 1963, "number_of_episodes": 106}