{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0001162": "Griffin Dunne", "0576538": "Ajay Mehta", "4508906": "Meera Rohit Kumbhani", "3053127": "Troy Doherty", "9368032": "Joaquin Obradors", "9336806": "Donnie Masihi", "1484297": "K.T. Thangavelu", "3735317": "Zainab Kareem", "10471448": "Leila Marien", "10281668": "Brennan Culpepper"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Kevin attempts to help Nicky; Randall and Kate reflect on differing memories of their childhood.", "After witnessing his behavior regardless of if it was a regular occurrence for him or purely a reaction to their visit, Kevin, Kate, and Randall feel they have no other option but to help their Uncle Nicky in the short term by not leaving him by himself in his leaking trailer where he could do himself harm. Kevin takes this help one step further by researching vet centers, one in nearby Youngstown, which looks to be a good one where they can take him at least for a visit. Rebecca appears unexpectedly to join them, even though originally she had no intention of meeting Nicky but nonetheless felt compelled to do so. Kate and Randall leave to attend to their other commitments. As Kevin and Rebecca deal with Nicky and as Kate and Randall head off together to their respective homes, they all cannot help but remember the day Rebecca now realizes was the day after Jack returned from his last visit to Nicky, in which Rebecca had an up-and-down time with Kevin when he wanted to get a baseball card signed by Pirates pitcher John Smiley. Kate and Randall have vastly different remembrances of the day and their father despite having been together and with Jack for all of it.—Huggo"], "genres": "N/A", "imdbID": "6439902", "rating": 8.4, "votes": 1527, "number_of_episodes": 106}