{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "2883943": "Tim Jo", "0625529": "Kirsten Nelson", "7021141": "Iantha Richardson", "10387116": "Preston Oliver", "0001162": "Griffin Dunne", "1787882": "Maury Morgan", "1695726": "Claudia Choi", "0484805": "Angela Landis", "5497997": "Marah Fairclough", "2016856": "Shayy Irving", "0646307": "Kirsten Olesen", "9378323": "Alfredo Tavares"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca helps Kate and Toby care for baby Jack. Zoe and Kevin look after Tess and Annie. Randall and Beth consider how to move forward.", "In 1992, Jack has to figure out what to do when Rebecca has an unexpected overnight hospital stay, not wanting to leave her side, the kids to see her in her present condition for the fear they may have, especially because they are dependent upon her emotionally as their mother, or to leave the kids with someone else in their collective emotional distress. The feeling of dependence on their mother hits Kate in the present day after Rebecca and Miguel have made the decision to move to Los Angeles to help Kate and Toby with baby Jack as he begins the transition from living on machines to surviving on his own. With them not yet even having left the hospital or Rebecca and Miguel having made the move, Kate begins to feel overtaken by her mother in the child-rearing process. Kevin can't help but raise the topic of children once again with Zoe when they babysit Tess and Annie, and Kevin sees how good she is with their nieces. And Randall and Beth have to figure out a way to overcome their current marital impasse if they can, their problems, which they have been trying to keep from their daughters. Unlike what Randall and Beth believe, their marital problems are not well hidden within the house, and both Tess and Déjà are able to see such problems with Randall and Beth and have their own methods of dealing with it. All these items come into play in the surviving Pearson collective convening several years into the future.—Huggo"], "genres": "N/A", "imdbID": "6439914", "rating": 9.1, "votes": 1943, "number_of_episodes": 106}