{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0648846": "Peter Onorati", "2874472": "Joy Brunson", "1157053": "Jeremy Luke", "1293847": "Natalie Morales", "0594895": "Mo McRae", "2954288": "Caitlin Thompson", "7021141": "Iantha Richardson", "0599019": "Sumalee Montano", "5732386": "Darryl Wesley", "0651075": "Arianna Ortiz", "1446060": "Hunter Parrish", "1530850": "Rafael Cabrera", "8645912": "Makenzie Lee-Foster", "5395063": "Jill Johnson", "3585556": "Angela Fornero", "2226919": "Stephanie Ray", "1863607": "Nansi Aluka", "0011386": "Tacey Adams", "4616715": "Matt Kelly", "3863881": "Brandon Morales", "0004622": "Alfred F. Woodley", "5935361": "Cooper Mothersbaugh", "2695249": "Denell Johnson", "9789831": "Brianna Bryan", "0625228": "Chuck Ramage", "5812325": "Paige Smith", "12673512": "Britt Bankhead", "6021232": "Brian Patrick Butler", "9354285": "Courtney Elizabeth", "9456576": "Doug Lito", "7290078": "Rich Morrow", "9875211": "Joe Wooley"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Big Three find themselves on new paths as they celebrate their 38th birthdays; Jack and Rebecca go on their first date; Deja turns a corner.", "It's December 23, 1972. While most of the talk in Pittsburgh today is what the sports media is calling Franco Harris' final play \"immaculate reception\" to win the playoff game against the Raiders, all Jack can think about is his first date with who he considers his dream girl, Rebecca, after spotting her singing at an open mic at *the* bar, especially as seeing her changed the course of his night and possibly of his life. The problem for Jack this night is that between him and Darryl, he can only come up with $9 for the date, something he doesn't want to tell Rebecca and which becomes more and more problematic as the date progresses. In present day, the Big 3 are celebrating their thirty-eighth birthdays. Kate and Toby will be attending a brunch hosted by Madison for the occasion, their mood at the brunch which will be dictated by an appointment they have that morning concerning their diminishing options to have a baby. Kevin will be joining Randall and his family to celebrate. What Randall is hoping for as the ultimate gift this year is for Déjà to agree to be adopted by him and Beth, he having planned an elaborate speech at a special location to broach the subject with her for the first time. It may not go Randall's way if Déjà has not yet gotten over the sense of being abandoned by her mother, which had earlier resulted her acting out against the Pearsons. Another attendee at that party will be Beth's cousin Zoe, who does not want Beth to know that she and Kevin are in the early throes of a sexual relationship, especially in knowing the outward animosity Beth has always had toward Kevin.—Huggo"], "genres": "N/A", "imdbID": "6439874", "rating": 8.6, "votes": 2006, "number_of_episodes": 106}