{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "1146916": "Eliza Bennett", "2954288": "Caitlin Thompson", "0179275": "Matt Corboy", "0704737": "Ruben Rabasa", "4931079": "Jonathan Grebe", "2277433": "Owen Alabado", "10527741": "Parker Sands", "10527742": "Lathan Moore", "9420684": "Sydnee Parker Anderson", "9157843": "Francisco M. Martinez", "7661074": "Bruce M. Stockert"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin keeps a secret from Zoe. Randall gets unexpected news about Deja. In the past, the Big Three graduate from High School.", "The Big Three are about to graduate from high school four weeks after Jack's death. Rebecca and Kate are unable to move on from the loss of Jack in their lives. For Rebecca, the issue is highlighted by something that happens when she goes shopping for something that was Jack's purview. For Kate, the feeling of abandonment is only exacerbated by Kevin's decision to follow Sophie to New York after graduation in pursuit of becoming an actor. In present day, Kate has finished the eight credits from Encino Community College required to become a college graduate. Although she doesn't want or expect any celebration, Toby goes all out not only for her but the other three people graduating at the same time with people surprising her at the surprise celebration. One person whom she does expect is Kevin, who has been in Los Angeles in meetings for the past week since the Big Three and Rebecca met with Nicky. The effect of meeting with their uncle for the first time has taken its toll on Kevin, who tries to hide his coping mechanism from everyone but especially Zoe. Other issues overtake the celebration. One person who did not make the trip to Los Angeles is Randall. Randall and Beth are trying to organize their lives in light of his upcoming work as city councilor and her decision to teach dance, all the while making sure the three girls are still priorities. Something that happens with Déjà may influence what decisions they make as a family.—Huggo"], "genres": "N/A", "imdbID": "6439908", "rating": 8.4, "votes": 1468, "number_of_episodes": 106}