{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0429171": "Ron Cephas Jones", "1726032": "Rob Morgan", "1313656": "Ryan Michelle Bathe", "1462340": "Yetide Badaki", "0530249": "Mario Lopez", "7289684": "Chris V. Pipkin", "8291648": "Drew Olivia Tillman", "5288777": "Rickey Alexander Wilson", "0468629": "Mary K. DeVault", "1186842": "Richard Gleason", "3940334": "Joshua Kwak", "0861558": "Kirk Thornton", "10166367": "Badegech Dittner", "10166368": "Victoria Knighten", "10166369": "Sydney Thomas", "7572405": "Marielle Caldwell", "9689195": "Ezra Faith", "9517468": "Khafre King"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Pearsons gather to support Kevin at his movie premiere; The teenage Big Three make college decisions.", "Approximately twenty-four hours in the lead up to the New York premiere of Kevin's feature film debut in Ron Howard directed Hill 400 is presented with the adult members of Kevin's family all invited. Kevin's thoughts go primarily to Zoe and figuring out if they are anything more than sex partners, which if so, means asking her to the premiere as his official date. Kate and Toby don't want to divulge to anyone in their family that they going through IVF, especially fearing the reaction from Rebecca. Toby is also hiding something about the process that may affect all his relationships and not only with Kate. And after the first week of school for the girls, Randall wants to accommodate Déjà, who misses hanging out with other black people her own age who are few and far between at the local school. He decides to introduce her to Sky, the daughter of William's old Nigerian friend Chi Chi from the apartment building in Philadelphia. Randall's action only demonstrates to him further how he lives between two worlds not quite fitting in in either. Within this time, Kate makes an off the cuff comment to Kevin, but it ends up affecting Randall even more, who hears about it second hand. What happens within this twenty-four hours is colored by how their lives were affected in the aftermath of Jack's death, a time when the Big Three were contemplating their post-secondary lives.—Huggo"], "genres": "N/A", "imdbID": "6439878", "rating": 8.1, "votes": 1683, "number_of_episodes": 106}