{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "4927489": "Melanie Liburd", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0029400": "Michael Angarano", "1726032": "Rob Morgan", "2883943": "Tim Jo", "2954288": "Caitlin Thompson", "0599019": "Sumalee Montano", "7021141": "Iantha Richardson", "0383226": "Joseph Hieu", "3116097": "Phong Le", "0001162": "Griffin Dunne", "6968802": "Peter Falls", "9308415": "Anthony Ramirez", "2731235": "Alvin Cowan", "5772891": "Derrell Coakley", "8291648": "Drew Olivia Tillman", "2306384": "Gregory A. Thompson", "0859150": "Leonard L. Thomas", "10188950": "Tan Ly", "1824934": "Lexi Johnson", "6509599": "Tq Gaskins", "9783289": "Cheyenne Green", "8721803": "Eric Utomo"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["44"],  "plot": ["Kevin arrives at the village his father served in; Kate pursues a new opportunity; Randall debates Councilman Solomon Brown; Jack struggles to get through to his brother.", "With Jack and Nick's joint tour of duty in Vietnam, Jack has to work fast to get Nick out of his funk until Nick is scheduled to return to his own platoon. Jack tries to reinforce that their joint mission is to make it back home alive. Nick has his own thoughts of what he wants for his time in the war. In present day, Kevin and Zoe are close to making it to the Ville where both Jack and Nick served. In likening their situation to a documentary movie, Kevin has to come to grips with Zoe's assertion that their journey is a fluid one without a preconceived ending of Kevin's own making. Kate and Toby discover that the news thus far on the baby front is positive. There is one suggestion that Dr. Jasper makes for Kate's own good, which sends her on a journey of discovery of her own with Toby by her side. They also have to discover why they don't want to learn the sex of the baby among other things they don't talk about the baby. Randall has an upcoming debate with Councilman Brown while he and Beth not only have to deal with a moody Tess but figure out what to do when they learn that Déjà has secretly been in contact with her biological mother. Something has to give with all these pressures facing Randall and Beth. And Kate tries to convince Tess to open up about her emotions, Tess' secret which Kate has divulged to Rebecca only wanting Tess to have that support she will probably eventually want and need.—Huggo"], "genres": "N/A", "imdbID": "6439888", "rating": 8.7, "votes": 1821, "number_of_episodes": 106}