{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0429171": "Ron Cephas Jones", "0607185": "Jennifer Morrison", "0648846": "Peter Onorati", "3641002": "Austin Abrams", "0917060": "Nick Wechsler", "0950165": "William Allen Young", "4188767": "Rachel Hilson", "3112508": "Amanda Leighton", "2601498": "Aynsley Bubbico", "9368032": "Joaquin Obradors", "9336806": "Donnie Masihi", "6373457": "Noah Salsbury Lipson", "12960665": "Anthony Aldapa", "10899560": "Chad Allen", "4245780": "Wayne Jones", "11034111": "Joshua K. Lavender", "6761943": "Chris Lemchi", "2445590": "Thiago Oliveira"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca hosts a dinner party. Kevin tries to support those around him. Randall faces concerns about how his family is adjusting to their new home.", "Two milestone Rebecca Pearson dinners are presented. The first is Jack and Rebecca's dinner the first night in their first-ever house together, they scrambling to locate their items for dinner as Rebecca wants to make the evening special. The second is one month after she and Kate have moved into their house following the fire, the dinner, beyond having invitee Miguel over for all his help, to celebrate Kevin and Sophie's marriage, and to welcome Randall and new girlfriend Beth from college. While the earlier dinner had its many problems, Rebecca still considers it the perfect night, while the issues that end up overtaking the latter dinner, which includes an unexpected attendee, may make emergence to it even being a good night difficult. In present day, Kevin, having purchased his own trailer and having set up next to Uncle Nicky, proceeds with his vow to help Cassidy repair her marriage, the first time meeting Ryan being at a local hockey game where veterans, including Cassidy, will be honored in an on-ice ceremony. Beyond finding that Uncle Nicky still resists his presence in his life, Kevin may find his task with regard to Cassidy and Ryan harder to achieve than he believed. Randall and Beth discover that the one aspect that Randall hoped would not manifest itself in any of his children has afflicted Tess. In learning directly from William that he too suffered from the condition, Beth takes action to comfort both Randall and Tess about the matter, but also repair whatever negative feelings Tess has about her father because of it. And Kate and Toby await the housewarming gift Randall says he and Kevin have sent. While Toby expects it to be another grand gesture typical of the Pearson men, it ends up being bittersweet for Kate in some things attached to the actual gift.—Huggo"], "genres": "N/A", "imdbID": "10322314", "rating": 8.8, "votes": 1622, "number_of_episodes": 106}