{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "2954288": "Caitlin Thompson", "11013071": "Blake Stadnik", "1013433": "Susan Santiago", "0781899": "Pamela Adlon", "1594244": "Steven Lee Allen", "11381169": "Tanner Long", "11381171": "Sebastian Forbes", "4280847": "Shay Ali"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Kevin spends the day with Rebecca; Toby makes a grand gesture; the Big Three get their report cards.", "Each of the Big Three has returned to his/her respective home following their much needed sibling retreat to the cabin to deal with their current issues. Kevin feels the need to visit with his mother in light of learning not only about her potential health problems, but learning that she will be finding out her MRI test results today. On Miguel's suggestion, Rebecca and Kevin end up spending the day together leading up to her late afternoon appointment. With Kate, Toby is saying all the right things to her, and is in the works for another of his grand gestures, but she isn't sure if the words and the gesture are enough. In meeting with Madison to clear the air about what happened between her and Kevin, Kate may get a clearer perspective about Toby. And Randall, on Beth's urging, has decided to see a therapist in light of the fact of the intruder, that incident which may trigger his next panic attack. On top of that issue, Randall is dealing with being in Philadelphia while Rebecca is without him in Los Angeles, he not trusting either Miguel or Kevin to handle things with her to his satisfaction. To fully get out of therapy what he needs, Randall will have to give up some control which he may not be able to do being who he is. These issues with the three and with Rebecca hearkens back to a day when they were twelve, it being report card day and the implications of those report card marks in relation to a deal the three have made with their parents.—Huggo"], "genres": "N/A", "imdbID": "10322334", "rating": 8.6, "votes": 1444, "number_of_episodes": 106}