{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0004898": "Omar Epps", "1750371": "Marsha Stephanie Blake", "2874472": "Joy Brunson", "1792900": "Brandon Scott", "3680560": "Skye P. Marshall", "0000427": "Pam Grier", "8645912": "Makenzie Lee-Foster", "8895521": "Johnath Davis", "8070375": "Bobby Favoretto", "2582484": "Michael J. Kraycik"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Déjà pushes the boundaries of Randall and Beth's trust. Jack and Rebecca invite Randall's new teacher over for dinner.", "Two exploratory dinners approximately 30 years apart are presented. In the first, Jack has invited Mr. Lawrence - Cory - and his wife Trish to dinner in seeing how much Randall admires, almost revers, his black teacher. While Jack outwardly wants to get to know Mr. Lawrence, the reason for the invitation, Rebecca, and the Lawrences for that matter, can see Jack's true agenda. In the second, Randall and Beth have invited the Hodges family for dinner, the issue spurring it being the fact that Déjà not only went against their directive of not seeing Malik, but that their time together was as he convinced her to skip school, Randall and Beth only finding out by a telephone call from the school principal. Realizing that Déjà cannot totally avoid Malik, Randall and Beth want to meet his parents before passing their final judgment. While Randall has more than made up his mind, Beth wants them to keep a open perspective in not prejudging the outcome. The dinner may not turn out the way either expects. And with both dinners, it may be the innocent who can only bring up the white elephants in the room. In the process of the dinner with the Hodges, a flashback to Déjà and Malik's day together skipping school is shown. As Randall has only shown the family what tourists see of the city, Malik wanted to show Déjà the \"real\" Philadelphia: his Philadelphia. In the process, Déjà laments not remembering much about her only other trip to Philadelphia when she was four or five with her biological mother and grandmother, and laments her inexperience with boys.—Huggo"], "genres": "N/A", "imdbID": "10322320", "rating": 8.7, "votes": 1553, "number_of_episodes": 106}