{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0607185": "Jennifer Morrison", "2883943": "Tim Jo", "1792900": "Brandon Scott", "0950165": "William Allen Young", "3004687": "Galadriel Stineman", "0001513": "Tim Matheson", "1490516": "Dan Warner", "0715433": "Gary Lee Reed", "3101421": "Maurice Webster", "1502541": "Tom Yi", "3295021": "Merrick McCartha"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kate and Toby try to make time for their marriage. Jack attempts to prove himself to Rebecca's father. Randall struggles to find his place with the other councilmen.", "Three rounds of golf over the years involving non-golfers Jack and/or Randall are presented. On the spur of the moment while Rebecca has a brunch date with her mother, Rebecca encourages Jack, the two still early in their dating life, to go out on the links with her father to the country club so that the two of them can bond and get to know each other better. Despite never feeling like he fit in that day, Jack takes 12-year-old Randall out for nine holes in wanting to provide him with opportunities he may not otherwise have, especially because he has been taken under Mr. Lawrence's wing - a black man Randall admires - and because Mr. Lawrence has told Randall of a new black professional golfer Tiger Woods who is poised to change the face of the game. In present day, Randall, feeling like he is being frozen out by Councilman Wilkins after having had to cancel two previous meetings with him, tries to find a way back in through one of Wilkins' favorite activities golf by using Randall's access to one of the most exclusive courses in town. This round is his first since that day when he was 12 with his father, which Randall wanted to cut short. Meanwhile, it's been almost 10 months since Kate and Toby have had sex, and with Kate using the excuse of Jack, Toby encourages her to ask Rebecca to sit with the baby so that they can have a romantic hotel stay on their own. Toby's mind and his body tell him two different things, the connection between those two being a comment made by Kate to him while he was cleaning out his closet. And Kevin is trying to find things to do to keep himself preoccupied in what is his new albeit temporary home with the length of his stay dependent on Nicky's legal issues. While he still has Cassidy's issue on his mind, Kevin ends up falling into old habits when it comes to the opposite sex.—Huggo"], "genres": "N/A", "imdbID": "10322316", "rating": 8.3, "votes": 1477, "number_of_episodes": 106}