{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "3641002": "Austin Abrams", "2954288": "Caitlin Thompson", "7021141": "Iantha Richardson", "2075851": "Jaret Sacrey", "1904890": "Maryam Myika Day", "1435830": "David Hutchison", "0420564": "Tobias Jelinek"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Big Three reconnect at the family cabin.", "The Big Three are spending time at the cabin after the terrible week each has had. Beyond whether being with their siblings can help each deal with the fundamental issue of the source of their problems, other questions are whether they can trust what is going on at home without micromanaging - for Randall, the safety of his family and of their property and for Kate, Toby stepping up to the plate as a true father to Jack - and whether that trust is warranted. Two other time periods when the family was at the cabin are shown. One is in 1993 when Jack decided that he wanted to bury a time capsule on the property with one item from each family member with a plan to open the capsule in five years. The other is in 1999 when Rebecca, Kevin, and Randall rushed to the cabin because of Rebecca's fear that Kate was not all right while Kate was alone at the cabin with Marc after Kate's somewhat odd-sounding telephone call home. Those two earlier time periods have a profound effect on their time in present day and into the future.—Huggo"], "genres": "N/A", "imdbID": "10322330", "rating": 9.5, "votes": 2426, "number_of_episodes": 106}