{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0001610": "Elizabeth Perkins", "1013433": "Susan Santiago", "0992556": "Thomas Anthony Jones", "2954288": "Caitlin Thompson", "0420564": "Tobias Jelinek", "0124208": "Sophia Bush", "1775466": "John Legend", "5282709": "Ruben Vernier", "1159706": "J. Anthony McCarthy", "1869418": "Desiree Hall", "1033094": "Jamie Tompkins", "4495094": "Jenny Tran", "0444937": "Eddie Kehler", "17112958": "Alexander Pleasant"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kate confronts Toby about the messages she found on his phone. Rebecca gets her test results from the doctors.", "During Jack and Rebecca's dating life, Jack is affected by the words said to him by her father at the end of their day on the golf course, those words hitting home as he critically reviews his own life. In present day, Randall takes it upon himself to arrange an appointment for his mother with the best neurologist in Los Angeles, Dr. Angela Whitaker. Randall's action may have an affect not only on Rebecca, who doesn't want either Kevin or Kate to know, but Miguel who feels that Randall is overstepping his bounds, especially as Miguel sees both his and Rebecca's bouts of forgetfulness as the natural course of their age. Kevin has employed the services of a matchmaking company in his short-term plan to get married and have a child by age forty, all the while having that great romance characterized by his parents. With one failed date after another, Kevin decides on a different tact of letting the universe take its course, which may yield some more positive results in he not putting as much pressure on the situation. And Kate continues to have issue with \"cross-fit Toby,\" especially as she believes one of his cross-fit pals with the online handle of Lady Kryptonite may have her designs on him. Kate tries to bridge the gap by inviting Toby's cross-fit friends, none who she has ever met, to Toby's Margaritaville-themed surprise birthday party.—Huggo"], "genres": "N/A", "imdbID": "10322324", "rating": 8.7, "votes": 1527, "number_of_episodes": 106}