{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "0607185": "Jennifer Morrison", "0004898": "Omar Epps", "10040186": "Asante Blackk", "0917060": "Nick Wechsler", "1750371": "Marsha Stephanie Blake", "11013071": "Blake Stadnik", "0380073": "Maximiliano Hernández", "0861487": "Auden Thornton", "0001610": "Elizabeth Perkins", "0001513": "Tim Matheson", "0001162": "Griffin Dunne", "8291648": "Drew Olivia Tillman", "6916654": "Michael Douglas Goodman", "7221471": "Julian Silva", "6373457": "Noah Salsbury Lipson", "10274388": "James LaPorta", "5830123": "Robert Riechel Jr.", "2550918": "Rich Paul", "3177302": "Bryan Dodds", "2984113": "Anthony Corrales", "2223081": "Samira Izadi", "0961547": "Tripp Pickell", "0405033": "Alex Hyde-White", "0919258": "René Ashton", "0644172": "Baadja-Lyne Odums", "11013070": "Jaxson DeFilippo", "6858202": "Bahara Golestani", "5471114": "Benmio McCrea", "9065119": "Cary Huff", "9157843": "Francisco M. Martinez"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["50"],  "plot": ["Jack meets Rebecca's parents. New characters are introduced.", "In the early 1970s, Jack and Rebecca have returned to Pittsburgh after what was their third date, a week-long road trip to Los Angeles where Rebecca was having an exploratory meeting with record company executives. Beyond their mock coyness, both Jack and Rebecca don't want to wait for their next date, which is why Rebecca offers and Jack agrees to a country club dinner she had already planned with her parents and some family friends. Beyond Jack's need to look the part meaning wearing a sports jacket which he does not own and cannot afford to buy, he will have to overcome what is probably her parents' perception of him having whisked Rebecca away only having known each other a week. Jack will find that the wolf in sheep's clothing may be the most dangerous in what he already sees as his and Rebecca's long-term relationship. In present day, Cass has just returned to the States decommissioned after a very difficult tour of duty in the Middle East. One specific event triggered by what on the surface was a minor issue shows her that she is suffering from PTSD, although she doesn't want to simplify what she is going through with the four letters alone. Teenage Malik is tired of his mother constantly harping on him about his responsibilities, he well aware of those responsibilities in seeing his infant daughter every day. He contemplates the big and easy money (i.e. illegal) to support his daughter rather than working at his father Darnell's garage. His encounter with \"a Pearson\" has the potential to be another Jack/Rebecca country club dinner. And a few decades down the road, Jack and Lucy's joint life, from their meeting to their courtship to the early part of their marriage, is presented.—Huggo"], "genres": "N/A", "imdbID": "10322306", "rating": 8.9, "votes": 2503, "number_of_episodes": 106}