{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "2954288": "Caitlin Thompson", "0001034": "Rosalind Chao", "0796117": "M. Night Shyamalan", "3520171": "Carter Sand", "7173876": "Lleythan Crosby", "5546917": "Milton T.J. Taylor", "7374547": "Sicily Fontaine", "6634068": "Audrey Casson", "4241645": "Shawana Carter", "5282709": "Ruben Vernier", "1860007": "Travis Greer", "10867026": "Kaz Womack", "11027957": "Ca'Ron Jaden Coleman", "10866049": "Isabella Rose Landau", "8070375": "Bobby Favoretto", "7171099": "Jibril Goodman", "0665952": "Peter Patrikios", "3491108": "Michelle Santiago"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Beth and Randall adjust to life in Philadelphia. Jack and Rebecca take the big three to the pool.", "At the end of summer 1992, Jack, before the kids head back to school for the year, wants to have a family fun day back to the pool as they did four years ago. Unlike that fun day about which the then eight year old kids were excited, the Big Three, now twelve, are less than excited. While Jack and Rebecca largely want at least the family aspect of that day four years ago not to have changed, the three now have a different dynamic with their family members, and have different, more grown-up peer pressure problems with their friends and so-called friends. In present day which too is at the end of summer, both Randall and Kevin can't help but think back to that pool day in 1992. Randall and Beth and their family are still settling into life in Philadelphia. While Randall too wants to have a Pearson family fun day to mark the end of summer and celebrate all their new city has to offer, he and Beth are in negotiation with the girls about other issues, Randall with Déjà about her want to ride the public transit bus by herself to school, and Beth with Tess about a trip to the salon, Tess who wants to express her true self in the hairstyle she chooses instead of Beth's vision of her. Kevin has now been sober one hundred eighty-seven days, since the day Jack was born. He is still struggling and has to balance his life: his own path in sobriety, supporting Kate in her current issues while having no idea how to provide that support in a meaningful way, and dealing with Nicky's recent kerfuffle, Nicky who isn't returning Kevin's calls. And Kate and Toby are dealing with the news that Jack's blindness is permanent. While Kate is handling the news with a seeming single-minded focus, which includes finding Anna who will help them live holistically with a child with such a disability, Toby, knowing his wife, can see that she is not dealing with the news in her own best interest while he tries to help himself in other ways he has not told anyone. In the process, Rebecca too can't help but think back to that pool day in 1992.—Huggo"], "genres": "N/A", "imdbID": "10322308", "rating": 8.4, "votes": 1529, "number_of_episodes": 106}