{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "4188767": "Rachel Hilson", "1616349": "Dave Annable", "3112508": "Amanda Leighton", "1884460": "Megan McNulty", "8899185": "Kya Kruse", "7561503": "Highdee Kuan", "4022227": "Clayton Farris", "7249194": "Orease Bowers", "11347117": "Heather Botts", "3938816": "Phillip-Charlie Daniell", "11713292": "Jason Jordan", "8738972": "Leah B. Kemerling", "9300788": "Bryce McKinney"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Pearsons visit New York City.", "Three Pearson family trips to New York City, each spurred by an event of one of the Big Three, are presented. When the kids are in middle school, the entire family spend 24 hours in the city en route to taking Randall to a debate tournament being held upstate. In their 24 hours, Jack allows each family member to choose one thing they as a collective will do. While this would be Jack's first-ever trip to the city, Rebecca cannot help but fondly remember her annual family trips there as a child, those remembrances which may foreshadow elements of this trip. A year after Jack's death, Randall, Beth and Rebecca drive to the city to meet with Kevin and Sophie, the trip to watch Kevin perform in a showcase, it being the first time Rebecca has returned since that trip six years earlier. While Rebecca is in town, Kevin has a plan in place concerning her and his acting coach, Kirby. And in present day, Rebecca and Kevin are flying to the city for Kevin's movie premiere, Randall who will meet them there. With Kevin and Kate's very reticent okay, Randall has an ulterior motive for wanting to meet with their mother concerning her diagnosis, he who has always felt he is the only one, in the absence of their father, who can take care of her and knows what is best for her, while Kevin has the conflicting goal of just wanting their mother to have just one great day.—Huggo"], "genres": "N/A", "imdbID": "10322336", "rating": 8.6, "votes": 1457, "number_of_episodes": 106}