{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0607185": "Jennifer Morrison", "3641002": "Austin Abrams", "0648486": "Timothy Omundson", "4188767": "Rachel Hilson", "0056249": "Joanne Baron", "0711118": "Phylicia Rashad", "3655078": "Megan Hensley", "0113998": "Kelvin Brown", "0268368": "Abe Farrelly", "0934910": "Rachel Winfree", "1484129": "Wayne Lopez", "1186450": "Paul Tigue", "0669071": "Julie Pearl", "0169581": "Mark Cohen", "3276688": "Amber Martinez", "11045934": "Alessandro Pedrazzi"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin reflects on his past. Rebecca visits Randall at college. Beth's mom comes to visit. Kate and Toby share new experiences with baby Jack.", "In 1998, Rebecca goes to visit Randall at college on Parents Day. While Kevin is now living in New York, Rebecca worries more about Kate at home wiling away her time with no direction. On the visit, Rebecca notices that Randall is distracted, and after learning why he is distracted, she takes measures against his wishes to deal with it. On the one and only task that Rebecca has given Kate for the day to go to the mall to replenish their CDs after the fire, Kate comes away from the experience with something unexpected. And at the end of the day, Rebecca and Kate receive some shocking news. In present day, Kate, wanting to provide Jack the full experience of life, decides to take him to a music class. That situation provides her and Toby with some experience about how to proceed with Jack. While Kevin is about to take Nicky to their next AA meeting after being banned from the last group, Kevin receives some news closing one chapter of his life, which makes the meeting more of a necessity for him this day. Another attendee at that meeting is Cassidy, also banned from the last group, who is also not doing well with the latest development at home. Out of circumstance, the three of them have five hours to kill before the meeting, which gives them time both to reflect on their current issues and, at least for Cassidy, reluctantly to get to know who could potentially be her long-term AA meeting colleagues when she views Kevin in particular with some animosity. And after three months work, Beth is having the grand opening of the dance studio with her immediate family in attendance to provide support. With Carol also coming from out of town for the opening, Randall, who has never gotten along with his domineering mother-in-law, makes a vow to Beth to act as the buffer between the two of them during the event. The event ends up being overtaken with a situation in the building, and with something associated with a request from Déjà.—Huggo"], "genres": "N/A", "imdbID": "10322310", "rating": 8.5, "votes": 1465, "number_of_episodes": 106}