{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0607185": "Jennifer Morrison", "2883943": "Tim Jo", "3641002": "Austin Abrams", "0648486": "Timothy Omundson", "0917060": "Nick Wechsler", "2601498": "Aynsley Bubbico", "6373457": "Noah Salsbury Lipson", "0186976": "Thomas Crawford", "0129522": "Doreen Calderon", "7223247": "Tom E. Nicholson", "10867026": "Kaz Womack", "10866049": "Isabella Rose Landau", "11027957": "Ca'Ron Jaden Coleman", "0727850": "Daniel Riordan", "1911660": "Justin Morck"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca visits Randall in Philadelphia; Beth is troubled by a request from Deja; Kevin has doubts about himself.", "Two periods in Rebecca and Randall's relationship are shown, highlighting what Randall has coined \"R and R\": Randall and Rebecca time. The first is about a year after Jack's death when Rebecca feels the need to enter the work force to pay the bills with Jack's insurance money dwindling. The second is in present day with Rebecca and Miguel making an early trip to Philadelphia for Thanksgiving at Randall and Beth's. Randall develops concern for Rebecca during R and R time that Rebecca cannot function without some help, arguably his help, because of different reasons in each of the two time periods. Meanwhile, Nicky's court appearance is approaching, which is the reason Kevin has stayed in town. However, Kevin is not in the best shape to be of help at this crucial time in the aftermath of his and Cassidy's sexual encounter, which has neither helped him nor Cassidy. With visits metaphysically from his past, Kevin has to find an outlet to deal with his emotions, the bottle his old standby. Baby Jack should be at the stage of eating solid food, but Kate is having difficulty when testing one food at a time like she believes she has to. Toby is not apprised of a development in the situation that occurred with Gregory. And Beth is supervising an in-house date between Déjà and Malik. While trying to be invisible, Beth feels the need to intervene in a matter between the two, which she learns does involve her and Randall.—Huggo"], "genres": "N/A", "imdbID": "10322322", "rating": 8.5, "votes": 1454, "number_of_episodes": 106}