{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0607185": "Jennifer Morrison", "2883943": "Tim Jo", "0648486": "Timothy Omundson", "1792900": "Brandon Scott", "0121620": "Carlease Burke", "2601498": "Aynsley Bubbico", "6373457": "Noah Salsbury Lipson", "1449868": "Freedom Bridgewater", "0122756": "Lauren Burns", "0942328": "David Grant Wright", "6033371": "Kian Morr", "0936011": "Time Winters", "1346283": "Misha Gonz-Cirkl", "5925107": "Irina Dubova", "1764331": "Teresa Tharp", "4725721": "Ray Dennis", "2603804": "Cailin McDonald", "0912202": "Maurice Warfield", "0426716": "Karlton Johnson", "2961601": "Antonio De Lima", "1032708": "Thomas Silcott", "2951550": "Nina Gosiengfiao", "8393998": "Portia D. Harris", "1906074": "Janis Jones", "10337775": "Miles Quincy Martin", "2474638": "Jaclyn Ngan"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Randall is confronted with a tough choice. Kate and Toby adjust to their new home. Miguel and Jack's friendship solidifies.", "The start of the school year in 1992 and present day are presented, times that do not go according to plan for many of the Pearsons. In 1992, Randall, wanting to make a good impression on a new teacher, does something that gets him into hot water instead and results in something with that he has to deal for the rest of his life. In this specific situation, he gets some unexpected help. With public school not yet having started, Kate and Rebecca try to bond over a shared activity at home, but it gets Kate onto a path that she too has to deal with for the rest of her life. And a bad situation at work brings Jack and Miguel closer together as friends. In present day, Déjà learns something about her budding romance with Malik, while Tess, expecting that she can deal with her sexual orientation in a fresh manner by not having a history with her new classmates, doesn't have the first day she wanted. Randall has literally become \"unhinged\" by having his office door removed to demonstrate his Monday open-door policy to the general public, which Jae-won, his Chief of Staff, encourages to do things differently. This move, however, receives the quiet and not-so-quiet ire of experienced staffer, chief aide Bernice. Randall, being open as a political newbie, has to balance Bernice's comments about doing his job versus what he truly wants to do. Kevin has decided to come to Nicky's aid in ensuring that his chair-throwing incident not only does not land him in prison but that he can still continue with therapy afforded to him as a veteran. In the process, Kevin, who is not managing well with regard to his sobriety, and Nicky meet Cassidy, their initial impressions of each other which gets them off to a rocky start. And in attending a business lunch to woo potential clients for Toby, Kate sees her husband in a clearer light which she did not see in her sole focus on Jack. She also meets one of their neighbors, the two who have the potential not to be good neighbors in focusing on their individual problems without knowing the others.—Huggo"], "genres": "N/A", "imdbID": "10322312", "rating": 8.4, "votes": 1512, "number_of_episodes": 106}