{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0781899": "Pamela Adlon", "0648846": "Peter Onorati", "2243196": "Jermel Nakia", "2484632": "Jennifer C. Holmes", "4692308": "Samuel Davis", "1088446": "Frank Bond", "9368032": "Joaquin Obradors", "9336806": "Donnie Masihi", "0112238": "Sally Brooks", "0122073": "Jernard Burks", "0574468": "Gerald McRaney"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["With the Big Three's 40th birthday now here, flashbacks in the immediate lead up to their births continue, with Randall's not as straightforward as it appears; Kevin and Madison make a decision about their future.", "With the Big Three's 40th birthday now here, the stories in the immediate lead up to their own births are continued, Randall's which is not as straightforward as it appears on the surface. Following the medical distress issue concerning the twins which required a trip to the hospital, Kevin and Madison make a decision about their future. And as the collective they have had to call the police in Rebecca never having made her way to the bakery to pick up the cake and they not having heard from her, Kate sends a frantic text to Randall, who makes the decision to drive to the cabin. Beyond the issue of Rebecca herself, Randall being at the cabin may not only provide an opportunity for he and Kevin to address the issue of their current estrangement, but for Kate to learn if she is indeed not imagining that her own relationship with Randall has been negatively affected, she believing, if so, it having something to do with the unknown issue between him and Kevin. That trip to the cabin leads to Randall making a decision about how best to deal with his own mental health.—Huggo", "With the Big Three's 40th birthday now here, flashbacks in the immediate lead up to their own births continue, with Randall's not as straightforward as it appears; Kevin and Madison make a decision about their future; Randall's trip to the cabin leads to him addressing his current estrangement with Kevin and how best to deal with his mental health."], "genres": "N/A", "imdbID": "13275494", "rating": 7.5, "votes": 1925, "number_of_episodes": 106}