{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0607185": "Jennifer Morrison", "0029400": "Michael Angarano", "3017448": "Genevieve Angelson", "0648846": "Peter Onorati", "0631146": "Laura Niemi", "0132843": "Scott Michael Campbell", "2731235": "Alvin Cowan", "0932137": "Ruth Williamson", "2366339": "Yvonne Valadez", "4361284": "Kila Packett", "6476208": "Philip Behringer", "1399740": "Drew Butler", "3182118": "Betsy Moore"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin and Madison get an unexpected guest.", "Three periods in Nicky's life are presented. In the first, it's the summer of 1969, and with the backdrop of the excitement of the moon landing, Nicky has settled into a life of hiding out at home with his parents, in the process thinking about the possibility that he may be drafted later in the year. The one bright spot that takes him out of his comfort zone is seeing Sally, a free-spirited coworker at the veterinary hospital where he works. Beyond whether he can either make the first move with her or act on any indications from her, what happens is proverbially and literally driven by a third, Pearl. In the second, it's the post-war era, and Nicky has been invited to a reunion of his platoon for an event, which he normally would have avoided except it is near his home and Jack, whom he has not seen since Vietnam, will probably be there. And in the third and final period, it's present day, and Nicky, without telling either Kevin or Madison, is getting ready for a trip to California to meet his namesake and his namesake's twin sister. He is ill-equipped to handle everything on his own, including the flight because he has not been on a plane since Vietnam in 1971. Each of the three segments are fraught with Nicky's fear and self-loathing.—Huggo"], "genres": "N/A", "imdbID": "14209614", "rating": 8.6, "votes": 1616, "number_of_episodes": 106}