{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0711118": "Phylicia Rashad", "0001162": "Griffin Dunne", "1600226": "Christian Pedersen", "0040992": "Mark Atteberry", "2733111": "Mark Jacobson", "0359257": "Ren Hanami", "1382044": "Terryn Westbrook", "12334022": "Makenzie Carmichael"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Beth navigates qualms with her mother; Kevin and Kate bring their families together for dinner.", "With three newborns simultaneously entering the Pearsons' collective lives, the parallel track stories of Jack and Rebecca handling their three and Kate and Toby, and Kevin and Madison handling their collective three newborns plus baby Jack, are told. Randall and Beth's family enters that parallel track when the stories shift to a dinner apiece. Not wanting to splurge on a babysitter with their limited financial resources, Rebecca decides to stay home with the babies while Jack attends a business dinner with Miguel and their bosses in Jack, bucking for a promotion, needing show them that he is \"more than just a foreman.\" Jack gets caught between a rock and hard place in a game of roulette he can't afford to lose. Kevin and Madison, wanting a break from the constant role of new parents, invite Kate and Toby and their family for a sit-down dinner. Toby doesn't want to let especially Kevin know that he lost his job, and that, of the many Zoom interviews he's had, there is only the remote possibility of getting one of those jobs. The fact of Natasha lending her support for the evening only highlights the reason why Toby wants to keep this part of his life a secret from Kevin. And although Randall and Beth have been home from New Orleans for some time, Carol, who had been looking after the girls, still has not gone home. While Randall and especially Beth have to deal with the judgmental presence of Carol in their day-to-day lives, they prepare for what was supposed to be a \"last supper\" before Carol heads home, that dinner which changes in tone with Carol's announcement that she plans to stay an extra week, and with issues Randall and Beth have with Tess and indirectly with Déjà through Malik, which are only exacerbated by Carol's presence.—Huggo"], "genres": "N/A", "imdbID": "14122176", "rating": 8.0, "votes": 1295, "number_of_episodes": 106}