{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0648846": "Peter Onorati", "0539651": "Joshua Malina", "0247040": "George Eads", "4187742": "Stephen Friedrich", "9368032": "Joaquin Obradors", "7412620": "Alex J. Joseph", "0848972": "Diana Tanaka", "9328844": "Jerimiyah Dunbar", "0215058": "John Deignan", "5003092": "Natalie Woodard"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["Kevin embarks on a stressful road trip; Jack and young Kevin go to a football training camp.", "Young teen Kevin has been invited by his coach to an expensive out-of-town quarterback training camp for seventh and eighth graders. Jack will be accompanying him, seeing this as the first major step to a possible football career with Penn State players and thus scouts in attendance, they providing information back to the institution for future scholarship consideration. Kevin's emotional state is affected by a conversation he secretly overheard between his parents about him which may set him up for failure, beyond some other issues, including words said directly to him by the coach and his own insecurities in knowing he gives up easily when the going gets tough. For Jack, this trip only reminds him of his childhood as a minor leaguer whose joy of baseball was quashed by his father's behavior, Stanley who always attended Jack's game, the one thing Stanley did with Jack. Jack just hopes that with Kevin, he has not turned into a version of his own father. In present day, Kevin, still in Vancouver, is close to completing filming with a few key scenes left, when he receives a telephone call from Madison who believes she is going into labor, six weeks before her due date. As Madison is all alone with the only other person she would normally turn to, Kate, being preoccupied with her own baby as Ellie is being induced, Kevin has to decide what to do. Even if he does choose to abandon the film in favor of Madison, he is not assured that he can find a flight home; if he does, whether he will make it back in time, let alone if any of life's unexpected surprises pop into the picture. Through it all, Kevin tries to channel his hero, Jack, in Kevin's mind, who would have found a way to accomplish it all.—Huggo"], "genres": "N/A", "imdbID": "13761864", "rating": 8.4, "votes": 1472, "number_of_episodes": 106}