{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "6217203": "Annie Funke", "7021141": "Iantha Richardson", "6681689": "Iyana Halley", "1145455": "La Trice Harper", "7012228": "Taubert Nadalini", "0209532": "Marita de Lara", "6197437": "Phoebe Kuhlman", "0790158": "Cari Shayne", "4841657": "Ricky Staffieri", "0238004": "Eddie Driscoll", "4189813": "Tony von Halle", "11285792": "Dion Gaeta", "4229526": "Stephen A. Chang", "1317477": "Kenny Stevenson", "11027957": "Ca'Ron Jaden Coleman", "10866049": "Isabella Rose Landau", "10867026": "Kaz Womack", "0851774": "London Garcia", "12351518": "Emerson Totino"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["A series of car rides propels the Pearsons towards new stages of their lives.", "Four separate trips transporting newborns from the hospital to home are featured. In one, Jack and Rebecca are taking the Big Three home. While the attending nurse can see their fears especially in having three in their first go 'round, Rebecca is open enough to wear her emotions on her sleeve, especially when she's alone with Jack. Jack, in not wanting to turn into his own father, hides his fears with he potentially facing a breaking point. In two, Randall and Beth are taking Annie home, they being old hats in this being their second time after Tess. As such, Beth can only focus on the promise of a Dairy Queen Snickers Blizzard, while Randall already has thoughts of number three. In three, Kevin and Madison are taking Nick and Franny home. Kevin, working on little to no sleep, can only think \"what would Jack do?\", not realizing that he is more like his father than he thinks. And in four, Kate and Toby are not only taking Hailey Rose home, but are driving Ellie to her home as well. In Ellie's emotions having changed since the birth, Kate and Toby realize how sensitive the situation is, while Toby further has to deal with an issue that he will eventually have to tell Kate about in it affecting their immediate future. Also featured are Randall and Beth's three daughters in the future as adults, one who doesn't even have to tell another what's going on in her life.—Huggo"], "genres": "N/A", "imdbID": "14071708", "rating": 8.1, "votes": 1366, "number_of_episodes": 106}