{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "1357218": "Chris Geere", "2633241": "Briana Venskus", "1245495": "Tom Parker", "5096181": "Alexandra Wright", "6728904": "Cronin Cullen", "1886427": "Doug Long", "1821621": "Mike Rock", "11027957": "Ca'Ron Jaden Coleman", "10866049": "Isabella Rose Landau", "10867026": "Kaz Womack", "10407986": "Catherine Curry", "8620868": "Lexie Lovering"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The family gathers for Kevin and Madison's wedding.", "It's the day of Kevin and Madison's wedding, and all involved who have different priorities for the day. A common theme, however, for a few is remembrances back to their own weddings and what those vows actually meant. For Kate, the thought of those vows relates to the current issue with Toby and work after he was offered a job requiring him to be in the office in San Francisco three days a week, which may result in Kate needing to quit the job she loves. For Rebecca, her thoughts go back not to her first wedding to Jack but to the impromptu family wedding the two needed to have to show the Big Three, who were five at the time, that they still loved each other. Those thoughts are not only related to Rebecca's current health issues but to her relationship specifically with Randall, who has not opened up to her about his time in New Orleans and discoveries about his biological mother, Laurel. Kevin and Madison are each dealing with the stress of the day in a different way, but their less than traditional route to the altar remains the elephant in the room, especially in light of their respective bachelor and bachelorette parties.—Huggo"], "genres": "N/A", "imdbID": "14597122", "rating": 8.6, "votes": 1532, "number_of_episodes": 106}