{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0711118": "Phylicia Rashad", "0001513": "Tim Matheson", "1357218": "Chris Geere", "2718355": "Bechir Sylvain", "2633241": "Briana Venskus", "1040833": "Angela Matemotja", "1020036": "Alexandra Breckenridge", "0607185": "Jennifer Morrison", "4927489": "Melanie Liburd", "7279042": "Presley Alexander", "2501087": "Anthony Ma", "2579496": "Anthony M. Bertram", "3230783": "Chevonne Hughes", "9757312": "Joe Daru", "12468134": "Jocelyn Riddle", "11944600": "Monte Escalante"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack and Miguel bond. Kevin and Madison navigate challenges. Randall seeks out a new kind of support network.", "With Miguel's help, Jack is preparing to recreate his and Rebecca's first date in her apartment as a setting to propose. Beyond a mishap in a test run, what Jack may regret most is not hearing back from her father, to whom he reached out for his blessing but who has remained incommunicado despite Jack's best efforts. In present day, news of Kevin and Madison's engagement has hit the tabloids as they start making wedding preparations. Madison, who has always had problems truly expressing herself, especially to men, may see the details of the wedding a little differently than Kevin, who seems to be leading the process. While Kate is Madison's obvious choice for matron of honor, Kevin knows the appropriate choice for best man is Randall, which may be easier said than done for both brothers. Nicky wants to be involved in a meaningful way for Kevin in lieu of Jack not being there, which may not sit well especially with Miguel. It's Kate's first day at work as assistant to the music teacher Phillip, who is not shy in openly expressing his feelings about her hire. With Kate at work, Toby is now officially househusband/stay-at-home dad, a transition which may be more difficult than he would like to admit. Randall has entered into a transracial adoptee support group, he in the process hearing slightly different experiences than his own. And Tess is having her first official study date with Alex at the house. Beth, who wants to be supportive of Tess and her choices, may view what Tess is going through holistically at this point in her life differently than she did with Déjà or what she will eventually do with Annie without even realizing it, something that Carol may see more clearly.—Huggo"], "genres": "N/A", "imdbID": "14301820", "rating": 7.8, "votes": 1256, "number_of_episodes": 106}