{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "1512166": "Jamie Chung", "2883943": "Tim Jo", "6217203": "Annie Funke", "0247040": "George Eads", "4187742": "Stephen Friedrich", "0393268": "Vien Hong", "0353718": "Michael Hagiwara", "4521672": "Nina Brissey", "3641002": "Austin Abrams", "2039526": "Pat Chambers"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Malik shadows Randall at work. Kevin struggles to connect with his new movie director. Jack and Rebecca struggle to sleep train their babies.", "Kevin has received the much coveted part in the new Jordan Martin Foster film. His insecurity begins to show in Foster not coddling him during the first read-through with the lead actress, Ava. The source of that insecurity is shown in two previous time periods, when he was an infant as he would not stop crying when Rebecca could not, against Jack's wishes stemming from advice from Miguel and Shelley, let him cry himself to sleep instead of running to his crib side, and when he was named quarterback for the school's football team at age 13, he wanting to give up when the going got even a little tough. Old wounds are opened up for both Kate and Ellie in their latest encounter, when Kate accompanies Ellie to her next ultrasound. For a civics class, Malik, much to Déjà's chagrin, gets the okay to shadow Randall for a day at city hall. Malik's seeming disinterest in the goings-on at city hall, which leads to a mishap of internet epic proportions, masks a more fundamental issue in Malik's life. And Hai, in watching a live stream, recognizes a name from his indirect past mentioned.—Huggo"], "genres": "N/A", "imdbID": "13394344", "rating": 8.2, "votes": 1475, "number_of_episodes": 106}