{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "2484632": "Jennifer C. Holmes", "3436127": "Brandon Victor Dixon", "2243196": "Jermel Nakia", "8969176": "Walt Keller", "7033784": "Anthony Turpel", "1090596": "Janora McDuffie", "0679531": "Jean St. James", "2203173": "Christian Ojore Mayfield", "11027957": "Ca'Ron Jaden Coleman", "10867026": "Kaz Womack", "10866049": "Isabella Rose Landau"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin visits Randall in Philadelphia.", "Kevin is making a special trip to Philadelphia to speak to Randall face-to-face to clear any ill feeling between the two of them before Randall stands up for Kevin at the wedding, their blow-out talk a year ago, that which has placed a strain on their relationship ever since even more so than any other time in their life. While knowing it will be difficult, Kevin does not want them to fall into what has been their usual routine of fighting then being uncomfortably cordial. And even before it happens, Randall is anticipating the less-than-satisfactory words Kevin will speak in saying what he thinks is politically correct and thus what he thinks Randall wants to hear rather than truly making any sort of amends in understanding what Randall has faced in his life. The strained relationship between the brothers highlighting their current issues are shown in two specific earlier periods: the first when Jack had sole responsibility for the two boys at age five, Jack surprising them in taking them to a taping of one of their favorite shows, Mister Rogers' Neighborhood (1968); and the second when they were in their late teens and Randall stayed with Kevin in Los Angeles shortly after his move there while Randall was attending a model UN conference.—Huggo"], "genres": "N/A", "imdbID": "14357426", "rating": 8.2, "votes": 1484, "number_of_episodes": 106}