{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "4188767": "Rachel Hilson", "3112508": "Amanda Leighton", "3911573": "Colt Prattes", "1020036": "Alexandra Breckenridge"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin and Madison partake in their respective bachelor and bachelorette parties.", "Kevin and Madison are having their respective Pearson family-only bachelor and bachelorette parties, Kevin's which has Randall, Toby, Miguel and Nicky at the cabin centered on a weekend of fishing, and Madison's, which on Kate's initiative ends up being an adults only affair with Kate, Rebecca and Beth at Madison and Kevin's house. Beyond a brief moment of discomfort for Madison and Kate's expected unexpected guest in recognition, both affairs are punctuated by the underlying white elephant of Kevin and Madison's union perhaps being neither's dream - Kevin's which is further inbred in the men watching Jerry Maguire (1996), a movie that shaped his young adult life, and his recent encounters with both Zoe and Sophie - leading to all in attendance quietly addressing their own relationship and/or family issues, Kate, of the Big Three, further remembering back to a family trip to the cabin in the late 1990s shaping her conflicting thoughts in being in the unique position of Kevin's sister, Madison's best friend and Sophie's childhood friend.—Huggo"], "genres": "N/A", "imdbID": "14583064", "rating": 8.0, "votes": 1142, "number_of_episodes": 106}