{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "6217203": "Annie Funke", "0642259": "Michael O'Neill", "2974421": "Abhi Sinha", "4396442": "Katie Sarife", "0001162": "Griffin Dunne", "0799984": "Leslie Simms", "0353718": "Michael Hagiwara", "0081116": "Veena Bidasha", "0306388": "Minerva García", "0848972": "Diana Tanaka", "11027957": "Ca'Ron Jaden Coleman", "10866049": "Isabella Rose Landau", "10867026": "Kaz Womack", "15252239": "Arline Loux"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["The Pearsons navigate huge family milestones together but from a distance.", "The Pearsons as a collective are awaiting the arrival of the new Big Three, in the same vein as the original of two biologically related in Madison and Kevin's twins, and one adoption in Kate and Toby's as Ellie is being induced. However, the situation is not perfect as any of them would have wanted beyond pandemic-related issues. Kevin is MIA, no one knowing if he caught his flight from Seattle, leaving Randall and Beth, driving home from Louisiana, on a video call with Madison as long as she needs support. While Kate is in the room with Ellie, Toby has to wait outside assuming the position of a tailgater outside the stadium. Toby's peace is interrupted by Arlo, another hospital visitor whose situation is making him a little more agitated especially in Toby having invaded his space. And Rebecca and Miguel are feeling isolated at the cabin, not knowing what to do as they wait and wait and wait for any news about Kevin and the three grandchildren. Rebecca can't help but focus on a framed \"picture\" on their wall of five different colored blobs, making her reminisce about about Jack and a trip the two took to the cabin alone when the Big Three were 13 and were starting not wanting to hang out with their parents anymore. With all these situations up in the air, it isn't a guarantee that all will turn out all right with any of Kevin or the three grandchildren. Nasir and Esther's story is also told from their chance initial meeting in 1963 to when their son turned four, their story which has a profound effect on the way the Pearsons are dealing with this situation.—Huggo"], "genres": "N/A", "imdbID": "13841384", "rating": 8.9, "votes": 1812, "number_of_episodes": 106}