{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8383168": "Mackenzie Hancsicsak", "7827879": "Parker Bates", "6807858": "Lonnie Chavis", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0429171": "Ron Cephas Jones", "2883943": "Tim Jo", "4188767": "Rachel Hilson", "1349199": "Keith Powell", "3112508": "Amanda Leighton", "0393268": "Vien Hong", "1889098": "Lucius Baybak", "2622011": "Annie Karstens", "3641002": "Austin Abrams", "4319363": "Ayla Glass", "2601498": "Aynsley Bubbico", "1382044": "Terryn Westbrook", "2810569": "Nelson Scott", "4420746": "Yumarie Morales", "15252239": "Arline Loux"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kate confronts her past. Randall's viral fame leans to an unexpected discovery. Kevin debates his future.", "In confiding to Toby that she had an abortion when she was eighteen - something that she has never told anyone else - Kate is forced to confront whether she has truly put her toxic relationship with Marc behind her despite the fact that it was over 20 years ago and only for the relatively brief duration of six months. Kevin and Madison are interviewing nannies, the importance of which is highlighted by the fact that Kevin has just been told that filming of his movie has been moved to Vancouver. This change of filming location and a statement Kevin makes during the interview of his nanny of choice brings up an issue that Madison was generally aware of but had never really thought about concerning their future life as parents. And after Randall's striptease video goes viral on the Internet, he receives a message from a stranger in Louisiana telling him about his birth mother that contradicts what William had told him about her, leading to feelings of betrayal yet again. Randall has to decide what to do with the new information both practically and for his own emotional health.—Huggo"], "genres": "N/A", "imdbID": "13440594", "rating": 8.0, "votes": 1418, "number_of_episodes": 106}