{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0607185": "Jennifer Morrison", "0068599": "Vanessa Bell Calloway", "1422552": "Adam Korson", "0179275": "Matt Corboy", "10866049": "Isabella Rose Landau", "1087153": "Dan Istrate", "13272549": "Johnny Kincaid", "12564151": "Natane Latimore", "12564154": "Ellie Griffitts", "5143731": "Allie Kate Elliott", "12564152": "Riya Golakeia", "12564149": "Cicely Morales"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Kevin visits the construction site; Malik and Déjà share controversial news at dinner.", "Kevin heads to Pennsylvania to help Nicky oversee the construction of what will be Rebecca's house at the cabin property. He decides to invite Cassidy in wanting some company, which brings into light the nature of Kevin's life with women and the balance between friendship and what at the time is often monogamous sex in his want for a committed relationship. Malik will be in Philadelphia for twenty-four hours, he wanting to make dinner for Randall, Beth and the family. Randall and Beth know that the dinner is meant for an announcement of some sort, they going through their usual game of guessing the options of the worse in the hope that nothing can be as bad as they can think of. They will soon find out how \"bad\" it is as the dinner nears its conclusion. And Rebecca is spending the day with Kate and the children as Kate invites her mother to class with her. Kate knows that it's been a rocky forty year road for the two of them to a point of a now truly loving relationship - one of the low points being when Rebecca started dating again after Jack's passing - which makes the pronouncement she has to make to her mother all the more difficult.—Huggo"], "genres": "N/A", "imdbID": "16296824", "rating": 8.2, "votes": 1195, "number_of_episodes": 106}