{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "4188767": "Rachel Hilson", "2883943": "Tim Jo", "0262484": "Elena Evangelo", "0179275": "Matt Corboy", "0001513": "Tim Matheson", "0001610": "Elizabeth Perkins", "1339320": "Danielle Langlois", "3862542": "Hays McEachern", "8899185": "Kya Kruse", "13272549": "Johnny Kincaid"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca has a big announcement to make at Thanksgiving dinner.", "Three Pearson family Thanksgivings are shown, two common threads being a focus on Rebecca, and the appearance of a version of Janet Malone's family famous Thanksgiving sugar pie, its secret, special ingredient which she has not divulged. The first is the year before Jack and Rebecca are to be married, they hosting dinner solely for her parents. Rebecca's week-long preparation for the get-together takes a back seat on the day to the issues between mother and daughter, where Rebecca can no longer handle her mother's continual judgment. Against Dave's advice to let the two deal with their issues in their own way, Jack tries to diffuse the situation. The second is just before Y2K. While Kevin and Sophie's split and Kate's obvious weight gain in her depressed life, something most visible to Randall who has not seen her in a while, are issues at this gathering, it is the foursome of Rebecca, her boyfriend Matt, Miguel, and his French girlfriend Marguerite that quietly preoccupies the thoughts of the Big Three and Beth, who can see that there is something going on between Rebecca and Miguel that Kevin in particular does not want to happen, and that Rebecca and Miguel themselves, unspoken, are trying to avoid in deference to Jack and his memory. And the third is current day at the cabin where Kevin will outline the plans for the family complex to be built on that property. Even before arriving, Beth can foresee that this Thanksgiving will be another explosive one as they usually are with the Pearsons, issues including Kevin being solo on this important family day without the twins, and Kate and Toby's marital problems exacerbated by their day-to-day geographic distance. But it is Rebecca's request to have a meeting solely with the Big Three and Miguel before the day is out to make some pronouncements that adds that further ominous tone to the proceedings.—Huggo"], "genres": "N/A", "imdbID": "17073768", "rating": 8.7, "votes": 1280, "number_of_episodes": 106}