{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "8077891": "Tyler Barnhardt", "10866049": "Isabella Rose Landau", "11027957": "Ca'Ron Jaden Coleman", "10867026": "Kaz Womack", "1752251": "Livia Treviño", "1953775": "Chris Doubek", "1770369": "Paul Zies", "13272549": "Johnny Kincaid"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Randall and Rebecca embark on a road trip and reflect on their past.", "The aftermath of Rebecca's Thanksgiving pronouncement to the Big Three is shown for a third time, finally from Randall's perspective. Top of mind for Randall is why Rebecca chose Kate as her number two after Miguel and not him because the two of them, with the exception of when he discovered what Rebecca knew about William, have always had a special bond. Randall has also always felt that he was the family's protector after Jack died and that he tried to excel and more often than not did excel at everything he attempted, which is demonstrated in the incidents at the pool when the Big Three were six on the first day of summer and when they got locked in the permanently shut-down facility at age nineteen when Kevin wanted one last blow-out where they had spent much time over the course of their lives. While Randall has already told Jae-Won to hold off the senator who wants to have an important discussion with him, Randall is thrown off track by a move by Déjà. While Randall has to deal with the Déjà issue, Rebecca, knowing her son, beats him to the punch by addressing both the issue of not naming him her number two and how to deal with Déjà in his angry state.—Huggo"], "genres": "N/A", "imdbID": "18815408", "rating": 8.6, "votes": 1285, "number_of_episodes": 106}