{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "11013071": "Blake Stadnik", "0861487": "Auden Thornton", "3374198": "Mike Manning", "5057049": "Anissa Borrego", "10866049": "Isabella Rose Landau", "10867026": "Kaz Womack", "11027957": "Ca'Ron Jaden Coleman", "0607185": "Jennifer Morrison", "1789135": "Rachel Leah Cohen", "1696417": "Rebeka Montoya", "4601393": "Olivia Sanabia", "8496838": "Nolan Pugh", "13272549": "Johnny Kincaid", "5143731": "Allie Kate Elliott", "12564154": "Ellie Griffitts", "12564151": "Natane Latimore", "12564153": "Zoey Serrato"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack, Randall, Kevin and Toby struggle to connect with their children.", "The stories of four of the fathers trying to connect with their children are presented. In one, Jack is so busy with work that he never sees the preschool aged Big Three anymore in they being in bed by the time he arrives home. So he decides to take them to the movies on the weekend - their first ever trip to see a movie on the big screen - Rebecca leaving the four to this outing on their own. In two, Randall is taking Déjà out for her first driving lesson, in the process he knowing that he has a captive audience with her in that father/daughter connection. Randall discovers more about his daughter's life than he was anticipating. In three, Kevin, now sleeping in Kate and Toby's living room, is trying to be present in the twins' lives as if he and Madison were still living together, his emotions which are ramped up in now portraying the father in the reboot of The Manny. And in four, Toby tries to make the most of his time with the kids whenever he is in Los Angeles, which is less often than when he is in San Francisco for work. While he still makes the grand gestures to compensate, he believes he knows how to step into the role as full time caregiver in he having done so when he was stay-at-home dad. Beyond the issue of the four fathers wanting to connect more fulsomely with their children, another common thread is the role of the mother as the voice of reason and/or voice of knowledge.—Huggo"], "genres": "N/A", "imdbID": "16433226", "rating": 8.0, "votes": 1190, "number_of_episodes": 106}