{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "0005179": "Camryn Manheim", "0648846": "Peter Onorati", "0631146": "Laura Niemi", "0930908": "Jim Cody Williams", "10866049": "Isabella Rose Landau", "11027957": "Ca'Ron Jaden Coleman", "10867026": "Kaz Womack", "10197589": "Milo Cragnotti", "1883248": "Madonna Cacciatore", "2272474": "Rob Mainord", "5105035": "Lorena Fernández", "5241237": "Shanice Lynn"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Jack visits Ohio.", "After his mother passes away from an aneurysm, Jack feels that Rebecca and the kids really didn't know her all that well and doesn't want to subject them to the long four-hour one-way drive, Jack makes the trip alone to Ohio to arrange his mother's funeral. Upon arriving at Marilyn's cousin Debbie's house where Marilyn had been living without Stanley's knowledge ever since Jack got her out of the Pearson family house thirteen years ago, Jack discovers that his tasks associated to the funeral are limited to one - the eulogy - because Marilyn has prearranged most of it already. Jack finds this task the most difficult of all because while the two spoke on the telephone every week precisely at 6:00 pm on Sunday, their relationship for thirteen years was built primarily on these calls, the end of each was marked by Marilyn's statement, \"don't let me keep you,\" which was symptomatic of Marilyn not only not wanting to be a bother but not to be a bother specifically to Jack. Still, loving his mother and wanting to say something meaningful about her but not really knowing anything about her life in Ohio, he thinks back to the painful period of when they had a true relationship, namely when they both lived under the same roof as Stanley.—Huggo"], "genres": "N/A", "imdbID": "16024734", "rating": 9.1, "votes": 1889, "number_of_episodes": 106}