{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "4188767": "Rachel Hilson", "1422552": "Adam Korson", "3112508": "Amanda Leighton", "0179275": "Matt Corboy", "3374198": "Mike Manning", "8802766": "Jazlyn Martin", "0899681": "Goran Visnjic", "0525855": "Carl Lumbly", "0105876": "Wendy Braun", "11120888": "Marcel Mendoza", "3061156": "Michael James Lazar", "7470791": "Taylor Coleman", "13427729": "Isa Eden", "1824934": "Lexi Johnson", "3087846": "Tony Robinette", "7572716": "Spencer Moss", "7575422": "J.E. Burton", "11994192": "Kinley Cunningham", "6083961": "Jillian Kinsey"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Beth prepares her dancers for the first big dance recital at her new job.", "Thanksgiving is approaching. Adjusting to his new reality of co-parenting with Madison while trying to be supportive in her relationship with Elijah, Kevin invites Madison to the cabin for the Pearson family Thanksgiving so that he can be near the twins and invites Elijah to show support. In the process, he places Kate in an awkward position between him and her friendship with Madison while Kate already has domestic problems of her own. Beth, in her role as the dance academy's recruiter, which includes overseeing the scholarship program, is nervous for the new class of fifteen in their first recital, as nervous as if she were preparing to dance herself. Beth finds that there is one student, Stacey, who may require more hand holding to sooth doubts about her place in the academy. Kevin, Kate, and Beth's current experiences hearken back to an approach to Thanksgiving late in the previous millennium when Kevin and Sophie made an early return to Pittsburgh for the holidays from their respective bases of Los Angeles and New York, Rebecca invites a boyfriend, Matt, to Thanksgiving for the first time, and in Beth and Randall run into her old dance instructor, Vincent.—Huggo"], "genres": "N/A", "imdbID": "17372646", "rating": 8.0, "votes": 1210, "number_of_episodes": 106}