{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "1020036": "Alexandra Breckenridge", "0068599": "Vanessa Bell Calloway", "1422552": "Adam Korson", "10866049": "Isabella Rose Landau", "11027957": "Ca'Ron Jaden Coleman", "10867026": "Kaz Womack", "2480950": "Danielle Larracuente", "3989558": "Reasha Honaker", "13570674": "Callie Carlin Ogden", "13570675": "Kellan Tetlow"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["The Big Three make a plan for Rebecca.", "Moments over the course of their life when it has either been practically and/or emotionally just Rebecca and the Big Three are shown, these moments in light of it again being the four of them in the future a week following Miguel's passing. The Big Three, their respective spouses, Nicky and Edie, and Madison, Elijah and the two kids are at the house to provide their support, but everyone realizes that this gathering cannot last much longer as they have to return to their regular lives. Although Rebecca assigned Kate to be the decision maker in this instance when Miguel is no longer in the picture, the Big Three agree to have a meeting to discuss what to do about Rebecca's care. Beth and Sophie, in knowing the Pearsons for as long as they have, especially their respective significant other, know exactly how each of the three will act within the dynamic of just the three of them. While Randall and Kevin both have the most seemingly immovable opinions, it is quiet Kate who has the final say regardless of what her brothers want.—Huggo"], "genres": "N/A", "imdbID": "19064728", "rating": 9.2, "votes": 1870, "number_of_episodes": 106}