{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "1422552": "Adam Korson", "10866049": "Isabella Rose Landau", "11027957": "Ca'Ron Jaden Coleman", "10867026": "Kaz Womack", "6927138": "Abigail Killmeier", "1404392": "Carolyn Crotty", "1197237": "James Giordano", "3462511": "Moses Jones", "13272549": "Johnny Kincaid"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["43"],  "plot": ["Rebecca and Miguel's anniversary barbecue does not go as planned.", "Rebecca's two ten-year wedding anniversaries are presented, neither of which goes according to plan. In the first one with Jack, the two are going out for a romantic and expensive dinner, the first time Rebecca has been treated to such since the arrival of the Big Three, who are at home with a sitter. Without telling Jack beforehand, Rebecca plans to drink a lot, all in the prelude to what is the much anticipated sexual encounter to cap off the evening when they get home. In the current-day anniversary with Miguel, Kate and Toby are hosting a barbecue with Rebecca and Miguel's friends invited and Randall and Beth coming out from Philadelphia for the occasion. While they don't want it to happen, Kate and Toby are able to curb what for them has been the norm of something small leading to an argument eventually veering to the touchy topic of Toby wanting the family to move to San Francisco. A disaster and a potential tragedy ruin the occasion. The potential tragedy can either tear Kate and Toby further apart or bring them back together. Through it all, Rebecca sees what she considers a seminal moment in the earlier anniversary as a central theme of the latter. Meanwhile, Kevin learns something that makes him contemplate making another rash decision, this time concerning Madison.—Huggo"], "genres": "N/A", "imdbID": "18967088", "rating": 8.7, "votes": 1390, "number_of_episodes": 106}