{"cast": {"0893257": "Milo Ventimiglia", "0601553": "Mandy Moore", "1250791": "Sterling K. Brown", "1978680": "Chrissy Metz", "1261997": "Justin Hartley", "1635244": "Susan Kelechi Watson", "2884388": "Chris Sullivan", "0005030": "Jon Huertas", "2954288": "Caitlin Thompson", "1357218": "Chris Geere", "2964567": "Niles Fitch", "6026551": "Logan Shroyer", "4952695": "Hannah Zeile", "8082633": "Eris Baker", "7919715": "Faithe Herman", "7132577": "Lyric Ross", "10040186": "Asante Blackk", "0001162": "Griffin Dunne", "1020036": "Alexandra Breckenridge", "0607185": "Jennifer Morrison", "1705090": "Katie Lowes", "3112508": "Amanda Leighton", "1496043": "Patrick Mulvey", "10867026": "Kaz Womack", "4148543": "Josh Odsess-Rubin", "0206129": "Frederick Dawson", "13609795": "Kai Trueblood Fall", "13570674": "Callie Carlin Ogden", "13570675": "Kellan Tetlow", "0496448": "Howard Leder", "0344190": "Eileen Grubba", "0068599": "Vanessa Bell Calloway", "1422552": "Adam Korson", "10866049": "Isabella Rose Landau"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["42"],  "plot": ["The night before Kate's wedding, Kevin's love life takes an unexpected turn.", "On the day of Kate and Philip's wedding, Beth and Madison discovered evidence in Kevin's room that he spent the night with a woman, including a pink brassiere, a woman's shawl, and a love note written in a woman's handwriting. In watching the proceedings that day, they narrow down the possibilities to three women: Philip's friend Arielle, the wedding singer; Cassidy, his supposedly platonic plus one for the occasion; and the most unlikely due to her marital status, Sophie. Rewind twenty-four hours, and the day before the wedding is shown from Kevin's perspective and his time with each of the three candidates among others, what presented explaining how the brassiere, the shawl, and the note ended up in his room and the other clues Beth and Madison witnessed. In reviewing that day on the wedding day, Kevin is uncertain about what happened in terms of what it means for his future with regard to the woman. The scales tip with an associated but yet unassociated subsequent conversation Rebecca has with said woman, Rebecca unaware of the implications, not knowing what Beth and Madison have seen or what has happened the past twenty-four hours with Kevin.—Huggo"], "genres": "N/A", "imdbID": "19064716", "rating": 8.9, "votes": 1742, "number_of_episodes": 106}