{"cast": {"0386088": "Matthias Hinze", "0255654": "Andreas Elsholz", "0918819": "Claudia Weiske", "0445757": "Sandra Keller", "0726081": "Lisa Riecken", "0627018": "Angela Neumann", "0578808": "Frank-Thomas Mende", "0405909": "Andrea Höhne", "0059985": "Johannes Berenz", "0437735": "Werner Kanitz", "0717548": "Christiane Reiff", "1127101": "Natascha Pfeiffer", "0452606": "Alexander Kiersch", "1869423": "Misha Antonich", "0096011": "Dirk Borchardt", "1281621": "Viktoria Voigt", "0380631": "Marie-Christine Herriger", "2654160": "Ilonka Breitmeier", "0819192": "Christian Oskar Spitzl", "0082707": "Eckhard Bilz", "0698242": "Eva Probst", "1523035": "Lena Ehlers", "1703042": "Matthias Zieschang"}, "geners": ["Drama", "Family", "Romance"], "runtimes": 0,  "plot": ["Family Ahrens gets a surprise visit. Leon and Alex argue about Emma, while Laura babbles in front of Chris.", "18-year-old Heiko Richter gave a party at home. The next morning, some hungover guests are still lying around. Heiko is about to bring breakfast to his girlfriend Tina when the phone rings. His parents announce that they will return from their vacation earlier than planned. Heiko has only a few hours to clean up the chaos in the house. Tina, who had prepared herself for a few nice days with Heiko, has to go back home. She lives with her older brother, the doctor Frank Ulrich. Her parents are dead. Frank has a difficult task to fulfill. He has to teach bad news to the teacher Elisabeth Meinhart, to whom he and his sister owe a lot. She has a serious illness that will keep her away from her beloved work at school for some time. There it goes under and over. Peter Becker wants to throw school and go to work. Elke Opitz is harassed by her biology teacher. In order to be safe from his re-enactments, she wants to leave school like Peter and Tina. Elisabeth Mainhart no longer sees any meaning in her life. She turns on the gas tap in her apartment."], "genres": "N/A", "imdbID": "0848018", "rating": 5.2, "votes": 30, "number_of_episodes": 8294}