{"cast": {"0004821": "Michael Chiklis", "0219748": "Catherine Dent", "0324658": "Walton Goggins", "0413052": "Michael Jace", "0425543": "Kenny Johnson", "0439813": "Jay Karnes", "0553468": "Benito Martinez", "0001634": "CCH Pounder", "1056583": "Jamie Anne Allman", "0625351": "Elimu Nelson", "0730099": "Brent Roam", "0051257": "Kirk Baltz", "0487005": "Jenya Lano", "1108664": "Cathy Cahlin Ryan", "0811027": "David Rees Snell", "0758775": "Heather Salmon", "0533268": "Andy Mackenzie", "1711257": "DJ Rabiola", "0042588": "Michael Auteri", "1188048": "Joel Rosenthal", "1106926": "Ra Hanna", "1006468": "Ana Argueta", "1711298": "Staci Snell", "1711015": "Bree Benton", "1707084": "Ron Daniels", "1712548": "Melanie Myers", "1594698": "Kevin 'Repo' Thomas", "1712603": "Malcolm Wain", "0850875": "Chris Tashima", "1554649": "John Funk", "13394361": "Peter Godoy", "0456676": "William Brent Kirkland", "1494672": "Henry T. Yamada"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["46"],  "plot": ["It's warrant sweep day at the Barn. Vic and the Strike Team discover visiting NBA superstar Derrick Tripp hanging out with his \"homies\" before the evening game with the Lakers. Vic decides to do his part for the home team by keeping Tripp as a \"friendly hostage\". One of Vic's street informants, Connie, approaches him after having been roughed up by a new john. Vic hands off the case to Claudette and Dutch, who is convinced they're on the trail of a serial killer. Dutch's theories are proved wrong when he and Claudette ultimately discover that their perp is not a serial killer but rather a disturbed man who is raping women in a desperate attempt to procreate. Danny and Julien stumble upon a gun smuggling ring while delivering one of their warrants and disaster is averted only by Danny's sharp instincts. David has his hands full overseeing the sweep, managing an increasingly packed cage, soothing the frazzled nerves of the attending desk sergeant, and avoiding a potential lawsuit from Derrick Tripp's lawyer over the disappearance of his star client.—WyattJones", "It is a warrant sweep day. While Vic and the Strike-Team try juggle through their warrants,unofficial female informant of Mackey comes to him about a violent assault. Is there a serial rapist on the loose ? Danny and Julien patrol in Farmington's Hispanic community and respond to suspicious activities.—AnduG8"], "genres": "N/A", "imdbID": "0699538", "rating": 7.6, "votes": 2838, "number_of_episodes": 89}