{"cast": {"0004821": "Michael Chiklis", "0219748": "Catherine Dent", "0324658": "Walton Goggins", "0413052": "Michael Jace", "0439813": "Jay Karnes", "0553468": "Benito Martinez", "1108664": "Cathy Cahlin Ryan", "0811027": "David Rees Snell", "0001634": "CCH Pounder", "0001845": "Forest Whitaker", "0545687": "David Marciano", "0305519": "Paula Garcés", "1015516": "Onahoua Rodriguez", "0316708": "Nigel Gibbs", "0007033": "Harvey Silver", "0718647": "Joseph D. Reitman", "1188915": "Autumn Chiklis", "1015096": "Chaney Kley", "1591250": "L. Michael Burt", "0008657": "Louisa Abernathy", "1111884": "Joey Vieira", "2523685": "Jontille Gerard", "1820969": "Ray Auxias", "1477423": "Efia Pearson", "2525916": "Ruben Avitia", "2268301": "Tracey Graham", "10935814": "Tony Stoll", "2803524": "Maria Zambrana"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["51"],  "plot": ["Shane's guilt for killing Lem intensifies after the Strike Team learns that he didn't make a deal with the authorities, and Kavanaugh resorts to threatening informants and planting evidence to pin Lem's murder on Vic.", "The Strike-Team is reeling from the aftereffects of their close friend and Vic is stressed that Jon Kavanaugh is still not out of the picture. Lem's entire Detective's career is pushed back into being non existent cause of his guilty plea and Aceveda gets a surprise confrontation about the committee speech while Kavanaugh finds a way back to one of his witness.—ANDUG8", "A man is suspected for burning down a methadone clinic. Someone is arrested after claiming he killed Lem. A porn store owner is beaten up in his store, likely for making porn with grandmothers. Dutch tells Vic that Corrine is worried about him. The Strike Team buries themselves in work. They have an encounter with Moses and talk about Antwon. Tina is studying for her detective's exam. Claudette's start as a captain is rocky.—TV Guide"], "genres": "N/A", "imdbID": "0836472", "rating": 8.4, "votes": 2306, "number_of_episodes": 89}