{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "1490300": "Aisha Hinds", "0606487": "Dean Norris", "0000526": "Samantha Mathis", "4435720": "Mackenzie Lintz", "0710632": "Dale Raoul", "3430569": "Megan Ketch", "0728132": "Leon Rippy", "5523316": "John Elvis", "0153779": "Jeff Chase", "4218919": "Jaret Sears", "2400464": "Linds Edwards", "2542649": "Adam Poole", "5588119": "David Pascua", "6685981": "Wil Smith"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["42"],  "plot": ["A friend of Julia's goes into labour after touching the dome. Big Jim kicks out Junior. Linda seeks out the Dundee brothers after Rose's murder. Joe and Norrie find a second mini-dome that holds a mysterious egg inside it.", "Norrie and Joe go to the dome to see if they can figure out what powers they might have over it. Joe wonders if the dome might have a nucleus at its center. It the very middle of the area covered by the dome, they make a discovery. Julia's next door neighbor Harriet is expecting a baby very soon but when she goes into premature labor, she thinks the dome may have done something to her baby. She had a vision of her absent husband just before labor began. A healthy baby is born but tragedy soon follows. Big Jim lays down the law with Junior as regards Angie and throws him out of the house. He also tries to re-establish his authority in the town after he learns that Ollie has taken over his propane supply. The police try to track down the Dundee brothers who killed Rose at the diner.—garykmcd", "Junior lives in the precinct after his heartless father expels him, yet Angie refuses to keep silent about her captivity. After enjoying physical intimacy, Joe and Norrie want to work out what causes their seizures and why they are special. Joe guesses the dome's properties must be strongest under its center, where they find a mini-dome which contains an egg. Farmer Drake refuses to become Jim's partner and gets Ollie Dinsmore to steal his propane, but Jim manages to kill him and blowing up his truck. Junior succeeds as deputy to eliminate the Dundee brothers, but continues excessive lethal force after the gunfight.—KGF Vissers", "Norrie summons Joe to go to the dome to see whether they can communicate with it. Joe decides to use his knowledge in trigonometry to search the center of the dome and they find a small dome in the woods with an egg inside. Big Jim expels Junior from home and invites Angie to stay with him, but she prefers to visit Rose in the kitchen of her restaurant. She buries him with Sam and they clean the place. Julia's next door neighbor has a vision of her husband and goes into labor after touching his image. Alice helps to deliver the baby but she does not resist the lack of insulin. Linda and Junior seek out the Dundee brothers and when Junior learns that they tried to rape Angie, he shows no mercy with them. Ollie takes over Big Jim's propane but he prepares a prompt action.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821462", "rating": 7.2, "votes": 1673, "number_of_episodes": 39}