{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "0606487": "Dean Norris", "4435720": "Mackenzie Lintz", "0728132": "Leon Rippy", "5154768": "Andrew Vogel", "0869627": "Michael Tourek", "1281943": "Jimmy Gonzales", "1354180": "Bob Fisher", "1188949": "Bonnie Cole", "5013246": "Gregory French", "5474643": "Rob Koebel", "2850047": "Joe Montanti", "1542962": "Clam Sepulveda", "6685981": "Wil Smith"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["Norrie grieves over her mom's death. Joe shows Julia the mini-dome. Big Jim makes a plan of action when Ollie takes control of food and water.", "Norrie is grieving over her mom's death and Julia can't help but wonder at the seeming coincidence of the new birth and the death. Norrie blames Joe for taking her to the center of the dome which she believes is what killed her mom. Joe shows Julia the egg and it has a message for her when she touches it. Big Jim has it out with Junior over the shooting of Cliff Dundee. Sheriff Linda Esquivel also tells him off, saying that if they weren't so short-handed she would have fired him. Junior learns that his mother committed suicide. Food shortages are now of concern and Ollie Dinsmore makes it plain to Big Jim that the shortages, including access to his well, will continue until he is thrown out of office. Big Jim's attempt to take control of his land fails when Ollie shows up with a half-dozen men. Junior joins Ollie's army. Big Jim is ready to go to war but Barbie has a better idea.—garykmcd", "Big Jim, desperate to regain control from Olie by stealing back the only well, raises a raggedy volunteers army for a frontal attack, which fails utterly and leaves Jim captive. Furious about his expulsion from home, Junior joined Olie's side and was promised revenge by his own hand. Now he gets the chance, he makes Jim grovel, weep and confess he lead about Junior's mother's death, in fact a desperate suicide, as Ollie suggested. Yet, given a rifle, Junior saves Jim by shooting Ollie. Barbnie, who warned against the amateur attack, still executes his alternative idea, diverting the water to an decommissioned well. The mini-dome has weird effects on people, turning Norrie against Jim and producing a reflection of the boy which tells Julia 'the monarch will be crowned'.—KGF Vissers", "Julia thinks about the cycle of life with the death of Alice and the new baby born. Meanwhile Norrie believes that Joe is the responsible for the death of her mother since he walked with her to the center of the dome. Julia asks Joe to show the black egg in the center of the dome and they realize that the color changed to pink. Out of the blue, Julia has a vision of Joe saying \"the monarch will be crowned\". Big Jim expels Junior from home. Ollie plans to control Chester's Mill with the water and food and Big Jim intends to use the law to take control of his land. However Barbie finds that Ollie's well is connected underground to the town's reservoir and he intends to blow up the well to drain the water to the reservoir. Big Jim organizes an armed group to invade Ollie's land but Junior joins Ollie's militia. Soon Ollie tells that his mother committed suicide. When the war begins, Barbie's plan succeeds and he discovers Big Jim's true intention.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821464", "rating": 7.1, "votes": 1571, "number_of_episodes": 39}