{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "1066346": "Jolene Purdy", "0606487": "Dean Norris", "4435720": "Mackenzie Lintz", "0710632": "Dale Raoul", "0954036": "Natalie Zea", "4538732": "Raheem Babalola", "2424044": "Evan Gamble", "0832326": "Ray Stoney", "1494966": "Matthew Cornwell", "6283429": "John Carter", "5804589": "Andrew Cox", "5535767": "Fred Galle", "2752798": "David Jimerson", "2478500": "Don A. King", "5474643": "Rob Koebel", "5387196": "Tammy Rackley", "6685981": "Wil Smith", "6433585": "Alex S. Taylor"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["42"],  "plot": ["Julia takes Barbie to see the mini-dome and the egg, but they have both disappeared. A former acquaintance of Big Jim and Barbie makes a re-appearance. Angie starts to experience the same seizures as Joe and Norrie.", "Julia takes Barbie into the woods to show him the mini-dome but it has vanished. A search through the woods yields little information. After Barbie and Sheriff Esquivel arrest a drug user, they first hear of a new drug, rapture. Jim arrives home and finds Maxine, the head of the drug operation, waiting for him. She was in Chester's Mill the day the dome appeared and has been lying low ever since. It turns out Barbie knows her as well. Big Jim wants to disarm everyone in the town. Junior visits Angie at the diner but she collapses and says 'the pink stars are falling'. Angie starts to think Junior's comments about not being well may have some merit. When Joe, Angie and Norrie finally locate the mini-dome and the egg, they also realize the assistance of a fourth person will be required.—garykmcd", "Junior finally regains Angie's confidence by explaining about her condition and his mother's similar misunderstood visions, which concern the pink stars Joe saw. The mini-dome disappeared from its forest locating just before Julia could show it to Barbie. Joe, Norrie and his dog search the woods all day, only to find it in their barn. Big Him and Barbie's drug trade 'boss' Maxine Seagrave is back, not dead as presumed but having observed in hiding for a week, shockingly confident she can blackmail them to build an even stronger criminal empire on novel poison 'rapture', which already made its first victim.—KGF Vissers", "Julia takes Barbie into the woods to show the egg, but they find that the mini-dome and the egg are gone. Linda calls Barbie through the radio to go to a shooting nearby and they arrest a drug addicted that had broke into a house. They discover that Chester's Mill has a new drug, rapture, and the reverend was distributing it. Junior goes to the restaurant where Angie is working and she has a seizure and says that the pink stars are falling. Junior takes her home and she learns that Joe and Norrie have the same seizures. Big Jim finds an old acquaintance, Maxine, waiting for him at home. She proposes that the town is disarmed and Big Jim uses his persuasion to convince people to voluntarily deliver their weapons and ammunition to keep the town safe. Maxine is the responsible for manufacturing and distributing rapture. Sheriff Esquivel investigate the rapture and finds evidences against Duke in the propane storage facility. Junior brings Angie to his mother's studio and shows a painting of his mother. Big Jim and Barbie meet Maxine and she blackmails them. Joe, Norrie and Angie discover where the dome is and find that they need a fourth hand.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821468", "rating": 7.1, "votes": 1567, "number_of_episodes": 39}