{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1066346": "Jolene Purdy", "1490300": "Aisha Hinds", "0001194": "Jeff Fahey", "0606487": "Dean Norris", "0000526": "Samantha Mathis", "4435720": "Mackenzie Lintz", "0110803": "Beth Broderick", "0710632": "Dale Raoul", "5523316": "John Elvis", "0706413": "Talmadge Ragan", "2971926": "Michael Rosander", "4844486": "Kwajalyn Brown", "4348530": "Josh Carter", "0364931": "R. Keith Harris", "0143751": "John Casino", "2817581": "Dave Blamy", "5115030": "Richard Bachellor", "5234956": "Steve Baldwin", "6930245": "Kurt Barner", "5647178": "Sherrie Bowling", "5816385": "Mary-Jo Jackson", "5474643": "Rob Koebel", "5588119": "David Pascua", "4568643": "Darrell Rackley", "0794688": "Kent Shocknek", "1146857": "Kevin Sizemore", "5604953": "Alexia Stip", "5502201": "Kristina Tonkowska", "3155168": "Ben Yemba"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["45"],  "plot": ["In Chester's Mill, Maine, a strange occurrence locks the town in under an invisible dome-like surface.", "The citizens of Chester's Mill, Maine find that their idyllic community is suddenly encased under a glass dome. No one knows where it came from or what it is but they do know that no sound can penetrate the invisible barrier. The first to come across it is Dale 'Barbie' Barbara who was hurrying to get out of town after burying a body in the woods. Many in the community are away that day attending a parade and festivities in a nearby town. That leaves local councilor and car salesman 'Big Jim' Rennie and Sheriff Howard Perkins in charge. Many of the residents harbor secrets however.—garykmcd", "In Chester's Mill, Maine, a man with the nickname \"Barbie\" buries a body in the woods. When he is leaving town, he distracts with the police car, loses control of his car and has a flat tire. Soon an invisible magnetic field surrounds the town as if it were a glass dome, and the inhabitants are trapped inside. Most of the population is out of town in a parade, including the firemen and the police officers. Sheriff Howard 'Duke' Perkins tries to calm down the population to avoid panic. The councilor and car dealer \"Big Jim\" Rennie hides a secret with propane trucks shared by the Sheriff. His son Junior abducts his girlfriend Angie and imprisons her in a shelter. Barbie is lodged by the wife of the man that he killed. What is the origin of the mysterious dome?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2656658", "rating": 7.6, "votes": 2899, "number_of_episodes": 39}