{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1066346": "Jolene Purdy", "0606487": "Dean Norris", "0954036": "Natalie Zea", "4435720": "Mackenzie Lintz", "0001858": "Mare Winningham", "3051426": "Crystal Martinez", "1411388": "Rey Hernandez", "4327510": "Christy Grantham", "6685981": "Wil Smith"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["40"],  "plot": ["After Junior abandons Angie, Joe and Norrie, the weather turns nasty. Julia is shot by Maxine. Big Jim convinces Linda his stash of propane is what's saving the town and the biggest threat they face is from Barbie.", "Big Jim reports to the police station as promised and convinces Linda that his stash of propane is what's saving everyone today. He tells her the biggest threat they face is from Barbie. After spending the night on the couch, Barbie tells Julia he didn't like it much and she admits she didn't much like sleeping alone either. She answers a knock at the door and comes face to face with Maxine who promptly shoots her in the chest. Barbie races to get her to the hospital. Back at the barn, Joe thinks the stars are about them but Junior runs off after failing to convince Angie they should be together. After the shooting and Junior running off, the weather turns nasty. After it clears, Joe and the others head off to the dome and see something they wish they hadn't.—garykmcd", "Big Jim convinces Linda that he is a good guy and his propane is saving Chester's mill. Further, she also convinces her that Barbie is a threat to the town. Junior leaves Angie, Joe and Norrie in the barn and the weather changes forming a violent storm. Maxine shots Julia in the chest and Barbie and Joe that is seeking out Junior save her. Barbie leaves Julia in the hospital and goes with Big Jim to Maxine's club. They succeed in dominate Maxine and her bodyguard. Out of the blue, Big Jim executes them both and tries to kill Barbie; however, he punches Big Jim and controls the situation. But Linda arrives and Big Jim tells that Barbie killed Maxine and the other man. Junior, Angie, Joe and Norrie try to communicate with the dome and they have a dreadful vision.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821474", "rating": 7.2, "votes": 1506, "number_of_episodes": 39}