{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1066346": "Jolene Purdy", "1490300": "Aisha Hinds", "0606487": "Dean Norris", "0000526": "Samantha Mathis", "4435720": "Mackenzie Lintz", "0110803": "Beth Broderick", "0068709": "Ned Bellamy", "0710632": "Dale Raoul", "3227822": "Jeff Glor", "5523316": "John Elvis", "5154768": "Andrew Vogel", "0015673": "Al Vicente", "1939205": "Arianne Martin", "4348530": "Josh Carter", "4578041": "Ellen Rice", "0917314": "Gary Weeks", "5820120": "Rahsheem Shabazz", "4954992": "Nick Madrick", "5395644": "Ed Ricker", "4446823": "Andrea Alcorn", "3980481": "James Alcorn", "5698476": "Rochelle Aycoth", "5234956": "Steve Baldwin", "5648784": "Kristi Booher", "5761957": "Huck Borden", "5636323": "Frederick Carpenter", "5706254": "Kaitlyn Christian", "4645305": "Thomas Doutt", "6410634": "Christopher Donald Gallagher", "6105559": "Adrian Eugene Graham", "0364931": "R. Keith Harris", "5927536": "Teagan Heesch", "5816385": "Mary-Jo Jackson", "6753723": "Meghan H. Jones", "2585133": "Julie Kendall", "5474643": "Rob Koebel", "2052594": "Chip Lane", "2850047": "Joe Montanti", "5588119": "David Pascua", "5392854": "Charles Alan Ratliff", "4113330": "Adam J. Reeb", "1074373": "David Schifter", "6685981": "Wil Smith", "3155168": "Ben Yemba", "5831896": "Lia Zazzali"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["42"],  "plot": ["When friends and family from outside the dome come to visit, Barbie learns the military plan to destroy the dome with a missile.", "Julia hears a TV broadcast and learns the military has set up a 10 mile quarantine zone around the dome. The residents of Chester's Mill receive visitors however - friends and family who can at least see them from the other side of the dome. Norrie has a surprise waiting for her. For others, the reunions are bittersweet. Barbie learns from one of the soldiers that the army is pulling out. Rev. Coggins thinks he's receiving messages from God but his hearing aid is playing a role. He keeps hearing the word MOAB which he thinks is a biblical reference. Barbie knows otherwise. Big Jim finds Angie in his old bomb shelter and frees her. Junior isn't finished with her yet.—garykmcd", "Junior proudly steps up when new deputies are clearly needed. Father Big Jim lets him, despite discovering and freeing from their shelter his cuffed girl, who accepts he only meant to protect her. Townpeople cheerfully flock when the army arranges a meeting with loved-ones at the dome. Barbie however uses his veteran hero status to learn from a private that it's meant as a goodbye as the Us's largest non-nuclear bomb MOAB is to be thrown onto the dome. Everyone seeks shelter, but the damage is done outside and the dome still stands, albeit no longer causing shocks or fits.—KGF Vissers", "Joe and Norrie find many butterflies covering part of the dome. The military bring family and friends from outside the dome to visit people in Chester Mill in a The Visitor's Day and Barbie finds it strange. Norrie learns that her father is alive. Big Jim Angie locked in the shelter but he does not release her; when he leaves the place, Reverend Lester visits him and tells that he is receiving the word MOAB from God. Then he preaches for the population and orders Big Jim to confess his sins. Barbie learns that the military intends to bomb the dome, and the Visitor's Day is not to say hello to the families but farewell. Now they intend to bring the residents to the Sanders' cement factory. Big Jim releases Angie and he tells her that they all are all going to die on that day. However the powerful bomb does not affect the dome.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821458", "rating": 7.4, "votes": 1765, "number_of_episodes": 39}