{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1066346": "Jolene Purdy", "1490300": "Aisha Hinds", "0001194": "Jeff Fahey", "0606487": "Dean Norris", "0000526": "Samantha Mathis", "4435720": "Mackenzie Lintz", "0110803": "Beth Broderick", "0068709": "Ned Bellamy", "5523316": "John Elvis", "0364931": "R. Keith Harris", "2374823": "Joe Knezevich", "1146857": "Kevin Sizemore", "1490451": "Troy Rudeseal", "5772297": "Anna Sharma", "1676016": "David M. Smith", "5774725": "Charlon Turner", "1574019": "Maureen Mountcastle", "4976368": "Zeeko Zaki", "5234956": "Steve Baldwin", "5272194": "Robert Gregory Cole", "5539164": "Jonathan Edwards", "6864959": "Nicholas Farrior", "4418826": "Carolyn Foland", "5930140": "Ayana Johnson", "4636172": "Griffin O'Connor", "5065258": "Philip Odango", "5588119": "David Pascua", "4982550": "Paul Shaplin", "6685981": "Wil Smith", "7573885": "Jim Templar", "3832496": "Josh Turner", "5398829": "Melissa Veal", "4983930": "Meagan D. Westbrook"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["40"],  "plot": ["Following Duke's death, his house catches fire, forcing the town to rally together to form a bucket brigade. Elsewhere, Junior ambushes Barbie, while Dodee and Phil pick up a military frequency.", "In a flashback, we learn that Barbie killed Julia Shumway's husband trying to collect a debt. Sheriff Howard Perkins' pacemaker exploded after he touched the dome wall. Big Jim and Rev. Lester Coggins spend their time ensuring their secret doesn't come out. Coggins searches the dead sheriff's house for anything incriminating them but makes a mess of it and sets the house on fire. With the fire department pumper truck outside the dome, there's danger of fire engulfing the entire town. Angie is still a prisoner in the underground shelter and the unstable Junior confronts Barbie convinced Angie slept with him. Joe McAlister estimates that the dome covers an area 10 miles across and some of the residents try to tunnel under it.—garykmcd", "Sheriff Howard \"Duke\" Perkins gets close to the dome and his pacemaker blows up, killing him. Big Jim finds in his will that Deputy Linda Esquivel has inherited his house, so he sends Reverend Lester Coggins to seek documents in Duke's house. However Coggins burns the house to the ground. The paranoid Junior has a fight with Barbie since he believes that Angie has shagged with him. Deputy Paul Randolph has a nervous breakdown and shoots the dome; however the bullet ricochets and hits Linda's brother-in-law.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2779640", "rating": 7.1, "votes": 2132, "number_of_episodes": 39}