{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1490300": "Aisha Hinds", "0606487": "Dean Norris", "0000526": "Samantha Mathis", "4435720": "Mackenzie Lintz", "0068709": "Ned Bellamy", "0728132": "Leon Rippy", "0922927": "Celia Weston", "0364931": "R. Keith Harris", "3051426": "Crystal Martinez", "0974626": "Elena Varela", "0636094": "Dane Northcutt", "0732008": "Robin Robertson", "3980481": "James Alcorn", "5698476": "Rochelle Aycoth", "5102828": "Shannon Blackledge", "5647178": "Sherrie Bowling", "6105559": "Adrian Eugene Graham", "6681639": "Caroline Kahn", "5829522": "Leila Lottering", "4964475": "Karen Malina", "5436456": "Jo Ann Mason", "5440468": "James Nass", "5588119": "David Pascua", "5673973": "Ethan Rosero", "6685981": "Wil Smith", "3280928": "Quincy Villanueva", "3155168": "Ben Yemba"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["The town suffers from an outbreak of meningitis. Julia learns that Phil and Barbie are connected to her missing husband. Angie struggles to escape the bomb shelter.", "The military units outside the dome are packing up, much to the consternation of many of the townsfolk. There is a much greater problem however when Linda falls sick, the first of many as an outbreak of meningitis spreads across the town. Julia continues to have her doubts about Barbie and visits a site he had marked on his map. She finds her husband Peter's car at DJ Phil's trailer but he says her husband sold it to him. DJ tells her about the cabin and when Junior tells her about meeting Barbie at a cabin, she's desperate to get there but having fallen ill, has to get out of the hospital. Angie, still a prisoner in the bomb shelter, faces rising water after a pipe bursts. Norrie and Joe realize they have a seizure when they touch.—garykmcd", "Julia snoops around Barbie's s bag and finds a map. She follows the indications and finds her Peter's car, but Phil tells that he sold it to him. Julia presses Barbie to know what is happening. Out of the blue, he faints. Junior is attacked by Angie and keeps her locked up in the shelter. She accidentally breaks a pipe of water and the shelter is flooded. The military leaves the dome's boundary and Lynda also faints. Joe asks Junior if he has seen his sister. Soon people realize that there is an outbreak of meningitis in Chester's Mill. Alice joins the short staff of the hospital to help the population, but they realize that they are short in antibiotics. Big Jim goes with Barbie to search for antibiotics at Dee's pharmacy but they discover that a burglar stole the medicine. Julia discovers that there is a cabin where he husband might be and she flees from the quarantined hospital. She faints and Barbie saves her. Big Jim finds Angie locked up in his shelter.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821450", "rating": 7.1, "votes": 1783, "number_of_episodes": 39}