{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1490300": "Aisha Hinds", "0606487": "Dean Norris", "4435720": "Mackenzie Lintz", "0110803": "Beth Broderick", "0068709": "Ned Bellamy", "0728132": "Leon Rippy", "5523316": "John Elvis", "1146857": "Kevin Sizemore", "2095613": "Katie Garfield", "5763008": "Chantelle Rose", "5154768": "Andrew Vogel", "4789363": "Darryl Booker", "1604924": "Nick Basta", "0198522": "Bill Eudaly", "1530293": "Deborah Childs", "5698476": "Rochelle Aycoth", "5668324": "Robert Hazlette", "6681639": "Caroline Kahn", "2850047": "Joe Montanti", "6685981": "Wil Smith", "5669368": "Jim Vogt"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["41"],  "plot": ["After a Deputy is killed, Big Jim organizes a search party to hunt down the culprit. Meanwhile, Joe and Norrie continue to experience strange seizures.", "Deputy Paul Randolph escapes from custody and Linda Esquivel sets out to find him. In the meantime, Big Jim Rennie puts together a posse together and recruits Barbie to help out. Angie suggests to Junior that they try getting under the dome through the old cement factory tunnels. Most of those tunnels were closed off but Junior sets off to see what he can find. Julia follows him. Julia continues to wonder what the odds are of Barbie just being in town when the dome appears. Carolyn is worried about her daughter Norrie who was away all night. Norrie spent the night at Joe's house but when Caroline finds her both Joe and Norrie have a seizure. Junior begins spreading rumors that Barbie is a psychopath who attacked him for no reason.—garykmcd", "Linda arrests Deputy Kevin Sizemore and controls the population that wants justice. However, Paul lures her and flees from the jail. Big Jim organizes a search party to hunt Paul down and Barbie joins the posse. Junior keeps Angie locked in the shelter. She convinces him to try to find a means of escaping below the dome through the old cement factory tunnels. Norris mother is seeking her out. Julia sees the weird behavior of Junior and follows him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821206", "rating": 6.8, "votes": 1905, "number_of_episodes": 39}