{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "1066346": "Jolene Purdy", "1490300": "Aisha Hinds", "0606487": "Dean Norris", "4435720": "Mackenzie Lintz", "1151921": "Jason Davis", "5523316": "John Elvis", "3051426": "Crystal Martinez", "3621333": "Jay Gates", "0144213": "Kevin Cassidy", "1871389": "Benjamin Rowe", "5845178": "Christopher Johnson", "6377765": "David-Alexander Coley", "5070329": "William Frasca", "1172175": "Beth Gosnell", "5596902": "Joseph Milton Hodges Jr.", "5596670": "Joseph Milton Hodges Sr.", "5596607": "Nancy Rouse Hodges", "5816385": "Mary-Jo Jackson", "3655676": "Damien McGowan", "6001482": "Teresa McGowan", "1542962": "Clam Sepulveda", "6685981": "Wil Smith", "6191551": "Carlo St. James"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["Big Jim rallies the town against Barbie after framing him for the murders and the shooting of Julia. Joe and Norrie move the mini-dome to Ben's house but it soon begins to act strangely.", "The entire town rallies to find Barbie after Big Jim convinces them he is behind the recent murders and shooting Julia. Barbie realizes that Julia's life is in danger - Jim's story will fall apart once she regains consciousness and tells people what really happened. Barbie and Angie hatch a plan to get her out of the clinic but Barbie soon finds himself in jail and Big Jim has a proposition for him. Joe and Norrie move the mini dome to Ben's house but it soon begins to act strangely.—garykmcd", "Big Jim sets up Barbie as the perpetrator of his own murders so far. Overheared by Dodee as murder plotter, Jim shoots her too. Joe and Norrie are jailed, but refuse to tell the whereabouts of the mini-dome and egg, which they gave for safekeeping to nerd friend Ben Drake, who finds its influence shattering. Junior guards shot-wounded Julia, but Angie lures him away long enough for Barbie to evacuate her. Caught by the sheriff, Barbie goes to jail and promises to confess Jim's murders if he lets the kids go. Once they're off, Jim breaks that promise at the kangaroo court, but the kids are followed to Ben's home while Junior consults the great dome for guidance, alone.—KGF Vissers", "Big Jim organizes a posse to hunt down Barbie in the woods. Dodee discloses to Big Jim the existence of the egg and the mini-dome and she overhears a military broadcast telling that Big Jim is not reliable since he killed the Reverend. Coggins. Big Jim executes Dodee; burns the station to the ground; and then he accuses Barbie. The lesbian Carolyn discovers the mini-dome in the barn but she promises to help the teenagers to protect it. Big Jim comes to the barn with henchmen, but the kids have moves it to Ben's house. Big Jim arrests Joe and Norrie, but later he is forced to release them. Linda follows the couple and discovers the location of the mini-dome. Meanwhile Barbie and Angie remove Julia from the hospital, but he is arrested by Linda. Then Big Jim blackmails Barbie to confess the arson of the station and the murders.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821478", "rating": 7.4, "votes": 1615, "number_of_episodes": 39}