{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "1225406": "Colin Ford", "1066346": "Jolene Purdy", "0606487": "Dean Norris", "0954036": "Natalie Zea", "4435720": "Mackenzie Lintz", "0001858": "Mare Winningham", "4009567": "Berry Newkirk", "4920608": "Derek Roberts", "3051426": "Crystal Martinez", "1411388": "Rey Hernandez", "4302361": "Matthew Austin Murray", "0355797": "Kevin Hall", "2952095": "Jeremy Conner", "5234956": "Steve Baldwin", "7107789": "Jeff Crofut", "5821189": "John Delaney", "0001194": "Jeff Fahey", "5710574": "Kegan Dean Rushing", "6685981": "Wil Smith", "6433585": "Alex S. Taylor"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Maxine continues to manipulate Barbie and Big Jim. Linda and Julia investigate Duke's involvement with previous criminal activity in Chester's Mill. Meanwhile, Angie realizes Junior is the \"fourth hand\".", "Maxine extends her reach in Chester's Mills by opening a bar where people can gamble on bare-knuckled fights. Big Jim pays a visit to a lake island home hoping to find the information Maxine has on him and Barbie. After Linda finds a safe-deposit box key in Duke's hat, she and Julia head off to the bank. Duke left some incriminating information. Julia checks her husband's box leading her to understand better what happened to her husband. Dodee finds the mini dome but is injured when she touches it. After speaking to a nurse at the hospital, Angie is certain she know the identity of the fourth hand.—garykmcd", "Koen and Norrie confide about the mini-dome into Angie, whose confession about the incident with Junior and his mother's prophetic drawings lead to the conclusion he must be the fourth person fit to 'start' the egg; which has attracted a monarch caterpillar. Junior agrees and indeed launches a pink stars display after a painful investigation into the illegal fight-club set up by Maxine. She blackmailed Barbie into bare-knuckle fighting former collection victim Victor and bets right that he will loose on purpose. Big Jim meanwhile searches the lake shore for the hiding place of her blackmail material, finds and deals conclusively with her even meaner mother out of wedlock, Agatha Seagrave. Julia helps the sheriff work out her late predecessor Duke's part in setting op the lethal drug business on proviso none would be sold in town.—KGF Vissers", "Maxine blackmails Barbie to fight against his rival Victor in her club where people gamble food and drinks. She wants to control Chester's Mill and is using her underground bar to slowly take over the town. Meanwhile Big Jim takes his boat and goes to the island where he expects to find Maxine's secret and he meets the house's caretaker Agatha. Soon she threatens him with a gun and tells that she is Maxine's mother and they seek revenge against Chester's Mills since she was humiliated when she was young. She also discloses Barbie's secret. However Big Jim takes her gun and ties up her hand. He takes Agatha to his boat but she slips and falls into the water and Big Jim Lets her die drowned in the water. Julia discovers an insurance policy and that her husband forced Barbie to kill him to benefit her. The snoopy Dodee finds the mini-dome in the barn and touches it, but she has a shock and faints. Joe, Norrie and Angie discover take her to the hospital, and Angie discovers the owner of the fourth hand.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2821472", "rating": 6.9, "votes": 1549, "number_of_episodes": 39}