{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "4337039": "Alexander Koch", "0128655": "Eddie Cahill", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "4435720": "Mackenzie Lintz", "3492152": "Karla Crome", "0606487": "Dean Norris", "0710632": "Dale Raoul", "4530137": "Grace Victoria Cox", "3949582": "Matt McHugh", "6032503": "Mary Austin", "5070329": "William Frasca", "2850047": "Joe Montanti", "5440468": "James Nass", "5588119": "David Pascua", "6191551": "Carlo St. James"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["39"],  "plot": ["As the news of Angie's murder spreads, Rebecca warns Big Jim of a caterpillar infestation that could infect the town's remaining crops.", "Big Jim seems to have turned over a new leaf, convinced that the dome saved his life. They have an immediate problem when Rebecca determines that the influx of butterflies has led to a massive increase in the caterpillar population with half of their local crops now infested. Rebecca wants to burn half of the crop to save the rest but Big Jim decides that with the infestation the dome is testing him. He has another plan. At the high school, Junior finds Angie's bloodied corpse. They also find a woman's bloody shoe print. Junior thinks his father is responsible but Joe saw him asleep at home. Sam reveals to Julia that his late sister was Big Jim's wife. He also shows her the sketch she made that appears to be the girl Julia rescued from the lake.—garykmcd", "Shocked by the threatening dome, Big Jim seems finally to pull together with Junior and Barbie's gang, yet still self-righteously disagrees on methods. The teacher finds the monarch caterpillars have mutated into a voracious threat to the town's entire food supply, so the only change is spraying, Barbie prevents Big Jim from doing it himself. Joe is driven to literally murderous desperation when his sister is found killed at school, the culprit s unclear. Sam unveils being Junior's maternal uncle.—KGF Vissers"], "genres": "N/A", "imdbID": "3606348", "rating": 6.6, "votes": 1301, "number_of_episodes": 39}