{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "4337039": "Alexander Koch", "0128655": "Eddie Cahill", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "4435720": "Mackenzie Lintz", "3492152": "Karla Crome", "0606487": "Dean Norris", "4530137": "Grace Victoria Cox", "3430569": "Megan Ketch", "0948267": "Dwight Yoakam", "6623271": "Hannah Black", "4862492": "Austin James Parker", "6623272": "Reide Hale", "1692994": "Estes Tarver", "3561432": "Myke Holmes", "6291229": "Nick Alexander", "5698476": "Rochelle Aycoth", "6623281": "Gavin Goodell", "5588119": "David Pascua", "6433585": "Alex S. Taylor"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["38"],  "plot": ["While Julia and Sam attempt to stop Big Jim and Rebecca's plans for population control, Barbie, Joe and Norrie try to jog Melanie's memory, and Junior turns to Lyle for answers.", "As conditions in Chester's Mill worsen, Big Jim and Rebecca consider resorting to population control, which drives a wedge between Barbie and Julia. Meanwhile, clues to Melanie's past and her connection to the Dome are revealed.—Jiilo_Kim", "The girl from the lake has been identified as Melanie Cross who attended the local high school in 1988. Joe, Norrie and Melanie turn to Barbie for help in figuring out just who or what she is. With food supplies dwindling, Rebecca is pushing to get rid of unproductive people to reduce the population. Jim for his part is uncomfortable with the whole thing. Rebecca may have found a way to deal with that. Julia, who has lost faith in Barbie, asks Sam Verdreaux for help.—garykmcd", "Joe's chosen bunch realizes that the lake-rescued girl must somehow be long-missing then schoolgirl Melanie Cross and asks Barbie to help making sense of her return. Rebecca sneakily prepares a modified porcine influenza to carry out the human culling trough the water supply, but after noticing a mutation, presumably by the Dome, decides against it, just like Jim, who chose to help stop her.—KGF Vissers"], "genres": "N/A", "imdbID": "3659538", "rating": 6.9, "votes": 1182, "number_of_episodes": 39}