{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "4337039": "Alexander Koch", "0128655": "Eddie Cahill", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "4435720": "Mackenzie Lintz", "3492152": "Karla Crome", "0606487": "Dean Norris", "4530137": "Grace Victoria Cox", "0834606": "Sherry Stringfield", "0948267": "Dwight Yoakam"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["39"],  "plot": ["As resources dwindle, Big Jim holds a census in order to forecast how long Chester's Mill can continue to exist under the dome, while chaos ensues when a rainstorm turns into acid rain.", "Big Jim and Rebecca organize a census of sorts so they know exactly how many people are still living under the dome. Rebecca tasks Joe, Norrie and the girl from the lake to go to the high school and retrieve spec for a wind turbine, a science project some of the students had been working on. The girl from the lake knows the combination of the locker at the spot where Angie died. Joe uses that information to identify her. The town faces a major problem when it begins to rain what appears to be highly acidic blood. Lyle the barber thinks it's a message from God but Rebecca takes a more scientific approach to solving the problem. As pressures continue to mount, Barbie and Julia grow apart.—garykmcd", "Even Big Jim is shocked when it becomes clear the town census, which the teacher asked him to hold, serves meanwhile to determine who may later be excluded from sharing in the quickly running-out supplies of vital commodities. Most people remained indoors while a blood-red acid rain descends from the dome, but barber Lyle believes it his divine mission to capture the blasphemous atheist teacher for torture and, unless convinced of conversion, execution, which is prevented when Barbie's party tracks them down last minute. Junior and Joe's party meet in the school, where the lake drowning-rescued girl's uncanny acquaintance with even Angie's locker code suggests her identity.—KGF Vissers"], "genres": "N/A", "imdbID": "3814840", "rating": 6.8, "votes": 1233, "number_of_episodes": 39}