{"cast": {"1036181": "Mike Vogel", "0498956": "Rachelle Lefevre", "2358540": "Natalie Martinez", "1429380": "Britt Robertson", "4337039": "Alexander Koch", "0128655": "Eddie Cahill", "1225406": "Colin Ford", "3850069": "Nicholas Strong", "4435720": "Mackenzie Lintz", "3492152": "Karla Crome", "0606487": "Dean Norris", "1490300": "Aisha Hinds", "1066346": "Jolene Purdy", "4530137": "Grace Victoria Cox", "0834606": "Sherry Stringfield", "0000175": "Stephen King", "6414062": "Bryleigh Anne", "5698476": "Rochelle Aycoth", "5070329": "William Frasca", "6409101": "Tim Greene", "5596902": "Joseph Milton Hodges Jr.", "5596670": "Joseph Milton Hodges Sr.", "5596607": "Nancy Rouse Hodges", "5816385": "Mary-Jo Jackson", "6681639": "Caroline Kahn", "2850047": "Joe Montanti", "6392506": "Kayla Narron", "5672221": "Kevin J. O'Connor", "5588119": "David Pascua", "3066502": "Marlo Scheitler", "6191551": "Carlo St. James"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["42"],  "plot": ["As Barbie's fate lies in Big Jim's hands, the dome presents a new threat when it becomes magnetized. Meanwhile, Julia seeks out the help of a stranger to save the life of a mysterious girl.", "Barbie's execution is interrupted by the dome, which seems to have become magnetized. Julia rescues a drowning girl in the lake and is assisted by a former EMT who lives nearby. He thinks he recognizes the girl. Rebecca Pine, a high school teacher, tells Barbie she thinks the dome's electromagnetic force is interfering with people's brain waves causing the hallucinations, seizures and unconsciousness many are suffering from. While Rebecca works on building a magnet to counteract the force, Angie thinks this is happening because they did not kill Big Jim as their vision showed them. Big Jim is trapped in his underground bunker where he has an unexpected visitor.—garykmcd", "Junior refuses to execute Barbie, finally standing up against Big Jim, who later decides against doing it himself as the dome seems to protest by deploying a new power to make most people faint by a strong electromagnetic force field, which physics teacher Pine promises to control by building a giant magnet, assisted by Rebecca. Sam Verdreaux, a former paramedic who came hide outside town after some traumatic incident, appears to help rescue a drowning girl and comes to town. The chosen bunch speculates that the dome may be helping or forcing them to eliminate Big Jim, who gets trapped in his cellar bunker by the force field.—KGF Vissers"], "genres": "N/A", "imdbID": "3088612", "rating": 7.1, "votes": 1647, "number_of_episodes": 39}