{"cast": {"1022429": "Sam Witwer", "1012010": "Meaghan Rath", "0403134": "Sam Huntington", "0772704": "Kyle Schmid", "0535019": "Natalie Brown", "2316151": "Robert Naylor", "3208285": "Susanna Fournier", "1980429": "Pat Kiely", "1428452": "Dusan Dukic", "0893464": "Gianpaolo Venuta", "0059431": "Jay Baruchel", "4866467": "Jonah Carson", "0161048": "Chip Chuipka", "4188166": "Daniel DiVenere", "4814462": "Jonathan Emile", "0047606": "Nick Baillie", "1116945": "Mike Paterson", "4264669": "Erica Deutschman", "1760161": "Imogen Haworth", "3549238": "Nicolas Gendron", "1957478": "Chris Barillaro", "9452082": "Jeff Lemay"}, "geners": ["Drama", "Fantasy", "Horror"], "runtimes": ["44"],  "plot": ["Josh's best friend returns from the dead and Aidan breaks the rules by bringing ailing Vampire Henry to the house to recuperate. Meanwhile, Sally's confrontation with the Reaper rocks her to her core.", "The Reaper continues to train Sally. When faced with her first solo reap (Walter, a ghost Sally met in Zoe's self-help group), Sally can't go through with it and the Reaper has to finish the job. Sally's scared of making a mistake, but the Reaper tells her that there are no mistakes. Josh and Julia run into each other at work and vow to be friends. They're joined by another old friend, Stu, a ghost who was killed by the wolf who turned Josh. Stu and Josh catch up, and Stu, like Emily, warns Josh against jumping back into things with Julia.—Anonymous", "Aidan is drained by his unselfish efforts to save Henry after his live flailing, leaving the sire so desperate for blood he accepts trying Josh's, but the werewolf is too tasty and yet sickening. The full moon moon renders Josh anxious about his next transformation, but neither can leave when they realize Sally has collapsed after the Reaper, actually a dark side of her ghost personality, proved her potential as cosmic balance-contrary-ghosts)vanquisher. Unable to help her, the boys appeal to 'ghosts herd' Zoe, who is furious to find Sally just vanquished her lover Nick Fenn, yet accepts to enter her dream. It's a fake domestic bliss fantasy orchestrated by and starring Reaper Scott, who puts up a virtual fight.—KGF Vissers"], "genres": "N/A", "imdbID": "2113864", "rating": 7.9, "votes": 217, "number_of_episodes": 52}