{"cast": {"1022429": "Sam Witwer", "1012010": "Meaghan Rath", "0403134": "Sam Huntington", "1982266": "Kristen Hager", "0032628": "Amy Aquino", "1161069": "Connor Price", "0410622": "Katharine Isabelle", "1123994": "James A. Woods", "0893464": "Gianpaolo Venuta", "1773454": "Mylène Dinh-Robic", "0747653": "Tim Rozon", "1107273": "Laura Mitchell", "0433268": "Richard Jutras", "1946716": "Leigh Ann Taylor", "0753202": "Anana Rydvald", "3912580": "Teale Bishopric", "0302078": "Melissa Galianos", "7231070": "Kathleen De Santiago", "4023942": "Marine Buton", "2042776": "Jesse Rath"}, "geners": ["Drama", "Fantasy", "Horror"], "runtimes": ["44"],  "plot": ["Sally goes to Donna for help with her latest loss and learns more than she bargained for. Aidan and Suzanna come face to face with the truth about their tumultuous past, and Josh and Nora seek help from an old friend in an attempt to bring Josh back to who he was.—Anonymous", "Aiden is thriving, though at the expense of others, and Kenny is left to clean up the aftermath. Meanwhile, Josh and Nora discover Robbie's dead body and reveal their werewolf nature to ghostly Robbie. Sally explains her version of the afterlife but becomes fixated on resurrecting Robbie despite Josh's warnings about the risks of magic. Aiden returns home, briefly interacts with Robbie, and sneaks off for more blood. Sally catches him losing control and asks for his opinion on using magic to save Robbie. In his altered state, Aiden supports her intentions, despite usually being anti-magic. Determined, Sally decides to consult Donna, a witch from her past, to gain insight. Meanwhile, a beautiful young woman pushes her shopping cart through a hardware store. She seems mundane enough, her cart filled with wood boards, a sleeping bag, and her leather handbag, and wearing a simple top under a gray jacket. Her hazel eyes, however, dart about suspiciously until they land on a ladder. Quickly, she pushes her cart aside and goes towards it. She starts pushing it with all her might until it reaches a certain point. Sally jumps out of her body, revealing to be the reason for her strange behavior. As the dazed woman leaves, Sally climbs up top. Using risky magic, she brings Donna from the past to the present. Donna reveals her dark history: she was resurrected by witches who sacrificed an innocent soul, and she warns Sally that using magic comes with dangerous consequences, including getting stuck in the past. When Sally refuses to make a similar sacrifice to save Robbie, Donna selflessly offers herself instead. Elsewhere, Aiden is forced by Suzanna to confront his bloody past and the loss of their son, Isaac. Their emotional confessions lead to a fragile reconciliation. Josh and Nora, struggling with their strained relationship, suspect Robbie's death wasn't accidental but focus on closure. Nora expresses frustration about the burdens of ghostly interference and unresolved issues with Josh. Meanwhile, Robbie seems content as a ghost and uninterested in being resurrected. Sally bonds with him over memories but discovers he's chosen to move on instead of returning to life. Josh tries to reconcile with Nora, but his wolf instincts take over, making the situation volatile. Nora distances herself, frightened by his loss of control. Before departing, Donna asks Sally to seal her death spot to prevent further tampering with magic. Sally attempts to promise restraint but is transported back to 2010, the day of her murder. Now trapped, she must find a way to rewrite her fate and escape the loop, setting up the next chapter of her journey.—BSLFan"], "genres": "N/A", "imdbID": "3181446", "rating": 7.8, "votes": 159, "number_of_episodes": 52}