{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0267506": "Anna Faris", "0641389": "Jim O'Heir", "0661755": "Annie Parisse", "0009344": "Jorge Luis Abreu", "0869772": "Carla Toutz", "1344400": "Cali Sheldon", "1343484": "Noelle Sheldon"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Nervous and excited, Monica and Chandler travel to Ohio to meet a young pregnant woman, Erica Simmons, who is considering allowing them to adopt her child when it's born.", "After Rachel confirms Joey is more mature in relationships, Phoebe presents him to another friend as date, Sarah, who fails alas to respect his primordial rule by touching food in his plate. Ross wants fashion advice for his date, so Rachel and Phoebe take him shopping, but after he left the choosing to professional buyer Rachel he accidentally ends up wearing her stuff, despite Joey's 'jealous' warning. Monica let the gang get her hopes up when Chandler and she fly to on adoption agency in Ohio. The pregnant mother, Erica, likes them- but only because their files got mixed up with a doctor and a female minister; Monica throws everything at playing the reverend part, but Chandler tells the truth, so Erica calls it off; Monica's pressing on only makes it worse, but Chandler explains privately...—KGF Vissers", "Monica and Chandler go to Ohio to visit with a mother who is considering having her baby adopted. The mother accidentally confuses Monica and Chandler with another couple who are a Reverend and a doctor. Joey reveals to Phoebe and Phoebe's friend that he does not share food. Ross trying to impress a date so goes shopping with Rachel and Phoebe to get new clothes. Rachel gets Ross clothes, but accidentally gives him a bag of her clothes instead of a bag with his clothes.—Anonymous"], "genres": "N/A", "imdbID": "0583432", "rating": 8.4, "votes": 4958, "number_of_episodes": 235}