{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0748620": "Paul Rudd", "0267506": "Anna Faris", "0748270": "John Rubinstein", "0878837": "James Michael Tyler", "0711110": "Jim Rash", "0349341": "Carole Gutierrez", "0006463": "Jason Kravits", "0162882": "Anthony Cistaro", "0218831": "Manao DeMuth", "0006488": "Brian Palermo", "1620867": "Michelle Pereira", "1648040": "Vincent Boyle", "3208716": "Billy Dec", "0300803": "Edward James Gage", "0334413": "J Graigory", "0628420": "Paula Newsome", "4643800": "Jeannette Papineau", "1036824": "Angelika Roberts"}, "geners": ["Comedy", "Romance"], "runtimes": ["48"],  "plot": ["Phoebe races Ross to the airport in a bid to stop Rachel from leaving for Paris. Monica and Chandler pack up their apartment ahead of their move to their new house, and Joey buys Chandler a new chick and duck as a leaving present.", "Erica gives birth to the baby that Monica and Chandler are adopting. However, there's one small added surprise. Meanwhile, Ross and Rachel sleep together one last time before Rachel leaves to start a new life in Paris but Ross realises that he still loves her.—Iantjambo", "Phoebe's bachelorette party features a rather unexpected surprise when a stripper shows up; Ross and Chandler reflect back on a pact they made in college After hearing Ross's plea at the airport, Rachel gets off the plane to Paris and decides to stay in New York and be with Ross; Chandler and Monica move away.—Dynasti Noble", "Erica has gone into labor three weeks early and Chandler has a hard time handling the situation when Monica leaves them alone in the delivery room. Meanwhile, Ross and Rachel sleep together and Ross realizes that he still loves Rachel and wants to be with her. Erica delivers, but there is one big surprise - there are twin babies, one boy and one girl. After Erica delivers the second baby, Monica and Chandler decide to name the girl, Erica, and the boy, Jack. Ross chases Rachel to the airport with the help of Phoebe but they end up going to the wrong airport. Joey buys Monica and Chandler a duck Jr. and chick Jr. as a going away gift. Monica finishes the packing...", "Ross and Phoebe race to the other airport, afraid they are not going to make it in time to catch Rachel. Phoebe calls Rachel, and tells her there is something wrong with the \"left phalange\" which creeps out the rest of the passengers so everyone gets off. Ross and Phoebe get to the correct airport but Rachel has just boarded again. Phoebe screams as loud as she can, and Rachel comes back out. Ross tells Rachel he loves her, but she gets on the plane anyway. Meanwhile, Chick Jr and Duck Jr are stuck inside the foosball table, and Monica volunteers to break the table. When Ross gets back to his apartment, he finds a message that Rachel had left him. She says that she is trying to get off the plane. Ross listening to this, does not know that Rachel is standing behind him and they finally get back together. Monica and Chandler pack the final things in their apartment, and leave their keys, along with the rest of the gang who produce keys. Monica & Chandler, their twins, Joey, Phoebe , Rachel & Ross all go downstairs to have one more cup of coffee in Central Perk."], "genres": "N/A", "imdbID": "0583433", "rating": 9.6, "votes": 17276, "number_of_episodes": 235}