{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0796235": "Jane Sibbett", "0372961": "Jessica Hecht", "0575977": "Heather Medway", "0883940": "Nancy Valen", "0223315": "Larry Poindexter", "0010264": "Jay Acovone", "0340408": "Joel Gretsch", "0923909": "Maggie Wheeler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["As Valentine's Day approaches; Ross and his date end up at the same restaurant as Carol and Susan, Joey inadvertently sets Chandler up on a blind date with Janice, and the girls burn mementos of their old boyfriends.", "It is Valentine's day and only the boys have got dates. After an opening line about an egg that Joey and Chandler recommended, Ross gets his first date since his divorce with the ladylike Kristen. However Carol and her lesbian partner Susan end up in the same restaurant. Susan gets called away to work so Ross makes everyone shift seats to let Carol sit with him and his date. Alas their conversation gets a bit too exclusive. Joey insists that Chandler comes to a restaurant as his foxy date Lorraine demanded a double-date. Her unknown friend turns out to be Chandler's ex Janice. When Joey and Lorraine leave early, Chandler and Janice use his credit card to order the best champagne. The two bottles contain so much alcohol they wake up together. Meanwhile the date-less girls take Phoebe's advice to perform a cleansing ritual: burning in a keepsakes from boys they want to forget. Paolo's grappa contains so much alcohol the ebullient effect requires calling three hunky firemen to the apartment.—KGF Vissers", "On Valentine's Day Joey convinces Chandler to blind date his own date's friend, who turns out to be his annoying ex-girlfriend Janice. Ross goes on a date with a neighbor, which turns bad when they run in to his ex-wife in the restaurant. The dateless girls perform a cleansing ceremony at home: burning objects connected to bad dates.—bergsten"], "genres": "N/A", "imdbID": "0583587", "rating": 8.1, "votes": 6663, "number_of_episodes": 235}