{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0004969": "Jill Goodacre", "0359969": "Larry Hankin", "0299289": "Cosimo Fusco"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["When New York suffers from a blackout, Ross tries to tell Rachel that he likes her, and Chandler gets stuck in an ATM vestibule with a model.", "When a power-cut blacks out most of New York City, Chandler, to his delight finds himself trapped inside an ATM vestibule with Victoria's Secret model Jill Goodacre. She lets him use her cell-phone, and offers him gum which he instantly regrets refusing. He accidentally spits out her gum which he finally accepted, then picks up some to put back in his mouth and begins to choke when he realizes it wasn't the original gum. The others kill time in Monica's apartment, lit by the light from a Menorah, telling stories of the weirdest places they ever had sex. Joey tells Ross he waited too long moving onto Rachel and is now too far into the 'friend's zone.' Ross still tries to make a move on Rachel while stargazing on the balcony. Joey keeps the other girls inside by pretending Ross prepares a birthday surprise party for Monica. A wandering cat scratches Ross. Rachel and Phoebe go knocking on their neighbor's doors to find the cat's owner, seeing through odd neighbor Mr. Heckles's who lies about being the owner. On their mission, they bump into the hunky, and actual cat-owner, Paolo, who only speaks Italian. Rachel brings him back to the apartment where he outstrips Ross's flirting, even not being able to speak English.—KGF Vissers", "New York has a power cut. Chandler is trapped in an ATM vestibule with Jill Goodacre. The other friends play games in Monica's apartment. Ross decides to ask Rachel out but a lost cat gets in the way. Phoebe & Rachel try to return him & find he belongs to a hot Italian guy, Paolo. Can you imagine how Ross is going to feel?...—Phoebe_Friends_Fan"], "genres": "N/A", "imdbID": "0583579", "rating": 8.8, "votes": 9207, "number_of_episodes": 235}