{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0625482": "John Allen Nelson", "0507051": "Clea Lewis", "0542699": "Cynthia Mann", "0374516": "Barry Heins"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Monica and the gang introduce Rachel to the \"real world\" after she leaves her fiancé at the altar.", "In a New York City coffee house called Central Perk, we're introduced to six friends: chef Monica Geller, data controller Chandler Bing who lives across the hall from Monica, Chandler's roommate/actor Joey Tribbiani, Monica's brother Ross Geller, new ageist Phoebe Buffay, and \"born to be a wife\" Rachel Green. One of the friends is just getting into a relationship and two are just getting out of one each. Monica is in the former category, going on a real/not-so-real date, dates with guys she's interested in being a rare occurrence. But she is excited by her upcoming one with Paul the Wine Guy from her place of work. Out on their date, their intimate conversation includes the fact that trauma from his last relationship has left him sexually incapable, something that only the right woman like Monica can fix, and she apparently does. Later however she finds that it was just a line to get her into bed, and thus her streak with the \"wrong guy\" continues. Ross is one of the two in the getting out of a relationship category. He and his ex-wife Carol broke up when she found out she was a lesbian. However waltzing into town is his old crush and Monica's best friend from high school Rachel, who is the second friend on a break-up: she has just left her fiancé Barry at the altar, she still in her wedding dress when she first shows up at the coffee house. This move was based on the fact that she realized she was more interested in being married than in being with Mr. Potato Head lookalike Barry. She and Monica had not seen each other since high school, she turning to Monica now since Monica is the only person she knows in the city. Rachel barges into Monica's life since she has no skills, no job and no money - up to this point in her life, she has lived off the wealth of her father - but needs to flee the direction of her life with Barry and her parents. Although she now has a place to stay with Monica, she needs a job and she needs a new support network. As old flames die slow and reignite easily, Ross hopes to be one of her more intimate supports.—Huggo"], "genres": "N/A", "imdbID": "0583459", "rating": 8.1, "votes": 10921, "number_of_episodes": 235}