{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0456909": "Stan Kirsch", "0118748": "Brian Buckner", "0803331": "Darryl Sivad", "1295801": "Anthony Backman", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Monica gets a shock when she finds out her boyfriend is a high school student. Chandler finds out his colleagues don't like him when Phoebe temps as his secretary.", "Chandler discovers that he and Rachel had an intimate moment in her dream. After revealing to her young boyfriend that she is older than she said, he reveals he is a high school senior. When Phoebe temps as Chandler's secretary, he discovers that his colleagues don't like him.—gdubs-41348", "Rachel had a dream about her and Chandler having sex and Ross is jealous. Monica's boyfriend Ethan is a senior at college but their age difference is no problem because Monica told him she was 22. Phoebe fills in for Chandler's secretary but tells Chandler that nobody likes him. Ethan and Monica have sex after Ethan tells her he is a virgin and Monica confesses to being 26. Ethan then tells her that he is a senior in high school and Monica freaks out. Rachel has another dream about Chandler - but this time Joey was there too. Chandler accompanies Phoebe to a party with people from work even though he was not invited but they still don't like him. Monica tells Ethan she loves him but can't be with him. Rachel has a dream about Ross while Ross is there and she yells out his name. They share an almost intimate moment when Ross gets beeped that Carol is in labor. Everybody leaves for the hospital.—Anonymous", "When Chandler needs a temporary secretary, Phoebe gets the job despite it requiring her to act 'normal'. She tells Chandler that his colleagues no longer consider him a friend since he was promoted, even though he's a very good one. Ross gets jealous when Rachel tells him about her erotic dreams involving Joey and Chandler. Monica is so happy with her younger boyfriend Ethan that she asks him to stay the night, but afterward finds out he's an under-age virgin in high-school.—KGF Vissers"], "genres": "N/A", "imdbID": "0583616", "rating": 8.1, "votes": 6418, "number_of_episodes": 235}