{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0767779": "Camille Saviola", "0319251": "Kim Gillingham", "0035737": "Jack Armstrong", "0923909": "Maggie Wheeler", "12827017": "Gorja Max", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Eager to spend time with Rachel, Ross pretends his washroom is rat-infested so he can join her at the laundromat. Meanwhile, Joey has Monica pose as his girlfriend, and Chandler struggles to break up with his girlfriend.", "Eager to spend time with Rachel, Ross pretends his building's washroom is rat-infested so he can join her at the laundromat. Chandler points out this could be a 'date' and the first time she'll see his underwear so it shouldn't be dirty! Rachel, the spoiled 'laundry virgin' feels managing this domestic chore is a real step to independence, but despite Ross's good advice she leaves a red sock in the machine. The real accomplishment comes where she has to stand up as no-nonsense-New Yorker against a rude, aggressive woman who invents rules to pretend it's not Rachel turn to do her laundry. Joey realizes he regrets dumping foxy Angela when he learns she is dating Bob. He proposes a double-date, then needs a girl stat. Monica agrees to be Joey's date but when she sees hunky Bob and realizes he's not Angela's brother she starts to enjoy the evening. Chandler drinks too much espresso while desperately trying to break up with neurotic Janice.—KGF Vissers", "Ross asks to join Rachel & Monica at the Laundromat so he can see more of Rachel. Monica backs out at last minute so Ross & Rachel are left doing laundry alone together.... Phoebe & Chandler go to break up with their current partners together at the coffee house. Phoebe's goes a lot smoother than Chandler's. ... Joey regrets ending it with his ex, Angela, but she has a boyfriend, Bob. To try & sabotage the relationship & keep the pieces, Joey tells Monica he has set up a double date for her with Bob, but tells Monica that Angela is Bob's sister. ...—Originally by: Angela Edited by: Phoebe_Friends_fan"], "genres": "N/A", "imdbID": "0583599", "rating": 8.3, "votes": 7760, "number_of_episodes": 235}