{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0933332": "Dorien Wilson", "0796235": "Jane Sibbett", "0372961": "Jessica Hecht", "0359969": "Larry Hankin", "0335462": "Jennifer Grant", "0724247": "Michele Lamar Richards", "0005087": "Leila Kenzle", "0000166": "Helen Hunt", "1535581": "Patty Tiffany", "1442174": "Katie", "3571907": "Patrick O'Bell", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Phoebe feels neglected when Joey falls for her twin sister. Chandler struggles to fire an attractive co-worker. Ross attends Lamaze classes with Carol and Susan.", "Chandler's boss orders him to tell his foxy junior co-worker Nina that she's fired but he can't and ends up dating her instead. He tells the boss she's in therapy as she is unable to handle or even remember her sacking. Chandler even promises her a raise! Ross's monkey Marcel has become systematically troublesome, yet he's the only one who masters the TV control's foreign language channels in Monica's apartment. Ross joins Carol and Susan in Lamaze class which turns into a disaster when Carol can't come and he has to play her part. A birth video makes Carol decide 'not to go through' with the birth anyway. Chandler and Joey find Phoebe's twin sister Ursula working in a bar. Joey asks for Phoebe's blessing to date her sister which is reluctantly given.—KGF Vissers", "Joey meets Ursula and they begin to date, Marcel the monkey uses the television remote to change the channel to 'Urkel' in Spanish, Ross is made uncomfortable by attending Lamaze classes with his ex wife Carol and her lesbian partner Susan. Meanwhile Phoebe becomes jealous of Joey spending more and more time with Ursula and Chandler struggles to fire an employee who he has a crush on."], "genres": "N/A", "imdbID": "0583568", "rating": 8.0, "votes": 6601, "number_of_episodes": 235}