{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000633": "Tom Selleck", "0923909": "Maggie Wheeler", "0925943": "Mitchell Whitfield", "0403272": "Jana Marie Hupp", "0817379": "Peter Spears", "1235117": "Jackie Bright", "0123007": "Fritzi Burr", "0827565": "Mindy Sterling", "1318659": "Paxton Culpepper", "5906452": "Richard Lawrence"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel reluctantly agrees to be maid of honor at her ex-fiancé Barry's wedding. Monica ponders her future with Richard. Joey has to practice kissing guys to get a role in Warren Beatty's new movie but Ross and Chandler are unwilling to help him.", "Rachel, Ross, Monica, and Richard attend ex-fiancé and ex-maid of honor Mindy's wedding. Joey has to practice kissing men for a big role in a Warren Beatty movie. Monica has to make a decision about her relationship with Richard when she discovers that he doesn't want more children.—gdubs-41348", "Joey has a problem: he has to kiss a guy for an audition and Warren Beatty told him he was a bad kisser. Joey wants to practice kissing a guy with Chandler. Rachel is maid of honor for Barry and Mindy's wedding. She has to wear a horrible pink dress. Monica thinks about getting married to Richard. Richard tells her he sees a future with Monica but not with kids. Chandler has a relationship over the Internet. Turns out the girl is married. Ross, Rachel, Richard and Monica go to the wedding. Rachel feels uncomfortable because Barry's parents told everyone she ran away from Barry because she was crazy after having had syphilis. Ross saves Rachel by making a speech about her courage to show up at the wedding. Richard tells Monica he'll have a child with her if he has to in order not to lose her. Monica doesn't want a child with someone who doesn't really want to have one. Chandler's meets his cyber space friend and they kiss.—Anonymous"], "genres": "N/A", "imdbID": "0583514", "rating": 8.1, "votes": 5779, "number_of_episodes": 235}