{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0005486": "Marlo Thomas", "0796235": "Jane Sibbett", "0372961": "Jessica Hecht", "0498609": "Phil Leeds", "1988006": "Candace Gingrich", "0810083": "Symba", "0216466": "Lea DeLaria", "10605902": "Jenny Inge", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel's mom comes to visit with big news. Monica caters Carol and Susan's wedding. Phoebe becomes 'possessed' by the spirit of a recently deceased client.", "Ross isn't confident enough to accept attending his ex Carol's lesbian wedding to Susan. Because the wedding caterer has a bad accident, Monica gets the job, a first for her, but can't get it done without generalized slave labor... Joey has his first TV appearance as Dr. Drake Ramore in Days of Our Lives, and shows the friends some acting tricks used there... Phoebe's 82 year-old client Rose died on her massage table, and her spirit went into her- now she has two crazy personalities and an octogenarian's agenda... Rachel was all nerves for her ma's first visit since she blew her wealthy wedding to Barry, but actually her happiness in poverty inspires Mrs. Greene Sr., who never worked but cracks at everybody, to leave Rach's pa and cheerfully join the crazy modern girls life... Everybody attends the wedding, and when Carol's parents won't give her away...—KGF Vissers", "Susan and Carol announce their plans to get married. Ross doesn't want to go to the wedding. Monica is doing the catering. Phoebe's client dies on the massage table. Phoebe thinks the old lady's spirit hangs in Phoebe's body. Rachel's mom is visiting and sees how happy Rachel is and wants to leave Rachel's dad to have a life like Rachel. Ross turns up at the wedding to give Carol away because her parents wouldn't come to her lesbian wedding. Ross and Susan finally get along.—Anonymous"], "genres": "N/A", "imdbID": "0583624", "rating": 7.9, "votes": 6100, "number_of_episodes": 235}