{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0001389": "Chris Isaak", "0000222": "Brooke Shields", "0144657": "Dan Castellaneta", "0929609": "Fred Willard", "0188220": "Roark Critchlow", "0557758": "Sean Masterson", "0005254": "Tahj Mowry", "0541849": "Lawrence A. Mandley", "0940555": "D. Elliot Woods", "0472820": "Karman Kruschke", "0109159": "Kevin Bright", "0186331": "David Crane", "0191906": "Jim Cummings", "0409892": "Steve Ireland", "1442174": "Katie", "0442035": "Marta Kauffman", "2044475": "Thomas James Kepner"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross goes to visit Marcel whilst on a trip to California and discovers he is working in commercials. Joey receives a fan letter from an attractive but unstable woman. Phoebe is asked to sing for children at a library.", "Joey's first fan-mail -for his character, Dr. Drake Ramore- is from Erika Ford, who sounds like a crazy stalker, so Chandler and he are scared when she turns up, but given her looks he accepts to dine together- enough for her to think she's Drake's fiancée. Hunky Rob Donan invites Phoebe to play songs for kids in the public library, but her brutally honest lyrics shock the parents. After seeing a monkey like Marcel in a commercial, Ross decides to visit him in the San Diego Zoo, where he's officially told the capucin died but hears the truth from a hush-hush caretaker: he's in a movie being shot in New York so they all go there...—KGF Vissers", "This episode is composed of two episodes. In the first part Joey is stalked by a crazy woman named Erika Ford, who thinks that Joey is actually Dr. Drake Ramoray. Ross goes to the zoo where Marcel is but finds out that Marcel is doing ads and movies, in fact is at NY for a movie. In the second half all the six friends go to the shooting. Chandler meets a beautiful woman who was once humiliated by Chandler when they were kids. Monica and Rachel fight for Van Damme.—Rurouni"], "genres": "N/A", "imdbID": "0583439", "rating": 8.5, "votes": 6380, "number_of_episodes": 235}