{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000633": "Tom Selleck", "0624240": "Audrie Neenan", "0001285": "Elliott Gould", "0681943": "Christina Pickles", "0075671": "Warren Berlinger", "0228646": "Josie DiVincenzo", "2200693": "Stephen Samuels"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Joey and Chandler's friendship is jeopardized when Joey decides to move out. Monica worries about her parents finding out about her relationship with Richard when they attend a party together. Rachel and Phoebe go to get tattoos.", "Phoebe talks Rachel into getting a tattoo despite, or rather because of, Ross's disapproval. At dad Jack Geller's birthday party, Dr. Richard Burke has some trouble hearing comments about his unspecified date, Monica more hearing about hers and the worst when she's accidentally in the bathroom while her parents get intimate. After a tiny row about using each-others stuff, even soap, Joey considers moving out of Chandler's apartment to live alone for the first time now he has a good contract and another actor moves to an even posher one.—KGF Vissers", "Monica is nervous about her parents finding out about her and Richard dating when she, him and Ross attend Mr. Geller's birthday party together. Joey decides to move out of his apartment, leaving Chandler upset and confused. Rachel tries to convince Phoebe to get a tattoo.", "Ross, Monica and Richard are at the Geller's for a birthday party. Everyone knows Richard has a 20 years younger girlfriend and Monica is having a hard time listening to all the comments about it. Monica and Richard tell Monica's parents about their relationship. Joey finds a nice apartment and wants to move out because he has never lived on his own. Rachel gets a tattoo. Joey moves out.—Anonymous"], "genres": "N/A", "imdbID": "0583456", "rating": 8.5, "votes": 5955, "number_of_episodes": 235}