{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0359969": "Larry Hankin", "0002235": "Mike Hagerty", "0001894": "Danny Dayton", "0923909": "Maggie Wheeler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Mr. Heckles dies and leaves all his possessions to Monica and Rachel, Chandler worries he will die alone just like him. Meanwhile, Rachel and Monica argue over a lamp, Phoebe and Ross argue over evolution.", "When Monica and Rachael's grumpy neighbour, Mr Heckles, dies he takes his final revenge by leaving all his belongings to them, which is basically all his junk that he has hoarded over the years. However while going through Heckles year book, Chandler realised that when Heckles was younger he was a lot like him and yet he died alone and bitter, this frightens Chandler into changing his ways as he doesn't want to end up like him. Meanwhile, Phoebe infuriates Ross by claiming evolution is just a myth.—Iantjambo", "Heckles who lives in the appartement underneath Monica and Rachel is always complaining of their stomping around and being noisy. While complaining Heckles dies and leaves all his stuff and his apartment to Rachel and Monica. The apartment is the biggest mess they have ever seen. While cleaning it Chandler finds out that he is exactly like Heckles and is afraid he will die all alone just like Heckles.—Anonymous", "Mr. Heckles, the friends' grumpy, delusional neighbor one floor below, dies just while he was poking his broom at the floor again; having no-one closer, his will left all his possessions to 'the two noisy girls above', who think it's his last revenge as there's nothing of value but a mountain of junk to clear out, but several items do have an impact. Rachel is determined to get one or two tasteless items 'of her own' into Monica's carefully coordinated interior. Chandler is shocked to find how similar Heckles was to him at his age, which terrifies him he might end up just as lonely and mean- time for his 'safety girl', or even accept the possibility of commitment? Meanwhile Phoebe deliberately drives Ross to despair with her refusal to accept either evolution or gravity as a scientifically proven fact.—KGF Vissers"], "genres": "N/A", "imdbID": "0583453", "rating": 8.2, "votes": 6350, "number_of_episodes": 235}