{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0004965": "Adam Goldberg", "0300096": "June Gable", "0878837": "James Michael Tyler", "0333158": "Jason Graae", "0404408": "Tim Hutchinson"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Chandler demands that Eddie move out; however, he doesn't seem to get the message. Meanwhile, a book on empowerment for women inspires the girls. In order to pay his bills, Ross convinces Joey to audition for a role he doesn't want.", "Even accommodating gentleman Chandler loses it when he finds out Eddie has been sneaking in his bedroom to watch him sleep. When the girls read a pseudo-poetical hardcore feminist bestseller, it quickly stirs trouble between Rachel and Ross and amongst the three girls. Now Joey has lost his job, his two-envelope Visa-bill leaves him no other choice then to audition for a measly part beneath a former soap star's dignity and standing by as unpaid stuff is carried off, except a porcelain dog which Ross ransoms after regretting having told Joey to do anything for material security, as he would. Since Eddie simply forgets his move marching orders, Chandler first spends a night at Monica's but then finds the perfect way to solve both his and Joey's problem.—KGF Vissers", "Eddie is freaking Chandler out by watching him sleep every night. Chandler tells Eddie to move out. Phoebe, Monica and Rachel read a book about how women need to become more empowered. There is wind who makes women goddesses but the men take the wind. Joey can't pay his debts so he has to give all his furniture back to the stores. Eddie finally agrees to move out but seems to forget it again. The girls get into a fight while talking about them being goddesses and empowered women. Chandler changes the locks and tells Eddie he doesn't know him. Joey moves back in with Chandler.—Anonymous"], "genres": "N/A", "imdbID": "0583449", "rating": 8.4, "votes": 5971, "number_of_episodes": 235}