{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0269463": "Jon Favreau", "0000539": "Dina Meyer", "0737138": "Reg Rogers", "0300096": "June Gable", "0590313": "Jennifer Milmore", "0878837": "James Michael Tyler", "0001774": "Ben Stiller", "0147312": "Laura Cayouette", "0112048": "Jeff Brooks", "0094288": "Peter Bonerz", "0761998": "Scott Sandler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross witnesses Rachel's date screaming at people. Meanwhile, Joey becomes upset when Kate is offered a job in Los Angeles; Phoebe refuses to hang up the phone when she is placed on hold by her phone company.", "They all go to Joey's play together. Joey is bringing Kate, Ross is there with a date so Rachel has to get a date as well. Rachel turns up with her freaky date Tommy. Joey and the cast get really bad reviews for their performances and Joey finally gets the chance to be with Kate again. They stay up all night and talk. Rachel stops seeing Tommy because Ross was right and he really is a maniac. Kate leaves for a job in L.A..—Anonymous", "Joey hands free tickets for his play; when Monica asks two, flaunting having a boy-friend, everyone wants two, even if the date is still to be found. Only Phoebe is turning oblivious to the world, sitting by the phone and believing a repairs services' hypocritical recorded message 'you're call is next and important to us'. Ross finds Rachel's hush date Tommy is obnoxiously rude to everyone, except when her other friends are around, and the harder he tries to get them to see it, the more 'still jealous' he looks, until the roomies' chick... After terrible reviews on opening night, the director dumps Joey's co-star and ex Kate Miller, Joey hesitates to be her second-choice again for weird reasons, but still has what Rachel calls 'the night', only the next day she accepts a job in L.A., causing her understudy's first go at the lead most confusing, only the audience is unlikely to mind given the ludicrous script...—KGF Vissers"], "genres": "N/A", "imdbID": "0583643", "rating": 8.1, "votes": 5402, "number_of_episodes": 235}