{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0852132": "Christine Taylor", "0878837": "James Michael Tyler", "0000414": "Teri Garr"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["While at the beach, Phoebe meets a family friend with links to her past; Ross discovers that Rachel still loves him and must decide between her and Bonnie.", "Phoebe finds out about an old friend of her parents, Phoebe Sr., so she decides to go and ask her about her father. All the friends go to the beach together looking for her, but Ross's girlfriend Bonnie can't come. While Phoebe is away, Rachel flirts with Ross, Chandler tries to convince Monica that he is boyfriend material and Joey wants to get everyone to play strip poker. They end up playing strip Happy Days game. Phoebe Sr. doesn't know where Phoebe's father is, but she reveals to her that she is her biological mother. Rachel convinces Bonnie to shave her head and tells Ross about her feelings. He has to choose between the two women.—Pruneau", "Phoebe finds a woman who knew her parents. She lives at the beach and the friends go there to talk to her. Bonnie can't join them. Monica is afraid she will die an old maid and Chandler offers to be her boyfriend just in case she never finds anyone. Monica laughs at his idea. At the beach house the friends play strip poker out of boredom. Rachel and Ross flirt with each other but then Bonnie turns up. Bonnie shaves her hair off. Ross and Rachel tell each other that they're still in love and they kiss. Phoebe breaks into her parents' friend's house to find out whether the woman knows where her father is. The woman doesn't know where Phoebe's father is but it turns out that she is Phoebe's mother. Ross doesn't know whether to move on with Bonnie or to get back with Rachel.—Anonymous"], "genres": "N/A", "imdbID": "0583496", "rating": 8.7, "votes": 6121, "number_of_episodes": 235}