{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0269463": "Jon Favreau", "0567852": "Kevin McDonald", "0061307": "Matt Battaglia", "0304580": "Robert Gant", "0304579": "Richard Gant", "0325750": "Carole Goldman", "2182506": "Douglas Looper"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross seeks medical help when he finds a mysterious skin condition on his backside. Phoebe struggles to choose between two guys; Monica can't decide what to do about Pete when she thinks he is going to propose.", "\"Ross' Thing\" is something on his derrière. He doesn't know what it is. Chandler doesn't know what it is. Joey doesn't know what it is. A large contingent of conventional doctors don't know what it is. So Phoebe sends him to Guru Saj, her herbalist, to figure out what it is. Guru Saj doesn't know exactly what it is, but solves the problem, not with medicine, conventional or otherwise. Meanwhile Pete mentions to Monica that he has something important to tell her. When Joey finds out that Pete has paid $50,000 to a ring designer, engagement ring comes to everyone's mind. Although Monica originally thinks she will say no if Pete asks her to marry him, the thought of saying yes becomes more and more appealing. However the question has to come first. On another dating front, Phoebe ends up dating two guys at the same time, Vince the beefy fireman, and Jason the sensitive kindergarten teacher. She likes them both for their obvious attributes. But when dating two guys at one time starts to feel like work, she decides she has to give one up. The decision becomes that much harder when she finds out there is a sensitive side to Vince and rippling muscles hide underneath Jason's baggy shirt. But when Phoebe can't make up her mind, the two guys end up making it for her when they meet each other.—Huggo"], "genres": "N/A", "imdbID": "0583565", "rating": 7.8, "votes": 5330, "number_of_episodes": 235}