{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0272601": "Sarah Ferguson", "0062636": "Helen Baxendale", "0105232": "Richard Branson"}, "geners": ["Comedy", "Romance"], "runtimes": ["30"],  "plot": ["Phoebe tries to help Rachel deal with her feelings for Ross as the rest of the gang head to London for Ross and Emily's wedding.", "Even before they leave the apartment, Joey drives Chandler crazy by forgetting everything useful, even his passport, but crying every five seconds \"London, baby!\", and photographing absolutely everything all the time, as if 6 hours on an airplane with Monica weren't bad enough. Emily was already a nervous wreck, but when she and Ross show Monica her dream site for the wedding that hall is already torn down, ahead of schedule! Ross hears Monica made her consider postponing and freaks out about their parents and transatlantic guests; she answers then they better call it off altogether. Back home, Phoebe makes Rachel realize how much she still loves Ross, so she helps her make up her mind, but warns her it's too late to get Ross back- yet Rachel rushes to London. When Joey insists to buy and wear an ostentatious Union Jack souvenir hat, Chandler refuses to spend the rest of the day thus; instead of being lost and miserable, Joey has a great afternoon, even photographed with Fergie, but back in the hotel room gets really homesick after phoning Phoebe and watching Cheers on TV. After explaining to Ross the obsessive focus of girls on their wedding, Monica comes with a solution: a romantic make-over of the hall's ruin...—KGF Vissers", "The friends are leaving for Ross and Emily's wedding in London. Phoebe and Rachel stay at home. Ross really wants Rachel there at his wedding but Rachel lies to Ross about having to work. The building where Ross and Emily were supposed to get married is torn down so they think about postponing but don't after all. Rachel realizes she still loves Ross and goes to London to tell him.—Anonymous"], "genres": "N/A", "imdbID": "0583566", "rating": 8.6, "votes": 5694, "number_of_episodes": 235}