{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0001285": "Elliott Gould", "0062636": "Helen Baxendale", "0002018": "Tom Conti", "0491402": "Hugh Laurie", "0766837": "Jennifer Saunders", "0925930": "June Whitfield", "0931404": "Olivia Williams", "0139732": "Jane Carr", "0681943": "Christina Pickles", "0130736": "Daniel Caltagirone", "0930748": "Heathcote Williams", "0264235": "Peter Eyre", "0220841": "Shelly Desai", "1348696": "Aidan Harrington", "0539719": "Greg Malins"}, "geners": ["Comedy", "Romance"], "runtimes": ["30"],  "plot": ["Phoebe tries to warn the gang that Rachel is coming to London to tell Ross she still loves him. Ross and Emily's parents get into an argument over the bill for the wedding. Monica and Chandler sleep together. The wedding ends with a gaffe.", "Ross' and Emily's parents meet and prove quite antagonistic; Stephen and Andrea Waltham enjoy that the Gellers pay for the wedding, against tradition, but Jack feels the list of expenses at their house is highway robbery, so Ross tries to mediate. Joey is terribly homesick, despite playing best man jointly with Chandler. Rachel misses her flight having forgotten her passport, and on the next annoys the gentleman sitting besides her to death who is quite happy to disagree with her all the way. The rehearsal dinner is hell for Chandler and Monica, who doubts whether she'll ever find a partner.—KGF Vissers", "As Ross prepares to marry Emily, Rachel makes a last minute transatlantic flight to England to tell Ross she loves him and try to win him back. However, when she arrives she sees Ross kissing Emily and realising how happy he is with her she relents and wishes him all the best. Now nothing can go wrong with the wedding. Can it? Meanwhile, Ross and Emily's fathers do battle over the wedding bill.—Iantjambo"], "genres": "N/A", "imdbID": "0831991", "rating": 9.1, "votes": 7147, "number_of_episodes": 235}