{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0004883": "Tate Donovan", "0108295": "Paget Brewster", "0925717": "Paxton Whitehead", "0834959": "Craig Strong", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["After seeing Kathy's play, Chandler becomes convinced she is cheating on him with her co-star. Rachel develops a crush on one of her customers. Monica becomes jealous when she realizes she is no longer the 'hostess'.", "After her former department at Bloomingdales was abolished, Rachel gets a new job: personal shopper for big spending clients; one of them, Joshua Bergen, really appeals to her, so she lures him back after hours with his 'lost' wallet, but even Joeys misunderstood suggestion to offer him Knicks tickets doesn't quite work out. Chandler is terribly jealous when he thinks his girlfriend Kathy gets too intimate with her thespian counterpart, and she takes it badly enough to break up with him- once he's no longer drunk, he's a wreck and realizes he didn't really know. Monica really misses being 'the hostess' now the boys have the big apartment, so she decides to make their tiny place 'even better'; she does a great job in two obsessive days non-stop, but is so tired she dozes off on the couch.—KGF Vissers", "After the apartment switch, Monica becomes jealous when everyone starts to hang out at Chandler and Joey's. Chandler becomes paranoid after seeing Kathy simulate sex with another man in her play. Rachel develops a crush on a customer at work.—ab1995", "Rachel is demoted to personal shopper at work. Meanwhile, Chandler can't take the thoughts that the sexy new play his girlfriend Kathy is starring in, might lead to off-stage romance. Monica misses being the hostess because now everyone hangs at the boys' place. Rachel finds newly divorced client Joshua irresistible, but he doesn't react like planned to Rachel's advances. Monica makes their apartment live-able and Kathy breaks up with Chandler.—Anonymous"], "genres": "N/A", "imdbID": "0583547", "rating": 8.0, "votes": 5166, "number_of_episodes": 235}