{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0478844": "Alison La Placa", "0624510": "Taylor Negron", "0266697": "Richard Fancy", "0722451": "Jennifer Rhodes", "0212847": "Laura Dean", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Monica ends up having to choose between a head chef position or the catering business she started with Phoebe. Rachel is close to getting a promotion but tragedy strikes. Chandler and Ross are excited when an old friend is coming to town.", "Phoebe and Monica get a van for their catering business. Rachel applies for a job as assistant buyer. An old friend and party wizard wants to visit Ross and Chandler. They are excited like two small children and can hardly sit still but the friend cancels their reunion. Monica wrote her first review and the owner of the restaurant comes to complain about it. Joanna doesn't want to lose a good assistant as Rachel and makes Rachel look bad at the interview for the new job. Rachel wants to quit but Joanna offers her the position of assistant buyer in Joanna's department. Ross and Chandler are depressed because they wanted to party with their friend so Joey offers to take them to party. Monica shows the owner of the bad restaurant how to make a sauce and he wants her as head chef. Joey, Chandler and Ross are out partying but realize they have become adults and are too tired after a few clubs and didn't like it much. Phoebe is really upset because Monica will leave their business buts lets Monica take the job because that's all Monica ever dreamed of. Joanna is hit by a cab and dies. Rachel probably won't get promoted because no one else knew of their agreement. Monica starts at the restaurant and the staff hate her because their relation and ex head chef Emilio got fired.—Anonymous"], "genres": "N/A", "imdbID": "0583490", "rating": 7.7, "votes": 5192, "number_of_episodes": 235}