{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0502073": "Thomas Lennon", "0664710": "Rick Pasqualone", "1320696": "Todd Glass", "0314905": "Baillie Gerstein", "0143604": "Lisa Cash", "0103268": "Jeanette Miller", "3208716": "Billy Dec", "1237772": "Paul Gebeau", "0382273": "Joel Heyman", "0660860": "James Paradise"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["The gang go to Las Vegas to visit Joey. Chandler is angry when he finds out Monica had lunch with Richard. Ross and Rachel try to embarrass each other after an awkward encounter.", "Joey calls Phoebe; refusing to take Chandler's apologies for not believing in his film, he barks for him to not come over- he's working as a gladiator in armor in a Vegas casino. Monica tells Phoebe, who may not tell Chandler, that she met and lunched with Richard, but felt nothing. Monica decides to give Chandler one anniversary present a day early: tickets for Las Vegas; Phoebe insists everyone goes, to make up for her missing London. Ross and Rachel have previous engagements but decide to follow the next day. As Phoebe put the idea in her head, Rach tests out walking around alone and naked; Ross sees her and comes over, thinking it was a sexual invitation; this misunderstanding escalates on the plane to embarrassing each-other in outrageous ways. In Vegas, Joey must admit he's just earning cash while the movie is delayed lacking funds. Chandler and Monica fight whether she may see Richard again. Joey loses his only tip in one hand, but thinks he'll make a fortune because he found the dealer to be his 'identical hand twin', and demands Chandler is supportive this time.—KGF Vissers", "Joey told the others he was doing a movie in Las Vegas but they didn't have enough money to shoot so Joey works at a casino dressed as a gladiator. Monica bumped into Richard and had lunch with him but didn't feel any attraction anymore. Monica gives Chandler tickets to Vegas for their anniversary and then Phoebe joins them. Ross and Rachel fly to Vegas a day later. They try to embarrass each other on the plane while Chandler and Monica have a fight about Monica's lunch with Richard.—Anonymous"], "genres": "N/A", "imdbID": "0583500", "rating": 8.6, "votes": 5590, "number_of_episodes": 235}