{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0258117": "Michael Ensign", "0608457": "Scott Mosenson", "1575231": "Jennette Robbins", "2483768": "Alexia Roberts", "0637327": "Johan-Carl Nowack", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Joey finds himself constantly covering for Chandler and Monica's affair. Ross becomes angry when someone at work eats his sandwich. Phoebe and Rachel enroll in a literature class.", "Ross brings his leftover thanksgiving sandwich to work, but someone eats it. He finds out that it was his boss, who puts him on sabbatical and sends him to a psychiatrist for anger management therapy. Phoebe takes a literature class and asks Rachel to come with her, but instead of reading the books, Rachel comes and asks Phoebe what they're about right before the class begins. Monica takes the class instead of Rachel, but she tries to make the class more challenging and no one likes her.—Anonymous", "Chandler and Monica are still trying to keep their relationship a secret from everyone else (apart from Joey who already knows) so they keep on making Joey cover up for things that could give away their secret relationship. At work someone eats Ross's sandwich from the work fridge and he gets really angry so he is put on sabbatical and is asked to see a psychiatrist. Phoebe is taking literature classes and invites Rachel to do them with her but Rachel is just doing it for the fun while Phoebe actually wants to learn. Then Monica decides to come along instead of Rachel, but she is even worse.—IMDb-Joe", "Phoebe enrolls in a literature class at the new school and Rachel decides to go with her. Phoebe is already reading the first assigned book and Rachel says that she knew the book because she read it in high school. A very depressed Ross arrives upset that someone ate his leftover Thanksgiving sandwich. Phoebe writes a threatening note for Ross to attach to his lunch at work to keep people from taking his food. Chandler and Monica are secretly seeing each other and Joey is the only one who knows it. When they get careless and the other friends start noticing things, they beg Joey to put the blame on himself to cover for them. Joey is upset because he is being looked at as a pervert in everyone else's eyes and Chandler and Monica don't want to admit their relationship to the group just yet. Ross's reputation at work has drastically changed thanks to the threatening note written by Phoebe on his lunch. His boss approaches him with concern that he should see a psychiatrist. When Ross explains that the situation is all about a sandwich, the boss admits to being the one who took his Thanksgiving sandwich. Ross became very upset, yells at his boss and is given a tranquilizer by the staff psychiatrist. Ross comes to the coffee shop acting very stoned and explains to Monica and Chandler that he was placed on sabbatical at work because he yelled at his boss. Monica gave a nude picture of herself to Chandler but Joey found it. Rachel sees Joey looking at it and assumes he had been peeping on Monica and took the picture. Everyone confronts Joey and being tired of taking the blame for all of the suspicious behavior, he turns the table and tells everyone that Monica has been stalking him (Joey) because they slept together in London.—Joyce L."], "genres": "N/A", "imdbID": "0583563", "rating": 9.0, "votes": 6556, "number_of_episodes": 235}