{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0300096": "June Gable", "0491068": "Julie Lauren", "0627624": "George Newbern", "0047520": "Tom Bailey", "0034305": "Lee Arenberg", "0670103": "Robyn Pedretti", "0103268": "Jeanette Miller", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["A bored Ross wreaks havoc in Chandler and Joey's lives. Rachel is uncomfortable with Danny's unusually close relationship with his sister. Phoebe runs into trouble whilst collecting donations for the poor during Christmas.", "Joey's new roommate Ross is bored out of his mind, while on sabbatical, and shows absolutely not aptitude for relaxing and pranks. Phoebe is determined to 'spread joy' all over the city as Santa's elf collecting for charity, but takes it too personal while many New Yorkers rather dump trash then actually donate money in the bin, thus reviving 'street Phoebe'. Joey is exasperated: even a part for an Italian Brooklyn actor his age is nailed by an unfit celebrity, so Ross makes it his mission to coach him creating his own part by writing a script; alas Chandler's idea for a self-invented game gets Joey's attention far easier. Tired of Rachel's hopelessly procrastinating 'plan' Monica plainly asks Danny 'who ignored her on purpose' to date Rachel, and he immediately accepts; she sees him kissing a girl in town, but at his apartment finds it's just his sister Krista, yet instead of relieved she is rather appalled how physically close the adult siblings still are, and the other friends concur. Joey tells Ross and Chandler who are bickering about what Joey should do that he finished fives pages in the library and asks them to test-read aloud- they soon finds it's a script for the two of them to make up...—KGF Vissers"], "genres": "N/A", "imdbID": "0583617", "rating": 8.0, "votes": 5130, "number_of_episodes": 235}