{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0202184": "Kristin Dattilo", "0154412": "Lilyan Chauvin"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["As Joey's grandmother visits to watch him on TV, Ross has trouble flirting with the pizza delivery girl, and Rachel tries to find an earring of Monica's that she has misplaced.", "First, Ross takes Chandler's natural joking with pizza delivery girl Caitlin for flirting behind Monica's back, and actually tells her just as they celebrate their 10-month anniversary, which starts a discussion on whether flirting by men is innocent, but not by females. Then Ross decides to demonstrate his flirtatious talent, which the others know to be abysmal; even conquering Rachel took him nine years. Meanwhile, Joey brings over Nonnie, his Italian grandmother who doesn't speak any English but was his only relative who always believed in his career, to watch a \"Law and Order\" episode in which Joey has a small role. Once he realizes his scene has actually been cut out, everyone tries to fool her and thus spare her heartbreak. Phoebe can't return Monica's earrings, a gift from Chandler she wants to wear that evening, because Rachel borrowed and lost them, as usual. Ross's flirting lessons turn out to be of the 'how not to do it' variety, but Rachel takes pity on him.—KGF Vissers", "Joey's Italian grandmother has visited him to watch his appearance on TV, but Joey learns he was cut from the show. The gang learns that Ross can't flirt after he has an awkward encounter with the attractive pizza delivery girl. Rachel tries to find Monica's earring that she lost.", "Joey had a part on \"Law and Order\", and his grandma comes for a visit to watch the show - but they cut Joey's scene out. Chandler and Monica have their 10-month anniversary. Ross likes the pizza delivery girl Caitlin and tries to flirt with her, but fails; Rachel upsets Ross by saying he doesn't know how to flirt. Ross orders another pizza to prove her wrong, but fails again. Rachel goes after Caitlin, and begs her to give Ross her phone number, which she does. Monica admits that she flirts with other men all the time and it doesn't mean anything, but Chandler has a big problem with it.—Anonymous"], "genres": "N/A", "imdbID": "0583479", "rating": 8.6, "votes": 5509, "number_of_episodes": 235}