{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0819440": "Gregory Sporleder", "0878837": "James Michael Tyler", "0627624": "George Newbern", "0072476": "Doug Benson"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross moves in with Chandler and Joey after Emily's cousin kicks him out of his apartment. Phoebe dates a health inspector. Rachel plays hard-to-get with Danny.", "Emily's cousin kicks Ross out, so he moves in with Chandler and Joey. They try to get him to move out because he drives them crazy. Rachel and Monica's new neighbor invites them to his party but Rachel makes an excuse not to go. Phoebe starts dating a health inspector, but every time they go out to eat he finds a reason to close the restaurant down. Chandler and Joey decide to let Ross stay.—Anonymous", "Ross's marriage ends with Emily so Emily's cousin kicks Ross out of his apartment. Joey and Chandler offer to let Ross stay with them until he finds another apartment. Meanwhile Phoebe is dating a Health Inspector and whenever they go to dinner he keeps on closing the restaurant they eat in so Phoebe convinces him to to just be himself on dates. And Rachel is trying to play hard to get with Danny who moved into her building recently. Joey and Chandler start to get sick of Ross living with them because of his annoying habits, so they pressure him into getting another apartment quickly.—IMDb-Joe", "After breaking up with Emily, Ross has no place to live anymore, so he accepts Chandler's and Joey's invitation to move in with them. However, they find that Ross has rather annoying habits. Phoebe dates a health inspector, but soon realizes that she can't take him to any of her favorite restaurants. Rachel plays \"hard to get\" with Danny, but he doesn't seem to notice."], "genres": "N/A", "imdbID": "0583486", "rating": 8.1, "votes": 5206, "number_of_episodes": 235}