{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0308606": "Willie Garson", "0004941": "Soleil Moon Frye", "0198260": "David Dalton", "2468634": "Linde Gibb", "0298351": "Stephon Fuller", "4238648": "Ferdinand Mehlinger", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross makes enemies out of his new neighbors. Chandler freaks out about his relationship with Monica. Joey dates a girl who likes to playfully punch him but she doesn't realize she punches him too hard and Joey is reluctant to tell her.", "Ross has found out about Chandler and Monica's relationship and is angry. Although, when he finds out that they are in love with each other he is happy with their relationship. Joey is dating a girl that keeps on hitting him (although the hitting is friendly, they punches are still quite hard). Ross finishes moving into his new apartment and the President of the Tenants Committee asks for a $100 donation (for the handyman who is retiring), as a thank you. Ross does not want to give the money as he just moved in and it's against his principles. Because everyone in the building now hates Ross, he decides to have a party to get the people in the building to like him again, but no one comes. Chandler gets all worried about commitment when everyone is joking about him and Monica getting married and having children so he gets into a fight with Monica about commitment. To say sorry he proposes to Monica but Monica makes him realize how stupid that is. Joey eventually breaks up with Katie (the girlfriend who keeps hitting him).—IMDb-Joe", "Ross is really upset that Monica and Chandler are together but when they tell him that it is serious and they love each other he is very happy. Joey's girlfriend Katie is really nice but she keeps punching him. Just playfully but Joey hates it because it hurts. Ross moves into his apartment and refuses to pay $100 for the handyman's retirement present because he only just moved in and never met the guy. The result is that all his neighbours hate Ross already. Ross decides to throw a party for them and explain that he only stood up for his principles. Chandler freaks out when everybody talks about him getting married to Monica. He accuses Monica of wanting to get married right away and have kids and Monica doesn't want to talk to him again. Chandler doesn't know how to fix it because Monica has always told him how to fix mistakes in relationships. Nobody turns up to Ross' party because they are having a party for Howard the handyman. Joey puts on lots of clothes so Katie's punching won't hurt him when he breaks up with her. Chandler proposes to Monica to make up for his mistake. Monica refuses to marry him just because he is sorry but agrees to just be together with Chandler.—Anonymous"], "genres": "N/A", "imdbID": "0583610", "rating": 8.4, "votes": 5359, "number_of_episodes": 235}