{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0322306": "Joanna Gleason", "0796235": "Jane Sibbett", "0911725": "Megan Ward", "0435071": "Judy Kain", "0936364": "Jim Wise", "0020679": "John Christopher Allen", "0020360": "Charles Thomas Allen", "0918135": "Matt Weinberg", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel takes up smoking to feel more included at work. Joey auditions for a soup commercial with Ross's son Ben, but they end up competing against each other. Monica and Phoebe plan Rachel's surprise birthday party one month in advance.", "Joey is envious when Ross' son Ben gets an audition for a commercial, but is delighted to hear there also is a role for the boy's father, so he teams up with his godchild; both pass the first round. Everybody is hoping for free stuff, now that Rachel is starting her job with Ralph Lauren. Phoebe suggests they throw an intimate dinner as a surprise birthday party for Rachel, a month in advance, but Monica quickly takes over in grand style; Phoebe insists on being in charge of something, so she gets cups and ice. Rachel quickly finds that her boss Kim and collaborators tend to make all decisions on the balcony during smoking breaks, so after trying just to join them - which doesn't get her close enough - she adopts the terrible habit her dad, a doctor, always warned against with true horror stories. After Ben and Joey are selected for the final cut, Joey is told their lack of physical resemblance means they will be paired with different actors, and only one of them will be cast. Monica's nose and Chandler's experienced eye immediately notice that Rachel has started smoking; she convinces the office girls to attempt quitting together as 'patch sisters', but the others quickly relapse and insist she keep clean - she's out again. Joey's fake offer to waive his audition so that Ross will likewise retract Ben fails. During the final audition, even the line \"Mm, soup!\" is too hard for Joey not to mess up, as he keeps saying \"noodle soup\". Phoebe uses cups and ice in huge quantities and endless, wacky variations to take over much of Monica's party; Ross consoles Joey by suggesting he subconsciously wanted to fail so that Ben's feelings wouldn't be hurt - but the kid didn't get the part either. Chandler gets a taste of the Ralph Lauren smokers' balcony.—KGF Vissers"], "genres": "N/A", "imdbID": "0583475", "rating": 7.8, "votes": 4999, "number_of_episodes": 235}