{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0258117": "Michael Ensign", "8183016": "Jon Haugen", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["When Phoebe finds out about Monica and Chandler, she and Rachel attempt to get them to confess their relationship.", "When Phoebe discovers Monica and Chandler's relationship, she and Rachel try to mess with them. But chaos intervenes when Monica and Chandler find out what they're up to. Ugly Naked Guy is moving out, and Ross tries to get his apartment, but he has serious competition.", "Ugly Naked Guy is moving, and Ross is trying to get his great apartment. While Rachel, Ross and Phoebe are in the apartment, Phoebe looks through the window and sees Monica and Chandler kissing. Joey is relieved that they can finally tell them that everyone knows about their relationship, but Phoebe and Rachel don't want to tell them, and have their fun by messing with them. Phoebe makes a pass at Chandler, and Rachel gives them all her laundry when Monica and Chandler go to \"do laundry\". Ross tries to bribe Ugly Naked Guy with muffins, but so many people want the apartment that his bribe looks trivial by comparison. Monica figures out that Phoebe knows about them, and that she is trying to freak them out by showing an interest in Chandler. Monica wants to mess with Phoebe and Rachel now, and gets Chandler to pretend he is attracted to Phoebe as well. Ross is looking for a way to bond with Ugly Naked Guy. Chandler invites Phoebe over so she can feel his bicep and \"more\" - therefore Rachel and Phoebe realize that Monica and Chandler are only messing with them, so Phoebe accepts Chandler's invitation. Ross visits Ugly Naked Guy and bonds with him by eating muffins with him naked. Chandler and Phoebe both wait for the other one to back down, but neither does, and they kiss awkwardly before Chandler gives up and yells out that he loves Monica. Now everyone except Ross knows officially. Ross gets the apartment, and sees Monica and Chandler through the window and freaks out.—Anonymous"], "genres": "N/A", "imdbID": "0583452", "rating": 9.7, "votes": 14060, "number_of_episodes": 235}