{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0062636": "Helen Baxendale", "0004833": "Gary Collins", "0858109": "Sandra Thigpen", "1943734": "John R. McLaughlin", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross finally gets in touch with Emily and they try to work it out. Chandler gloats after Rachel reveals that Monica's secret boyfriend is the best sex she ever had. Phoebe and Joey debate if a selfless good deed exists.", "Almost caught once again, Chandler arrives with champagne for Monica, but instead finds the whole gang in her apartment so he says he is celebrating that his office just got wrinkle free fax paper. Joey thinks he has been hired as host for a PBS telethon, but is actually just one of many phone operators on screen. Phoebe says she hates PBS because it reminds her of the miserable days when her mother watched Sesame Street on it before committing suicide and even bitches Joeys telethon is selfishness masquerading as a good deed. When he retorts there is no such thing as a truly selfless good deed, she promises to prove him wrong. Ross tries to make up with Emily by phone and when she asks him to move to London he says no as he would be away from Ben. Emily agrees to move to New York but on the condition he won't see Rachel any more. The others consider her request to be unreasonable and after struggling to decide Ross becomes desperate enough to leave the decision to a Magic 8 ball which proves uncooperative. RacMonica has made up a fictional waiter as her secret boyfriend after Rachel walked in on her as she was actually waiting for Chandler. Rachel tells Chandler that Monica said her waiter boyfriend was 'the best sex she ever had' which Chandler enjoys enormously and milks for all it is worth. However Monica is cranky enough to cut him dry for the. Not knowing about the specifics of the condition, Rachel incites Ross to do whatever Emily wants to get her over to New York.—KGF Vissers"], "genres": "N/A", "imdbID": "0583467", "rating": 8.1, "votes": 5130, "number_of_episodes": 235}