{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0878837": "James Michael Tyler", "0507287": "J.D. Lewis", "1376366": "Joeanna Sayler", "1556567": "Matthew Mullany", "0092998": "Alex Boling"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Chandler and Ross argue over a joke. Meanwhile, Joey reluctantly takes a waiter job at Central Perk, and Monica becomes annoyed when Phoebe says she would choose Rachel over her as a girlfriend.", "Ross has sent a joke to be printed in Playboy magazine, which they did but Chandler claims it was his joke so he starts logging his jokes. While the girls go through the Playboy, Phoebe manages to insult Monica by saying she thinks Rachel the better choice to go out with. Later Rachel also insults Monica by saying she's high-maintenance. When Joey must explain to Gunther he can't pay his bill because he's broke, he gets a job at Central Perk as a waiter. He tries in vain to keep his job a secret from the friends, who end up reassuring him and offering advice. Unable to settle the joke authorship, Chandler and Ross ask Monica to decide, each confident she's in his pocket, only to be told the joke is no credit to anyone. Closing the café after Gunther refused him time off to do an audition, Joey is fired but one word from Rachel has him re-hired.—KGF Vissers", "Ross makes up a joke, sends it to Playboy and they print it. When he tells the friends about it Chandler claims he made up the joke. The girls enjoy their first time reading a Playboy magazine. Ross receives $100 from Hefner for the joke and Chandler and he fight about who the joke belongs to. Chandler decides to keep a joke journal and Joey becomes a waiter at Central Perk because he can't pay his bills anymore. Ross and Chandler want Monica to decide who the joke belongs to but she tells them that the joke sucks and is offensive and they should argue who is to be blamed for the joke so both of them blame the other one.—Anonymous"], "genres": "N/A", "imdbID": "0583621", "rating": 7.8, "votes": 4856, "number_of_episodes": 235}