{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0541909": "Louis Mandylor", "0878837": "James Michael Tyler", "0559363": "Jill Matson-Sachoff", "0714414": "Ron Recasner", "0115236": "Mongo Brownlee", "1159215": "Preston James Hillier", "0445762": "Shane Keller", "0923909": "Maggie Wheeler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel and Phoebe take self-defense classes. Chandler and Monica agree to give each other homemade presents for Valentine's Day. Joey tries to get money through medical research.", "Rachel and Phoebe take a self-defense class, and claim they can defeat anyone who attacks them. Ross doesn't believe them, and educates them of a martial arts technique called unagi. Chandler and Monica promise they'd make each other's Valentines Day gifts, but they both forget to make them.—rsuddhi93", "Joey is broke but needs money fast for new publicity shots, so he is determined to get enrolled for another medical experiment. Since the only one that pays $2000 is for identical twins, he hires fellow actor Carl to play his fictitious twin Tony. Because Monica worked on Valentine's day Chandler and she agree to celebrate it today and make their own presents. But both completely forgot the last bit and; the last-minute hunt for anything that could pass for home-made goes worst for Monica. Instead she promises to make all Chandler's wishes come true in kitchen and bedroom. Chandler's present for Monica, a 'mix tape of romantic songs', was made for him by Janice. Ross is the butt of the jokes again when he gravely tells Rachel and Phoebe the self-defense class they take is useless without the state of total awareness the Japanese call unagi (or is that some sushi?), but is brutally lacking it himself...—KGF Vissers"], "genres": "N/A", "imdbID": "0583570", "rating": 8.9, "votes": 6876, "number_of_episodes": 235}