{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000702": "Reese Witherspoon", "0878837": "James Michael Tyler", "0947044": "Susan Yeagley", "0385644": "Cheryl Hines", "0112048": "Jeff Brooks", "0000793": "Alexis Arquette"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel's younger sister arrives in New York and goes on a date with Ross. Meanwhile, Monica won't admit that she is sick.", "Joey surprises the Friends by charging them at Central perk to the cent, but shocks them when he gives pretty girls freebies. When Gunther finds out he takes it out of Joey's pay and the broke Casanova uses the only loophole which is giving the girls free muffins by pretending it's their birthday. Rachel's spoiled sister Jill moves in now, cut off by their father, after she bought a friend a boat. She is supposed to learn financial responsibility from the only daughter dad is proud of but makes a terrible start: shopping on dad's credit cards illegally with the numbers she memorized. Rachel nips that in the bud but fails to stop Jill dating Ross. Monica was sent home because she's too sick to work, but maintains beings sick is for sissies and therefore decides to seduce poor germ-threatened Chandler with sex.—KGF Vissers", "Rachel's sister, Jill comes to her for help after having financial trouble. Joey forces his friends to pay at Central Perk, but gives free food to the cute women. Monica refuses to admit she's sick and wants to have sex with Chandler. Phoebe discovers a spark between Ross and Jill.", "Joey gets in trouble for giving female customers free food at Central Perk. A sick Monica desperately tries to convince Chandler that she's not sick. After her father cuts her off, Rachel's sister Jill comes to town. Rachel talks Jill into asking Ross out. Ross and Jill return to his apartment and he closes the drapes as Rachel looks on from Monica and Chandler's.—Anonymous"], "genres": "N/A", "imdbID": "0583555", "rating": 8.1, "votes": 5049, "number_of_episodes": 235}