{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0128655": "Eddie Cahill", "0005475": "David Sutcliffe", "0132610": "Julia Campbell", "0444629": "Caroline Keenan", "0260241": "Roger Eschbacher", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Chandler struggles to photograph well for his and Monica's engagement picture. Joey teaches Tag how to pick up women, much to Rachel's annoyance. Phoebe and Ross date a couple who are divorcing.", "Monica's mom arranged to get their wedding announced in the paper, but they need to get a picture from a professional photographer as any camera makes Chandler grin look like a hyenas. Phoebe dates Kyle, who knows both Chandler and Ross -thwho nicknamed him 'Hums While He Pees'- from their basketball club. Ross gets to divert his crazy ex Whitney by taking her to a ballroom dance-date. Rachel is completely smitten with her office assistant Tag, enough to smell his cloths and be jealous when their colleague Melissa asks him out. Rachel even pays Joey to take Tag out, first to a Knicks game, then to a bar where they meet dozens of potential rivals for Rachel. Rachel then bribes Joey with free Ralph Lauren shirts to stop picking up women together so tag will stop too but Tag decides to go back to his ex-girlfriend.—KGF Vissers", "Monica and Chandler need a good picture for their engagement announcement but Chandler never looks good in pictures so they decide to let a professional photographer take their picture. Phoebe dates divorced Kyle and Ross ends up dating the Kyle's ex wife Whitney. Kyle and Whitney get back together and Tag goes back to his ex girlfriend. Because Chandler is absolutely hopeless in picture they just take a photo with Joey.—Anonymous"], "genres": "N/A", "imdbID": "0583601", "rating": 7.9, "votes": 4787, "number_of_episodes": 235}