{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000678": "Kathleen Turner", "0176175": "Mark Consuelos", "0636314": "Troy Norton", "0553492": "Chuck Martinez", "0000793": "Alexis Arquette", "0584381": "Joe Everett Michaels", "0225379": "Stephanie Dicker", "2627761": "Michelle Haury", "1287427": "Glen Hambly", "1409648": "Jeri Slaughter", "0824084": "Kevin Alexander Stea", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Ross and Rachel hit the freeway together when Monica's Porsche shows up again; Chandler and Monica go off to Vegas to find Chandler's estranged dad.", "Finding out that she's the only one of the friends who never got to drive Monica's Porsche, Rachel steals the car keys from Ross, who feels responsible - so he jumps in before learning that Rachel's license is expired. They get stopped - twice - but flirting doesn't work with either officer. When Phoebe's studly boyfriend Jake bends over, Joey sees that he wears lingerie. Phoebe tells Joey that they exchanged underwear, and that it takes a really confident man to dare doing so. Joey can't resist trying it himself. Chandler refuses to send a wedding invitation to his estranged father, but Monica is determined to put family first, and drags her groom to Las Vegas, where Chandler's dad has a drag show. When they are finally face to face, Chandler makes a decision.—KGF Vissers", "Rachel is the only one of the gang who isn't allowed to drive Monica's Porsche, because she is a bad driver. So Rachel steals the keys from Ross and takes him for a drive. Rachel doesn't have a license and gets stopped for speeding, but can convince the officer not to give her a ticket. Ross then drives her home, but drives so slowly that they are stopped again, and Ross gets a ticket. Chandler didn't invite his dad to the wedding, but Monica insists that they go to Vegas and see him. They go, and see Chandler's dad's show as a female impersonator. When Chandler's dad unwittingly approaches their table during his performance, he is startled to see his son after so many years; the couple tells him of their upcoming wedding, and Chandler graciously invites him. Clearly moved, he says that he would be very happy to attend.—Anonymous"], "genres": "N/A", "imdbID": "0583516", "rating": 8.2, "votes": 4901, "number_of_episodes": 235}