{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000215": "Susan Sarandon", "0025483": "Eva Amurri", "0079439": "Jack Betts", "1169471": "George Stults", "0038472": "Jeff Asch", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Joey's character on Days of Our Lives wakes up from his coma with a brain transplant from one of the show's legendary characters. Ross practices the bagpipes for Monica and Chandler's wedding. Phoebe and Rachel compete for the same man.", "Joey gets an opportunity to rejoin \"Days of Our Lives\" when his comatose character is implanted with the brain of a female character. Joey approaches her to get some advice on how to play her character, but she's unaware that she's being written out of the show and freaks out at Joey. Later, she tries to give him some pointers, and they end up spending the night together. Ross tells Chandler and Monica that he has a surprise for their wedding, which turns out to be him playing the bagpipes - terribly, as it turns out. Rachel and Phoebe have their eye on a guy at the coffee house and when he leaves his cellphone, they see it as an opportunity to hook up with him; the only problem is who will it be?—rcs0411@yahoo.com", "Joey gets training from the actress he is replacing on \"Days of Our Lives\". Rachel and Phoebe find a cute guy's cellphone in Central Perk and fight over who gets to call him to return it. Ross practices playing bagpipes for Monica and Chandler's wedding, much to their horror.—ab1995", "Joey's character on \"Days of Our Lives\" will finally come out of the coma, but only after they transplant a woman's brain. The woman - Jessica - will live on in Drake's body, so Joey asks the actress who plays her to help him be Jessica. Ross will play bagpipes at Monica and Chandler's wedding as a surprise. Joey is seeing the actress playing Jessica, but she will be doing a movie in Mexico.—Anonymous"], "genres": "N/A", "imdbID": "0583528", "rating": 8.2, "votes": 4965, "number_of_episodes": 235}