{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0302128": "Stacy Galina", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Joey and Ross accidentally take a nap together - and much to their dismay, find that they like it. Phoebe and Rachel compete to become Monica's maid of honor.", "The boys watch \"Die Hard\" for the zillionth time. Joey had planned to watch \"Die Hard 2\" next, but accidentally rented the first movie twice. After Chandler splits, Joey and Ross stay, but they doze off, freaking out when they wake up cuddled together. Worringly, both have never felt better rested. Joey is determined to try it again, but Ross too afraid of 'being weird'. Monica decides to make the other girls decide between themselves who gets to be her bridesmaid. Phoebe claims to have never done it, while Rachel has done it twice - but both are lying. They accept Joey's idea that he and Ross should audition the candidates, who both play ruthlessly on the judges' weak points. The result is surprising. When Monica meets Chandler's teenager summer camp girlfriend Julie Graff, she makes him apologize for dumping Julie on account of her being overweight. Joey and Ross finally take another nap together on the couch, but are embarrassed when they wake up to see the other four watching them.—KGF Vissers", "After watching a movie, Ross and Joey end up having a nap together. They feel very weird about it, especially since they enjoyed it so much. Monica decides to let Phoebe and Rachel decide which of the two will be her bridesmaid. Since they cannot decide, they let Ross and Joey be the judges of a contest. Monica is uncomfortable when she discovers that when he was 15, Chandler broke up with a girl because she was fat.—Pruneau"], "genres": "N/A", "imdbID": "0583632", "rating": 8.7, "votes": 5663, "number_of_episodes": 235}