{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0128655": "Eddie Cahill", "0434580": "Michael Kagan", "0679531": "Jean St. James", "0875826": "Cody Tucker", "0333984": "Cynthia Graham", "0737140": "Renee Rogers", "0751966": "Eric Rutherford", "0082214": "Andrew Bilgore", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Chaos ensues when Monica and Chandler decide to share each other's secrets. Rachel gets a promotion and interviews for an assistant. Joey is offered the chance to go back on \"Days of Our Lives\".", "Joey and Rachel compete over who has the best news. Rachel was personally promoted by Ralph Lauren to head a division, and subsequently can hire a personal assistant. Although Hilda has all relevant qualifications and plenty of experience, Rachel still chooses young Tag Jones, who the girls and Chandler consider beautiful enough to be a model. Tag is greatly surprised that his clumsy interview didn't lose him the job, but gets increasingly suspicious as it seems people believe he's gay - a lie spread by Rachel so she can keep him for herself. However, he is more interested in Phoebe. Nobody has the heart to tell Joey that a pilot he made stunk, so he becomes overconfident about his lead in \"Mac and C.H.E.E.S.E.\", and tells producer Terry that he can stuff a comeback role on \"Days of Our Lives\", especially if Joey is required to audition. Alas, the producers phone with the news that the sci-fi series is canceled, so Joey must beg Terry to take him on board. Meanwhile, Monica tricks Chandler into telling her an embarrassing \"Ross at Disneyland\" anecdote. Ross finds out and retorts, starting a series of spilled secrets the three use against each other.—KGF Vissers", "Rachel gets promoted to merchandising manager and gets to hire her very own assistant. \"Days of Our Lives\" want Joey back as Drake Ramoray's twin brother. Rachel is hiring, but doesn't know whether to choose a woman with great experience or the inexperienced hunk Tag. She knows that she should go for experience, but Tag is too cute, so Rachel hires him. Joey is too sure of himself to audition for \"Days of Our Lives\", but then \"Mac and C.H.E.E.S.E.\" gets canceled and he doesn't have either show. Rachel tells everyone that Tag is gay, but is caught off guard when Tag wants to ask Phoebe out.—Anonymous"], "genres": "N/A", "imdbID": "0583544", "rating": 7.9, "votes": 4825, "number_of_episodes": 235}