{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000213": "Winona Ryder", "9053346": "Mike J Daugherity", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel's college friend can't remember a scandalous kiss from the past; Chandler and Ross argue for possession of Val Kilmer's tuxedo.", "Rachel bumps into a girl she knew in college. Monica tells everyone they made out once when they were drunk. When Phoebe learns of it she doesn't believe it so Rachel decides to go out with her and bring Phoebe along so that she can tell her what happened. While making their seating plans for the wedding, Chandler is sad that 10 percent of the guests are his. So when Joey asks if his parents can attend, Monica says no but Chandler wanting more guests says let them. But Joey keeps on making a big deal about certain things. When Chandler goes to Rachel to get a tux, he picks the one once worn by Pierce Brosnan thinking it would make him the coolest. But then Ross gets the tux Val Kilmer wore when he played Batman.—rcs0411@yahoo.com", "Rachel bumps into her old friend Melissa from college who she once kissed after drinking too much sangria. Monica has the seating chart for the wedding finished and Chandler is really sad that only about 10 guests are from his side. Chandler goes to see Rachel at Ralph Lauren's to choose a tux and picks the tux that Pierce Brosnan wore once and sent back. Chandler thinks he is the coolest until he finds out that Ross picked the tux worn by Val Kilmer in Batman. Phoebe doesn't believe Rachel that she made out with Melissa so she goes to dinner with them to ask Melissa about it. But unfortunately for Rachel, Melissa can't remember anything. To prove to Phoebe that she is wild Rachel kisses Melissa again and Melissa admits being in love with Rachel and remembering the kiss all the time. It turns out that Ross' tux was worn by Val Kilmer but not in Batman. Chandler finds a new tux - which was worn by Diane Keaton.—Anonymous"], "genres": "N/A", "imdbID": "0583545", "rating": 8.2, "votes": 4938, "number_of_episodes": 235}