{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0002235": "Mike Hagerty", "0137488": "Amanda Carlin", "0376531": "Lyn Alicia Henderson", "0669658": "Evie Peck", "0639625": "John O'Brien", "1089463": "Anita Dashiell", "0630035": "Shane Nickerson", "0161880": "Laurie Okin", "0216991": "Kim Delgado", "0584091": "Christopher Michael"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Even on their honeymoon, Monica is pushy, and is annoyed that Chandler won't jump the line at the airport check-in - especially after the couple in front of them, also on their honeymoon, get bumped up to first class.", "Even on their honeymoon, Monica is pushy, and is annoyed that Chandler won't jump the line at the airport check-in - especially after the couple in front of them, also on their honeymoon, get bumped up to first class. They try to sneak into the first-class lounge, but are caught - but she at least manages to steal an orange. Joey and Phoebe find that Monica and Chandler have tricked them out of the keys to the master apartment; Joey hopes a false gas leak alert will make super Treeger use his key, but he makes a fireman use an axe, and the wrecked door calls for a big lie. Rachel is finally ready to tell who the father is - the others say they already know, except daddy Ross, who thinks she just wants another passionate night with him. After blaming everything on the condom manufacturer - as neither he nor Joey ever read the notice they are only 97% effective - Ross promises Rachel full support, and of course proposes - which she turns down, as they aren't in love. She refuses to admit she won't cope on her own, although she can't even see their baby on the first ultrasound.—KGF Vissers", "Monica and Chandler leave for their honeymoon. Joey and Phoebe don't have a key to Monica and Chandler's apartment and need to get in, so they tell Treeger that there's a gas leak. A fireman comes to break the door in, so they have to explain the broken door to Monica. Rachel finally tells Ross that she is pregnant, and he's shocked - but he promises to be there for her; he even wants to marry her. Rachel doesn't want to marry Ross because they're not in love, and she is certain that she can raise the child on her own. They go to the doctor together and look at the first picture of their baby.—Anonymous"], "genres": "N/A", "imdbID": "0583476", "rating": 8.6, "votes": 4910, "number_of_episodes": 235}