{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000285": "Alec Baldwin", "0813887": "Bonnie Somerville", "0001457": "James Le Gros", "0409892": "Steve Ireland", "0527592": "Mark Lutz", "2040618": "Danielle Autumn Stratton"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Chandler and Monica are happy together - their worst problem is his habit to put CDs in the wrong box and their different taste in music. Rachel is desperate to get back on good terms with Joey, so she takes Monica's advice.", "Chandler and Monica are happy together - their worst problem is his habit to put CDs in the wrong box and their different taste in music. Rachel is desperate to get back on good terms with Joey, so she takes Monica's advice to change the subject to something work-related. However in another uncomfortable conversation she manages to convince Joey that her boss, Mr. Zelner, wants to buy her baby. When Phoebe resumes reading tea leaves, she sees that she'll meet the man of her dreams soon, and takes that to be Jim, who she keeps bumping into. However she soon finds he isn't quite that nice, and may be too crazy even for her! Ross is determined to get his favorite pink ('light salmon shade') shirt back from Mona's, so he sneaks in with the key, and dives behind the couch when she enters with a studly new lover...—KGF Vissers", "Phoebe tells everyone's future in tea leaves - Monica will have a violent death, Rachel will have a baby and Phoebe will meet the man of her dreams. Joey and Rachel are very awkward around each other and Joey avoids Rachel until Rachel asks for Joey's help with a problem she made up. Phoebe keeps bumping into the same guy and thinks it might be the man of her dreams. They go on a date and the guy turns out to be a writer of erotic novels for children and also in every other aspect very crazy. Phoebe walks out on him and meets a new guy.—Anonymous"], "genres": "N/A", "imdbID": "0583651", "rating": 7.9, "votes": 4589, "number_of_episodes": 235}