{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0353243": "Molly Hagan", "0812133": "Rena Sofer", "0806613": "Tucker Smallwood", "0534380": "Tim Maculan", "0724322": "Scott Richards", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Monica's restaurant get a bad review. After confronting the critic who wrote it, she decides to join a cooking class, with Joey in tow. Rachel gets jealous when Ross hits it off with a woman at the baby department store.", "Monica and Joey end up taking a beginner's cooking class when they go to confront a teacher who gave Monica's restaurant a bad review. Ross meets a cute sales clerk when he and Rachel go shopping for baby supplies. Phoebe helps Chandler prepare for a job interview.—GMEllis625", "After reading an awful review about her soup, Monica goes to the critic in order to give him her soup again. Meanwhile, Chandler is preparing for an interview. Joey has plans to go the movies with Monica but she wants to stop by the school where her critic gives cooking classes. Chandler feels confident about the interview, until Phoebe tells him that maybe he'll only show his funny side and not be serious enough. Monica arrives to the school with Joey, forcing the critic to taste her the soup again. Intimidated, the critic says that the soup is great. But Monica decides to stay in an amateur cooking class after she answers one of the questions correctly. Ross and Rachel go shopping for the baby and while there Ross meets a beautiful girl who he is impressed to find out loves anthropology. Rachel gets jealous after Ross and the girl hang out. Phoebe continues to help Chandler hide his funny side during the interview. He does well in the interview, but at the end when he is saying goodbye to his interviewer, he starts to tell jokes remembering some funny words of the interview. Monica gets a star because her great cookies but Joey cooked a better ones and the teacher congratulates him for good work. Finally, Ross' date was good, but Rachel confesses that she is jealous and wants that Ross stay with her every minute of her pregnancy. Despite her \"unreasonable\" attitude, Ross agrees to stay with her and says that he won't date anymore.—Alejandro Frias"], "genres": "N/A", "imdbID": "0583592", "rating": 8.0, "votes": 4612, "number_of_episodes": 235}