{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000285": "Alec Baldwin", "0001285": "Elliott Gould", "0681943": "Christina Pickles", "0768237": "Kat Sawyer", "0314910": "Ellen Gerstein", "0608758": "John C. Moskoff", "0798532": "Tim Silva", "0166128": "Aixa Clemente", "2557152": "Bob Bencomo", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Everyone prepares for the Gellers' 35th wedding anniversary in Long Island; Monica struggles to prepare the perfect toast; Phoebe invites her new boyfriend Parker.", "Everyone is preparing for the 35th wedding anniversary of Jack and Judy Geller. For this event, Monica wants to make the toast instead of Ross, and she's considering talking about the subject of Chi-Chi, the late family dog. Phoebe's date is an extremely enthusiast man, Parker, who likes to make an exuberant fuss about everything. He starts with Rachel, telling her about the \"miracle of birth.\" At the party, Ross and Rachel are stunned that his parents have told everyone that they've gotten married, and want them to maintain the pretense for the guests. Everyone starts to make jokes about Parker and his ridiculously effusive comments about the freeway, the city and how he takes a \"mental picture\" of happy moments. Phoebe hears their jokes and gets angry, arguing that she has never criticized their dates, and that Parker's enthusiastically way of seeing life isn't all bad. But eventually she realizes that Parker indeed makes a big fuss over everything: the plates on the buffet, the food, the oysters, the hall. Ross and Rachel try to handle the guests' congratulations in a low-key manner, but when people start giving them cash gifts, they feel obliged to invent outlandish details about their wedding and Ross' proposal. Joey tries to convince Phoebe that there's nothing wrong about Parker, and encourages her to have a good time with him. Later, Monica's toast is a big mess, because she starts to talk about Chi-Chi and her dead grandmother. Jack and Judy ask Ross to say some words - which are very touching as always, making Monica feels frustrated. Rachel confesses to Ross that she found his story about his proposal deeply moving, and he admits that it was how he had long imagined proposing to her. At home, Phoebe tells Parker that he's like \"Santa Claus with Prozac\". They have a fight and break up, but excited Parker finishes by asking \"Isn't this the greatest fight that you ever had?\"—Alejandro Frias"], "genres": "N/A", "imdbID": "0583499", "rating": 8.0, "votes": 4658, "number_of_episodes": 235}