{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000279": "Hank Azaria", "0748620": "Paul Rudd", "0878768": "Aisha Tyler", "0050955": "John Balma", "0913585": "Audrey Wasilewski", "0584381": "Joe Everett Michaels", "0788205": "Alison Shanks", "2875904": "Jason Carroll", "0079612": "Robert Alan Beuth", "2909963": "Bill Blair", "0756022": "Tony Sagastizado I", "1344400": "Cali Sheldon", "1343484": "Noelle Sheldon", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["50"],  "plot": ["The gang heads down to Barbados for the palaeontology conference.", "To the other friends' fury, it keeps raining except during Ross's speech, which to their amazement is a big hit with the paleontologists. Joey's scientific ignorance decides Charlie to turn her favor to Ross, then they must flee the other academics who intend by tradition to throw the key note-speaker into the pool. Chandler and Phoebe knew better, but Mike accepts to play table tennis against ever-obsessive fluffy monster Monica; when she gets injured, Chandler jumps in and crushes Mike. Rachel can't hide her feelings for Joey anymore, so when he sees Ross and Charlie kiss...—KGF Vissers", "Charlie and Joey break up and so Rachel makes her move on Joey by telling her feelings. Meanwhile Ross and Charlie begin to fall in love which each other. Joey and Rachel end up kissing. But surprise, surprise, Chandler, Monica and Phoebe are listening through the very thin walls of the hotel room so they spy on Ross, Charlie, Rachel and Joey. Plus Monica go to the hair salon and her frizzy monster hair is transformed into braids tied up with shells. Everyone gets mad especially Chandler.—Myrlee", "Charlie dumps Joey for Ross. Rachel finally tells Joey that she has had feelings for him. Joey doesn't want to proceed with Rachel because he couldn't do that to Ross. But after he sees Charlie and Ross kissing, he heads upstairs to share a romantic kiss with Rachel. Monica's hair keeps growing. Monica and Mike compete in an unfriendly way.—Anonymous", "Chandler gives advice to David, but that makes David want to propose to Phoebe. Although Phoebe is still in love with Mike. Monica calls Mike who shows up there right in the middle of David's proposal. Mike proposes instead. Phoebe gets back together with Mike, but doesn't accept his proposal. Monica's hair gets all poofy after getting off the plane. Charlie and Ross enjoy themselves when rewriting Ross's speech. Rachel keeps changing her mind on when to tell Joey that she has feelings for him.—Anonymous"], "genres": "N/A", "imdbID": "0583497", "rating": 8.5, "votes": 5205, "number_of_episodes": 235}