{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000551": "Dermot Mulroney", "0409892": "Steve Ireland", "0359577": "Evan Handler", "0507629": "Phill Lewis", "1090543": "Alexandra Margulies", "3094053": "Heather Sims", "0517638": "Paul Logan", "0203309": "Elizabeth Davidson", "1384651": "Genevieve Davidson", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Chandler starts looking for a job and is anxious about having a baby, Rachel decides to go back to work, and Phoebe works as an extra on Joey's show.", "Monica wants a baby so desperately that she keeps talking about sex to Chandler, even when Ross is there. Since Chandler is unemployed, she helps him find ideas, and organizes a meeting between Chandler and an acquaintance who works in advertising. Chandler is excited about advertising, and keeps making up \"slogans\" about random objects - but he is also worried that he won't be earning any money for some time, and wonders whether it is the right moment to have a baby. Ross and Rachel take Emma to Ralph Lauren's to introduce her to everyone, but Rachel discovers that a guy named Gavin is replacing her during her maternity leave. She is convinced that Gavin is trying to steal her job, so she decides to come back to work two weeks early. Since Phoebe is short on cash, Joey gets her a job as an extra on \"Days of Our Lives\", but she has difficulties overcoming her nervousness, and understanding that she is only an extra, not a major character.—Pruneau", "Rachel visits work and sees a guy named Gavin at her desk, and automatically goes back to work because she thinks he is better at her job that she is and that she will get fired. While Rachel is giving a presentation, Gavin is nice enough to watch Emma. Joey gets Phoebe a job as an extra on his soap, but she is not that good. Monica and Chandler realize that this might not be a good time to start a family.—Anonymous"], "genres": "N/A", "imdbID": "0583470", "rating": 7.8, "votes": 4487, "number_of_episodes": 235}