{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0748620": "Paul Rudd", "0679410": "Dedee Pfeiffer", "0005006": "Elaine Hendrix", "0924845": "Gregory White", "0400450": "Angee Hughes", "0785900": "Greta Sesheta", "1057133": "Ashly Holloway", "0399912": "Logan Hudson", "0203309": "Elizabeth Davidson", "1384651": "Genevieve Davidson", "0364957": "Kim Harris", "0461458": "Jodi Knotts", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Joey arranges a blind date for Phoebe. Chandler is leaving for Tulsa without Monica, because she has got a great job offer.", "Joey and Phoebe are planning to have a dinner in a restaurant and they arrange to get dates for each other. Looking at his address book, Joey finds out that he only has only girl's telephone numbers. He promises Phoebe to find her a male companion for that night. At the Coffee House Joey simply shouts the name \"Mike\" in order to see if someone responds. A Mike responds and Joey tells him the plan. Meanwhile, Monica has been offered a job in a great restaurant. She's afraid of telling Chandler that she wants to take this job, as it is in Manhattan meaning couldn't move with Chandler to Tulsa. Everyone finds out that Ross stills visits his pediatrician, Dr. Genttleman. He even likes to ask for a sucker when he's leaving doctor's office. At the restaurant, things get complicated, because Joey tells Phoebe that he and Mike are friends from the high school leading to much improvisation, but Phoebe discovers that Mike is a total stranger. Chandler understands that Monica has a great professional opportunity in the restaurant. He tells Monica that she should accept the job, despite the fact that they won't see each other too much. Next day, Mike is at the coffee house and he finds Phoebe to apologize about the other night. Everyone gathers to say goodbye to Chandler in the apartment. Monica tells Chandler that he's the most important thing in her life.—Alejandro Frias"], "genres": "N/A", "imdbID": "0583633", "rating": 8.1, "votes": 4684, "number_of_episodes": 235}