{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000279": "Hank Azaria", "0001764": "John Stamos", "0878768": "Aisha Tyler", "0880820": "Andy Umberger", "0221430": "Dan Desmond", "0628050": "Cynthia Newman", "0364957": "Kim Harris", "0798811": "Tracy Silver", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel take Joey's girlfriend Charlie and Phoebe shopping. Ross presents his theory to get a chance to go a conference in Barbados. Monica and Chandler consider alternate pregnancy options.", "When Joey hears that his girlfriend Charlie is an insecure shopper, he volunteers expert Rachel, who dreads being alone with her, so she makes sure Phoebe comes along, by saying she needs a dazzling outfit for the party she's going to just to save face as her ex Mike is coming too. Gynecologist Dr. Connelly tells Chandler and Monica they should keep trying the natural way, but realistically consider a surrogate mother -a nightmare for Monica- or donor sperm insemination, so Chandler invites his 'perfectly eligible' colleague Zach for dinner; they scare him with endless health and genealogy questions, yet Monica has another objection... Ross hopes to be the key note speaker at a paleontology convention on Barbados thanks to his spectacular theory, but it makes professor Sherman, who can get it for him, literally fall asleep. After embarrassing misunderstandings in the shop, Phoebe bumps into David, who is back from Minsk, for good...—KGF Vissers / correction: sLiDe.gR", "After finding about their chances of getting pregnant, Monica and Chandler search for the perfect guy to give them his sperm to get them a baby. Ross works on writing his speech. Charlie goes shopping with Phoebe and Rachel, which makes Charlie think Phoebe likes Joey. Phoebe shops for the perfect dress for a party that Mike is going to be at, but she bumps into David on the way and forgets about the party. Monica and Chandler decide to adopt children instead of getting a donor.—Anonymous"], "genres": "N/A", "imdbID": "0583597", "rating": 7.6, "votes": 4513, "number_of_episodes": 235}