{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0001484": "Jon Lovitz", "0659143": "Sam Pancake", "0072829": "John Eric Bentley", "0878837": "James Michael Tyler", "12143148": "Geoff Wingham"}, "geners": ["Comedy", "Romance"], "runtimes": ["24"],  "plot": ["Phoebe and Joey purposely set Ross and Rachel up on bad dates in the hopes they'll get back together. Monica and Chandler babysit Emma.", "As they think Ross and Rachel should get back together with Emma, Joey and Phoebe, when asked to fix them up with blind dates, plan to make those so horrible they'll end up back with each other. Phoebe does a great job: Steve is so unattractive he even makes himself cry; Joey found his own nightmare woman, a history teacher, not realizing she risks looking ideal to Ross; but she stands Ross up, making him the object of bets by the waiters on how long he will wait before leaving. Chandler and Monica agree to babysit Emma, but with him being bored without a job and she ovulating, their sex drive gets the better of them, so Joey finds the baby 'exposed to perversion' next to the bedroom...—KGF Vissers", "Ross and Rachael ask Phoebe and Joey to set them up on blind dates. Phoebe and Joey plot to set them up with people they will hate so they realize that they belong with each other. Phoebe sets Rachael up with a former massage client who repeatedly tells Rachael that she's too good for him, and eventually makes himself cry. Joey sets Ross up with a woman who's perfect for him, but when Phoebe points out that she's Ross's perfect match, he tells the girl that the date is cancelled, so Ross gets stood up at the restaurant where the waiters start betting how long he'll stay. Monica and Chandler are babysitting Emma, but since it is the last day Monica is ovulating, they have sex. Joey comes in and realizes that Monica and Chandler are having sex, so he takes the baby, leaving Monica and Chandler to search for her.—Brianna", "Rachel asks Phoebe to find a date for her and Ross asks Joey to hook him up with someone. Phoebe and Joey decide to set them up on horrible dates in the hopes that they would end up getting back together. When Rachel goes out on her date, she leaves Emma with Monica and Chandler. Monica is ovulating, so they have sex. Joey walks in and takes Emma so she doesn't hear them having sex.—ccrashh"], "genres": "N/A", "imdbID": "0583580", "rating": 8.0, "votes": 4520, "number_of_episodes": 235}