{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0748620": "Paul Rudd", "0807228": "Alan F. Smith", "0924884": "Irene White", "0668283": "Chris Payne Gilbert", "0108861": "Kevin Brief"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Rachel is ready to start hanging out again. She and Phoebe go to a bar, where they meet two guys.", "Rachel is ready to start hanging out again and concludes that she is tired of waiting that something happens between she and Ross. So Rachel and Phoebe decide to go out one night to a bar. Chandler and Joey have two tickets for the Knicks that night but Chandler lies to Joey saying he isn't coming to New York, because he prefers to spend the night with Monica who doesn't know anything about the Knicks' game. When Chandler arrives from Tulsa, Monica is waiting him wearing a sexy lingerie. Problems start when Joey sees that Monica is behaving suspiciously and wearing sexy lingerie and Joey suspects that Monica has a man inside the apartment and is cheating on Chandler. Joey calls Chandler telling that maybe Monica is having an affair and he should come quick. Meanwhile, Joey tries to manage the situation with a baseball bat. Chandler hides when Joey enters looking for Monica's lover. While Rachel and Phoebe are in the bar, Ross and Mike will spent the night at Ross's apartment, drinking beer and talking. But talking is going to be a little bit complicated, because after a few minutes they won't have anything to talk about. At the bar, two guys approach to talk with Rachel and Phoebe and after having a few words with them, Phoebe explains that she has a boyfriend. Rachel however says that she's free. One of the guys asks Rachel for her telephone number. She gives him the number but later she regrets it, afraid that Ross will answer the phone. Chandler has to confess Joey that he has lied to him, because he wanted to spend the night with Monica, afraid that Joey wouldn't understand. Offended, Joey says that he isn't too dumb to understand something like that. Tired, Mike decides to get away from Ross's apartment but Phoebe calls and ask him to return and intercept all the phone calls. Chandler apologizes to Joey and promises never lie to him again. Ross answers a phone call from the man from the bar, but he doesn't tell Rachel about it.—Alejandro Frias"], "genres": "N/A", "imdbID": "0583554", "rating": 8.0, "votes": 4638, "number_of_episodes": 235}