{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0000156": "Jeff Goldblum", "0507629": "Phill Lewis", "0392068": "Teck Holmes", "0309307": "Kyle Gass", "0285890": "Suzanne Ford", "0425835": "Michelle Anne Johnson", "3784065": "Bernard Curioso", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["24"],  "plot": ["Joey gets a part in a stage-play in a painful way. Ross and Phoebe are mugged outside Central Perk, Phoebe realizes that she mugged Ross 18 years ago. Chandler starts his new career as an advertising writer.", "Joey is delighted to get an audition for a stage-play directed by the legendary Leonard Hayes, who also stars in the lead; when he's only allowed to finish his performance because a female producer has the hots for him, but pleases Leonard because of his tortured expression, he decides to reproduce its cause: a bursting blather and bulge full of liquids, which must come eventually come out again. When a robber who just took Ross's wallet at gunpoint is recognized by Phoebe as her street friend Lowell, she admits to have been a mugger herself, and soon remembers one of her nerdy teenage victims was Ross, then a comics fan, from whom she took his backpack containing the sketches for his own nerdy superhero \"Science Boy\". Chandler gets and aces his own audition, for an unpaid intern job as writer in a publicity firm, where he is considered the old dude, but proves wit transcends generations by elaborating the only bright idea for a product which rather appeals to childish Joey, sneakers on roller blade wheels.—KGF Vissers", "Chandler begins his new internship at the advertising company, and soon discovers that he has a huge age distance from the other interns. Ross discovers a huge secret about his mugging when he was 14. Joey picks up a new acting method to impress an actor holding auditions for a play."], "genres": "N/A", "imdbID": "0583631", "rating": 8.1, "votes": 4555, "number_of_episodes": 235}