{"cast": {"0000098": "Jennifer Aniston", "0001073": "Courteney Cox", "0001435": "Lisa Kudrow", "0001455": "Matt LeBlanc", "0001612": "Matthew Perry", "0001710": "David Schwimmer", "0629653": "Marisol Nichols", "0171983": "Joe Colligan", "2294927": "Blake Reed", "2792358": "Shayne Anderson", "1377241": "Keith Pillow", "0810964": "Johnny Sneed", "0160930": "Susan Chuang", "0878837": "James Michael Tyler"}, "geners": ["Comedy", "Romance"], "runtimes": ["22"],  "plot": ["Nervous about his upcoming romantic scenes, Joey rehearses them with Rachel. Ross & Chandler get their money's worth on their weekend trip to Vermont while Phoebe takes advantage of Monica's clientele.", "Joey is insecure now his Days of Our Lives character Dr. Drake Ramore is getting real dialog, so he asks Rachel to come along to the set, which she loves enough to get romantic dreams, but about Drake, Joey or both? Monica's fancy restaurant Javu is doing great, so she's flat out too busy to accept joining Chandler on a surprise trip he booked to Vermont. When Phoebe comes sing her gross songs outside Javu, Monica tries to tell her nicely it's inappropriate, lacking style, but Phoebe just gets a fancier dress; once told the truth, she starts a nasty row... Meanwhile Chandler couldn't get a refund, so he takes Ross along, who gets high on maple candy and shows Chandler how to take revenge when they are told no reservation was booked and must take a $600 suite, technically without stealing, by stocking up on absurdly greedy quantities of everything hotels supply guests, worse then even Monica ever did...—KGF Vissers", "After Rachel goes to the \"Days of our Lives\" set with Joey, she has a romantic dream about him or is she having a dream about Drake? Chandler surprises Monica with a weekend getaway. Although she can't go, Chandler takes Ross instead. Phoebe drives everyone away from Monica's restaurant with her bad singing.—Anonymous"], "genres": "N/A", "imdbID": "0583549", "rating": 7.9, "votes": 4494, "number_of_episodes": 235}