{"cast": {"0340408": "Joel Gretsch", "0571537": "Jacqueline McKenzie", "0991810": "Mahershala Ali", "0020751": "Laura Allen", "1005514": "Patrick John Flueger", "1039977": "Chad Faust", "0259264": "Kaj-Erik Eriksen", "0627492": "Brooke Nevin", "0001075": "Peter Coyote", "0001004": "Billy Campbell", "0855564": "Lee Tergesen", "1462727": "Conchita Campbell", "0873021": "Lori Triolo", "0480328": "Peter LaCroix", "0001726": "Helen Shaver", "0434673": "Richard Kahan", "1058352": "Miranda Frigon", "1235157": "Preston Cook", "0441857": "Stanley Katz", "0429228": "Shaine Jones", "0570512": "Andrew McIlroy", "0235596": "Bill Dow", "0031191": "Christine Anton", "1898851": "Muriel Kauffmann", "0335315": "Claudine Grant", "1632717": "Amanda MacKay", "0370971": "Deryl Hayes"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["41"],  "plot": ["Baldwin and Skouris deal with returnee Oliver Knox, involved in a series of murders. Jordan Collier, hotel magnate, puts himself in front as 4400 spokesman.", "One of the 4400 is suspected to be a serial killer. Jordan Collier steps into the public as a 'face' to represent and organize the 4400. Danny informs Tom half-heartedly of Shawn's violent incident. Ryland tries to stop Barbara Yates from whitch-hunting the 4400 and Maia's babysitter does not like to know the future.—Qultlifter", "While Tom Baldwin's son remains in a critical state and Diana Skouris is trying to adjust to Maia living at her house, another urgent matter comes up for the two. Oliver Knox, one of The 4400, returns to his hometown Friday Harbor, Washington. Soon after a woman is murdered. The local police are reminded of another series of killings, which stopped five days before Knox disappeared. Meanwhile Jordan Collier, a hotel magnate and one of The 4400, is starting to act as a spokesman and advocate for the returnees. He appears on TV to convince the public there's nothing wrong with them and he tries to find returnees to invite them to meetings. Upon learning of Lily's baby he makes Richard an offer he can't refuse.—Arnoud Tiele (imdb@tiele.nl)"], "genres": "N/A", "imdbID": "0502797", "rating": 7.4, "votes": 610, "number_of_episodes": 45}