{"cast": {"0340408": "Joel Gretsch", "0571537": "Jacqueline McKenzie", "1005514": "Patrick John Flueger", "1039977": "Chad Faust", "1462727": "Conchita Campbell", "0248461": "Megalyn Echikunwoke", "1013318": "Jenni Baird", "0001004": "Billy Campbell", "0317315": "Todd Giebenhain", "0215229": "Tim DeKay", "0434673": "Richard Kahan", "0192024": "Martin Cummins", "0003964": "Frank C. Turner", "0222665": "Sean Devine", "1738103": "Graeme Duffy", "0817780": "Jennifer Spence", "0003210": "C. Ernst Harth", "0733218": "Ian Robison", "1692766": "Nelson Leis", "1682392": "Christie Laing", "1928517": "Rob Heschl", "0459686": "Alex Kliner", "0793156": "Jim Shield"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["42"],  "plot": ["The NTAC nerd squad bring to their Director's attention a 4400, Curtis Peck, who was a shoestring budget film maker and continues to be one, except that his 4400 ability seems to be to receive script pieces that combine to tell the true, complete answers to haunting questions, like \"What happened to Jimmy Hoffa?\" and \"Who shot JFK?\". And now he's missing and he left a video message where he told that Jordan Collier is not the real threat - there is something far more dangerous, and now they are after him. Peck's producer shows a trailer of the film Peck was supposed to start making, \"The Marked\", to Tom and Diana, and it paints a new, frightful picture: In the future the 4400 are supposed to prevent, exists a group of powerful individuals who like their time just the way it is and have irrevocably replaced the minds of ten important persons of the present time with the minds of their agents. Peck calls them \"The Marked\" because each one supposedly has an X-shaped mark behind their left ear because of the mind-replacing procedure. So far, Peck has received only one name. When Tom and Diana start investigating, Peck's unbelievable conspiracy theory starts to gain credibility... Meanwhile, Shawn meets Collier and tells him that he can't join Collier's cause because he needs to focus on his politic opponent, Gabriel Hewitt. Soon after that, Hewitt suffers a stroke. A coincidence?—Toni Tapola, Finland"], "genres": "N/A", "imdbID": "1049218", "rating": 7.9, "votes": 342, "number_of_episodes": 45}