{"cast": {"2257207": "Daniel Kaluuya", "3726887": "Jessica Brown Findlay", "0000391": "Rupert Everett", "0204919": "Julia Davis", "0858500": "Ashley Thomas", "0691586": "Paul Popplewell", "2877285": "Isabella Laughland", "2411784": "David Fynn", "1731356": "Colin Michael Carmichael", "4789912": "Hannah John-Kamen", "2259018": "Kerrie Hayes", "2051261": "Eugene O'Hare", "1881580": "Jaimi Barbakoff", "4199178": "Merce Ribot", "4901015": "Matthew Burgess", "2468503": "Laura Power", "4688232": "Matt Stokoe", "3979744": "Chloe Driver", "4676680": "Bryony Francis", "3637941": "Chris Martin Hill", "5659997": "Emma Holmes", "3019858": "Alan Lambie", "3824907": "Brian Shaw"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["62"],  "plot": ["In a world where people's lives consist of riding exercise bikes to gain credits, Bing tries to help a woman get on to a singing competition show.", "In this alternate, future reality, Bing and thousands of others must ride exercise bikes for hours a day to earn \"merits\", credits that can be used to purchase basic necessities as well as novelty items. They are surrounded by televisions playing mindless entertainment all day long, including TV shows that mock the odd overweight citizen who cannot workout, a lot of pornography...and a talent show similar to the real-world Got Talent franchise. When Bing meets, Abi, a woman with a talent for singing, he believes she can win the competition and earn a better life. However, after he makes sacrifice upon sacrifice to get her to the show, she is degraded and harassed by the judges and audience, who offer her a choice: start a career in pornography...or go back to being a slave. Her choice inspires a revelation in Bing, who begins to see the cruel injustice of the world in which he lives, and he is determined to change it...no matter what the cost.—alexandriahicks-10795"], "genres": "N/A", "imdbID": "2089049", "rating": 8.0, "votes": 68584, "number_of_episodes": 33}