{"cast": {"1239499": "Rory Kinnear", "0242026": "Lindsay Duncan", "0838910": "Donald Sumpter", "0329259": "Tom Goodman-Hill", "0934318": "Anna Wilson-Jones", "1171145": "Patrick Kennedy", "0533258": "Alastair Mackenzie", "1813397": "Chetna Pandya", "1276507": "Alex Macqueen", "0801043": "Jay Simpson", "1013450": "Helen Fospero", "3575723": "Lydia Wilson", "4080531": "Sophie Kennedy Clark", "0461409": "Andrew Knott", "1395602": "Allen Leech", "0616750": "Johann Myers", "2348343": "Sophie Wu", "0043931": "Rakie Ayola", "1904716": "Amit Shah", "4334838": "Nick Hendrix", "1517523": "Justin Edwards", "2935576": "Jeany Spark", "3043480": "Aymen Hamdouchi", "0729623": "Julian Rivett", "0285355": "Jonathan Forbes", "0101479": "Madeleine Bowyer", "0926905": "Jeffry Wickham", "3691746": "Shazad Latif", "2284961": "Eleanor Wyld", "2468535": "Wolf Wasserman", "4710129": "McKell David", "0494462": "Dominic Le Moignan", "3637941": "Chris Martin Hill", "1810152": "Allin Kempthorne", "3717498": "Matthew David McCarthy", "4432495": "Joshua Wichard"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Prime Minister Michael Callow faces a shocking dilemma when Princess Susannah, a much-loved member of the Royal Family, is kidnapped.", "In a run-up to Christmas the British Prime Minister Michael Callow is woken up and shown a disturbing video. On it he sees that people's princess Susannah of Beaumont has been abducted and will allegedly be murdered unless he has sex with a pig on live television. An effort to trace the kidnapper on a deserted campus proves to be in vain and Michael dismisses his aides' suggestion that a porn star perform the bestiality with the PM's face digitally superimposed. News coverage and Internet tweeters go into overdrive as Michael ultimately does his duty, in a deserted room with one camera man and a seemingly contented pig. Despite being ordered not to look, millions of people tune in though their amusement soon turns to horror at what they see.—don @ minifie-1", "In London, in Christmas, the Prime Minister Michael Callow is awakened by his advisors Alex Cairns and Julian Hereford that show a video of Princess Susannah of Beaumont to him. The princess is the pride and joy of the Royal Family and beloved by the people, and she tells that she was kidnapped. Further, the kidnapper demands that Michael have sex with a pig on live television; otherwise he would kill her. Michael's wife Jane Callow supports her husband while his advisors try to hire a porn star to perform the act while the secret service tries unsuccessfully to track the kidnapper down. Meanwhile the media seeks for news at any cost. What will the Prime Minister do?—Claudio Carvalho, Rio de Janeiro, Brazil", "Michael Callow, prime minister of England, is faced with a horrific decision. When Princess Susannah, a young woman and member of the royal family, is kidnapped and held for ransom, Michael is faced with two choices: let the princess suffer a horrific death at the hands of her captor; or comply with the kidnapper's demands. To save her life, Michael will have to humiliate himself and abandon his morals by having sexual intercourse with a pig on live television for the viewing pleasure of the captor and of his country's citizens. The question is, is he willing to make the sacrifice?—alexandriahicks-10795"], "genres": "N/A", "imdbID": "2089051", "rating": 7.6, "votes": 68591, "number_of_episodes": 33}