{"cast": {"1527905": "Toby Kebbell", "2092886": "Jodie Whittaker", "3665787": "Tom Cullen", "2805495": "Amy Beth Hayes", "1368934": "Rebekah Staton", "1528548": "Rhashan Stone", "4555381": "Phoebe Fox", "0592993": "Jimi Mistry", "0487406": "Daniel Lapaine", "0172428": "Karl Collins", "2759873": "Elizabeth Chan", "3194274": "Mona Goodwin", "1519710": "Kemal Sylvester", "4676680": "Bryony Francis", "3637941": "Chris Martin Hill", "7470649": "Jackson Kai"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["49"],  "plot": ["In the near future, everyone has access to a memory implant that records everything they do, see and hear. You need never forget a face again - but is that always a good thing?", "In the future, thanks to the Grain, a chip which can be implanted on a hard drive in the brain, every single action that a person makes is recorded and may be played back. Liam, a lawyer, married with a child, suspects that his wife Fi is having a fling with the brash Jonas, whom they meet at a dinner party.—don @ minifie-1", "In the future, most of the population has a chip called Grain implanted to record and replay each and every memory. After a job interview, British lawyer Liam Foxwell takes an earlier flight to meet his wife, Ffion, at a dinner party with her old friends. When he unexpectedly arrives, Ffion is talking to her friend Jonas and Liam finds her reaction strange. Then he watches her glances at Jonas during the dinner and he suspects they are having a love affair. When Liam presses his wife for information on Jonas, she admits to a brief relationship with him in Marrakech before she met Liam. They have sex and Liam spends the night drinking and reviewing the reunion. On the next morning, he drives to the house of Jonas and confronts him. What will be the price of his obsession?—Claudio Carvalho, Rio de Janeiro, Brazil", "In the near future, most of the population has something called \"Grain\" implanted in their brains, a device that retains every experience a person has had for later viewing. When Liam Foxwell, one of the many people with this implant, meets a cocky man named Jonas at a dinner party, he suspects that his wife Ffion is cheating on him with Jonas. As he continues to confront her about his suspicions and replay memory after memory, he dives deeper into insanity, which will come at a great cost for him and his family.—alexandriahicks-10795"], "genres": "N/A", "imdbID": "2089050", "rating": 8.5, "votes": 71026, "number_of_episodes": 33}