{"cast": {"1564072": "Lenora Crichlow", "0806968": "Michael Smiley", "3095562": "Tuppence Middleton", "1947068": "Ian Bonar", "4628177": "Elisabeth Hopper", "0058867": "Nick Bartlett", "5516564": "Nick Ofield", "1765971": "Russell Barnett", "5516680": "Imani Jackman", "5333660": "Shawn Aldin-Burnett", "4566494": "John Duggan", "3613279": "Lee Nicholas Harris", "5288405": "Shane Hart", "5387921": "Stephen McDade", "7608710": "Mia Mills", "4011733": "Philip L. Milne", "5383458": "Scott Plumridge", "6043474": "Dan Twine", "10998315": "Will Willett"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["42"],  "plot": ["Victoria wakes up and cannot remember anything about her life. Everyone she encounters refuses to communicate with her, and they all seem to know something she doesn't. But what?", "Victoria wakes with a head-ache and bandaged wrists,pills spilled on the floor. A strange sign is flickering on the television but she can remember nothing. Outside she meets Jem, a young woman who explains that the signal on the television set comes from the White Bear transmitter. It has turned most of the population into voyeurs who do nothing but watch and sometimes film as a deadly elite known as the hunters kill those unaffected by the signal,such as Jem and Victoria. Escaping from a hunter they reach the White Bear transmitter,which they intend to destroy. However the White Bear set-up is not what it first appears and nor is Victoria.—don @ minifie-1", "Victoria Skillane awakes dazed and confused on a chair in front of a television with a weird sign, pills spilled on the floor and bandage around her wrists. She walks around the house with amnesia and glimpses of a girl. She sees a picture of her, a man and the girl on a fireplace and she concludes she might be her daughter. She leaves the house and sees people watching and filming her passively. Out of the blue, a man with a rifle hunts her down and she runs under the view of the inhabitants. She meets a young woman called Jem that explains to her that most of the population is controlled by a signal from the White Bear transmitted that transforms them into voyeurs. They run to a convenience store in a gas station and the hunter shoots and kills Jem's friend Damien. They run to escape and a man called Baxter stops a van and saves them from hunters. But the guy is a sadistic hunter but they succeed to flee. Jem explains that she intends to burn the White Bear to the ground and they drive to the facility. When they reach the place, Victoria learns secrets about her and the place where nothing is what seems to be.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2542420", "rating": 8.0, "votes": 59043, "number_of_episodes": 33}