{"cast": {"0358316": "Jon Hamm", "1245863": "Rafe Spall", "2772105": "Oona Chaplin", "1164730": "Natalia Tena", "2857778": "Janet Montgomery", "1727356": "Rasmus Hardiker", "1161961": "Dan Li", "0238636": "Ken Drury", "2013934": "Zahra Ahmadi", "3358045": "Verity Marshall", "3542065": "Ian Attard", "4632254": "Grainne Keenan", "0915948": "Robin Weaver", "0633770": "Simon Nock", "0377807": "Diveen Henry", "3776734": "Esther Smith", "3591758": "Beatrice Curnew", "5362326": "Jonathan Arkwright", "0108510": "Liz May Brice", "6235008": "Nicholas Agnew", "1733556": "Gavin Kean", "3600214": "Sukh Ojla", "7009091": "Leanne Li", "7379038": "Magnus Robertson-Jones", "7379039": "Beatrice Robertson-Jones", "5596669": "Raphael Sowole", "6100857": "Turlough Convery", "5775677": "Samuel Valentine", "3590660": "Matthew Aubrey", "2198515": "Muzz Khan", "4766088": "Daniel Kendrick", "0085944": "Paul Blackwell", "4786823": "Richard Cullen", "6842127": "Susan Hughes", "7384166": "Jassie Mortimer", "5171679": "Ricky Rajpal", "5157380": "Neil Alexander Smith"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["73"],  "plot": ["Three interconnected tales of technology run amok during the Christmas season are told by two men at a remote outpost in a frozen wilderness.", "Joe Potter wakes up on the Christmas Day and finds his talkative co-worker Matt Trent preparing the Christmas dinner. They have been working together for five years in a remote outpost in the middle of nowhere in the snow. Joe does not like to talk, but Matt decides to tell his story. Matt was helping the shy Harry to seduce the beautiful Jennifer in a party using the \"Z-Eye\" implanted in his eyes in an illegal procedure. Harry succeeds and they go to Jennifer's apartment but things go awry and they die. Matt delete the evidences of his participation but his wife blocks him and they become invisible and inaudible to each other. Then Matt explains that he really worked with a chip called Cookie, capable to make a digital copy of the user. Then he forced the copy to serve the real user through torture manipulating time to break any resistance from the copy. Joe decides to tell why he came to the outpost and he explains that he lived with Beth. One night, they have dinner with their friends Tim and Gita and Beth is feeling tired and absent. She goes to bed and Joe cleans the kitchen. However, he accidentally drops the garbage on the floor and he sees a positive pregnancy test. He questions Beth and she tells that she will abort the baby. They have an argument and Beth blocks and leaves Joe. One day, he accidentally finds her silhouette on the street and he discovers that she is raising her child with her father. However he is incapable to see neither Beth nor the child since he is still blocked. But when Beth dies in a train accident, Joe goes to her father's house to see his child and he has a surprise. But where the outpost is located?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "3973198", "rating": 9.1, "votes": 75239, "number_of_episodes": 33}