{"cast": {"2288047": "Daniel Rigby", "4006608": "Chloe Pirrie", "0002076": "Jason Flemyng", "0580014": "Tobias Menzies", "2925304": "Christina Chong", "0484202": "James Lance", "2755953": "Ed Gaughan", "0171674": "Kenneth Collard", "0787237": "Michael Shaeffer", "0868476": "Pip Torrens", "2916966": "David Ajala", "2487593": "James Richard Marshall", "4474759": "Jack Monaghan", "1617379": "Louis Waymouth", "0851089": "Daniel Tatarsky", "0916413": "Michael Webber", "0857173": "Abigail Thaw", "1377178": "Bruce Mackinnon", "3806097": "Amber Anderson", "5533322": "James Howard", "0519311": "Charlotte Longfield", "4082917": "Sarah Hoare", "5333660": "Shawn Aldin-Burnett", "4710628": "Marco Flammer", "3346556": "Robby D Haynes", "4701018": "Chonradee Kulthap", "2972606": "Teresa Mahoney", "5360921": "Stuart Matthews", "7608710": "Mia Mills", "6446309": "Angus Powell", "3666483": "Mick Slaney", "6062738": "Peter Theobalds"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["A failed comedian who voices a popular cartoon bear named Waldo finds himself mixing in politics when TV executives want Waldo to run for office.", "Comedian Jamie Slater provides the voice for Waldo, a blue cartoon bear who interviews politicians for a late night topical satire show where Waldo generally humiliates them. Jamie's producer Jack Napier suggests Waldo stands as the local MP in the upcoming election, against pompous Tory boy Liam Monroe - one of Waldo's interview victims.—don @ minifie-1", "The comedian Jamie Salter has created the blue cartoon bear Waldo and provides voice and movements to the character. Waldo is the host of a night show where he interviews politicians to humiliate them. When the conservative politician Liam Monroe, who is the leader in the researches, is irritated by Waldo during a show, his producer Tamsin and the television owner Jack Napier decide to follow Monroe along his campaign to disturb him against Jamie's will. Waldo becomes popular and people decides to vote him to protest against politician. Meanwhile Jamie has one night stand with the Labour Party candidate Gwendolyn Harris and they fall in love with each other. However Gwendolyn is advised by the party adviser to keep distance from Jamie during the campaign since he might use inside information in his show. During a debate, Monroe uses the information he has about Jamie and offends him. Jamie has an anger outburst and attacks Monroe and Gwendolyn. What will be the consequences in the upcoming election?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2386296", "rating": 6.5, "votes": 48340, "number_of_episodes": 33}