{"cast": {"2017943": "Hayley Atwell", "1727304": "Domhnall Gleeson", "1721217": "Claire Keelan", "1561651": "Sinead Matthews", "2929459": "Flora Nicholson", "1445529": "Glenn Hanning", "1469243": "Tim Delap", "3843541": "Indira Ainger", "4304212": "Pamela Betsy Cooper", "5366001": "Tony Fadil", "1705294": "Richard Glaves", "4767135": "Richard Herdman", "2711324": "Chris Wilson"}, "geners": ["Crime", "Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["48"],  "plot": ["After learning about a new service that lets people stay in touch with the deceased, a lonely, grieving Martha reconnects with her late lover.", "Martha is devastated when her partner Ash is killed in an accident the day they planned to move in together. At Ash's funeral, Martha's friend tells her of a new service which enables people to communicate with their (deceased) loved one. Martha is appalled, and decides to stay in the cottage despite her sister's view she is isolating herself. One day Martha gets a message from Ash, and she realises Sarah has signed her up for the service. Initially, Martha's displeased but, on finding she's pregnant, relents and soon begins communicating now and more with 'Ash'. With her comfort-level growing talking with the synthetic Ash, it isn't long before 'he' tells Martha about a 'next level' of communicating - one which will bring them truly closer.—don @ minifie-1 (updated by U.N. Owen)", "Martha and Ash are deeply in love, and move in together. The next morning, Ash has an accident and is killed. During the funeral, a friend tells her of a service which helps grieving people recover; by creating a virtual Ash to communicate with. At first, Marthex's aghast, but soon she's in touch with 'Ash'. As she beckons acclimated speaking with 'Ash', she finds out she can take the relations much further - with a synthetic clone. Will she replace Ash with the clone?—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2290780", "rating": 7.9, "votes": 57831, "number_of_episodes": 33}