{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0103537": "Terry Bradshaw", "0005379": "Dennis Rodman", "1214883": "Terry Greene", "0370788": "Pamela Hayden", "0534134": "Tress MacNeille", "0853122": "Russi Taylor", "0927293": "Karl Wiedergott"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["An android son replaces Bart; Homer and friends are the quarry in Mr. Burns' hunting tournament; a witch turns townsfolk into their Halloween costumes.", "In Bartificial Intelligence, Bart falls into a coma after trying to jump into a swimming pool off a window ledge. Dr. Hibbert says that this coma is permanent, so the Simpsons get a robot for a son. Bart wakes up, only to be abandoned by Homer. He stays with some robots and becomes a robot himself, able to destroy the robot that replaced him. In Survival of the Fattest, Mr. Burns invites a bunch of people, including Homer, to a hunting party. But it turns into World's Most Dangerous Game when Burns starts killing everyone he can with his gun. Homer stays alive and Marge defeats Burns and Smithers with a frying pan. In I've Grown a Costume on Your Face, a witch turns Springfield residents into the costumes they were wearing at a party. Lisa, who is Albert Einstien, tries to solve everything. She finds that Maggie can turn them back to normal, being a witch. No one wants to be normal again, but Maggie turns everyone into pacifiers.—Anonymous", "In \"B.I.: Bartificial Intelligence\", the family replaces Bart, who is in coma, with a robot son, but when Bart wakes up he wants revenge on the robot. In \"Survival of the Fattest\", Mr Burns invites many of the townspeople to go hunting, but Mr Burns plans hunting the townspeople. In the end Homer is the last one alive, but for how long? In \"I've Grown a Costume on Your Face\", a witch turns everyone in Springfield into their costumed characters, and Maggie, being dressed as a witch and therefore becoming a witch herself, is the only one who can break the spell.—Emil Petersen", "After trying to jump into the pool from a window ledge, Bart is in a coma so the Simpsons family have to replace with a robot that Homer loves, however, when Bart wakes up, he takes revenge. Burns invites some men to a hunting party, only to know that Mr Burns is the one hunting them and Homer becomes the last one alive. A witch turns Springfield into their own costumes, since Maggie is dressed as a witch, she is the only one who can break the spell (and turn everyone into pacifiers)."], "genres": "N/A", "imdbID": "0701287", "rating": 7.3, "votes": 2007, "number_of_episodes": 848}