{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0170306": "Stephen Colbert", "0005360": "Lionel Richie", "0370788": "Pamela Hayden", "0534134": "Tress MacNeille", "0927293": "Karl Wiedergott"}, "geners": ["Animation", "Comedy"], "runtimes": ["20"],  "plot": ["Homer falls in love with private planes after taking a flight to Chicago with Mr. Burns. So Marge hires Homer a \"life manager\" to help him think positively and find a job that will allow him to fly for a living.", "Having saved Burns' life Homer is rewarded by a trip to Chicago on a private plane,serenaded by Lionel Richie. This gives him a taste for a better life and,thanks to a personal life coach,gets an interview for a high-flying job with the Rich Texan. Having failed the interview he still pretends to Marge that he is working but,exposed by Bart,chooses to come clean on a private plane...where the pilot collapses and Homer must fly them all to safety.—don @ minifie-1", "Both the episode and the season takes place two months after the movie, Homer has successfully saved Springfield from a fatal catastrophe and the town has been returning back to normal. Mr. Burns goes shopping at the Springfield mall after his mansion has been ransacked, during his trip to the mall, Mr. Burns finds a penny in the fountain and he tries to take it but he drowns in the fountain, Homer manages to save Mr. Burns and he is rewarded on going to a trip to Chicago. Homer begins to love flying first class and he doesn't want to leave the private plane. Marge hires a life coach to motivate Homer on succeeding with his life. Homer wears his bowling shoes to improve his life and his luck begins to change when he applies for a job with the Rich Texan. Unfortunately, Homer doesn't get the job because he doesn't know anything about copper tubing and he begins spending time at Krusty Burger. Bart notices his father at the burger joint and he tells his father that he should tell Marge what really happened. Homer decides to tell Marge by private plane but it doesn't go as planned when the pilot overdoses and he passes out. Homer is able to land the plane but it crashes into the ocean after he attempts to taxi it to the terminal. Homer apologizes to Marge for not being honest with her and she forgives him. Homer decides to go back to work at the power plant after learning the dangers of riding a private plane without experience."], "genres": "N/A", "imdbID": "1103798", "rating": 6.6, "votes": 1758, "number_of_episodes": 848}