{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0733427": "Harry Shearer", "0001288": "Kelsey Grammer", "0000279": "Hank Azaria", "0370788": "Pamela Hayden"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["After Krusty is found guilty of robbing the Kwik-E-Mart following Homer's eyewitness testimony, Bart and Lisa set out to prove his innocence.", "While shopping at the Kwik-E Mart, Homer is caught in the middle of an armed robbery. The suspect is dressed like Krusty the Clown, Bart's television idol. Homer confirms the identity and is arrested, tried and convicted (under the pretense that he was trying to recoup gambling losses). Bart is convinced that he is innocent, with Lisa's help, eventually deduces that someone was trying to frame him. Tying information together from news reports, their own knowledge and logical reasoning, Bart and Lisa expose Krusty's sidekick, Sideshow Bob as the culprit. Bob, it seems, had grown weary of being the butt of Krusty's physical gags and being part of an inane show, and with Krusty out of the way he could reshape the show into his more scholastic vision. Bob is arrested and swears revenge, while Krusty is freed.—Brian Rathjen <briguy_52732@yahoo.com>", "Bart's idol, Krusty the Clown, is under arrest. Homer is shopping at the Kwik-E-Mart to buy items for himself, but an armed robber who is dressed like Krusty robs the mart and runs with no one harmed. Bart, Lisa, and Maggie find out that Krusty is arrested, which makes Bart heartbroken. Krusty is placed into trial, but he says that he didn't do it. With Homer as a witness, he points to Krusty that he was the perpetrator, putting him in jail. Parents are having their kids put items of Krusty in a pile that will be burnt. With kids upset, Krusty's partner, Sideshow Bob, hosts the show and sees Bart unhappy in the audience and asks what he's down about. But Bart realized something: He noticed that Krusty had small feet and Sideshow Bob having big feet. In the tape of the robbery, Homer accidentally steps on the edge of his long feet. Bart accuses him and Bob confesses that he did it and hated him. With Krusty freed, kids are happy once again.—kevindklenke", "Krusty the Clown is accused, tried and convicted of robbing the Kwik-E-Mart, and Sideshow Bob takes his place as TV show host. Bart, however, believes that Krusty was framed. He enlists Lisa's help, and together they uncover the truth behind the robbery."], "genres": "N/A", "imdbID": "0701147", "rating": 8.3, "votes": 5557, "number_of_episodes": 848}