{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0733427": "Harry Shearer", "0000279": "Hank Azaria", "0000983": "Albert Brooks", "0744648": "Maggie Roswell"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["Homer takes the family camping, but it soon becomes a misadventure when they lose their equipment and Homer is mistaken for Bigfoot.", "Ned Flanders shows off his newly purchased (and monstrous) motor home to the Simpsons. In a fit of oneupmanship, Homer decides he needs one too. Homer's credit is very poor, but he wants that motor home, so he buys one whose oil is leaking and appears to be held together by chicken wire and duct tape. With their new motor home, Homer takes the family on an outing in the woods. Homer quickly loses his way and everyone bails from the motor home just before it tumbles into a large ravine. The family is forced to rough it the rest of the way. Maggie becomes separated from the family and takes refuge with a family of bears. Meanwhile, Homer and Bart lose their clothing and have to wear leaves. Homer quickly falls into a stream and becomes covered with mud. A couple staying in the woods, concluding that what they've seen is Bigfoot, takes a picture of Homer and sends it to a TV station. Soon, the woods are crawling with media representatives, hoping to get their own glimpse. A park ranger shoots Homer with a tranquilizer and he is taken to a laboratory for analysis. However, the results - either it's a below-average human or a brilliant beast, a German scientist says - are inconclusive.—Brian Rathjen <briguy_52732@yahoo.com>", "The Simpson's neighbor, Ned Flanders, shows his new RV he purchased. With Homer jealous, he decides he should buy one, too. After he purchases it, Homer decides to go on a camping trip with his family, worried. Homer accidentally wrecked the RV and it falls off a cliff. Homer and Bart decide to go find some food while Marge and Lisa set out shelter. Marge and Lisa think Maggie is with Homer and Bart, but she is lost and finds a pack of bears, teaching them how to do toddler things. Will the Simpsons survive?—kevindklenke", "The Simpsons go camping in their dilapidated RV, and problems arise when the RV is destroyed by falling off a cliff. The family are separated in the woods, where Maggie is cared for by bears and Homer (who has lost his clothes and is wearing a heavy coating of mud instead) is mistaken for a hideous Bigfoot-like monster."], "genres": "N/A", "imdbID": "0701228", "rating": 7.7, "votes": 5410, "number_of_episodes": 848}