{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0733427": "Harry Shearer", "0370788": "Pamela Hayden", "0168941": "Christian Coffinet", "0534134": "Tress MacNeille"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["Bart is sent to France on a student exchange program, where he's treated like a slave; an Albanian student with suspicious motives takes Bart's place in the family.", "Bart flushes a cherry bomb at school, nearly injuring Principal Skinner's mother, Agnes, in the process. An exasperated Skinner tells Homer and Marge that since expulsion would not do Bart any good, he's placing him in a foreign-exchange student program. Bart is sent to France, where his host family are unethical winemakers who plan to employ him as a slave.—Brian Rathjen <briguy_52732@yahoo.com>", "At school, Bart dumps a cherry bomb in one of the school's toilets, causing damage to the bathrooms. Principal Skinner gets a psychologist to see what to do with him. The psychologist finds an educational program in France for three months. Bart loves the idea and he is substituted with a boy from a foreign country. When Bart arrives in France, he meets with a guy who he thinks he's from the program. Bart finds out it was a scam and that the guy and his partner were secretly putting him as a slave. Meanwhile, the boy who was substituted also is secretly working for one of the country's air forces, and he goes back to his country and Bart comes back. The Simpsons find out that Bart can speak French, which makes him free and live happy with his family.—kevindklenke", "After Bart blows up a cherry bomb in the school toilets, Principal Skinner plans to put Bart into a student exchange program. Bart travels to France, where he is hosted by a pair of criminals and becomes a national hero when he exposes their plan to spike wine with antifreeze. Meanwhile, back in Springfield, the Simpsons host an Albanian student named Adil, who (unknown to the family) is actually a spy in search of nuclear secrets. Touched by Adil's interest in his work, Homer gives Adil the secrets he's after by showing him all over the nuclear plant."], "genres": "N/A", "imdbID": "0701232", "rating": 7.7, "votes": 5056, "number_of_episodes": 848}