{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0733427": "Harry Shearer", "0000279": "Hank Azaria", "0364860": "Jo Ann Harris", "0370788": "Pamela Hayden", "0490383": "Christopher Collins"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["Homer is forced to become a department store Santa when Marge spends the family's Christmas savings on removing Bart's tattoo.", "During Christmas at the Simpsons, Bart asks for a tattoo. Marge takes them to the mall to buy presents. Bart sees a tattoo parlor and lies about his age to get a \"Mother\" tattoo. Marge catches Bart while the tattoo parlor is working on it. Marge runs in and drags Bart out. She spends all the Christmas money on removing Bart's tattoo, and Mr. Burns doesn't give out bonuses. Homer then gets a job at the mall as Santa Claus. Bart goes to the mall and pulls off Homer's beard. Homer is then left without a job, and only gets paid $13.00. Will Christmas get any better for the Simpsons?—TnMovieFan2@aol.com", "Christmas time has come and the Simpsons have different ideas to spend their Christmas. Bart wants a tattoo, Lisa wants a pony, and Homer wants his Christmas bonus from work. But when his boss, Mr. Burns, announces that he will not give any Christmas bonuses to the employees, Homer tries to find ways to earn money for his family. But a Christmas miracle arrives when a new member joins the Simpsons family.—kevindklenke", "After Bart's tattoo removal, Homer's failure as a department store Santa, and a bad day at the dog track, Christmas prospects look dim for the Simpsons. But Homer seines the day and, with the help of Santa's Little Helper, blunders home with the best gift of all - something to share the family's love. And frighten prowlers.", "It's a tight Christmas for the Simpson's as Homer doesn't get his bonus, and the Christmas spendings saved up over the year by Marge has to be spent on removing Bart's tattoo. Will Homer pull through and deliver a Merry Christmas, or will his hairbrained schemes land the family in hot water?"], "genres": "N/A", "imdbID": "0348034", "rating": 8.1, "votes": 9645, "number_of_episodes": 848}