{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0001652": "John Ratzenberger", "0370788": "Pamela Hayden", "0534134": "Tress MacNeille", "0249283": "Chris Edgerly"}, "geners": ["Animation", "Comedy"], "runtimes": ["22"],  "plot": ["The 25th annual 'Simpsons' Halloween special includes an alternate dimension, a \"Clockwork Orange\"-style gang led by Moe and a visit from the Tracey Ullman-era Simpsons.", "On the annual spooktacular Halloween special, Bart and Lisa are transported to a demon-filled alternate universe after Bart reads a set of Aramaic symbols he finds on the underside of his desk; Moe's \"Clockwork Orange\"-style gang is disrupted when Dum (Homer) falls for a girl (Marge) who wants him to give up the thug life; and, in an homage to \"The Others,\" the Simpsons are visited by their former Tracey Ullman-era versions of themselves.—Jiilo_Kim", "Following an introduction in which the two aliens announce guest appearances by artistes, many of whom have refused to be in 'the Simpson's Treehouse of Horror stars with 'School Is Hell'. Having read an Aramaic rune Bart finds himself transported to Hell, where his deviousness makes him the star pupil and he graduates with honour having tortured Homer half to death. 'A Clockwork Yellow' is a brilliant Clockwork Orange parody in which Moe recalls his days leading his gang the Drugs until they were forced to become respectable though they end up by killing the guests at an 'Eyes Wide Shut' party. 'The Others' finds the family haunted by the ghosts of the earlier cartoon incarnation of themselves. Eventually the current family kill themselves with Homer choosing which of the two Marges he prefers before assorted versions of the family turn up at the door.—don @ minifie-1", "Bart goes to a new school that's in Hell. Moe leads a gang and their names are called, Dum, Leonard and Carlton and they call themselves \" A Clockwork Orange.\" The Simpsons family find that their house is haunted and the haunters are like their twins, but, with two incarnations of the Simpsons, there are millions of others."], "genres": "N/A", "imdbID": "3552792", "rating": 7.4, "votes": 1745, "number_of_episodes": 848}