{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0001650": "Michael Rapaport", "1070597": "The Weeknd", "0370788": "Pamela Hayden", "0534134": "Tress MacNeille", "0724656": "Kevin Michael Richardson", "1456471": "Kimberly Brooks", "0217221": "Grey DeLisle", "0246373": "Alex Désert", "0249283": "Chris Edgerly", "3536856": "Kelly Macleod", "4330012": "Tony Rodriguez"}, "geners": ["Animation", "Comedy"], "runtimes": ["22"],  "plot": ["Homer leads a rebellion of loser dads against the friendship between Bart and a famous kid influencer.", "Bart wants to have a pair of popular sneakers made by a young influencer, but Homer buys a pair of boot-legged shoes from his con-artist friend, Mike. When Bart tries to return the shoes, he learns that the shoes he got are fakes and Homer accidentally embarrasses his son in public. At home, Bart angrily calls his father out for being uncool and he begins to disown his father for embarrassing him. Orion gives Bart official Slipreme merchandise as an apology gift. Orion and Bart become fast friends, the two begin to hang out together and they design a sneaker for an upcoming release party. Meanwhile, Homer tries to prove to Bart that he can be cool and he starts wearing the Slipreme attire. Homer and his friends start to wear the attire, but their newfound popularity doesn't sit well with Bart or Orion. Before the release party can begin, Bart enlists Marge to prevent Homer and his friends from ruining the event. Marge arrives to remind Homer for who he truly is and he realizes that wearing street wear isn't his style. Homer guides his middle-aged friends to an aviation history museum. Homer and Bart reconcile, he purchases a pair of fake shoes, when Bart tries the shoes on they fall apart. Homer and Bart head to Krusty Burger. During the credits, Orion learns that he is an exact clone of his father, the two share an embrace.—dawsonpersi"], "genres": "N/A", "imdbID": "14458006", "rating": 6.4, "votes": 806, "number_of_episodes": 848}