{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0370788": "Pamela Hayden", "0534134": "Tress MacNeille", "0744648": "Maggie Roswell", "0853122": "Russi Taylor", "0908761": "Marcia Wallace"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["Bart and Lisa attend \"Kamp Krusty\" but it is nothing like they thought it would be; Homer's hair grows back and he loses weight while the kids are away.", "It's the last day of school and bart and Lisa wanna go to Kamp Krusty. While Lisa passes with all her positive grades Bart fails. But Homer allows him to go as the parents want the kids to go. While there excited the Kamp in reality it had nothing to do with Krusty and it was more like military school or hell. With the kids going crazy and taking over the Kamp. Krusty finally comes and reveals they paid him a dump truck of money to use his name. And Krusty brings them to Mexico.", "Bart and Lisa head to Kamp Krusty for the Summer, but instead of meeting Krusty, them and the other kids are put to work making crummy merchandise.—Tiff Banks", "Bart doctors his report card so that he can attend Kamp Krusty for the summer. Homer knows he needs to keep Bart at home but - so he can get him off his hands - sends him (along with Lisa) anyway. Bart and Lisa and all their friends are looking forward to a summer of camping, swimming, hiking and overall fun. But when they get there, they discover that camp director Krusty the Clown is nowhere in sight and that he has put someone named Mr. Black in charge. The camp turns out to be little more than a sweatshop, with the children forced to assemble substandard merchandise to be sold at cut-rate prices; when they aren't working, the youths are forced to endure grueling basic training-type activities. Mr. Black's camp counselors, the Springfield bullies (Dolph, Jimbo and Kearney), help keep order at the camp and feed the kids nothing but gruel. Lisa manages to smuggle a letter out of the camp calling for help, but when Mr. Black tries to pass off a drunken Barney as Krusty, Bart has had enough. He rallies his camp-mates together to stage a huge revolt, driving Mr. Black and the bullies away. Homer - who has lost weight and grown hair because of his stress-free, Bart-free summer - loses all the progress he made upon seeing Brockman's TV news coverage of the camp riot. A vacationing Krusty also sees the news report and, setting his priorities straight, rushes to the camp to apologize to the kids. He takes them to the happiest place on earth - Tijuana, Mexico!—Brian Rathjen <briguy_52732@yahoo.com>"], "genres": "N/A", "imdbID": "0701142", "rating": 8.5, "votes": 4530, "number_of_episodes": 848}