{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0000469": "James Earl Jones", "0908761": "Marcia Wallace", "0336064": "Doris Grau", "0370788": "Pamela Hayden", "0853122": "Russi Taylor"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["The family's job at Mr. Burns' country estate goes awry when Homer goes mad; Homer's attempt to repair a toaster results in inadvertent time travel; The school staff turn cannibalistic.", "The Simpsons get hired by Mr Burns to take care of his country-side mansion for the winter where Homer starts going mad. In the second segment, Homer's toaster breaks and in trying to fix it, he inadvertently made it into a time-machine in which cause terrible consequences. In the third segment, Bart and Lisa's teachers start killing and eating the students in the school when they misbehave.", "The Simpsons family go to take care of Mr Burns' country-side mansion where literally goes insane. Homer tries to fix the toaster but accidentally turns it into a time machine. Every day in the school cafeteria, kids, one by one, are mysteriously vanishing when the real people behind all this is the school teachers.", "In \"The Shinning\", Homer becomes crazy when he can't have any beer or watch TV. The Simpsons family try to protect themselves from him with Bart's \"Shinning\". In \"Time and Punishment\", Homer gets his hand stuck inside a toaster and ends up going back in time, which doesn't turn out great. In \"Nightmare Cafeteria\", Bart and Lisa find out the school's staff are cooking and eating children.—UM", "The Simpsons are employed on Mr. Burns's country estate-and Homer goes insane. And act two, Homer's attempt to repair a toaster lead him repeatedly back into the past-and he inadvertently changes the future. And the final act, the school cafeteria turn to an unusual source of food-and schoolchildren start mysteriously disappearing.—Tiff Banks"], "genres": "N/A", "imdbID": "0701281", "rating": 9.2, "votes": 5731, "number_of_episodes": 848}