{"cast": {"0144657": "Dan Castellaneta", "0001413": "Julie Kavner", "0004813": "Nancy Cartwright", "0810379": "Yeardley Smith", "0000279": "Hank Azaria", "0733427": "Harry Shearer", "0367005": "Phil Hartman", "0000469": "James Earl Jones", "0370788": "Pamela Hayden", "0534134": "Tress MacNeille", "0648643": "Jack Ong", "0853122": "Russi Taylor"}, "geners": ["Animation", "Comedy"], "runtimes": ["30"],  "plot": ["While the kids become stranded on a desert island, Homer attempts to cash in on the Internet.", "Against Marge's wishes, the family stays up for a movie adaptation of \"Noah's Ark,\" which turns out to be a very long (and bombastic) Troy McClure adaptation. The movie runs all night, and a very tired Bart and Lisa head off to school while Homer calls in sick, claiming that his family came down with smallpox. At school, Bart and Lisa are participating in a Model United Nations Club meeting (which doesn't go very well) before leaving for an excursion. During the trip, the children's antics cause an accident; Otto was trying to brake to avoid a steep hill, and when he finally is able to slam on the brakes, the juice from a grapefruit (which had been lodged beneath the brake pedal) squirts into Otto's eyes, blinding him and causing him to steer the bus off a high suspension bridge. The bridge plunges into a river. Otto swims away \"for help,\" but is swept away by a tidal wave; he is later rescued by Chinese fishermen. The schoolchildren, meanwhile, escape the bus and are washed ashore on a desert island. There, Bart puts up his bravado and insists that survival on a desert island is just like on television, but harsh reality sets in and the children soon realize they have no survivalist skills. Eventually, Bart is able to secure a cooler full of snack food items left in the bus; the hungry children chow down, but Lisa demands they ration the food (since it could be days before they are rescued). However, everyone awakens the next morning to discover the rations are gone and - due to circumstantial evidence - immediately suspect Milhouse. A trial is immediately held, where Milhouse insists a monster was to blame. Without evidence to confirm his other classmates' suspicions, Bart acquits Milhouse, making everyone else (except for Lisa) very angry. The others chase after the three and they corner them in a cave ... where the monster - which turns out to be a wild boar - lurks. On one of its tusks is an empty bag of potato chips, which immediately lets Milhouse off the hook. The children later kill the boar and eat it; Lisa, since she is a vegetarian, forces herself to eat the slime that was the boar's food source. At the end, a narrator (James Earl Jones) says the children are eventually rescued ... \"by, let's say, Moe.\" In the subplot, Ned Flanders' mail gets mixed in with the Simpsons, and one of the letters is for \"Flandcrest Enterprises,\" which turns out to be an Internet business Ned and Maude have started (they sell religious book rugs). Homer sees profit potential and decides to start his own online business, Compu-Global-Hyper-Mega-Net. His first customer is Comic Book Guy ... and the only one, as it turns out, since Bill Gates and two goons immediately \"buy out\" Homer by trashing his entire living room!—Brian Rathjen <briguy_52732@yahoo.com>"], "genres": "N/A", "imdbID": "0701085", "rating": 8.2, "votes": 2967, "number_of_episodes": 848}