{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0061106": "Robert Bathurst", "1470271": "Kate Bowes Renna", "1279692": "Greg Hobbs", "1164098": "Jamie de Courcey", "0446300": "Marcus Kelly", "1395602": "Allen Leech", "3505561": "Gerard Mcdermott"}, "geners": ["Drama", "Romance"], "runtimes": ["48"],  "plot": ["O'Brien and Thomas continue their efforts to frame Bates, Mary falls in love with Matthew, and Sybil is injured in a political disturbance and Branson is blamed.", "May 1914. Encouraged by politically aware chauffeur Tom Branson, the socially conscious Lady Sybil espouses politics as a means of aiding equality for women and the lower classes, to her father's anger. At a political meeting she is injured in a scuffle and rescued by Matthew. Lady Mary tells her mother she has received a marriage proposal from Matthew, but tells her mother she feels she should come clean about Kemal to him. Rumours about this indiscretion are now rife and Cora tells her mother-in-law how she helped Mary move the body. Edith continues to see more and more of Sir Anthony whilst O'Brien and Thomas continue to persecute John. They tell Carson they saw him steal wine and get Daisy to support them. However, Daisy does the decent thing and admits she was put up to it. Bizarrely, John, though he knows Thomas to be the wine thief, offers no explanation, confessing to being a former alcoholic and offering his resignation.—don @ minifie-1", "Lady Sybil's political interests continue to grow and she attends a Liberal rally for the upcoming by-election. Her father hits the roof when he hears of it. Carson receives a letter about Mary and discreetly raises the contents with Lady Cora. Similarly, Lady Violet receives information from her daughter in London forcing Cora to admit what happened with the young Turkish diplomat. Thomas and O'Brien openly accuse John Bates of stealing the wine Thomas took and draw Daisy into their perverse little scheme. Lying to her father about her intentions, Lady Sybil attends the results of the by- election but is rescued by Matthew when the mob turns violent. Lady Edith is asked out by Sir Anthony and Mary realizes she is quite in love with Matthew but decides that if she is going to marry him she will have to tell him about Kemal Pamuk.—garykmcd", "Fearing Bates may still denounce Thomas a wine thief, he and O'Brien suggest it's Bates, which Carson's investigation doesn't conclude, Daisy having withdrawn her lie to help adored Thomas, but Bates still expects to be fired for confessing his former theft jail sentence. Driver Tom Branson enjoys fellow 'socialist' Sibyl to an indoor political meeting, but fears for his job as the earl, who found out, forbids her and she still tricks him to drive her on false pretenses to a public one which ends in a brawl, during which she's knocked out and Matthew helps rescue her to be nursed discretely by Isobel. Violet bitterly blames Cora for the Turkish debacle now a rumor is going round and may wreck the family's reputation, but reconsiders there was no alternative to damage control to save Mary, who now is attracted to Matthew but feels she can only consider marriage after confiding the Kemal crisis. Learning in confidence William's mother is gravely ill, Mary nudges him to to take a few days off and visit her, surprised he would prefer a stable job to domestic service.—KGF Vissers"], "genres": "N/A", "imdbID": "1617365", "rating": 8.5, "votes": 2441, "number_of_episodes": 52}