{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0061106": "Robert Bathurst", "2688867": "Colin R. Campbell", "0236413": "Kevin Doyle", "0302338": "Bernard Gallagher", "0932017": "Dean Williamson"}, "geners": ["Drama", "Romance"], "runtimes": ["49"],  "plot": ["Bates sees Thomas stealing a bottle of wine, the footman tries to frame him for petty theft, and Mrs. Crawley tries to convince the Dowager Countess to surrender her annual entitlement prize for best bloom in the village.", "August 1913. O'Brien and Thomas continue to spread their malice, ensuring that Lady Edith learns from Daisy where Kemal died and attempting to frame John Bates for the theft of a snuff-box though Anna, clearly fond of John, ensures the plan backfires on them. Thomas's gossip also discredits Lady Mary's eligibility as a bride and the family must entertain the middle-aged Sir Anthony Strallen as a prospective husband. Mary is bored by him and it brings her closer to Matthew but Edith seems genuinely interested in him. Mrs. Patmore, the cook, must accept that her eyesight is failing and Lady Sybil continues to encourage Gwen in her secretarial applications whilst Isobel actually teaches Lady Violet some altruism at the annual produce show.—don @ minifie-1", "Rumors about Lady Mary's character are circulating in London as news of her nighttime encounter with the young Turkish diplomat begin to spread. It's all thanks to a letter Thomas the footman has written to a mate who in turn has passed it on to his employer. Thomas is worried after John Bates sees him taking a bottle of wine from the pantry. O'Brien suggests they need to neutralize him and set him up to be accused of theft. Mrs. Patmore's poor eyesight causes a major problem when she uses salt instead sugar for the desert. It's also time for the annual Downton Village flower show where Lady Violet, the Dowager Countess, always seems to win the prize for best bloom, something Isobel Crawley takes issue with. Sibling rivalry between Mary and Edith may have greater implications.—garykmcd", "Thomas realizes Bates saw him with a stolen bottle of wine from the butler's pantry, so Thomas and O'Brien set Bates up as apparent thief by hiding a historical snuff box from the earl's collection. Bates smells the rats but decides against turning the tables on the now widely unpopular conspirators. A letter from Thomas to a fellow footman must have started the rumor about the Turkish's diplomat died in Mary's bed, for now discretely. It is discovered after a salted dessert that grumpy cook Patmore constantly blames Daisy because of her deteriorating eyesight. When Sibyl aptly entertains at dinner middle-aged Sir Anthony Strallen, whom Mary as a prospective husband, she jealousy ties to steal him back, thus sabotaging her own rapprochement to Matthew Crawley. Isobel campaigns to end dowager Violet's annual victory in the village festival's best bloom competition over Mr. Molesley's senior father William's roses.—KGF Vissers"], "genres": "N/A", "imdbID": "1617364", "rating": 8.4, "votes": 2440, "number_of_episodes": 52}