{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0236413": "Kevin Doyle", "0271499": "Bill Fellows", "4120742": "Elizabeth Hill", "1395602": "Allen Leech", "0716122": "Martin Reeve", "0730191": "David Robb", "4355300": "Peter Agnelli", "5044650": "Andy Evason"}, "geners": ["Drama", "Romance"], "runtimes": ["47"],  "plot": ["Mrs. Hughes is reunited with an old beau, now a widower proposing marriage, and the Countess hires Matthew Crawley to see if the will can be broken and disagrees with his mother on a diagnosis.", "May 1913. A fair comes to the village and here Mrs. Hughes meets up with an old flame, Joe, who once asked her to marry him and does so again. Despite being gay, Thomas escorts Daisy to the fair purely out of spite as he knows William is fond of her. The gesture is not lost on either John Bates or Mrs. Hughes. Gwen is not called for interview for the secretarial post but Sybil agrees to support future applications. A new chauffeur, Tom Branson, arrives. He is well-read and politically aware. Having got one over on Isobel regarding a medical diagnosis, Violet attempts to talk Robert out of a need for an arranged marriage but fails. Mary, seeing herself as no more than a commodity, unburdens herself to Matthew and they get a little closer.—don @ minifie-1", "Lady Violet, the Dowager Countess, continues to press for a solution to Lady Mary's inheritance. At her request, Matthew reviews the situation and reports to his cousin Lord Grantham that he can find no way out of their dilemma. Grantham tells his daughter Mary that her only hope is to marry Matthew, something she will not do. A new chauffeur, Tom Branson, comes to Downton Abbey. A self-described socialist whose interests are history and politics, he encourages Lady Sybil to pursue her own interests, particularly women's rights. Most of the staff take the opportunity to attend the village fair. Thomas asks Daisy to go with him but it's only to spite William, who is in love with the girl. Mrs. Hughes runs into an admirer from her youth, Joe Burns. She turned down his marriage proposal once long ago but he is now a widower and asks her again.—garykmcd", "The dowager actually puts the 'unfair' loss of Mary's inheritance to Matthew, the actual heir, who reports to the unsurprised earl he fears she won't accept his legal finding of no hope, Cora insists her daughter should consider marriage instead, Robert sees himself as guardian of the dynastic inheritance bound to the peerage, not true estate owner. The Irish new driver Tom Branson pleasantly surprises the earl, being well-read, but also encourages feminist lady Sibyl, being a non-revolutionary socialist, who in turn pushes maid Gwen to apply for a secretarial job. Clueless Daisy greedily accepts gay Thomas's invitation to go to the Downton fair together rather then poor junior footman William. Isobel feels Violet shouldn't win the Gratham cup in the festival's gardening competition every year, favoring Mr. Molesley's father Joseph's roses instead, but miss-diagnoses the valet's hand rash and calls rank on a nurse to get the false medication, while Violet realizes the menial cause spot-on. Farmer Joe Burns, now widower, proposes again to Mrs. Hughes, who is flattered but feels it's too late.—KGF Vissers"], "genres": "N/A", "imdbID": "1617363", "rating": 8.1, "votes": 2511, "number_of_episodes": 52}