{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0061106": "Robert Bathurst", "0094039": "Samantha Bond", "0236413": "Kevin Doyle", "0370343": "Richard Hawley", "0446432": "Ian Kelly", "1395602": "Allen Leech", "0517910": "Christine Lohr", "0571610": "Sean McKenzie", "1981245": "Brendan Patricks", "0730191": "David Robb", "0920993": "Jane Wenham", "2952107": "Catherine Balavage", "3863069": "Jefferson King"}, "geners": ["Drama", "Romance"], "runtimes": ["64"],  "plot": ["July 1914. Mary learns it was Edith who informed the ambassador know about Pamuk's death, Cora announces her pregnancy, and Thomas and O'Brien hatch new slanders against Bates as war clouds loom.", "July 1914. In London former suitor Evelyn Napier assures Lady Mary that it was Edith, not he, who spread gossip about her and Kemal. Mary counters by wrecking her sister's marriage plans with Sir Anthony. Robert is reluctant to dismiss John even though O'Brien and Thomas have obtained a letter claiming that he stole from a previous employer. Anna accompanies Mrs. Patmore to London for eye tests, resulting in corrective surgery and, whilst there, discovers that John took the blame for the theft for his ex-wife Vera, a fact which Robert is pleased to hear. Thomas, fed up at his failure to get John sacked, and sensing war on the way, joins the Army Medical Corps whilst Sybil finally gets Gwen her secretarial post. Cora is pregnant, a fact which puts the proposed marriage between Mary and Matthew in doubt, should the baby be a son and heir. However, thanks to O'Brien leaving a bar of soap on the floor, Cora slips and miscarries. All the staff except O'Brien cheer William on as he beats Thomas up for his unfeeling remarks on the loss. Matthew nonetheless feels that the engagement was only an act of pragmatism likely to be altered if an heir had been born and decides to leave Downton Abbey.—don @ minifie-1", "July 1914. The family returns to Downton Abbey from the London house, though Mary has stayed behind with her aunt for a few weeks. While there, she learns from Evelyn Napier of Edith's betrayal and of her letter to the Turkish Ambassador. Lady Cora is pregnant and there is hope that the family might yet have a son and heir but Matthew realizes just how insecure his position might be. When Mary doesn't give Matthew her answer on her return as promised, he assumes it's because his prospects may change should Lady Cora give birth to a boy. Tragedy strikes, however, when, thanks to O'Brien, Lady Cora has a fall. Thomas and O'Brien get information about Bates which they pass on to Carson. Anna refuses to believe Bates was a thief and while in London with Mrs. Patmore, who is there for an eye examination, traces his mother, who tells her the truth of what happened. At the family's garden party, Mary exacts her revenge on Edith and, dismayed at his own status in the family, Matthew decides to leave Downton.—garykmcd", "July 1914. Mary's former suitor, diplomat Evelyn Napier, discretely informs her the Pamuk story is out, and credible, as it started with a letter to the Turkish ambassador from Edith. Carson considers Thomas's thieving proven and consults the earl on when to dump him, but as war is in the air after Archduke Ferdinand's assassination, Thomas gets Dr. Carson to help him volunteer for a medical unit and taunts mourning junior footman William, who physically attacks him. Mr. Bromidge, whose firm comes to install telephones at Downton, is persuaded by Sybil to interview and hire maid Gwen as secretary. Matthew's status as heir presumptive is uncertain, now, after Cora announces her pregnancy. Mary fails to accept his proposal, as advised even by Violet, who feels she can still renege if it's a boy, so he concludes she's insincere. Overhearing Cora discussing advertising for a new lady's maid for Violet, O'Brien assumes she's to be dumped and causes Cora to fall and have a miscarriage. Bates expects to be fired as an ex-con, but Anna learns from his mother the real thief of regimental silver was his wife Vera, who ran. Cook Patmore receives eye treatment in London, so Violet's cook stands in, but Daisy is convinced to sabotage her to prevent the possibility of a permanent replacement. At the earl's garden party, Thomas gets his career offer, Matthew decides to leave Downton, and Mary's lies to trick Sir Anthony Strallan and causes him to stop courting Edith.—KGF Vissers"], "genres": "N/A", "imdbID": "1617366", "rating": 8.8, "votes": 2556, "number_of_episodes": 52}