{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "1214435": "Charlie Cox", "0185329": "Jonathan Coy", "0349888": "Lionel Guyett", "0419771": "Jonathan Jaynes", "1599985": "Perry Millward", "0790382": "Helen Sheals", "4355300": "Peter Agnelli", "3139026": "Filippo Delaunay", "6065260": "John Whitby"}, "geners": ["Drama", "Romance"], "runtimes": ["66"],  "plot": ["April 1912 . The family and staff of Downton are shocked when they find that the heir to the title and fiancé of the Earl's daughter Mary perished on the Titanic, and the Earl hires a crippled army comrade as valet.", "April 1912:- The heir to the title of Earl of Grantham, long time inhabitant of Downton Abbey, perishes on the 'Titanic'. Robert, the benevolent current earl, owes his wealth to his American wife Cora but they have only three daughters, who cannot inherit by law, so another heir must be found by marrying off Mary, the eldest girl. The Duke of Crowborough is a possibility but he is a closet gay who only has eyes for Thomas, the handsome but obnoxious footman, and soon departs. Robert's mother, the dowager, and Cora decide that the next best candidate is Matthew Crawley, a distant cousin, but Cora knows that the spirited Mary will not be happy with their choice. Downstairs there is also unrest as Thomas is passed over for promotion to valet in favour of Robert's batman from the Boer War, John Bates, who now limps due to a war wound. Along with Cora's maid Miss O'Brien, Thomas schemes to discredit Bates in the eyes of butler Carson and forces his resignation but Robert intervenes and keeps him on. Thomas vents his anger on second footman William, but he has an ally in the sensible housekeeper Mrs. Hughes.—don @ minifie-1", "When the RMS Titanic sinks in April 1912, Robert Crawley, the Earl of Grantham, and his wife Lady Cora learn that his cousin and male heir who would have eventually inherited the title perished along with his son. A marriage had been arranged with Robert's daughter Mary and now the family must find a new heir for the family home and fortune. After a young Duke decides Mary is unsuitable - the fact she will not inherit is the main stumbling point - Cora and her mother-in-law the Dowager Countess plot to have Mary marry the new heir, a third cousin named Matthew Crawley. Below stairs a new valet, John Bates arrives. He and the Earl of Grantham served together in the Boer War and the fact that Bates is lame and uses a cane to get about raises more than a few eyebrows. There's also a bit of ill-feeling as first footman Thomas had hoped to be promoted to the valet position. He begins to spread rumors that Bates can't do the job and Carson the butler decides that he just won't do.—garykmcd", "April 1912. The servants at Downton Abbey are busy preparing breakfast for Robert Crawley, the Earl of Grantham, and his family. The morning paper arrives, announcing the loss of Titanic. It is followed by a telegram, informing Lord Grantham that Patrick Crawley, the son of his first cousin, was on the sinking ship. The loss of Patrick means the loss of Downton Abbey for Robert and his family. The castle can only be inherited by a male heir, but Robert has only three daughters. Mary, the eldest of them, was going to marry Patrick, thereby securing the proprietary for the family. Now the estate has to be transferred to Robert's third cousin, Matthew Crawley. In the midst of all this a new valet, John Bates, arrives. He and Lord Grantham fought together in the Boer War, and he is hired despite being limp. The other servants find him unfit for the work, and especially the footman Thomas and the lady's maid O'Brien are determined to get rid of him. Robert vacillates, but decides to let him stay.—Maths Jesperson {maths.jesperson1@comhem.se}", "It is 1912 in the great house of Downton Abbey. Robert Crawley, the 7th Earl of Grantham, is shocked to learn that his heir, Patrick Crawley, presumably drowned after the Titanic sank. Cora Crawley, the Countess of Grantham and Violet Crawley, the Dowager Countess of Grantham, discuss who will inherit. As the family mourns, there is a new problem downstairs, as John Bates, the new valet for Lord Grantham, arrives. Ever since Bates's arrival, Thomas, the first footman/substitute valet, has had a rivalry in his mind with Bates. So does Miss O'Brien, Cora's maid. But, there is a question that remains: Who is the new heir?"], "genres": "N/A", "imdbID": "1608844", "rating": 8.3, "votes": 3518, "number_of_episodes": 52}