{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0236413": "Kevin Doyle", "0349888": "Lionel Guyett", "0378237": "Nicky Henson", "0640758": "Fergus O'Donnell", "0730191": "David Robb", "0764700": "Cathy Sara", "1173511": "Andrew Westfield", "4355300": "Peter Agnelli"}, "geners": ["Drama", "Romance"], "runtimes": ["47"],  "plot": ["September 1912. The new legal heir to Downton, lawyer Matthew Crawley, arrives with his mother, Isobel, to live on the estate. However, they are resented as usurpers and interlopers by both upstairs and downstairs.", "September 1912. Designated heir Matthew Crawley and his mother Isobel arrive and move into a house in the grounds of Downton Abbey but Matthew is uncomfortable with having servants and is not keen on an arranged marriage - something he has in common with Lady Mary. Robert's mother Violet looks down on them as they are not from her class - Matthew is a working solicitor and Isobel a trained nurse and doctor's widow, who nonetheless impresses when she helps at the local hospital and saves the life of one of Robert's tenants. Cora upbraids the two nastiest servants, O'Brien and Thomas, for sneering at the Crawleys but impresses upon Mary the financial need for the marriage. Carson is blackmailed by Grigg, a man with whom he once had a music-hall act, but Robert takes his part and sees Grigg off. Whilst Carson feels foolish for having a less-than-aristocratic past, he is supported by Bates and the two men become friends.—don @ minifie-1", "The new heir to the Grantham estate and title, Matthew Crawley, arrives at Downton Abbey and takes up residence on the estate. Matthew realizes that he's there to have one of Lord Grantham's three eligible daughters thrown at him in the hopes of arranging a marriage. He and Mary don't quite hit it off. Matthew's mother Isobel takes an interest in the local hospital and would like to contribute. She questions Doctor Clarkson's methods. For all that she would like the family fortune secured, the Dowager Countess is quite vocal in her dislike of the new heir and his middle-class ways. Below stairs, Carson the butler is acting strangely and, as it turns out, is trying to keep his past from being exposed.—garykmcd", "Matthew Crawley, the new heir of Downton Abbey, arrives with his mother to Crawley House, close to the castle. The Dowager Countess and her daughter-in-law Cora haven't found any legal way to secure Downton Abbey for their own family, so now they are going to try the matrimonial way instead. Their plan is to get Matthew married to Cora's oldest daughter Mary, but Mary resists this idea vehemently. Carson, the butler, receives a letter from a former associate, Charles Grigg, who tries to blackmail him. Grigg turns up at Downton Abbey. He reveals that he and Carter once were known as The Cheerful Charlies, doing a double act in the halls. Carter is ashamed, but the Earl, Robert Crawley, dismisses Grigg. Matthew's mother, Isobel Crawley, was trained as a nurse during the South African war. She visits the small collage hospital run by the Crawley family, where she convinces Dr. Clarkson to try a modern treatment method to save the life of a young farmer. The Dowager Countess, being the president of the hospital, tries to stop this, but her son, the Earl, appreciate Isobel's initiative, and makes Isobel the chairman of the board.—Maths Jesperson {maths.jesperson1@comhem.se}", "Manchester lawyer Matthew Crawley, the new heir of Downton Abbey, arrives in September 1912 with his mother Isobel, taking up residence in Crawley House, appended to the castle, mistrusting the antiquated aristocracy and unwilling to be waited on by staff, especially valet Joseph Molesley, who thus feels miserably superfluous until the earl justifies this class system aspect. Dowager Violet and countess Cora make no progress in seeking legal alternatives for the succession earl Robert may not even sanction, so they hope to match his daughter Rose to Matthew, but neither accepts being arranged or admits liking the other. Former Boer war nurse Isobel talks over Dr. Clarkson to try a novel therapy for cardiac-suffering young farmer John Drake otherwise doomed within days, ultimately resulting in memorial hospital patron Robert appointing her board chair above staunch conservative Violet. Butler Carson fails to hide being blackmailed by his once variety act partner crook Charles Grigg, whom the earl disposes of with carrot and stick. Senior footman Thomas Barrow looks after greenhorn William Mason while charming the kitchen girls.—KGF Vissers"], "genres": "N/A", "imdbID": "1617361", "rating": 8.2, "votes": 2808, "number_of_episodes": 52}