{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "3310211": "Rose Leslie", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0349888": "Lionel Guyett", "3772243": "Theo James", "0605943": "Roger Morlidge", "1981245": "Brendan Patricks", "0790382": "Helen Sheals", "1173511": "Andrew Westfield", "4355300": "Peter Agnelli"}, "geners": ["Drama", "Romance"], "runtimes": ["47"],  "plot": ["Gwen's ambitions to leave service and become a secretary are discouraged, Bates takes painful steps to overcome his limp, and a dashing Turkish diplomat visiting Downton seems to work his charms on everyone - especially Mary.", "March 1913. Gwen, one of the maids, has bought a typewriter and has applied for a secretarial post. Most of the staff are dismissive of her aspirations but the family - except Violet, of course - are supportive, and youngest daughter Sybil offers to supply a reference. Evelyn Napier, considered an eligible catch for Mary, arrives for the hunt, bringing his handsome friend Kemal Pamuk, a Turkish diplomat, who throws himself at her. He goes to her room at night for sex, during which he dies of a heart attack. Mary, Cora, and head housemaid Anna return the body to his room and agree to say nothing but are seen by Daisy the kitchen maid. The gruesome twosome of O'Brien and Thomas are also suspicious. Matthew spends a delightful day with Edith, the middle daughter, while Mrs. Hughes literally helps Bates out of a painful situation and they become friendly.—don @ minifie-1", "Lady Cora encourages daughter Mary's romance with Evelyn Napier, son of a Marquis, who will come to stay with them for the hunt. As Mary has rejected cousin Matthew Crawley, the Dowager Countess encourages the match with all haste, recognizing the need to get her settled before the bloom wears off. Napier arrives with a handsome young Turkish diplomat, Kemal Pemuk, to whom Mary takes an immediate liking. Late that night he makes his way to Mary's bedroom but there is a surprising outcome. Meanwhile, Lady Edith offers to show cousin Matthew some of the local churches. Below stairs, Gwen has been taking a correspondence course in typewriting and shorthand. She aspires to secretarial work which leads to a division of opinion among the staff. Bates meanwhile takes steps to correct his limp.—garykmcd", "The handmaid Anna finds out that her roommate Gwen has a typewriter hidden in their room. Gwen reveals that she is following a correspondence course in typing and shorthand, because her dream is to leave serving and become a secretary. Lady Mary tells her mother Cora that Evelyn Napier, Lord Brankesome's son, is coming for a hunt together with his friend Kemal Pamuk, an attaché at the Turkish Embassy. This prompts Cora to invite the two young men to stay at Downton Abbey overnight. When the companions arrive to the hunt, Mary is immediately infatuated by Pamuk, and ride alongside him. At the same time her sister Edith is showing their cousin Matthew some local churches. She tries to lead their conversation into personal matters, but he is only interested in historical facts. In the night the valet Thomas shows Pamuk the way to Mary's room, where Pamuk seduces Mary. He gets a heart attack and dies in her bed. To avoid a scandal Mary, her mother Cora and the handmaid Anna carry his dead body to his own room. The handmaid Daisy happens to see this, but says nothing.—Maths Jesperson {maths.jesperson1@comhem.se}", "The earl host a hunt party, wherefore Lord Brankesome's son, diplomat Evelyn Napier, stays at Downton with a delicate negotiations counterpart, Turkish embassy attache Kemal Pamuk, who flirts with Rose and blackmails assigned valet Thomas, who mistook the handsome oriental for a fellow gay, to help him sneak into Rose's room, only to have a fatal heart attack and be discretely returned to his room by the assorted ladies. Matthew missed the hunt with Edith, who eagerly volunteered to show him around the local churches and regrets his interest is truly just for art, and news about Rose. Bates hopes to correct his bad leg using a hand-crafted iron stretching apparatus, but the painful injuries become impossible to bite and hide. Carson scolds handmaid Gwen for hiding a typewriter, but other staff and family except the dowager encourage her to aim at a secretarial job.—KGF Vissers"], "genres": "N/A", "imdbID": "1617362", "rating": 8.4, "votes": 2738, "number_of_episodes": 52}