{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "3018580": "Zoe Boyle", "2168706": "Daniel Boyarsky", "4676621": "Gwendolen Chatfield", "4676915": "Rosie Jones", "0167403": "Jeremy Clyde", "0236413": "Kevin Doyle", "0448204": "Maria Doyle Kennedy", "0360626": "Richard Hansell", "1395602": "Allen Leech", "1044562": "Peter McNeil O'Connor", "0730191": "David Robb", "1798528": "Stephen Ventura", "4355300": "Peter Agnelli", "2541424": "Graham Bandy", "4924191": "Greg Bennett", "5196781": "Robert Clayton"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["After Bates' mother dies, he hopes his inheritance will buy him a divorce and allow him to marry Anna, Matthew announces his engagement to Lavinia Swire, and Sybil gets involved in the war effort.", "November 1916. Matthew is fighting in the horrific Battle of the Somme but at Downton Robert, given a courtesy title as head of the local yeomanry but deemed too old to fight, and William, forbidden by his father to enlist, feel frustrated as white feathers are given to non-combatants. Sybil also feels useless and goes to York for nursing training whilst Mary hides her disappointment when Matthew, home on leave, brings his betrothed, Lavinia Swire, to meet her. She nonetheless sees him off, giving him her lucky mascot, as he returns to the fighting, Back in the trenches he meets Thomas, sick of the war, who deliberately gets himself wounded. John returns from his mother's funeral, hoping to buy off his greedy wife Vera with his inheritance and marry Anna. However, now that he has money, Vera turns up and threatens to expose Anna's part in Mary's indiscretion with the Turk Panuk unless he leaves with her immediately - which he does. Fortunately a suspicious Mrs. Hughes has overheard them and gets Carson to put Robert in the picture without exposing Mary. Unaware of this, a sorrowful Anna is comforted by Ethel, the starstruck new maid who is felt by the other staff to have ideas above her station.—don @ minifie-1", "It's 1916 and the war is having an effect on everyone. Matthew Crawley is an officer at the front but comes home on leave where he not only reconciles with the rest of the family and with Mary in particular, but also introduces everyone to his fiancée Lavinia Swire. Robert Crawley is made Lord Lieutenant of the area and is disappointed that his appointment as colonel of a local regiment is an honorary post and that he will not actually be sent to France. Lady Sybil is desperate to contribute to the war effort and Isobel arranges for her to take a nurse's training course in York. Below stairs, John Bates is away attending to his mother's funeral. He returns with good news for Anna: his mother's estate was larger than anyone thought and he's now certain that he will be able to buy off his wife Vera and get a divorce. Unfortunately, Vera comes to Downton Abbey with something considerably different in mind. O'Brien relentlessly harasses a new new maid and the chauffeur tells Sybil how he feels about her. William the footman has been forbidden by his father to enlist and he must face the taunts of those who think he is shirking his responsibility.—garykmcd", "After serving in the trenches hell at the Somme, Mathew is back on leave with prospect for a temporary staff post in England, while Thomas finds his medical corps duties as stretch-bearer so infernal, he seeks to be repatriated due to injury by deliberately exposing himself to enemy fire. Yet healthy William is frustrated not to be drafted and feels almost deserving the white feather handed by headless girls at a Downton hospital benefit for not volunteering at his father's request, immediately defended by Lord Lieutenant earl Robert, who feels discarded as Yeomanry 'toy soldier' commander and hopes a regimental command will mean front posting. Carson must do with dwindling staff and new maid Ethel is foolishly 'pranked' by O'Brien, even causing an incident at a grand dinner. Sibyl takes a York nursing course but Matthew arrives with his middle-class fiancee Lavinia Swire, so Mary decides against a last attempt to hook him up. Bates expects to pay off his wife Vera to divorce with his mother's inheritance, but she arrives in Downton to blackmail him to resign and leave with her, the earl only learns after his departure that was to prevent the Pamuk incident becoming public.—KGF Vissers"], "genres": "N/A", "imdbID": "1821819", "rating": 8.5, "votes": 2493, "number_of_episodes": 52}