{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0236413": "Kevin Doyle", "1263496": "Howard Gossington", "1395602": "Allen Leech", "0517910": "Christine Lohr", "1770860": "Daniel Pirrie", "0730191": "David Robb", "4425912": "Nicholas Blatt", "5626447": "Laura Jeanne", "2903496": "Giles Spencer"}, "geners": ["Drama", "Romance"], "runtimes": ["53"],  "plot": ["Matthew and William are missing in France, the mounting tensions between Cora and Isobel result in Isobel's volunteering for France, Bates returns to Downton, and the servants open a soup kitchen for unemployed veterans.", "The simmering dispute between Isobel and Lady Cora comes to a head. When Isobel learns Cora has re-arranged the meal times for the servants and the work schedules for the nurses without consulting her, she suggests that if she is not to have a meaningful role, she will leave. Cora tells her that may be a good idea and Isobel heads to France. With Isobel away, her servants try to keep themselves busy. Her cook takes to feeding unemployed ex-servicemen but O'Brien, always bent on causing trouble, it seems, tells Lady Cora but she doesn't quite get the reaction she was expecting. Robert meanwhile learns that Bates is working in a nearby pub and pays him a visit. Branson the chauffeur tells Lady Sybil that he is in love with her and he will only leave when she is ready to leave with him. Lady Mary decides that she will marry Sir Richard Carlisle. When housekeeper Mrs. Hughes finds Ethel in bed with one of the patients, she fires the housemaid on the spot and sends her packing without a reference. Everyone at Downton Abbey is worried when Matthew and William are reported as missing in action.—garykmcd", "Matthew and his orderly William are looking forward to a visit home, but go missing after encountering Germans behind the trenches. Isobel isn't in reach anymore either after having bluffed she got a Red Cross offer there in a vain attempt to overrule lady Grantham's decision to spare her own staff. Only Dr. Clarkson can rein in Thomas's haughtiness towards the 'domestics', and the earl scolds him for having withheld, like Anna, the fact Bates is working in a pub nearby, until his lordship convinces him to return, relieving Carson but i fact crushing Mr. Molesley's silent ambition to become earl's valet after praise for filling in flexibly now there is less domestic work and staff. O'Brien seeks revenge on the kitchen gang by telling her lady about what she assumes sale of food, actually a free soup kitchen for veterans Cora embraces. Tom Branson tells Sidyl he only stays in service till she admits being in love too and agrees to run away together until their families accept the union. Maid Ethel is fired by housekeeper Hughes, being found in bed with recovering major Charles Bryant, but pregnant. Rose tells Violet she will accept Sir Richard Carlisle's proposal, without love but prospects of an estate, hence is most surprised when Matthew arrives during the concert for the recovering officers where they perform all three.—KGF Vissers"], "genres": "N/A", "imdbID": "1852309", "rating": 8.3, "votes": 2149, "number_of_episodes": 52}