{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "3018580": "Zoe Boyle", "0129379": "Clare Calbraith", "0322513": "Iain Glen", "1395602": "Allen Leech", "0573618": "Kevin McNally", "0533499": "Christine Mackie", "0730191": "David Robb"}, "geners": ["Drama", "Romance"], "runtimes": ["53"],  "plot": ["Ethel confronts her baby's grandparents, Bates thinks he might have played a role in his wife's death, Branson and Sybil elope, and Carlisle tries to recruit Anna to spy on Mary.", "With the house no longer a hospital Thomas hopes to make money on the black market but is ruined after being cheated by his supplier. Mrs Hughes helps Ethel to confront Mr and Mrs Bryant, the parents of her baby's late father but, whilst his wife seems moved, Bryant dismisses Ethel as a liar and fraud with no proof of paternity. Carlisle tries to bribe Anna to spy on Mary but she refuses and tells Mrs Hughes and Carson, the latter consequently withdrawing his offer to work for Carlisle, whom he sees as underhand. Robert, disillusioned by the war's failure to accomplish anything, makes a play for Jane but quickly apologises whilst Sybil, liberated by her war work, elopes with Tom Branson, though her sisters follow and bring them back. John is concerned that, whilst Vera officially killed herself by taking poison, it was rat poison bought by him and fears he may be incriminated. The big news, however, is Matthew regaining the use of his legs. He announces his forthcoming wedding to Lavinia but Violet tells him he is marrying the wrong woman.—don @ minifie-1", "It's 1919 and the last of the soldiers and hospital equipment have left Downton Abbey. Lady Cora thinks it's time for Matthew to leave as well but Robert is feeling out of sorts and wondering if the war was worth it. Lord Grantham develops a fondness for one of the housemaids. Sir Richard Carlisle asks Anna if she would like to work for them with a considerable increase in salary in return for more information about Lady Mary's activities. Carson begins to doubt he can work with Sir Richard when Anna reports what has happened. Thomas decides his fortune is to be made in the black market and builds quite a hoard of basic goods. Lady Sybil and Branson decide the time has come to marry and decide to elope. Matthew thinks he can feel a tingling in his legs and everyone is overjoyed when he finds that he can stand. Matthew announces that he and Lavinia are to be married at Downton Abbey. The Dowager Countess has some important information for him and a bit of advice. Ethel learns that her baby's grandparents will be visiting Downton Abbey. Bates is worried when he realizes he may have inadvertently provided his wife with the poison that killed her.—garykmcd", "Early February 1919, Matthew hesitates to tell he finally feels his legs again, proof his spine isn't broken, and Dr. Clarkson admits having waited to tell a specialist hoped so. Matthew announces that he and Lavinia intend to marry soon, so dowager Violet confides Mary is still in love with him, but Matthew feels obliged to marry Lavinia. Sir Richard Carlisle distresses Anna by asking her to spy on Mary, deciding Carson to decline becoming his butler, Sir even considers opting for an estate further away. Bates suspects that Vera committed suicide in order to frame him and confides in Anna he bought the fatal rat poison. When Major Bryant's parents visit Downton to see where their son convalesced, Mrs Hughes fails to arrange a meeting between them and Ethel, who intrudes with baby Charlie, but grandpa Bryant angrily refuses to acknowledge the unproven bastard. Thomas invested his savings in the post-war black market, but the kitchen finds it worthless junk. Lord Grantham kisses attractive new maid Jane Moorsum. Lady Sybil finally decides to elope with Tom Branson to Gretna Green, but Mary, Edith and Anna find out, set chase and persuade Sybil to return alone and plead her cause openly to their parents.—KGF Vissers"], "genres": "N/A", "imdbID": "1852312", "rating": 8.2, "votes": 2116, "number_of_episodes": 52}