{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "3018580": "Zoe Boyle", "0094039": "Samantha Bond", "0236413": "Kevin Doyle", "0322513": "Iain Glen", "1395602": "Allen Leech", "0531229": "Cal MacAninch", "2674236": "Lachlan Nieboer", "0640758": "Fergus O'Donnell", "0730191": "David Robb", "0764700": "Cathy Sara", "1798528": "Stephen Ventura", "4355300": "Peter Agnelli", "4425912": "Nicholas Blatt", "2903496": "Giles Spencer"}, "geners": ["Drama", "Romance"], "runtimes": ["53"],  "plot": ["April 1917. With John still absent, Isobel's butler Molesley makes a play for Anna but is rejected. Robert gets a new valet, shell-shocked ex-soldier Henry Lang, whilst William goes off to war. Edith learns to drive a tractor extremely well, and nearly succumbs to a kiss from the married farmer Mr. Drake.—don @ minifie-1", "Matthew again returns to England, promoted to captain and with a new assignment. His new fiancée is terribly anxious at his possible return to the front. Lady Edith shocks her family when she tells them that she's going to help a local farmer, who finds himself without farmhands, by driving the man's tractor.—garykmcd", "Romance seems to be in bloom at Downton: Sir Richard Carlisle and Mary, Edith and farmer, Mosely unsuccessfully with Anna, Edith and a local farmer, and in the War: Thomas helps at the hospital, Williaam enlists, ans the EArl is frustrated.—duke1029", "The earl grumbles being denied a front post and having to do with skeleton, often under-qualified staff, including shell-shock veteran new valet Henry Lang, while Molesley, who avoided having Violet's exemption for draft processing undone as with Wlliam, who's delighted to be trained but ignores Daisy can't quit requite his love.—KGF Vissers"], "genres": "N/A", "imdbID": "1846043", "rating": 8.1, "votes": 2196, "number_of_episodes": 52}