{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "3018580": "Zoe Boyle", "0129379": "Clare Calbraith", "0168253": "Michael Cochrane", "0178674": "Paul Copley", "0236413": "Kevin Doyle", "0322513": "Iain Glen", "1395602": "Allen Leech", "0573618": "Kevin McNally", "0533499": "Christine Mackie", "0648393": "Stephen Omer", "0730191": "David Robb", "0766736": "Anton Valensi", "2972606": "Teresa Mahoney", "4360324": "Ed Pearce"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["The Spanish Flu disrupts plans for Matthew's wedding when Cora, Lavinia, Carson, Molesley, and other staff members fall ill. Ethel has to decide the future for her son, and Jane resigns from Downton.", "April 1919. As Downton Abbey prepares for Lavinia and Matthew's wedding, Sybil and Tom shock the family by announcing their intention to move to Dublin, where he has work, and marry. However, events are overtaken and the marriage is put on hold when Carson, Cora, Lavinia and others fall sick with the Spanish flu. Thomas uses the situation as an excuse to get his job back but Lavinia, aware of Matthew's feelings for Mary, suggests that the marriage be called off. After admitting their mutual feelings, Jane gives Robert her resignation, her young son's future assured thanks to the earl, whilst Ethel decides to keep her son Charlie rather than give him to the Bryants, who would raise him to forget her. The flu goes away, having claimed one victim, and Robert finally gives Sybil and Tom his blessing as they leave for Ireland. Anna and John also marry, by special license. However, the day after the wedding they receive unwelcome visitors.—don @ minifie-1", "Matthew and Lavinia's wedding is fast approaching and Matthew is now walking with the use of a cane. He does tell Lady Mary of his true feelings. Ethel learns that her baby's grandparents want to see the child but she isn't quite prepared for what they have to offer. Branson has obtained a position as a journalist in Dublin and Sybil tells her parents and grandmother that they are to be married. They do their best to try and break them up. Thomas learns that he's been had and that his black market goods are worthless. Carson won't have him back. Carson falls quite ill and he is the first of several who has Spanish flu, including Lady Cora and Lavinia. Bates and Anna have their own plans to marry.—garykmcd", "Thomas finds Carson unwilling to reengage the 'war profiteer', but seizes the opportunity to prove himself most useful, as the butler falls ill and Molesley does a poor job filling in during the preparation for Matthew and Lavinia's wedding. Cora and Lavinia are among a series of people falling ill, soon diagnosed as life-threatening Spanish flu, except drunk Molesley. Maid Jane offers herself as comfort girl to the earl, who can't give in to the temptation and offers a hefty sum for her son Freddie when she resigns discretely. Lavinia witnesses Matthew kissing Mary after agreeing he can't drop Lavinia after her generous sacrifice, but dies from the flu. Branson refuses to be bought off by the earl and Sybil braves the prospect of being disinherited, so to prevent the scandal of them running away Robert gives his reluctant blessing. Horace Bryant offers to raise bastard grandson Charlie as his privileged heir, but only if mother Ethel breaks off all contact. Bates and Anna get wed at the registrar's, but after a discrete wedding night he's arrested as a murder suspect.—KGF Vissers"], "genres": "N/A", "imdbID": "1852313", "rating": 8.7, "votes": 2280, "number_of_episodes": 52}