{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "2765309": "Thomas Howes", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0094039": "Samantha Bond", "3018580": "Zoe Boyle", "0132889": "Thomas Campbell", "1395602": "Allen Leech", "0531229": "Cal MacAninch", "0655600": "Graham Padden", "1770860": "Daniel Pirrie", "0730191": "David Robb", "0905554": "Julian Wadham", "4355300": "Peter Agnelli", "2903496": "Giles Spencer"}, "geners": ["Drama", "Romance"], "runtimes": ["53"],  "plot": ["Downton is turned into a convalescent hospital for the war-wounded and, through circumstances, Thomas is given authority in its operation. Anna and Bates are briefly reunited, and Branson plots against a heroic general who is dining at Downton.", "July 1917. As Isobel's plan to turn Downton into a hospital unites upstairs and downstairs in protest, O'Brien persuades Cora to make Thomas the hospital manager. Ethel enjoys the patients' attention whilst Edith earns respect as an auxiliary nurse. Chauffeur Branson, extolling the Russian Revolution, intends to be a conscientious objector but is rejected on medical grounds as former footman William, on his way to the trenches, proposes to Daisy. As Lang finds his trauma interferes with his work Anna discovers Bates working in a local pub. He tells her that Vera has been unfaithful and he is hopeful of a divorce. Violet and Rosamund learn that Carlisle coerced a reluctant Lavinia into exposing government secrets by using her father's debt - thus the engagement is still on.—don @ minifie-1", "With the ever-growing number of wounded requiring care, Downton Abbey is converted to a hospital for convalescing officers. Everyone's routine is disturbed and Lang in particular finds it all very unsettling. Isobel and Cora are at loggerheads over who is in charge and O'Brien suggests to Lady Cora that Thomas take charge of the hospital. Isobel isn't very pleased. Anna thinks she saw Bates in the village and it turns out he is working in a local pub. He still hopes to divorce his wife. Branson, the Bolshevik chauffeur, has been called up but has a plan to publicly declare himself a conscientious objector. He runs into something of a roadblock, however. A visit by General Sir Herbert Strutt gives Branson an opportunity to strike a blow for the working man. Ethel takes an interest in a convalescing officer, Major Bryant, and Edith helps a soldier who has lost his hand write to his mother with the news. Rosamund and Violet learn something about Lavinia Swire and set out to end her relationship with Matthew. William the footman returns for one last night before shipping out and asks Daisy to marry him.—garykmcd"], "genres": "N/A", "imdbID": "1852308", "rating": 8.0, "votes": 2132, "number_of_episodes": 52}