{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0061106": "Robert Bathurst", "0094039": "Samantha Bond", "0138232": "Timothy Carlton", "0178674": "Paul Copley", "0185329": "Jonathan Coy", "0322513": "Iain Glen", "0369814": "Nigel Havers", "1002754": "Dominic Kemp", "0688857": "Simon Poland", "0698082": "Tony Pritchard", "0760194": "Nick Sampson", "0806527": "Sharon Small", "4425912": "Nicholas Blatt", "10353859": "Isis", "13639770": "Mark Joslin", "2972606": "Teresa Mahoney"}, "geners": ["Drama", "Romance"], "runtimes": ["93"],  "plot": ["Christmas 1919. Downton Abbey is hosting a lavish Christmas party, yet despite being the season of goodwill, tensions are rife and Bates' arrest has cast a shadow over the festivities.", "At Christmas 1919 the Crawleys welcome Edith's former suitor Sir Anthony, now a war invalid, who tells her that he is too old for her, and Robert's sister Rosamund with her beau, the raffish Lord Hepworth. Sybil writes to announce her pregnancy. After Carlisle's selfish attitude towards the servants and his jealousy when Mary accompanies Matthew to visit Lavinia's grave, Robert prises from his wife the fact that the newspaper baron is effectively blackmailing his daughter into marriage to keep her secret and, on her father's advice, Mary breaks off the engagement, knowing that the angry Carlisle will now probably expose the family. Aware that Hepworth is penniless, Violet unsuccessfully tries to warn Rosamund against marriage but Rosamund is determined to go ahead with the wedding - until she catches her fiancé in bed with her maid. Things do not go well for John, on trial for killing Vera, though Robert and Matthew vow to contest his life imprisonment. Upstairs and downstairs at Downton all are shaken by his fate, even O'Brien, though Thomas schemes to ingratiate himself and become the new valet. On the eve of the servants' ball, Mrs. Patmore uses a little chicanery - and a Ouija board - to help Daisy assuage her guilt over William. Whilst at the ball, a long-overdue marriage proposal is made - and accepted.—don @ minifie-1", "It's Christmas 1919 and the normally happy activities are somewhat overshadowed by Mr. Bates' arrest and upcoming trial. Lady Cora is thrilled to hear from Sybil that she is pregnant but Lord Grantham is still having difficulty accepting his daughter's choice, despite the fact that he gave her his blessing. Lady Rosamund arrives at Downton for the holidays with her maid Marigold Shore. She also has a new beau, Lord Hepworth, a man the Dowager Countess is convinced is just after Rosamund's money. As time goes by, Lady Mary becomes ever more convinced that she and Sir Richard will never make each other happy. Lord Grantham can't quite understand why she is continuing her engagement until Lady Cora tells him of the incident with the Turkish diplomat and Sir Richard's threat to print the story if Mary changes her mind about their marriage. Lady Edith meanwhile renews her acquaintance with Sir Anthony Strallan who she learns was wounded in the war. Several people testify at Bates' trial and the verdict is rendered.—garykmcd", "[PART 1] Earl Robert hosts a pheasant hunt and dinners at Downton, where Mary is openly warned fiance Sir Richard Carlisle's patience for a wedding date is running out, yet she refuses Matthew's suggestion to call it off, lacking sympathy. Cora finally confesses the Turkish corpse blackmail to Robert. Dowager Violet warns impoverished charming Lord Hepworth he most inform her sister Rosamund of his misfortune before proposing, her maid Marigold looks down upon Downton's traditional holiday liberality and suggests Daisy should become a cook herself. Edith eagerly welcomes crippled ex-suitor Sir Anthony Strallan, who refuses to be a 'burden'. Broke, Thomas is back as footman but lord nor butler want to consider him for promotion even if jailed Bates isn't acquitted for the murder of his wife. The trial is a nightmare, with Robert and staff members forced to testify ultimately to his disadvantage, resulting in a death sentence, yet defense solicitor George Murray insists there are still slim chances to reduce the punishment or even go for acquittal. Daisy decides last minute against cruelly coming clean to William's father.—KGF Vissers"], "genres": "N/A", "imdbID": "2013429", "rating": 9.0, "votes": 3030, "number_of_episodes": 52}