{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0061106": "Robert Bathurst", "0068430": "Neil Bell", "0168253": "Michael Cochrane", "0299057": "Jason Furnival", "1047939": "Karl Haynes", "0383354": "Clare Higgins", "4711683": "Emma Keele", "0671808": "Mark Penfold", "0730191": "David Robb", "0799759": "Ged Simmons", "5888932": "Roman Green", "4123834": "Christopher Longman", "5152376": "Brian Woodward"}, "geners": ["Drama", "Romance"], "runtimes": ["48"],  "plot": ["The fate of Downton Abbey hinges on a letter from a dead man. Edith and Sir Anthony face their own fateful moment. Mrs. Hughes confronts a crisis.", "The feud continues between O'Brien and Thomas, who suggests that the ladies' maid intends leaving. Carson suspects that Mrs Hughes is unwell and tricks Mrs Patmore into confirming the cancer and, in a misguided effort to help, informs Cora. Anna visits a friend of Vera, Mrs Bartlett, though she offers no fresh evidence whilst, John falls foul of cell-mate Craig. Mary finds a letter which could persuade Matthew to take the inheritance and save the family home. Edith prepares to marry Sir Anthony.—don @ minifie-1", "Everyone at Downton Abbey prepare for yet another wedding as Edith and Sir Anthony Strallan are to marry. Lord Grantham can't quite bring himself to approve of the marriage but accepts it without objection. Cold feet set in and one of them is left standing at the altar. Lord Grantham has been waiting for Edith's wedding to be out of the way for him to formally announce their intention to sell Downton. However, Matthew begins to have second thoughts about accepting Reggie Swire's money. O'Brien and Thomas continue their battle of wills and Anna is still trying to find information that will exonerate her husband. Mrs. Hughes receives the news of her medical tests.—garykmcd", "The earl being 'broke', he prepares the family to move to a smaller country house to be renamed Downton Place, after Sibyl's wedding at the Abbey. So everyone goes visit the country home for a picnic, leaving the staff unaware as their number would be reduced drastically. Matthew still refuses to accept Lavinia's father Reggie Swire's huge inheritance, or even to read a letter he has delivered by solicitor, but Rose does and finds proof he knew enough to chose his heir, so insists it be used to save the Abbey. Vindictive Thomas tricks Molesley to inquire about O'Brien's position for a kin, Cora is not amused. Bates is warned in time to avoid being set up by his cellmate, Anna finally gets to speak Vera's hostile friend. Former maid Ethel Parks admits to Isobel having become a prostitute, but refuses to say what she needs help with. Mrs. Hughes is assured she can stay and expect all medical care, regardless of the diagnosis, while Carson gets the family's permission to redivide her work load, but the lab test is benign. Tom Branson is finally welcome visiting with pregnant Sibyl to attend the wedding, but at the altar Sir Anthony Strallan decides he can't 'condemnd her to a life as his nurse', so the staff gets to eat the lavish nuptial dinner.—KGF Vissers"], "genres": "N/A", "imdbID": "2385216", "rating": 8.4, "votes": 2006, "number_of_episodes": 52}