{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "1374796": "Ruairi Conaghan", "0185329": "Jonathan Coy", "0249876": "Charles Edwards", "0367731": "Terence Harvey", "4925834": "Cara Theobold", "1128519": "John Voce"}, "geners": ["Drama", "Romance"], "runtimes": ["48"],  "plot": ["A vindictive Ms. O'Brien hatches a damaging plot. Edith makes a major decision. Matthew devises a major plan for changing things, and Tom's brother pays a visit.", "Thomas fears for his job as Robert's valet and not just because John has been released back to Downton Abbey, to the delight of everybody else. The vengeful O'Brien, attempting to advance Alfred in the household, has tricked him into believing that his feelings for Jimmy are reciprocated, leading him to make a disastrous play for the shocked footman. And O'Brien makes sure that Carson finds out. Robert is doubly annoyed. Edith has decided to go to London and accept the journalist post, where she is charmed by magazine editor Gregson. Furthermore Matthew is insisting the estate be overhauled with new machinery, to make it self-sufficient. Tom's brother Kieran arrives from Liverpool for the christening and does not endear himself to the family. However, when the old estate manager resigns in protest at Matthew's proposals Cora suggests Tom, who has farming knowledge, take on the job rather than return with Kieran to work in his garage. Isobel is angry with Violet who, claiming to act in Ethel's best interests, has suggested she move to an area where her situation is not known.—don @ minifie-1", "Matthew continues to push for reforms at the estate but Lord Grantham continues to oppose him. Even the family solicitor advises him that the estate will eventually fail unless changes are made. Jarvis, the current estate manager takes it all personally and resigns. The Dowager Countess has an idea as to who might replace him. It's time for baby Sybil's christening and Tom's oafish brother arrives. Even Tom is put off by his rude behavior. With the return of Mr. Bates, Thomas wonders what the future might hold for him. His attempt to kiss the sleeping Jimmy not only results in outrage but is seen by Alfred. Edith travels to London to visit the editor who's offered her a position as a journalist. The Dowager Countess feels that Ethel should move on thereby sparing them all further embarrassment.—garykmcd", "July 1920. Bates is freed from prison and promised a cottage for him and Anna, and his valet job back, probably at Thomas's expense. Persuaded by O'Brien, Thomas sneaks at night into Jimmy's room to kiss him asleep- just as Alfred enters the room, returning from the cinema with the other young staff. Jimmy is outraged and Carson disgusted after he gets the truth out of Alfred, yet all hope to avoid a scandal. Against her isolated father's will, Edith goes to London to meet magazine editor Michael Gregson and accepts his offer to write a weekly column. Tom's uncouth brother and prospective firm partner Kiernan Branson comes to Downton for the Catholic christening in Ripon city and demonstrates rudely his preference for downstairs, called to aristocratic order by Tom. Matthew continues to confront Lord Grantham about the estate's mismanagement, leading to the resignation of the family's long-time agent Jarvis, whom Tom is persuaded to succeed so as to keep him and his daughter at Downton, joining his farmer skills to Matthew's in business.—KGF Vissers"], "genres": "N/A", "imdbID": "2385260", "rating": 8.1, "votes": 1905, "number_of_episodes": 52}