{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0068430": "Neil Bell", "0168253": "Michael Cochrane", "0178674": "Paul Copley", "0185329": "Jonathan Coy", "0299057": "Jason Furnival", "0383354": "Clare Higgins", "0730191": "David Robb", "4925834": "Cara Theobold", "8745734": "Roy Beck", "2765309": "Thomas Howes", "3347235": "Lewis James", "5020928": "Martyn Mayger", "4560922": "Martin Webbe"}, "geners": ["Drama", "Romance"], "runtimes": ["48"],  "plot": ["Things go badly amiss at Downton Abbey. Robert and Cora are not speaking. The servants are shunning Matthew's mother, Isobel. And Matthew and Robert have fallen out. Bates takes a gamble.", "Cora is still cold to Robert following Sybil's funeral and he is not best pleased when Tom announces that he wants his daughter, also to be named Sybil, to be raised as a Catholic, especially as Cora and her daughters back the young Irishman. He also clashes with Matthew over the running of the estate and there is further humiliation for him when Isobel invites the ladies of Downton to a dinner cooked by Ethel and, tipped off by the sanctimonious Carson, he tries to get them to leave because of Ethel's past, all of them defying him. Daisy visits her late husband's father, Mr Mason, who suggests she come to help him on his farm whilst Anna receives a letter saying that John is to be freed after Mrs Bartlett's evidence, though John has had to use threats for the outcome to be reached.—don @ minifie-1", "Lady Sybil's funeral has done little to heal the open wounds at Downton. Cora blames Robert for their daughter's death and their marriage is clearly at risk. The Dowager Countess suggests to Robert that he take a trip and give Cora space. In the end, Violet speaks to Dr. Clarkson and has something else in mind. Lord Grantham is upset when Tom announces that his daughter, who he intends to name Sybil, will be baptized as a Catholic. Isobel meanwhile decides to host a luncheon for the ladies and Ethel seeks Mrs. Patmore's help with the cooking. When Carson learns that the ladies of Downton are lunching at Isobel's he informs Lord Grantham who barges into the lunch and orders the women to leave. As expected, getting the evidence to free John is proving difficult forcing him to take matters into his own hands. Jimmy is growing increasingly with Thomas' attention to him.—garykmcd", "Cross-crushes between Alfred, Daisy, Ivy and James cause all nothing but trouble, even over innocent foxtrot dance introductions. Fearing Robert's marriage won't survive Cora blaming him for Sybil's death, the dowager gets Dr. Clarkson to convince her a Cesarean and gruesome treatment for eclampsia would almost certainly only have meant needless agony. Carson is almost alone condemning cook Patmore for teaching Isobel's Ethel to serve a full dinner to the visiting ladies, who ignore the earl's call to leave that 'cesspit' instantly. Tom plans to start a new life, taking the baby, named Sybil after her mother, to Catholic baptism and seeking a job in the city. Bates counter-bluffs his prison nemesis and solicitor Murray manages to get a testimony sufficient to have his sentence revised.—KGF Vissers"], "genres": "N/A", "imdbID": "2385246", "rating": 8.2, "votes": 1910, "number_of_episodes": 52}