{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0068430": "Neil Bell", "0191410": "Michael Culkin", "0299057": "Jason Furnival", "1047939": "Karl Haynes", "0517910": "Christine Lohr", "0573618": "Kevin McNally", "0533499": "Christine Mackie", "0799759": "Ged Simmons", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "5787663": "Michael Haydon", "8745734": "Roy Beck", "3491228": "Glen Stanway", "5152376": "Brian Woodward"}, "geners": ["Drama", "Romance"], "runtimes": ["48"],  "plot": ["August 1920: Two social revolutions arrive at Downton Abbey: the Irish civil war and the fight for women's suffrage. A mysterious conspiracy keeps Anna and Bates apart.", "August 1920. At Ethel's request, Isobel and Mrs Hughes arrange a meeting with Mr and Mrs Bryant as Ethel believes her son Charlie would have a better life with them. The kindly Mrs Bryant offers money but Ethel, though it is heart-breaking for her, agrees that the couple should raise her son for his own benefit. Edith, incensed at the limits of women's suffrage, has an article published in the press, which annoys Robert, but he is even more angry when Tom and the pregnant Sybil arrive from Ireland. Tom is on the run as an I.R.A sympathiser who has attended their meetings and will be arrested if he returns to Dublin, making them exiles though Tom expresses a wish to return to his homeland. Handsome new footman Jimmy turns the heads of the maids - and Thomas - whilst Daisy is put out when Alfred seems smitten by new kitchen maid Ivy.—don @ minifie-1", "Everyone is upset when Tom arrives at Downton, on the run from the law and without Sybil who should join him in a few days. Lord Grantham is outraged that he's left her behind. Edith is searching for something to do for the rest of her life and may have found it when The Times publishes her letter on women's right to vote. Lord Grantham insists that Matthew review the estate's financial records and he is not pleased with what he finds: antiquated methods and a great deal of waste. Raising the issue with Robert doesn't prove to be easy. With the estates finances now in order, Carson receives permission to hire more staff. A handsome new footman, Jimmy, sets tongues wagging but Daisy isn't so pleased with the new kitchen helper, Ivy, after Alfred flirts with her. Anna and John are despondent over the fact they've not received any letters from the other. Ethel has decided it would be best if she let the Bryants raise her son.—garykmcd", "Matthew, having invested the inheritance in Downton, finds its management financially inadequate but the dowager he confides into agree one can't solve that without ruffling too many feathers. He curbs the earl's willingness to grant Carson's request to rebuild the staff, with dead-gorgeous young valet James 'Jimmy' Kent, whom Thomas is eager to mentor, jumping above simple Alfred, who even Carson can't train to perfection. The latter seems out of Daisy's reach again as he seems more interested in new kitchen maid Ivy Stuart. Tom Branson arrives alone at night, before Sibyl, having fled Ireland separately as he is wanted for consorting with revolutionaries who torched an aristocratic castle, to Robert's fury, but the family gets him to negotiate a deal with the ministry, in fact voluntary banishment to Downton. Isobel and Hughes arrange for fallen maid Ethel to present her son Charlie to the wealthy Bryant grandparents, who end up taking him in, without her, for decent schooling. Tipped off by his cellmate Craig's nemesis, Bates turns the tables on contraband planting and regains mail privileges, to his and Anna's great relief.—KGF Vissers"], "genres": "N/A", "imdbID": "2385222", "rating": 8.0, "votes": 1938, "number_of_episodes": 52}