{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0068430": "Neil Bell", "0185329": "Jonathan Coy", "0299057": "Jason Furnival", "0517910": "Christine Lohr", "0683116": "Tim Pigott-Smith", "0730191": "David Robb", "4925834": "Cara Theobold"}, "geners": ["Drama", "Romance"], "runtimes": ["50"],  "plot": ["The Crawleys excitedly await as the new addition to the family is soon to come. Meanwhile, Anna attempts to uncover evidence for Bates's innocence. But then, when tragedy strikes, will things ever be the same again?", "After her letter is published, Edith receives an offer from the Sketch to write a weekly column. Matthew thinks it's wonderful but Lord Grantham and the Dowager Countess are not impressed. Anna thinks she has found evidence that will exonerate John. Getting that before the courts may not be easily accomplished. Isobel decides to practice what she preaches and offers Ethel a job - leading her cook to quit. Sybil is soon to have her baby and Lord Grantham, no longer trusting the local Doctor Clarkson's skills, decides to call in the eminent doctor Sir Philip Tapsell.—garykmcd", "May 1920. Altough the earl believed the serious press shares his disapproval of female opinion makers, Edith is asked to write a regular newspaper column, most of the family expresses doubts. Thomas enthusiastically mentors valet Jimmy, who starts to feel a bit uncomfortable with his 'familiarity'. Sybil going into labor, Lord Grantham hires famous obstetrician Sir Philip Tapsel, who waves Dr Clarkson's urging to hospitalize Sybil on account of eclampsia symptoms, Sybil delivers Tom's healthy daughter. Matthew believes Robert mismanages the estate and finds an ally in family solicitor George Murray, who was asked to confer with Anna on the probably hostile witness who could prove Bates's innocence, but Mary stops the 'inappropriate timing'. That night, Sybil dies. Cora blames Robert for the death from eclampsia, Cora blames Robert for dismissing Clarkson. Isobel hires Ethel as maid, so her disgusted cook quits.—KGF Vissers"], "genres": "N/A", "imdbID": "2385244", "rating": 9.0, "votes": 2428, "number_of_episodes": 52}