{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0117029": "Kenneth Bryans", "1769728": "MyAnna Buring", "0231871": "Ron Donachie", "0249876": "Charles Edwards", "0250718": "Peter Egan", "2708974": "Shaun Hennessy", "0378132": "John Henshaw", "4141252": "Lily James", "0481547": "Simone Lahbib", "0629498": "Phoebe Nicholls", "0730191": "David Robb", "4925834": "Cara Theobold", "0871443": "William Travis", "5347246": "Stuart Ward", "3171337": "Laura Hydari", "4464928": "Jonathan Brooks", "3726887": "Jessica Brown Findlay", "13639770": "Mark Joslin", "4955597": "Barry McGinley", "5762706": "David G. Robinson"}, "geners": ["Drama", "Romance"], "runtimes": ["92"],  "plot": ["The Crawleys go to Duneagle Castle to celebrate Christmas with the MacClares. Everyone is delighted as they fish, hunt, and dine. Unfortunately, when the Crawleys return, tragedy strikes. Will things ever be the same again?", "The Crawleys travel to Duneagle Castle in Scotland to holiday with Rose and her parents 'Shrimpie' and Susan, an unhappily married couple due to leave for Bombay in line with Shrimpie's posting with the Diplomatic Corps. Robert discovers the reason for the rift in the marriage and the move - Shrimpie's mismanagement has lost the family home. Edith's editor and love interest Michael Gregson also turns up and is befriended by Matthew, who believes he should let Edith down gently as he is unable to divorce his mentally-ill wife. Edith, however, is not so willing to give him up. Back in Yorkshire the staff attend a fair in Thirsk at the invitation of Mrs. Patmore's new admirer, grocer Jos Tufton. The Downton boys win a tug-of-war, but a drunken Jimmy is robbed by locals and rescued by Thomas, who ends up injured. Also at the fair are Isobel and Dr. Clarkson. Forward new maid Edna tries to seduce Tom.—don @ minifie-1", "The family is off to Duneagle in Scotland for their annual visit which, as Mr Bates tells the new maid Edna, is the highlight of Lord Grantham calendar. Their hosts are Shrimpie and Susan Flintshire, the Dowager Countess' niece and the parents of young Rose whose had caused some difficult moments for Matthew and Sybil the year before. Clearly the Flintshires' marriage is going through a rough patch and it seems they may soon go off on a foreign posting to Bombay. Michael Gregson arrives in Scotland obviously intent on wooing Edith. Back at Downton Abbey, Carson keeps a tight reign on those staff members who have stayed behind. Mrs. Patmore has a new admirer in the form of their new food supplier. Edna sets her sights on widower Tom Branson but when Mrs. Hughes catches her out she has advice for both of them. Isobel and Dr. Clarkson are spending a good deal of time together. The entire family returns to Downton when Lady Mary goes into labor but tragedy once again strikes.—garykmcd", "The Crawleys visits Rose's family, the Finches, in Duneagle Castle in the Scottish Highlands. They all enjoy the fishing, hunting, fine dining, and the rest of the leisure time they have together. Then, when Mary least expects it, she has to catch a train home so she can go into labor. Soon, tragedy strikes once again for the Crawley family."], "genres": "N/A", "imdbID": "2385306", "rating": 8.2, "votes": 2599, "number_of_episodes": 52}