{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0000511": "Shirley MacLaine", "0061106": "Robert Bathurst", "0068430": "Neil Bell", "0189562": "Sarah Crowden", "0299057": "Jason Furnival", "0730191": "David Robb", "4926294": "Lucille Sharp", "1994157": "Julie Eagleton"}, "geners": ["Drama", "Romance"], "runtimes": ["48"],  "plot": ["A conflict between two members of the house staff escalates. Meanwhile, the family tries to impress Martha by planning a lavish dinner party.", "Mary and Matthew return from their honeymoon but he is still reluctant to take the Swire inheritance so the family plans to impress Martha with a lavish dinner party, entertaining locals, in the hope that she will bankroll them. When the oven breaks down, Martha saves the day with her indoor picnic but is unable to provide the financial help the family wants. A jealous Thomas sets out to sabotage Alfred and replace him with Molesley but O'Brien gets revenge by humiliating Thomas whilst Isobel, working at a charity in York to help single mothers, spots Ethel, who runs off after being recognized. Mrs Patmore accompanies a nervous Mrs Hughes to the doctor after the housekeeper finds a lump on her chest. He takes tests but the analysis will take two months and the women agree to keep it secret from other staff. Despite her father's early disapproval that he is too old for her, Edith finally gets engaged to Sir Anthony.—don @ minifie-1", "Matthew and Mary are back from their honeymoon and obviously very happy in spite of Matthew's refusal to accept Mr. Swire's legacy and save Downton. Edith continues her pursuit of Sir Anthony despite objections from some in the family. Cora and Violet concoct a plan to impress Cora's mother with Downton's importance in the community. The lavish dinner they've planned faces ruin when the oven malfunctions and there is no dinner for the guests. Martha Levinson saves the day. Below stairs, O'Brien and Thomas find themselves at odds over the new footman. Mrs. Hughes finds a lump in her breast and, accompanied by an emotional Mrs. Patmore, visits the local doctor.—garykmcd", "April 1920. Downton may have to be sold as the family isn't rick enough anymore, yet Matthew refuses to accept Lavinia's father's inheritance 'on false pretenses'. The earl agrees, so Mary and the Dowager Countess conspire to show Downton at its grandest to persuade Cora's tacky but rich, visiting mother Martha Levinson to donate enough to prevent financial ruin, but both the party -without sufficient staff- and the plot fall foul terribly. Downstairs, under-staffing troubles Carson and his everyone. O'Brien turns on jealous Thomas, who meanly tricked young Alfred, recently promoted as Mathew's valet, into ruining a dinner jacket, by hiding Robert's shirts, while Martha's American maid kisses and helps Alfred, who is still replaced as valet by Molesley. Only Patmore knows and stands by Mrs Hughes, who must face Dr. Clarkson with a cancer scare. Working at a York charity for 'fallen girls', Isobel Crawley finds former maid Ethel is one of them. Edith actively pursues Anthony Strallan as a potential husband, although the earl agreed with him they're mismatched by age and crippling, until he is accepted and proposes. Bates and Anna keep conferring in jail to track down witnesses about evil Vera.—KGF Vissers"], "genres": "N/A", "imdbID": "2374958", "rating": 8.1, "votes": 2018, "number_of_episodes": 52}