{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0048192": "Edward Baker-Duly", "0094039": "Samantha Bond", "0249876": "Charles Edwards", "0302338": "Bernard Gallagher", "4141252": "Lily James", "0448888": "Edmund Kente", "8917917": "Jordan Long", "0533499": "Christine Mackie", "0730191": "David Robb", "1510188": "Richard Teverson", "4925834": "Cara Theobold", "0877919": "Tony Turner", "10098003": "Lily-Fleur Bradbury", "13639770": "Mark Joslin"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["Change arrives in a big way for several key characters at Downton Abbey. A yearly cricket match with the village sees old scores settled and new plots are hatched.", "Carson promises Thomas that if he resigns, citing John's return as the reason, he will give him a good reference. However, O'Brien persuades Jimmy to tell the butler that he will call the police unless the reference is withdrawn. Violet's great-niece Rose comes to stay, apparently bored with London, though she is keen to accompany Edith to town for a day, staying with Rosamund. However, she gives them the slip to go to a club with her married boyfriend who was the reason her mother sent her to Violet, and, along with Matthew, they lean on her to return.—don @ minifie-1", "Thomas' advances towards Jimmy are reported to Mr. Carson who suggests to Thomas that he leave with a good reference but Mrs. O'Brien manipulates those involved in her attempt to ruin him. Surprisingly, it's Bates who come to Thomas' rescue though he questions what he's done when he learns of Lord Grantham's solution. Edith reconsiders her decision to accept her job offer when she learns about her editor's private life. The Dowager Countess continues to involve herself with Ethel's situation but with a good result. Mary and Matthew are keeping a secret from one another. Violet takes charge of her niece Rose, 18 years old and very much the modern young woman who likes to spend her time in jazz clubs. The annual cricket match where the members of the house play a team from the village provides an opportunity to come together and resolve the many issues facing them.—garykmcd", "Before 11 August 1920. Carson must withdraw his promise of a letter of recommendation so Thomas can start anew elsewhere after James threatens with a complaint to the police, viciously inspired by O'Brien, who makes him backtrack after Bates and Anna threatens to reveal her soap secret. Downton Abbey's annual cricket match with the village preoccupies the earl, who wants the house to beat the locals, which is rare, despite lack of players, so inexperienced, reluctant Branson is commandeered, as consolation for the lord finally agreeing to manage the estate jointly with farmer's son Tom, and business-smart Matthew, as aristocratic guarantor of traditional values and local interests. The earl wants Thomas reinstated, but Alfred complains about Thomas to the police and CID officers arrive to see him; Lord Grantham persuades the police that it was all a misunderstanding and promotes James to first footman to allow Thomas to stay. Lady Rose MacClare (19), the daughter of the Dowager Countess's niece Marchioness Susan, and her husband Hugh, Marquess of Flintshire, visits. A sneaky trip to a London jazz club reveals that Rose is a wild party girl who flirts 'seriously' with married Terence Margadale, so Matthew and Violet deal with her discretely. Mary and Matthew discover they have separately been visiting a London doctor to find out why they have had no children; Mary reveals she a small operation restore her fertility, so they plan to start the family Robert craves as much. Isobel must admit Violet was right to advertise for a new job for Ethel safely far away, but the only offer is to close near Charlie's adoptive parents- until Daphne Bryant agrees to let her visit as 'former nurse'. Edith agrees to work for and date editor Michael Gregson learning he can't divorce his wife due to incapacitating insanity.—KGF Vissers"], "genres": "N/A", "imdbID": "2385266", "rating": 8.3, "votes": 1995, "number_of_episodes": 52}