{"cast": {"0095017": "Hugh Bonneville", "3726887": "Jessica Brown Findlay", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0278239": "Siobhan Finneran", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "1142271": "Amy Nuttall", "0001749": "Maggie Smith", "1405398": "Dan Stevens", "0934362": "Penelope Wilton", "0000511": "Shirley MacLaine", "2758578": "Charlie Anson", "0061106": "Robert Bathurst", "0168253": "Michael Cochrane", "0185329": "Jonathan Coy", "0191410": "Michael Culkin", "0299057": "Jason Furnival", "0671808": "Mark Penfold", "0718619": "Douglas Reith", "4926294": "Lucille Sharp", "1994157": "Julie Eagleton"}, "geners": ["Drama", "Romance"], "runtimes": ["68"],  "plot": ["Spring of 1920. Wedding guests descend on Downton Abbey, where disasters threaten. One of which is Cora's freewheeling American mother, who tries to loosen up her in-laws.", "Spring 1920:- Mary and Matthew's wedding is fast approaching. O'Brien fixes for her nephew Alfred, a former hotel waiter, to be the new footman though Carson finds him inefficient whilst Daisy is annoyed that, in view of the amount of cooking she does, she is still a kitchen maid and has not been promoted. Anna finds a list of all Vera's contacts and tells John she intends to write to them to discover if any of them found her suicidal. Robert, meanwhile, finds the future of Downton Abbey at risk due to money problems but Matthew annoys Mary by refusing a legacy left him by Lavinia's father. Sybil and Tom Branson arrive from Ireland - paid for by Violet - but Tom's new situation causes some awkwardness,largely for himself and the officious Carson, though he is supported by the Crawleys. When Tom appears drunk and vocal at dinner, Edith's gentlemanly admirer Sir Anthony exposes snobbish guest Larry Grey as having drugged him and Matthew asks Tom to be his best man. Tom reciprocates by reconciling Mary and Matthew. Another guest, Cora's brash American mother, Martha Levinson, turns up and there is an inevitable clash with Violet over Old and New World values.—don @ minifie-1", "A distraught Lord Grantham learns that most of his wife's fortune has been lost in a bad investment. The family's financial situation notwithstanding, Matthew and Lady Mary are in the final preparations for their wedding. Matthew learns he he may inherit a fortune from Lavinia Swire's father. It all creates a rift and puts the wedding at risk when he tells Mary he won't accept the money regardless of her father's financial challenges. Sybil and her husband Tom arrive for the wedding leading to discomfort both for Lord Grantham and the servants. Lady Cora's mother, Martha Levinson, also arrives for the wedding. Edith continues her friendship with Sir Anthony and is all the more interested in him after he exposes a dinner guest for spiking Tom's drink. O'Brien arranges for her nephew Alfred Nugent to take a position as footman. Anna continues her search for evidence to clear her husband John.—garykmcd"], "genres": "N/A", "imdbID": "2114648", "rating": 8.5, "votes": 2515, "number_of_episodes": 52}