{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0769084": "Andrew Scarborough", "0144237": "Raquel Cassidy", "1981245": "Brendan Patricks", "1099188": "Julian Ovenden", "3338149": "Gary Carr", "2542922": "Daisy Lewis", "0094039": "Samantha Bond", "3665787": "Tom Cullen", "0363424": "Nigel Harman", "0724174": "Joshua Richards", "0718619": "Douglas Reith", "4987481": "Philip Wallace", "0218759": "Richard Dempsey", "0178674": "Paul Copley", "9797096": "Susie Coats", "6682374": "Gintare Beinoraviciute", "3863069": "Jefferson King"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["Rosamund comes up with a plan to help Edith, but Violet sees right through it; Isobel is the object of someone's attention, while Mary asks Gillingham for a very big favor.", "Charles leaves, Mary having appointed Tim Drewe as pig-man, but when Anthony Gillingham's projected visit to Downton is announced Mary detects from Anna's reaction that something is wrong and learns the rapist's identity. The visit passes without incident, though Mary turns down a proposal from Anthony, who has broken off his engagement. Mary is alarmed when Rose tells her she is marrying Jack Ross and goes to see the singer. Lady Rosamund plans to take Edith to Switzerland to have her baby and put it up for adoption, but Violet is suspicious. Robert returns for the annual fete and Alfred comes back for a funeral, proposing to Ivy, who declines. Meanwhile, Isobel attracts the admiration of Lord Merton and Molesley forms a friendship with Baxter, though he is curious as to her relationship with Barrow.—don @ minifie-1", "Edith decides the time has come to tell her mother about her pregnancy and her Aunt Rosamund comes to Downton. Rosamund has a better idea: they will go off to Switzerland for several months where Edith can give birth and give up the child for adoption. The plan doesn't get by the Dowager Countess however who is now certain something serious is amiss. Tom again runs into Sarah Bunting, the young woman he had recently met at a Liberal party meeting. While on a trip to Thirsk, Tom sees Rose having tea with Jack Ross and reports the fact to Mary. She speaks Rose who insists she loves Jack and has every intention of marrying him. Mary confronts Jack on the subject. Lord Merton, Mary's godfather, visits the Dowager Countess for lunch and takes a definite interest in Isobel. With Robert still away, Cora organizes the annual village fête. Alfred says his final goodbyes to Ivy and Daisy. Mary, who has again turned down Lord Gillingham's proposal of marriage, asks him to sack his valet, Green. He agrees but shows up at Downton the next day to tell her that Green is dead, having been struck by a vehicle on the street. It was also the day that John Bates had supposedly gone off to York for the day.—garykmcd", "Mary persuade Gillingham to discharge Green without disclosing the reason and rejects his marriage proposal, Mary discover Rose's romance with Jack Rose, Alfred returns to for his father's funeral, and the Crawleys stage the annual church bazaar.—duke1029", "*August 1922. The Crowley family impresses even Tom's flirt, local school teacher Sarah Bunting, by sharing in the staff's efforts -Carson overrules Cora's blessing for Jimmy's fun intentions- to host the annual church bazaar. Edith despairs about Michael but wants to keep her baby, to be for by a tenant farmer Tim Drewe -who eagerly accepts leading the estate's own cattle breeding as well as the pigs- and his wife, but Lady Rosamund convinces her instead go to Switzerland and give the baby up for foreign adoption there. Alfred is back a last time for his father's funeral and proposes by letter to Ivy, who turns him down, but begins appreciating Daisy's loyalty after Ivy Mr. Mason convinces confused Daisy to seek closure, but she gives Alfred up too, and he leaves for good. Tom catches Rose dining and kissing with jazz singer Ross, who agrees it's an possible mismatch, but she tells Cora she's hell-bent to marry the Afro-American. Lord Gillingham visits briefly, intending to end his engagement to Mabel, still pursuing Mary, who \"can't\" commit, but learned about Anna's ordeal and gets Gillingham to dismiss the valet Green, which he agrees to do without details. During the church bazaar, Lord Grantham arrives unexpectedly with Tohmas, reporting Harold got off easily. Lord Gillingham tells Mary that Green was killed in a road accident in Piccadilly. Anna realizes that Bates had the same day off, supposedly to go to York, and he will not say what he was doing there.—KGF Vissers"], "genres": "N/A", "imdbID": "2752760", "rating": 8.2, "votes": 1705, "number_of_episodes": 52}