{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0144237": "Raquel Cassidy", "0842596": "Jeremy Swift", "6008477": "Joncie Elmore", "0523047": "Simon Lowe", "1099188": "Julian Ovenden", "1981245": "Brendan Patricks", "3338149": "Gary Carr", "6682374": "Gintare Beinoraviciute", "3678627": "Ray Burnet", "8573540": "Cat Kolubayev"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["A birthday party is planned for Robert, but Rose's contribution to the event surprises those above and below stairs, a new farming venture on the Downton estate comes with dramatic repercussions for Mary, and Edith receives troubling news.", "Robert is perturbed when Mary and Tom suggest intensive pig-farming on his land and Evelyn returns with his superior Charles Blake, to assess the viability of estates such as Downton. Blake does not impress Mary but both men are invited to stay for Robert's birthday party, for which Rose has engaged Jack Ross and his band. Rose's involvement with Ross would seem to go beyond the professional. At the party Isobel dissuades Tom from emigrating to America with his daughter and later she proves to Violet that young Pegg was not a thief, being surprised by the dowager's open-mindedness in reinstating him. Alfred receives good news - he has been accepted at the Ritz after all and Molesley is quick to step into his role but Edith is still concerned as Michael seems to have gone missing in Germany.—don @ minifie-1", "Mary and Tom propose that the estate invests in pig farming. Robert has agreed but admits to some nervousness over the enterprise. The ladies of Downton plan a birthday dinner for Robert but it's Rose who plans the surprise: Jack Ross and his band for after-dinner dancing. Alfred learns that he has been accepted at the Ritz for training as a chef and leaves Downton the next day. Isobel is disturbed at the Dowager Countess' sacking of new gardener John Pegg, accusing him of stealing a valuable letter opener, but is even more surprised at her reaction when she proves that Pegg didn't steal it. Anna and John go out for what is supposed to a romantic dinner but it doesn't go well. Edith worries over the fate of her friend Michael Gregson, who has vanished into thin air. She also receives confirmation from her doctor that she is pregnant. Mary's old friend Evelyn Napier returns to Downton with his colleague Charles Blake to whom Mary takes an instant dislike.—garykmcd", "Rose hires and becomes involved with a black leader, Michael is missing in Germany, Molesley has difficulty getting a job, at Downton, Pegg is suspected of thief, Bates discover's Anna's secret, and auditors test the viability of great estates like Downnton.—duke1029", "June 1922. Alfred leaves as he get into the Ritz chef training after all, but Daisy bitterly blames Ivy having 'chased' him, while Jimmy finds her utterly ungrateful when taking her to dinner and movie. Carson is unwilling to rehire 'unmotivated' Molesley to replace Alfred as footman, until Hughes inspires him to grovel properly. Bates treats Anna to dinner at a posh hotel where a snooty maître d'hôtel tries to bar them, but Cora enjoys ensuring them admission. Despite Dr. Clarkson curbing Isobel's crusade to save the young gardener by investigating the alleged thefts behind Spratt's back, Violet triumphs having rehired John Pegg . Government inspectors move in to survey the financial viability of the landed estates in Yorkshire: Mary's old gentleman friend Evelyn Napier and his boss Charles Blake, an acerbic liberal who politely clashes with her and makes clear the government has no interest in saving estates, only agricultural production. Rose arranges for black singer Jack Ross 's jazz club band to play as surprise at Robert's birthday, with a mixed reception from Carson and Violet tolerating modern folly, to Cora insisting to pick up the check. After the party, Mary sees Rose and Jack kissing in the servants' hall. Edith learns she is pregnant, without news from the father in Munich.—KGF Vissers"], "genres": "N/A", "imdbID": "2752784", "rating": 8.1, "votes": 1682, "number_of_episodes": 52}