{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "3665787": "Tom Cullen", "0363424": "Nigel Harman", "2791401": "Andrew Alexander", "0249876": "Charles Edwards", "0202945": "Joanna David", "1769728": "MyAnna Buring", "1171145": "Patrick Kennedy", "0853490": "Kiri Te Kanawa", "6682374": "Gintare Beinoraviciute"}, "geners": ["Drama", "Romance"], "runtimes": ["50"],  "plot": ["An extravagant house party at the Abbey gives the Crawleys a chance to reconnect with old friends, but some guests prove more welcome than others, and along with the celebrations come deceit and heartache.", "The Crawleys throw a weekend house party with guests including Terence Sampson and Anthony, Lord Gillingham. Tom is out of his depth making small talk but Edith is happy to welcome Michael into the group. Mary confides in Gillingham - although he is engaged to another woman - but John is irritated by Gillingham's valet Green's flirtatious attentions to Anna. Isobel, still mourning her son, is persuaded by Violet to join the party for a recital by opera singer Nellie Melba, while Molesley, now working as a delivery driver, stands in for the injured Jimmy as footman and Alfred saves the culinary day when stressed-out Mrs Patmore has an anxiety attack. During the recital Michael impresses Robert whilst Green forces himself on Anna, who asks Mrs Hughes not to tell John.—don @ minifie-1", "Robert and Cora invite a dozen or so friends for the weekend, the first such party since Matthew's death. Cora has ensured that several young men are included hoping Mary might take an interest - something Robert thinks is highly unlikely. The highlight of the weekend is to be a performance by renowned operatic soloist Dame Nellie Melba - but Lord Grantham and Carson have no intention of treating her as a guest. Several of the guests lose a good deal of money playing poker with Terence Sampson, a cardsharp. Edith is having difficulty getting her father to spend any time with her friend Michael Gregson. Once again, Tom feels completely out of place entertaining, something Edna begins using to her advantage. Alfred saves the day by cooking dinner when Mrs. Patmore has a panic attack and Molesley steps in to work as a footman when Jimmy injures himself. One of the visiting servants takes an interest in Anna and subsequently forces himself on her.—garykmcd", "The earl's first grand weekend house party is a nightmare for Carson, overburdening his diminished staff while few guests still bring their own, so must be assisted on top. Showing off with a sticky jar, Jimmy strains his wrist, so under-butler Thomas must join the footman service, as well as penniless Molesley, who isn't suitably grateful for a temporary rehiring he experiences as a demotion. Edith planned to properly present lover Michael Gregson to her father, but he realizes Robert isn't interested, until he skillfully uses his 'miscreant youth' experience to win back the debts Robert and friends incurred with professional Terence Sampson. Mournful Isobel is glad Violet persuaded her to attend, but Tom feels miserably 'out of place' in the aristocratic company, hence receptive to maid Edna's move. Cora finally finds a proper partner in recently peerage-succeeded Lord Anthony Gillingham, who has smart estate management advice, despite Rose inadvertently rekindling her mourning mood by fielding Matthew's gramophone. Bates is instinctively jealous of Gillingham's slick valet Green flirting with amused Anna, who is painfully surprised when he takes what she seemed to put out the hard way during the private opera recital of Dame Nellie Melba, which the staff is allowed to attend, including cook Patmore, who has a panic episode from the dinner stress, so Alfred can prove his potential as would be-cook by making the sauces.—KGF Vissers"], "genres": "N/A", "imdbID": "2746600", "rating": 8.0, "votes": 1873, "number_of_episodes": 52}