{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "1769728": "MyAnna Buring", "0378237": "Nicky Henson", "0842596": "Jeremy Swift", "0249876": "Charles Edwards", "1080105": "Alex Carter", "1401022": "Jonathan Howard", "1373910": "Nicky Bell", "3050181": "James Currie", "13639770": "Mark Joslin", "5360921": "Stuart Matthews"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["An unofficial will from Matthew comes into the family's hand, Thomas plots against Anna, Rose gets involved in a scrap at a servant's dance, and Mrs. Crawley tries to reconcile Carson and Trigg.", "Mary receives a letter from Matthew's effects, naming her as his sole heir and therefore the owner of half the estate. Encouraged by Violet, she agrees to shadow Tom and learn more about the running of Downton and its surrounding properties. Edna makes an inauspicious start as Cora's maid but soon forms an alliance with Thomas to discredit Anna. Anna herself accompanies Rose to a tea-dance in York for servants, where Rose, pretending to be a maid, attracts gardener Sam Thawley but also provokes a fight so that a hurried exit is required as the police arrive. Later, Sam turns up at Downton Abbey. Isobel learns that Carson fell out with Charlie Grigg many years earlier over a love triangle.—don @ minifie-1", "Lady Mary may be slowly coming out of her depression. At her grandmother's urging, she spends time with Tom, learning more about the estate and the problems they face. She has something of a surprise when Matthew's effects are sent by his office and they find a letter from him naming her as his sole beneficiary. Rose is bored and talks Anna into accompanying her to a tea dance but mayhem ensues when more than one young man takes an interest in her. Mrs. Hughes is shocked to learn that Lady Cora has re-hired Edna as a lady's maid - mostly on the strength of the reference she had given the girl. Carson refuses to see his old friend Grigg. Molesley's downward spiral continues and he is now working as a laborer in the village, John Bates tries to find some way to give the proud man some money. After making a serious mistake, Edna conspires with Thomas to lay the blame on someone else.—garykmcd", "March 1922. Lord Grantham hesitates, until prodded by the dowager, to show Mary and then the family a letter to her found in Matthew's office, stating his intent to appoint Mary his sole heir. Robert worries about validity as last will given the informal format, which solicitor Murray ends up confirming however, about George being 'passed over', doubled crippling inheritance taxes and Mary's incompetence to be uninvolved in managing the estate. Thomas helps Edna shift the blame for a ruined garment of Cora's on Anna. Jimy delights Ivy with tickets for a musical, and visiting a tea dance in a York jazz club for the servant class afterwards, witnesses a row involving Anna as chaperon and lady Rose, who pretended to be a maid, between her suitor, handsome gardener Sam Thawley, and a dance rival, causing a police raid, yet Sam comes looking for Rose. Violet inspires Tom to discretely teach Mary about the business. Ana worries, discovering that former valet Molesley is in debt, living with his father and working as a laborer, and has debts, Bates gets money from the Dowager Countess, and pretends to repay him an earlier debt. Mrs. Hughes prods Isobel to make Carson look after his impoverished former theater partner Charles Grigg, whom Isobel took in and found a Belfast job for, the cherry on the cake being a reconciliation with Carson, whose late lover preferred the other Charlie.—KGF Vissers"], "genres": "N/A", "imdbID": "2746594", "rating": 7.9, "votes": 1796, "number_of_episodes": 52}