{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0000511": "Shirley MacLaine", "0316079": "Paul Giamatti", "0718619": "Douglas Reith", "5014360": "Poppy Drayton", "0289038": "James Fox", "1472522": "Oliver Dimsdale", "2857778": "Janet Montgomery", "1099188": "Julian Ovenden", "0073121": "Michael Benz", "0144237": "Raquel Cassidy", "3665787": "Tom Cullen", "2542922": "Daisy Lewis", "0094039": "Samantha Bond", "1171145": "Patrick Kennedy", "3923285": "Alastair Bruce", "0930714": "Guy Williams", "0498523": "Pete Lee-Wilson", "0769084": "Andrew Scarborough", "6682374": "Gintare Beinoraviciute", "4701008": "Chris Cowlin", "2903758": "Valerie Dane", "4224794": "James Hare", "13639770": "Mark Joslin", "4474872": "Danielle Kingston", "6245642": "Anthony Milton", "5383458": "Scott Plumridge", "6174145": "Gemma Rourke", "6198524": "Paul Simmons", "3561505": "Evie Wray"}, "geners": ["Drama", "Romance"], "runtimes": ["93"],  "plot": ["Summer of 1923. It's summer and as part of Rose's 'coming out' she is to be presented at Buckingham Palace. The Crawley family go to London to prepare Grantham House for this busy social program.", "1923. A year has passed and Edith returned from Switzerland having secretly had her baby and given her up for adoption. The family and staff journey to London for debutante Lady Rose to be presented to the king. Martha Levinson and her son Harold also turn up and Mary meets both Anthony and Charles, who openly vie for her attention. Rose goes to a club with married friend Freda Dudley-Ward, from whom the cardsharp Sampson steals a love letter from the Prince of Wales. Mary and Charles endeavour to retrieve it in vain, though the escapade brings them closer. John is called upon to help obtain it. Mary is annoyed to learn from Anthony that the supposedly-republican Charles is himself an aristocrat's heir. Mrs Hughes and Mary discover that John was indeed in London on the day of Green's death. Martha attracts gold-digging admirer Lord Aysgarth but sees through him and turns down his proposal, though Harold, to his surprise, charms Aysgarth's daughter Madeleine and the Levinson valet Ethan is completely smitten with Daisy. The Levinsons want her as their cook. Back at Downton Edith hears that Michael has been imprisoned for opposing Hitler and seeks Tim Drewe's help in getting her daughter back.—don @ minifie-1", "The 1923 season has arrived and Rose is to be presented to the King and Queen. They open up their London townhouse and several members of the staff accompany them. Cora's mother Martha and her brother Harold arrive. Lord Aysgarth, in search of a financial safety net, sets his sights on Martha while at the same time pushing his daughter Madeleine in Harold's direction. Edith has also returned from her 8 month stay in Switzerland and has severe doubts about her decision to give up her baby for adoption. When Anna donates husband John's overcoat to charity, Mrs. Hughes finds a ticket stub for a train to London - on the same day Green was killed. Mary learns something interesting about one of her suitors, Charles Blake. The entire Crawley family gets involved in an intrigue when Terence Sampson, whom Edith's friend Michael Gregson caught cheating at cards during a weekend stay at Downton, steals a letter from Mrs. Freda Dudley-Ward, the Prince of Wales' mistress. Once again, it's John Bates who comes to the rescue.—garykmcd", "The family's 1923 annual trip to London is especially festive, with extra guests, as Lady Rose MacClare is among the debutantes presented at Buckingham Palace to the royal couple. Lady Cora's very rich American mother Mary and brother Harold Levinson, resisting Lord Aysgarth and his daughter Madeleine's dowry hunt, stay with the earl's family at Downton. Harold's charming valet Harold Levinson is commandeered to help out the staff, gets a crush on Daisy and convinces his employer to offer her a job as cook back in New York. Earl Crawley feels honor-bound to prevent a 'monarchy crisis' when a compromising letter from Mrs. Freda Dudley-Ward, the Prince of Wales' mistress, is stolen from lady Rose by socialite crook Terence Sampson, already caught cheating at cards by Edith's friend Michael Gregson and trusted to stoop to blackmail or worse, so John Bates is sent to ask a forger for a fake letter to intrude the thief's apartment, but duly foresees that adventure will fail. Thomas Barrow is eager to discredit former staff colleague Tom who showed local Sarah Bunting around t-in the Abbey unchaperoned. Edith discretely settles illegitimate daughter Marsisol's secret adoption. The butler needs several hints before choosing an outing suitable for the staff as reward after the strenuous hosting period.—KGF Vissers"], "genres": "N/A", "imdbID": "2819840", "rating": 8.4, "votes": 2031, "number_of_episodes": 52}