{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0144237": "Raquel Cassidy", "1099188": "Julian Ovenden", "1981245": "Brendan Patricks", "0094039": "Samantha Bond", "3338149": "Gary Carr", "0188221": "Stephen Critchlow", "2542922": "Daisy Lewis", "1551486": "Issy van Randwyck", "0010314": "David Acton", "0363424": "Nigel Harman", "3665787": "Tom Cullen", "5778421": "James Francis Andrews", "6682374": "Gintare Beinoraviciute", "4442665": "Aisling Hughes"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["Cora's playboy brother, Harold, is in trouble, so Robert must travel to America to help bail him out; a new farming venture at Downton sees Blake and Mary putting aside their differences.", "Robert is summoned to America to bail out his reprobate brother-in-law Harold but, after Mrs Hughes has given her the 'official' version of Anna's rape, Mary steps in to let John stay with his wife with his place being taken by Barrow. Barrow is curious as to the change of plan, asking Baxter to find out more, which Molesley overhears. Isobel plans to go with Tom to a meeting addressed by a Liberal MP but stays behind to nurse bronchitis-stricken Violet, and he goes alone, sitting next to Sarah Bunting, an attractive young woman. In London Edith decides she wants an abortion whilst Rose continues to see Jack Ross. Back at Downton, the pigs arrive and Mary takes Charles Blake to view them. He proves invaluable when the animals seem to be in trouble and he and Mary combine to save them, getting covered in mud in the process. Meanwhile Anthony Gillingham returns with Green, who faces Mrs Hughes' anger.—don @ minifie-1", "Robert is summoned to New York by his mother-in-law after her son Harold, Cora's brother, gets himself in serious trouble. Bates can't see himself leaving at this point in his relationship with Anna and asks Mrs. Hughes to help. She in turn tells Lady Mary what has happened to Anna and she convinces her father, without providing any details, to take Thomas as his valet. Mary is still upset with Charles Blake's view of large estates like Downton. They develop a better understanding of one another however when they discover that the newly arrived pigs have fallen ill. The Dowager Countess falls seriously ill and is nursed by Isobel who stays by her bedside night and day. Tom travels to Ripon to hear a Liberal MP speak and there meets Sarah Bunting, a local schoolteacher. Edith still has not heard from Gregson. She knows he arrived in Munich and signed into his hotel, but little else. She travels to London to terminate her pregnancy but her very perceptive Aunt Rosamund knows something is wrong. Alfred is doing well in his training and visits Downton. Rose meanwhile continues to see her handsome band leader, Jack Ross.—garykmcd", "Robert is needed to help his shady brother-in-law in NYC and is talked into taking Thomas as valet rather than Bates, who needs to stay with Anna, Mary impresses Charles Blake with her commitment to save Downton, and Edith contemplates an abortion.—duke1029@aol.com", "Robert reluctantly agrees to sail to New York to help out Cora's squander-bug brother Harold, but is persuaded by Mary without details to take Thomas as valet instead of Bates after Hughes tells Cora about Anna's trauma, which is rekindled by the return of Green. Tom is flat-out with modernization, like introducing pigs on the estate, but a visiting MP rekindles his left political interest and he meets teacher Sarah Bunting. While helping with management, Blake sneers at Mary he doubts whether many families are prepared to adapt enough to survive financially. Given Daisy's bitterness over Ivy 'chasing' Alfred, the women convince Carson to book a pub room from Alfred rather then let him pass in Downton on a home visit. Isobel spots Violet's medical trouble, get Dr. Clarkson and insists to nurse her personally at home through the critical period. Edith confides into Rpsamund growing despair over confirmation Michael is utterly missing and her troublesome pregnancy.—KGF Vissers"], "genres": "N/A", "imdbID": "2752752", "rating": 8.1, "votes": 1674, "number_of_episodes": 52}