{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0144237": "Raquel Cassidy", "6008477": "Joncie Elmore", "0769084": "Andrew Scarborough", "0041323": "Yves Aubert", "5407472": "Kieran Hodgson", "5923991": "Spencer Cowan", "1981245": "Brendan Patricks", "1994157": "Julie Eagleton", "1889111": "Deborah Wise"}, "geners": ["Drama", "Romance"], "runtimes": ["49"],  "plot": ["Mrs. Hughes tells Bates an edited version of Anna's rape, Edith goes to London to see Michael, Alfred takes a culinary test, and the Countess suspects new employee Pegg of theft and Robert tries to keep a tenant.", "Under pressure Mrs Hughes tells John what happened to Anna. Robert is sympathetic to Tim Drewe, whose father, an estate tenant, died owing huge debts, whilst Isobel persuades Violet to employ young villager John Pegg as a gardener, defending the boy when an ornament belonging to the dowager goes missing. Edith is upset that Michael is not returning her calls and there is a disappointment too for Alfred, who fails his trial as a chef at the Ritz and Molesley, who had hoped to replace him on the staff. Mary meanwhile reencounters Evelyn Napier, now involved in a survey of estates which would benefit from downsizing.—don @ minifie-1", "Bates is at a loss to explain the problem with Anna. After overhearing a private conversation, he pressures Mrs. Hughes to tell him what has happened. One of the longtime tenant farmers, much in arrears on his rent, has died and Mary and Tom want to foreclose and have the estate farm the land. Robert reluctantly agrees but bemoans the loss of tradition. After meeting the dead man's son, Robert thinks he may have another solution. Alfred has applied for a position as a chef at the Ritz in London and has been invited to undertake a cooking test. Everyone at Downton, except Jimmy, is rooting for him. With Alfred's expected departure, Carson offers the position of footman to Moseley, who dreads accepting a permanent position that he feels is beneath him. Edith travels to London to visit a doctor.—garykmcd", "May 1922. Thomas is pleased that new lady's maid Baxter pleases Cora, as she agrees to spy for her 'mentor' on the family. Alfred is selected for Ritz chef Arsene Avignon's gourmet training course, so Patmore and (mixed-feelings) Daisy keep coaching him although Jimmy can't see it as a career. Mary pretends not to care that Lord Tony is formally engaged to heiress Mabel, and pleased with a visit from Evelyn Napier, who makes on official survey of estates' prospects of economical survival and accepts to stay at Downton if he his boss comes along. The earl is inclined to take Tom and Mary's advise to cancel the lease on a long-standing family of tenants since the indebted incumbent Drewe's death, but agrees instead to advance the arrears personally when unaware heir Tim appeals to Yorkshire loyalty. Carson considers re-hiring Mr Molesley as footman in case Alfred leaves to a program, but Molesley hesitates about accepting this 'demotion' until Alfred fails 'this time' to make the final cut, hence remains unemployed. Isobel and Dr. Clarkson persuades Violet to employ young villager John Pegg as assistant gardener and dissuade her from firing the knave again as prime suspect for some thefts in the house since he tends to the indoor plants. Cora must persuade nervous Mrs Patmore to exchange their ice-box for a refrigerator, even after Baxter's equally 'scary' sewing machine solved her apron emergence. Edith visits a London doctor. Tom considers moving to America. Bates overhears Mrs Hughes feeling to persuade Anna to explain her behavior to him and threatens to leave till she confides that 'a stranger' broke into the servants' hall and raped Anna. Bates and relieved Anna reconcile, but he guesses it was Green who raped her.—KGF Vissers"], "genres": "N/A", "imdbID": "2752744", "rating": 8.1, "votes": 1689, "number_of_episodes": 52}