{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0098414": "Di Botcher", "0302338": "Bernard Gallagher", "0790382": "Helen Sheals", "1769728": "MyAnna Buring", "0378237": "Nicky Henson", "0249876": "Charles Edwards", "2061101": "Tristan Beint", "0842596": "Jeremy Swift", "0910040": "Harriet Walter", "0871579": "Moray Treadwell", "0079451": "Nigel Betts", "6682374": "Gintare Beinoraviciute", "2220152": "Christina Carty"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["Mary is still inconsolable six months after Matthew's death, Edith supports Michael going to Germany to divorce his wife, Molesley looks for a job, and there is a surprise applicant for Ms. O'Brien's job.", "Six months later and Mary is still mourning Matthew, leaving the care of baby George to Nanny West. Tom tries to interest her in estate management, to little avail, but Violet eventually persuades her to look to the future. Miss O'Brien leaves without any explanation to take work with Lady Flintshire, Rose's mother. Mrs Hughes is less than happy with Cora's replacement for her, Edna, a former maid who tried to seduce Tom. Edith goes to London, where Michael tells her he is prepared to go to Germany for a divorce so that they can be together. She brings electric kitchen gadgets back, which the maids like but which confuse Mrs Patmore. Jimmy takes Ivy out, and she gets drunk, annoying jealous Daisy and Alfred. Violet's efforts to get Molesley, redundant after Matthew's death, work with her friend Lady Shackleton are sabotaged by the lady's current butler whilst Isobel agrees to rescue Carson's old friend Grigg from the workhouse. Thomas seems unnaturally unpleasant towards Nanny West but is vindicated when Cora finds her being cruel to Tom's daughter and dismisses her.—don @ minifie-1", "It's now been six months since Matthew Crawley's death in a car crash and, with one notable exception, life at Downton is slowly returning to normal. The exception is the widowed Lady Mary whose deep depression continues. Lord Grantham, once again in sole command of the estate, is adamant that everyone should simply let her recover from her loss at her own pace. Tom, however, needs her if they are to continue to implement the changes Matthew had in mind. The servants are all atwitter when its revealed that O'Brien has left suddenly to work for Rose's mother, now on a posting in India. Rose puts a card in the village shop window to see if she can find a replacement. Edith's relationship with her London editor continues to grow. Thomas takes a dislike to the children's nanny and tells lady Cora he thinks she is unsuitable. That seems to be the case when Cora hears her verbally abusing baby Sybil. Sadly, Molesley has been unable to find work since Matthew's death but the Dowager Countess steps in to see if she can arrange something.—garykmcd", "Thomas and the haughty new, aloof nanny West instantly dislike each-other, so he warns lady Cora who throws her out for talking about baby Sibyl as fruit of sin. While Patmore worries kitchen appliances may make staff redundant, anonymous Valentine card speculation contributes to Ivy accepting a pub invitation from Jimmy, only to be carried back drunk. The late Matthew's valet is superfluous, so Carson has unfortunate Molesley move back to his father farm, where Violet picks him up to be showcased for high tea guest Lady Shackleton, who is considering to hire a new butler, but her own suspicious Spratt masterly sabotages his potential rival. Even six months after Matthew's fatal car accident, earl Robert keeps shielding Mary from real life to mourn, opposing attempts to find her new interests, not just George, especially helping Tom run the estate. Carson simply disposes of begging letters from his former vaudeville partner Charles Grigg, whom Mrs. Hughes finds in a Dickensian workhouse, so she pushes Isobel to help, also as occupational therapy after the loss of her perfect son. O'Brien having accepted a job in India, Mrs. Hughes regrets the reference she gave to former maid Edna Braithwaite which she uses to apply as lady's maid to Cora's liking. Edith is delighted her editor-lover Michael Gregson wants to apply for a foreign nationality so he can divorce his crazy wife, worried it has to be beaten foe Germany.—KGF Vissers"], "genres": "N/A", "imdbID": "2530858", "rating": 8.1, "votes": 2057, "number_of_episodes": 52}