{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "3982608": "Matt Milne", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "4925834": "Cara Theobold", "0934362": "Penelope Wilton", "0363424": "Nigel Harman", "0249876": "Charles Edwards", "1171145": "Patrick Kennedy", "0202945": "Joanna David", "2791401": "Andrew Alexander", "3665787": "Tom Cullen", "1769728": "MyAnna Buring", "0094039": "Samantha Bond", "3338149": "Gary Carr", "7160292": "Matthew Canny", "1994157": "Julie Eagleton", "13639770": "Mark Joslin", "5045226": "Hugh O'Brien", "1889111": "Deborah Wise"}, "geners": ["Drama", "Romance"], "runtimes": ["50"],  "plot": ["Anthony Gillingham returns to Downton to propose to Mary, Edna tries to coerce Tom into marrying her, and Anna will not tell Bates what's bothering her.", "As the guests leave, Anna keeps her rape by Green from John but is distant towards him and considering separate sleeping arrangements. Tom feels guilty after succumbing to Edna's advances again and seeks help from Mrs Hughes. Mary and Tom go to London on business, taking Rose, who is charmed by black American vocalist Jack Ross. On her return home, Mary is followed by Anthony who, despite being betrothed to another woman, proposes marriage. Edith stays in London and has sex with Michael, though her aunt, Lady Rosamund, warns her that the relationship could be doomed and her reputation lost. Alfred announces that he is hoping to become a chef whilst Isobel agrees to help Dr. Clarkson run an out-patient clinic.—don @ minifie-1", "Anthony Gillingham has fallen in love with Mary and is prepared to end his current engagement if Mary will have him. Tom finds himself in something of a predicament having spent the night with Edna. She's afraid she might be pregnant and wants him to marry her if she is. It's obvious to everyone that something is wrong and he turns to Mrs. Hughes for advice and help. In London, Edith finally succumbs and spends the night with Michael - she gets a stern talking-to from her aunt Rosamund the next morning. Rose is in London as well and meets a handsome band leader, Jack Ross. Alfred continues to pine for Ivy but finds her and Jimmy kissing.—garykmcd", "Thomas is amused to see that maid Edna, who boasted the fellow schemer would soon be glad to be in her good books, is made to leave Downton after attempting to blackmail gloomy Tom, after an intimate night she seduced him too, to wed her in case of pregnancy. Jimmy can't understand Alfred's ambition to become a cook, the latter reconsiders taking Ivy along to the selection for a free prestigious culinary course after seeing her kiss Jimmy, who just wants to enjoy life. Mrs. Hughes can't convince Anna to explain her aloof attitude to worried-sick Bates, whom she fears would kill Green, so helps her cover up and move back to the maids quarter. Green is back in view as Lord Anthony Gillingham seizes any opportunity to see Mary again, in London and back at Downton. There he proposes but can't decide her, despite the consideration he can't keep promising engagement to alternative fiancee Lady Mabel, so they part with a one-off 'souvenir' kiss. Visiting aunt Rosumund in London, naive Rose dances eagerly with Sir John Bullock, who misbehaves drunk, and feels 'rescued' by Afro-American jazz singer Jack Ross, while Tom actually pulls her back to Cora's party. Tom and Mary are breaking Robert's opposition to paying off the inheritance tax, without selling land. Edith is rebuked, having been seen by staff sneaking in after a wild night with Michael, who is about to go live in Germany to obtain citizenship. Dr. Clarkson recruits Isobel to help set up and run a hospital-dependent village clinic.—KGF Vissers"], "genres": "N/A", "imdbID": "2746602", "rating": 7.8, "votes": 1748, "number_of_episodes": 52}