{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0328828": "Matthew Goode", "0035605": "Alun Armstrong", "0269077": "James Faulkner", "0236069": "Penny Downie", "3195528": "Matt Barber", "0426855": "Sue Johnston", "0842596": "Jeremy Swift", "0718619": "Douglas Reith", "0784884": "Rade Serbedzija", "3584285": "Hannah Wood", "0487743": "Jane Lapotaire", "0185329": "Jonathan Coy", "0242762": "Sebastian Dunn", "2227000": "Harry Hadden-Paton", "1373220": "Alice Patten", "5320024": "Michael Fox", "6697291": "Oliver Barker", "8965395": "Zac Barker", "4708733": "Fifi Hart", "4080430": "Stephen Mason", "6245642": "Anthony Milton", "5106100": "Jason Nicholls", "7188212": "Eva Samms", "9263930": "Karina Samms", "5590700": "Graham Saxon", "11697510": "Sarah Seymour"}, "geners": ["Drama", "Romance"], "runtimes": ["93"],  "plot": ["Autumn of 1924. It's grouse shooting season and Rose's father-in-law invites the Crawley family to a shooting party in Northumberland.", "It's grouse-shooting season, and Rose's father-in-law, Lord Sinderby, has rented out Brancaster Castle in Northumberland and invited the Crawley family to a shooting party. Stowell, the Sinderbys' butler, has an ax to grind and a scandalous secret threatens to undermine the holiday. Surprises are in store as the families become better acquainted with each other and some new faces arrive on the scene. Meanwhile, the servants hold the fort back at Downton.—Anonymous", "The Crawleys and Tom spend a weekend with the Sinderbys, where a secret from the obnoxious lord's past is revealed and Barrow crosses swords with snobbish butler Stowell. Mary meets the dashing Henry Talbot whilst Edith is introduced to his friend Bertie Pelham. Back at Downton for the Christmas holidays, both Tom and Isobel have announcements to make whilst Violet reunites Kuragin with his imperious wife, who is less than grateful. Meanwhile, John makes a sacrifice to get Anna bail with Baxter and Molesley determined to prove that both partners are innocent of killing Green, and Carson and Mrs Hughes make plans for the future.—don @ minifie-1", "Grim snob Lord Sinderby puts his even haughtier butler Stowell in charge of all staff when hosting his new in-laws at a moorland castle he rented in Northumberland for dinner and grouse hunt, Autumn 1924. Thomas is grumpily commandeered as ad hoc valet, hence over-eager to set up Stowell at Rose's request, after his systematic rude ignoring 'upstart' Tom. The last ploy having learned secrets embarrasses the host by trick-inviting his bastard son's mother, but the Granthams helping to cover up wins them full acceptance, also for Mary is Atticus's loyal wife. At the hunt, Robert's health problem becomes impossible to hide, luckily only an ulcer, but Mary gets intrigued by estate manager Henry Talbot. Spratt and Denker's feud embarrasses themselves, mildly amusing Isobel, who decides against marrying Lord Merton on account on his sons's hostility, and Violet, who receives princess Kuragin, refusing an affair with her husband, confiding Irina saved her from ruin by stopping their St.Petersburg fugue. Carson finds a suitable home, learns Hugues can't afford paying a share due to a mentally disabled sister and proposes to her. Hearing Anna despairs in jail over her abusive father's incriminating input, Bates leaves a false confession and fleas to Ireland, until the earl can recall him in time for Christmas at Downton. Thomas is happy Andy is engaged as new footman. Tom gets a warm send-off, planning to emigrate, as Atticus to a US job.—KGF Vissers"], "genres": "N/A", "imdbID": "3962976", "rating": 8.9, "votes": 2180, "number_of_episodes": 52}