{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1099188": "Julian Ovenden", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0094039": "Samantha Bond", "1266378": "Emma Lowndes", "0769084": "Andrew Scarborough", "2542922": "Daisy Lewis", "1239465": "Louis Hilyer", "0911575": "Howard Ward", "0842596": "Jeremy Swift", "3195528": "Matt Barber", "0718619": "Douglas Reith", "3424227": "Alex McNally", "0001290": "Richard E. Grant", "0784884": "Rade Serbedzija", "0747674": "Christopher Rozycki", "2397300": "Catherine Steadman", "6697291": "Oliver Barker", "8965395": "Zac Barker", "5552975": "Lauren Beacham", "4802819": "Georgina Bennett", "1994157": "Julie Eagleton", "7188212": "Eva Samms", "9263930": "Karina Samms"}, "geners": ["Drama", "Romance"], "runtimes": ["50"],  "plot": ["Tom ends his relationship with Sarah, Rose meets a young man of Russian descent, Rosamund's visit to Marigold has consequences, Mrs. Patmore asks advice for her inheritance, and Simon Bricker expresses his love for Cora.", "Tom breaks off his friendship with Sarah but, on learning that she is moving to another job in Preston and encouraged by Daisy, wishes her well and thanks her for reminding him who he is. Rose meets Atticus Aldridge, a young lawyer of Russian-Jewish descent, who invites her to call on him when she is in London whilst the police interview Anna regarding Green's death, to the interest of Barrow, whose unhealthy complexion is getting noticed. Baxter relates her crime to Molesley and the pair grow closer. Violet's daughter Rosamund visits and the dowager tumbles to the fact that Marigold is Edith's daughter. The two older women want to get her away to France but Edith hopes to take her to London instead. Bricker tries to force himself on Cora but is interrupted by Robert.—don @ minifie-1", "The police continue to investigate the death of Mr. Green, this time interviewing both Anna and Lady Mary. An Inspector from Scotland Yard accompanies the local policeman. Thomas is definitely looking the worse for wear and he continues to dabble in some kind of self-inflicted treatment. Rose meets a handsome young man, Atticus Aldridge, at her refugee shelter and gets an invitation to dinner the next time she is in London. Lord Grantham's sister Rosamund visits Downton and quickly realizes that Edith has brought her daughter back from Europe. Violet is soon aware of the situation and proposes a solution. Also visiting Downton is Simon Bricker who chooses the most awkward moment to enter Lady Cora's bedroom - just as Lord Grantham returns late one evening from what was supposed to be a night away. Sarah Bunting has news for Tom Branson.—garykmcd", "Realizing Sarah can't keep her revolutionary mouth, hence will never fit with family, Tom tells her it's time to part, prompting her to accept a teaching position elsewhere. Self-medicating Thomas snaps at Baxter not to meddle in his presumably venereal condition, Molesley learns of her crime but sides with her 'as victim'. Atticus Aldridge is charmed by gentleman Atticus Aldridge who carries her bags to the refugees and confides Russian ancestry, but count Rostov rudely walks away realizing it's a pogrom emigrant's offspring, who must join his London law firm. Cook Patmore inherited a few hundreds and acts investment advice, so Carson passes on thee earl's choice of contractor to execute a housing project that won't deface the estate, but the housekeeper talks her into what she knows better: buying a cottage and take tenants until retirement. The dowager and doctor Clarkson worry Violet may end unhappy and lonely if she accepts to wed Lord Merton, who alas shows real interest in medicine. Convinced that Edith shows off Marigold to Robert's sister Rosamund Painswick, who realizes the truth, farmer Tim Drewe's wife demands to keep her out or move out of town. Ignoring Robert's wishes, Cora invited Simon to stay in Downton again, but while the earl is out on duty as Lord Lieutenant the art expert intrudes her bedroom, to be caught and decked at Robert's early return, spelling a marital crisis.—KGF Vissers"], "genres": "N/A", "imdbID": "3696132", "rating": 8.0, "votes": 1595, "number_of_episodes": 52}