{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "3665787": "Tom Cullen", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1099188": "Julian Ovenden", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "0934362": "Penelope Wilton", "0790382": "Helen Sheals", "0769084": "Andrew Scarborough", "1266378": "Emma Lowndes", "2542922": "Daisy Lewis", "1133584": "Ben Bradshaw", "2436839": "Simon Lawson", "0449790": "Roberta Kerr", "0718619": "Douglas Reith", "0001290": "Richard E. Grant", "0705370": "Naomi Radcliffe", "6778190": "Oliver Ashworth", "0323140": "Jon Glover", "0283518": "Keiran Flynn", "0911575": "Howard Ward", "6697291": "Oliver Barker", "8965395": "Zac Barker", "1994157": "Julie Eagleton", "4708733": "Fifi Hart", "5383458": "Scott Plumridge", "7188212": "Eva Samms", "9263930": "Karina Samms", "4039414": "Chris Townsend"}, "geners": ["Drama", "Romance"], "runtimes": ["49"],  "plot": ["James leaves Downton, Mary has a weekend rendezvous with Gillingham, Carson and the Earl disagree for the site of the War memorial, a wireless becomes part of Downton life, and Edith becomes Marigold's godmother.", "Plans for the war memorial do not go as smoothly as hoped. Rose tries to get a wireless at Downton, while Mary goes to Liverpool for her weekend with Lord Gillingham. Edith wants to get more involved in baby Marigold's life and Baxter still refuses to reveal her whole story. Art historian Simon Bricker is a houseguest who seems to be interested in more than just the paintings at the Abbey.—Anonymous", "Jimmy is dismissed and Barrow reveals Baxter's crime to Molesley, who defends her whilst believing that she may have had an accomplice. Tim, against his wife's wishes, suggests that Edith take Marigold on visits to the abbey whilst Sarah, as well as giving Daisy lessons to improve her position, suggests to Tom that his future lies away from Downton. The reactionary Robert still regards her as the enemy though he does succumb to Rose's request to install a wireless. Simon Bricker, an art historian, visits with Charles Blake and flirts with Cora. Mary tells Charles she prefers Tony Gillingham and, armed with contraceptives awkwardly purchased for her by Anna, sets out for a tryst with Tony in a Liverpool hotel. Meanwhile a policeman comes to Downton Abbey to re-investigate the death of Green.—don @ minifie-1", "Lord Grantham finds himself at odds with the committee - including Carson - looking to erect a memorial to those killed in World War I. They would like to build a memorial garden where visitors could sit in quiet contemplation. The problem is that the ideal location would be where the cricket pitch is located. Rose is continually dropping hints that they should acquire a new wireless radio but Robert thinks it's all a fad that will quickly pass. News that the King will make radio address at the opening of the Empire exhibition has him reconsidering. Edith decides to get more involved in Marigold's life. The police are investigating Mr. Green's death. Mrs. Patmore may have found a solution to Daisy's problem with arithmetic by hiring Sarah Bunton as a tutor. Lady Mary and Lord Gillingham head off for their tryst in Liverpool. A sacked Jimmy goes on his way.—garykmcd", "Thomas sadly is the only one giving a warm goodbye to junior footman 'Jimmy', his only friend, and forces Molesley to face the gravity of Bacter's prison sentence, while Cora can't make up her mind whether to sack the jewel thief in charge of her treasure. The earl isn't inclined to allow the new wireless 'rage' Rose hints at, but still feels obliged to lease one for the royal speech, attended by the whole household, after which he agrees to keep it. As monument committee chair, Carson questions the Lord's reluctance to sacrifice the cricket pitch rather then erect it in the village, but an example of kin piety settles their minds. Robert is in a foul mood as Tom openly opposes his conservative views under the 'revolutionary' influence of his commoner lover Sarah, who gives private lessons to kitchen maid Daisy and is feared one day to lure with Tom and grandchild Sybbie away. Still Edith gets permission to get more openly involved with Marigold, whose adoptive mother isn't inclined to be grateful as teacher husband Tim Drewe hoped. Mary eagerly hosts flirtatious art historian Simon Bricker, tells Charles Blake she decide against him and sneaks off to a Liverpool hotel as love nest with Lord 'Tony' Gillingham. Preparing Rose's refugee project, Dr. Clarkson appreciates the dowager's advice even with friend Isobel. Anna Bates is worried to overhear friendly police sergeant Willis warn Carson there's a new witness in the case of the death of valet Green.—KGF Vissers"], "genres": "N/A", "imdbID": "3666186", "rating": 7.9, "votes": 1668, "number_of_episodes": 52}