{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "3665787": "Tom Cullen", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1099188": "Julian Ovenden", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0426855": "Sue Johnston", "0784884": "Rade Serbedzija", "1266378": "Emma Lowndes", "0769084": "Andrew Scarborough", "0842596": "Jeremy Swift", "1239465": "Louis Hilyer", "0911575": "Howard Ward", "2743672": "Jamie Bradley", "3195528": "Matt Barber", "2397300": "Catherine Steadman", "0236069": "Penny Downie", "0269077": "James Faulkner", "2416484": "Matthew Jure", "6697291": "Oliver Barker", "8965395": "Zac Barker", "4304212": "Pamela Betsy Cooper", "1994157": "Julie Eagleton", "4708733": "Fifi Hart", "7188212": "Eva Samms", "9263930": "Karina Samms"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["Violet's new maid doesn't seem to be working out, Kuragin reveals he still loves Violet, Anna realizes Bates' innocence, and Thomas reveals a secret to Baxter.", "Violet has a new maid, Denker, who makes it clear to her what she regards as the limitations of her duties. She accompanies Violet to see Prince Kuragin with news of his wife's whereabouts but the dowager is shocked when Kuragin reveals that he still loves her. An anonymous letter to the police has them questioning Baxter as to whether John ever went to London, though she is unable to help. Aware that it was sent by Barrow she is forgiving enough to take him to see Dr Clarkson when his treatments have a negative effect on him. Robert and Cora reconcile as Robert accepts Mary and Tom's view that they should build decent houses on Downton land whilst John discovers Mary's condoms in Anna's cabinet and accuses her of not wanting to bear his child out of belief that he killed Green. Edith learns that Michael Gregson has been murdered by Fascist thugs and that she now owns his publishing company. Most of the family attend a point-to-point race, where Blake parades new girlfriend Mabel in front of Mary and Rose introduces Atticus's aristocratic parents to the Crawleys. Edith decides to take Marigold.—don @ minifie-1", "Lady Edith finally learns of Gregson's fate but is upset that everyone around her is simply going on with their lives rather than mourn her loss. She decides to take baby Marygold - Mr. Drewe finally tells his wife the truth - and runs off. The police are back again but surprisingly want to speak to Baxter after receiving an anonymous letter saying she had information in the the matter of Green's death. She doesn't, but she knows who sent the letter. Thomas' health continues to deteriorate and Baxter insists he visit the doctor. Lady Mary tries out a fashionable new hairdo and decides to participate in a horse race sponsored by Atticus Aldridge's father. Anna and John have a falling out when he comes to believe she doesn't want to bear his children. Violet meanwhile is having difficulty with her new ladies maid and is shocked to hear that Prince Kuragin still has feelings for her after all of these years.—garykmcd", "Unable to stand the pain of his infected self-injections, Thomas let Baxter take him to Dr. Clarkson, who concludes any 'gayu therapy' is pointless nonsense. Accompanying Patmore to inspect the cottage she buys for retirement inspires Carson to suggest to Hughes they might do the same together. Robert must decide whether to end his marriage despite Cara swearing innocence, his dog Isis is listless. Edith is gutted when the news arrives her lover Michael Gregson died in German captivity and left her his magazine, shocked by Rose's frivolous fashion and leaves Downton, seeing only Tom, and manages to collect half-orphan Marigold after Tim Drewe helps convince his wife she's the mother. The rest of the family attends the horse race sponsored by Atticus's family, Rose even enters and banters with dumped Tony's pushy new date Mabel Lane Fox. Violet finds her new maid Denker confronts butler Spratt and promises not to oppose Isobel's acceptance of Lord Merton's proposal. Violet refuses to consider 'running away' with prince Kuragin, who cares little his wife may be found alive, but is shocked to hear Mary's date Atticus is Jewish. Having found Mary's condoms, Bates fears his wife lied about wishing his child and comes clean about his trip to London and mere murder intent, but the unused return ticket that might clear him is missing and the police comes ever closer in the Greene case. Molesley insist to help Daisy study, confiding he was a promising pupil but his family couldn't afford school fees.—KGF Vissers"], "genres": "N/A", "imdbID": "3810550", "rating": 8.2, "votes": 1608, "number_of_episodes": 52}