{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "3665787": "Tom Cullen", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0426855": "Sue Johnston", "0784884": "Rade Serbedzija", "1239465": "Louis Hilyer", "0911575": "Howard Ward", "2270222": "Dean Ashton", "0842596": "Jeremy Swift", "5320024": "Michael Fox", "0250718": "Peter Egan", "0629498": "Phoebe Nicholls", "0236069": "Penny Downie", "0269077": "James Faulkner", "3195528": "Matt Barber", "4072776": "Sophie Cosson", "5751429": "James Phelips", "2397300": "Catherine Steadman", "0189562": "Sarah Crowden", "1561634": "Darren Machin", "0178674": "Paul Copley", "5778421": "James Francis Andrews", "6697291": "Oliver Barker", "8965395": "Zac Barker", "3678627": "Ray Burnet", "6646151": "Ethan Chapples", "5404549": "Alexander Cooper", "5888932": "Roman Green", "4708733": "Fifi Hart", "3863069": "Jefferson King", "5628754": "Maya Lindh", "5045226": "Hugh O'Brien", "2274343": "Tina Simmons", "7698981": "Albert Tang", "4420365": "Nathan Webb"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["Kuragin tells Violet he wants to live with her, someone tries to break up the Atticus Rose wedding, Daisy wants to live in London, and Anna is accused of Green's murder.", "Violet is shaken when Kuragin confesses that he loves her and wishes to remain with her rather than locate his missing wife. The family then goes to London for Rose's wedding where her sour mother Susan makes it clear that she and estranged husband Shrimpy are only putting up a show of togetherness for the wedding and she is as disapproving of the match as Lord Sinderby. On his stag night Atticus is tricked into appearing shirtless with a prostitute and the photo sent to Rose. Anna and John are summoned to Scotland Yard and told that Green was well-known as a sexual predator though they feign innocence. Anna takes part in an identity parade and is released but later arrested, as she was seen at the spot where Green died. The others return to Downton for the unveiling of the war memorial.—don @ minifie-1", "Everyone is in London for Atticus and Rose's wedding, including Rose's soon to be divorced parents. Lord Sinderby continues to object to his son's choice of bride but Atticus' mother forces him to temper his views. Rose wants her parents to pretend they are together as Lord Sinderby doesn't approve of divorce and they agree to go along but Rose's mother Susan does so reluctantly. Someone is out to wreck the wedding however when Atticus is set up for some compromising photos. Violet's admirer, Prince Kuragin, has some shocking news for her. Violet's maid, Denker, is taking advantage of a young footman they've hired for the wedding and Thomas decides to intervene. The investigation into Mr. Green's death continues with Anna required to attend an identity parade at Scotland Yard. It all leads to a shocking result. Back in the village the war memorial is revealed and Robert has a surprise for Mrs. Patmore.—garykmcd", "The family moves to the Grantham House in London for Rose's wedding. Scotland Yard demands Anna report there, as turns out for a line-up. Ambitious but naive young Londoner Andy is hired as extra valet, but needs Thomas's help to be saved from Denker dragging him along to a gambling club. After Spratt's ploy to discredit Denker backfires, Violet is shocked that prince Kuragin proposes becoming lovers again, regardless if the princess turns up. Rose's parents are openly on cold terms. Lord Sinderby admits hating the next generation would no longer be Jewish, but denies being behind indiscreet pictures taken by a harlot who sort of intruded Atticus's room after he left his bachelor party safely early. Rose duly believes her groom, her father finds out her sanctimonious mother set them up and warns her to keep their impending divorce secret, which she still tells about hoping conservative Lord Sinderby will pull the rug, but his wife threatens divorcing him. Molesley finally starts visiting museums, which inspires Daisy to consider defecting for a London job, which grieves Patmore, but she decides to finish school first. The earl asks Patmore to attend the war memorial opening, and surprises her by also honoring her late 'coward' kin Archie.—KGF Vissers"], "genres": "N/A", "imdbID": "3810558", "rating": 8.6, "votes": 1687, "number_of_episodes": 52}