{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "3665787": "Tom Cullen", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "1968873": "Ed Speleers", "0934362": "Penelope Wilton", "1266378": "Emma Lowndes", "0769084": "Andrew Scarborough", "0790382": "Helen Sheals", "0107372": "Patrick Brennan", "2542922": "Daisy Lewis", "0842596": "Jeremy Swift", "0910040": "Harriet Walter", "0718619": "Douglas Reith", "0151250": "Anna Chancellor", "4629351": "Louise Calf", "5549480": "James Joyce", "5082862": "Josh Dinneen", "4708733": "Fifi Hart", "4080430": "Stephen Mason", "7188212": "Eva Samms", "9263930": "Karina Samms", "6343834": "Charlie Watson"}, "geners": ["Drama", "Romance"], "runtimes": ["67"],  "plot": ["Tim Drewe guesses the parentage of Marigold, Mary receives another proposal from Tony, Violet plays matchmaker, Thomas continues to press Baxter for information with blackmail, and a flash fire threatens the mansion.", "The general Election of 1924 brings a Labour government into power, to the consternation of Robert and Carson, though many of the staff are pleased to have a prime minister from the working class. A village delegation, building a war memorial to local dead, requests Carson, not Robert, to head its committee and the class-bound butler feels awkward, ensuring the earl is made a patron. Tim Drewe tells Lady Edith he knows that Marigold, the daughter he and his wife have adopted, is her child whilst Lady Mary receives another proposal from Tony Gillingham. Violet organizes a lunch party to match Isobel with Lord Merton though Isobel resists and at Robert and Cora's anniversary dinner supports Sarah Bunting and Tom's view that the war was futile. Robert immediately takes a dislike to Sarah. Barrow continues to pressurize Baxter to disclose damning information on John Bates but, encouraged by the adoring Molesley, she tells Cora her secret, that she was imprisoned for theft from an employer, so the plan backfires on Barrow. However, he becomes a hero for rescuing the unhappy Edith, who has accidentally started a fire in her bedroom. Subsequent evacuation leads to the discovery of young footman Jimmy nude in bed with his former employer, saucy guest Lady Anstruther.—don @ minifie-1", "It's now 1924 and there is consternation, both above and below stairs, about the recent election of a Labour government. The younger generation see the shift as a form of modernization while the older generation - particularly Lord Grantham, the Dowager Countess and Mr. Carson - see it as an attack on the traditional way of doing things. Robert is shocked when a delegation from the village asks for Carson to head their World War I memorial committee. As well, he takes an immediate dislike to Tom's friend, schoolteacher Sarah Bunting, which leads to a disagreeable exchange at dinner. Lady Mary has yet to choose a husband but Lord Gillingham seems to be the front-runner and he proposes they become lovers and go away together for a few days. Lady Edith's daughter Marigold is now living with one of the families on the estate but she is finding the separation quite difficult. Below stairs, Thomas continues to pressure Baxter to provide him with gossip but it's Molesley who counsels her to reveal her secret to Lady Cora. Everyone is put in danger when a fire breaks out in Lady Edith's room.—garykmcd", "The earl, his mother and butler grumble, with some staff, youth and female opposition, against the 1924 elected first-ever Labour government, expected to start destroying their traditional world. Still Robert insists Carson must accept when asked, rather then the earl who is expected to donate the land, to chair a committee for a Great War monument. Footman James 'Jimmy' Kent duly fears, despite Thomas's protection, when his former employer Lady Anstruther stays at the Abbey and clearly can't keep his paws off him. The earl openly disapproves of Tom liaising with progressive primary teacher Sarah Bunting, yet the family attends the school's annual awards which a daughter is asked to present, while adopting teacher Tim Drewe guessed Edith's secret but vows to keep her maternity secret. Dowager Violet organizes a lunch party to match Lord Merton to Isobel, who upsets the earl with modernist views, supporting Sarah. As Thomas threatens to tell the countess about Baxter's secret unless she confides Bates's, Molesley convinces her to come clean first about her theft prison term to Cora, who meanly turns on Thomas instead. Tony Gillingham gets Mary to agree, if still not to marriage, to a discrete affair. After careless Edith starts a fire, vigilant Thomas saves her and enables timely measures so the damages are minimal, except for James who gets 'good references' having been fully discovered in bed with Anstruther.—KGF Vissers"], "genres": "N/A", "imdbID": "3325518", "rating": 8.2, "votes": 1844, "number_of_episodes": 52}