{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "3665787": "Tom Cullen", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1099188": "Julian Ovenden", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0784884": "Rade Serbedzija", "0747674": "Christopher Rozycki", "0718619": "Douglas Reith", "0094039": "Samantha Bond", "1266378": "Emma Lowndes", "6463102": "James Cave", "2397300": "Catherine Steadman", "0769084": "Andrew Scarborough", "0250718": "Peter Egan", "0001290": "Richard E. Grant", "2542922": "Daisy Lewis", "0911575": "Howard Ward", "5778421": "James Francis Andrews", "6697291": "Oliver Barker", "8965395": "Zac Barker", "5552975": "Lauren Beacham", "1994157": "Julie Eagleton", "4708733": "Fifi Hart", "2437302": "Adam Lannon", "2998226": "Robert Roman Ratajczak"}, "geners": ["Drama", "Romance"], "runtimes": ["49"],  "plot": ["The Countess confesses her past with Prince Kuragin, Lord Merton proposes to Isobel, Rose's parents are divorcing, Lord Grantham becomes jealous of Simon, and Lady Mary tells Gillingham she won't marry him.", "Violet and Isobel visit the soup kitchen Rose is running for the Russian refugees and Isobel is surprised when Violet confesses that Prince Kuragin once asked her to run away with him. Isobel herself is flattered by Lord Merton's sincere marriage proposal but asks for time to consider whilst Mary travels to London to reject Tony's offer. He is persistent but by chance she meets and dines with Charles Blake. Edith hears that Michael may be alive but in prison in Germany for opposing Fascists, though is upset when the Drewes refuse to let her see Marigold. Bricker's reappearance angers Robert, as does Sarah Bunting's continual challenge to his authority, causing him to ban her from the house. Baxter discovers that Barrow is attempting to 'cure' his homosexuality whilst the police continue to rake up Green's death, especially as, whilst in London with Mary, Anna visited the spot where he was killed.—don @ minifie-1", "Violet and Isobel visit Rose at the shelter and of course see her former admirer Prince Kuragin. She tells Isobel that he once asked her to run away with him.The war memorial is under construction but Mrs. Patmore can do little to add her nephews name to the site. Rose's father returns from his posting to Bombay and she learns that her parents are getting a divorce. Isobel receives a proposal of marriage from Lord Merton who freely admits that he is very much in love with her. After the incident in London, Lord Grantham is not very pleased to hear that Simon Bricker is returning to Downton. Thomas has returned from his leave and is up to something peculiar in his room. Lady Mary goes to London to tell Gillingham she will not marry him but he won't take no for an answer. Lady Edith learns Michael's office may be getting closer to learning what has happened to him. Sarah Bunting is invited to dinner but she again confronts Lord Grantham.—garykmcd", "After visiting the wretched soup kitchen for Russian refugees, dowager Violet confides in Isobel she declined running away with prince Kuragin when he asked her in St. Petersburg. Thomas is furious, after his private visit, that sanctimonious traitor Anna guesses he's self-medicating a probably venereal condition, while the police investigation closes in on her involvement in valet Greene's death. Earl Grantham disapproves of Cara inviting flirtatious art expert Simon Bricker to Downton again and bans Sarah Bunting after another 'revolutionary' provocation at dinner. Isobel needs time to consider Lord Merton's sincere marriage proposal. Lord 'Tony' Gillingham doesn't simply accept Mary's refusal to marry him after their love nest week. Already worried-sick as Michael's office suggests he may be prisoner in Nazi Germany, Mary hears farmer Tim Drewe's wife turned hostile to her 'toying' with Marigold. Rose learns her father, returned from colonial Bombay, is divorcing her mother. Mrs. Patmore remains gutted her nephew won't be mentioned on the war memorial.—KGF Vissers"], "genres": "N/A", "imdbID": "3714404", "rating": 8.0, "votes": 1623, "number_of_episodes": 52}