{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "3665787": "Tom Cullen", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "0296219": "Joanne Froggatt", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "1099188": "Julian Ovenden", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0094039": "Samantha Bond", "2397300": "Catherine Steadman", "3195528": "Matt Barber", "0236069": "Penny Downie", "0269077": "James Faulkner", "0718619": "Douglas Reith", "1495502": "Devon Black", "0842596": "Jeremy Swift", "6207378": "Holly Aston", "0769084": "Andrew Scarborough", "0178674": "Paul Copley", "2726989": "Ed Cooper Clarke", "2758578": "Charlie Anson", "6261702": "Alister Austin", "6697291": "Oliver Barker", "8965395": "Zac Barker", "4708733": "Fifi Hart", "5762706": "David G. Robinson", "7188212": "Eva Samms", "9263930": "Karina Samms", "6343834": "Charlie Watson"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["Atticus brings his parents, Edith and her daughter are brought home by Cora, Tom decides to take his daughter to America, Baxter volunteers to testify for Bates, and Isis is dying.", "Violet and Rosamund tell an angry Cora Edith's secret, which she promises to keep from Robert. Atticus brings his parents to stay, his mother being charming but his father less than happy that he wants to marry the non-Jewish Rose. Atticus suggests ringing Edith at the publishers but instead Cora goes to London and brings Edith and her daughter home, passing Marigold off as a deceased friend's child. Tom decides to take his daughter to live in America with his cousin whilst John and Anna contemplate running a hotel. They are not wholly satisfied with Baxter's reluctance to give him an alibi, unaware of her past, but both Molesley and Barrow champion her. Blake, about to be posted abroad, helps Mary get rid of Tony's attentions whilst Isobel agrees to marry Lord Merton. However his vile son Larry, seeing Isobel as beneath his class, insults her and the Crawleys and is thrown out of the abbey. Atticus also proposes to Rose.—don @ minifie-1", "Dowager Violet rebukes selfish Rose she doesn't object to Isobel becoming the lady of a great house but will miss her first)ever proper friend, while waving Spratt's dramatic declaration he can't suffer Denker any longer. At a formal dinner to welcome Jemish Lord Sinderby's family, his son Atticus secretly proposes to Mary after Lord Merton rebuked his sons hostility, voiced by Larry, to unequal marriages as 'doomed', be it qua class, breeding or religion. At Thmas's astute suggestion, retired teacher Mason convinces Daisy to persevere at studies, regardless whether the Labour government falls. Robert's marriage recovers as Cora helps hi mourn dying bitch Isis. Tom plans to move with Sibyl to Boston with his cousin. As Atticus suggests trying the publishing firm, Cora and Rosamund track her down in Lodnon and commandeer Mr. Drew to stage Marigold's 'adoption' as just a charitable virtue. Tony publicly kisses Rose to help convince her and Mabel the latter is free to court her other ex Charles Blake.—KGF Vissers"], "genres": "N/A", "imdbID": "3810556", "rating": 8.3, "votes": 1598, "number_of_episodes": 52}