{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "0328828": "Matthew Goode", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0178674": "Paul Copley", "0718619": "Douglas Reith", "0426855": "Sue Johnston", "0842596": "Jeremy Swift", "0911575": "Howard Ward", "2227000": "Harry Hadden-Paton", "0242762": "Sebastian Dunn", "4990981": "Victoria Emslie", "1553405": "Antonia Bernath", "0292538": "Rupert Frazer", "6697291": "Oliver Barker", "8965395": "Zac Barker", "4708733": "Fifi Hart", "4016944": "Nick Owenford", "7188212": "Eva Samms", "9263930": "Karina Samms"}, "geners": ["Drama", "Romance"], "runtimes": ["47"],  "plot": ["Violet embroils the Minister of Health in the hospital row, but his visit ends in catastrophe. Mary's suspicions are aroused.", "In London Edith has a date with Bertie as well as appointing an editrix but Mary discovers her sister's secret, at the same time assuring Tom that Henry Talbot is merely a friend. Barrow finds out young footman Andy's weakness whilst a court case brings Baxter and Molesley closer together and Denker has cause to be grateful to Spratt. Violet invites health minister Neville Chamberlain to dinner in her plan to defeat Isobel and Cora and their supporters over the hospital but the event is overshadowed by a family emergency.—don @ minifie-1", "May 1925. Mrs Patmore, Daisy, and Andy help Mr Mason move into the farm. Thomas discovers that Andy is desperately illiterate, and kindly offers to teach him in secret, so he can study farming theory while apprenticing with Mr. Mason. The dowager decides to fire Denker for 'over-loyal' insolence to Dr. Clarkson, but the maid plays the hidden kin card to make Spratt argue for a second chance. Violet blackmails Minister of Health Neville Chamberlain to attend dinner at Downton, haranguing everyone about the hospital. Robert suddenly vomits blood over the dinner table, collapses, and is rushed by ambulance to hospital as Dr. Clarkson diagnoses a burst ulcer. The earl survives surgery well, but Mary tells Tom that the two of them 'must' take over running the estate, 'sparing' her father further stress. Mary keeps toying with gentleman admirer Henry Talbot, who finds a car-crazy friend in Tom, and becomes suspicious about Marigold's birth after overhearing a puzzling remark between Cora and Violet. Edith hires same-age Laura Edmunds as magazine editor, and slides into kissing mode with Bertie Pelham. Molesley accompanies Baxter to Coyle's trial, but she is not called upon to testify as he pleads guilty.—KGF Vissers"], "genres": "N/A", "imdbID": "4574910", "rating": 8.5, "votes": 1578, "number_of_episodes": 52}