{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0842596": "Jeremy Swift", "0426855": "Sue Johnston", "0681975": "Ronald Pickup", "2227000": "Harry Hadden-Paton", "0701248": "Paul Putner", "4990981": "Victoria Emslie", "0911575": "Howard Ward", "0718619": "Douglas Reith", "0168253": "Michael Cochrane", "0178674": "Paul Copley", "0107372": "Patrick Brennan", "1395602": "Allen Leech", "6697291": "Oliver Barker", "8965395": "Zac Barker", "4708733": "Fifi Hart", "6593714": "Matthew Rohman", "7188212": "Eva Samms", "9263930": "Karina Samms"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["An old acquaintance comes to Edith's aid, while Mr Carson and Mrs Hughes' big day brings an unexpected arrival.", "In London Edith meets old acquaintance Bertie Pelham, who proves to be an invaluable help when her editor quits and she needs to publish her magazine by a deadline. At Downton the battle for the hospital's future continues with Isobel and Cora apparently getting Dr Clarkson on side whilst Barrow continues to look for new employment and Violet's maid Denker holds a secret over butler Spratt. Mrs Hughes sticks to her guns regarding the location for her and Carson's wedding, which goes ahead superbly with an unexpected and welcome guest turning up to wish the couple well.—don @ minifie-1", "Only the earl and lady inquiring what Mrs. Hughes wants as wedding gets her to admit she prefers the school hall to the usual Downton grand fuzz, and Mary's thoughtless attempt to intervene is duly waved. Mrs. Patmore mail-ordered a wedding dress, which rather disappoints, so Bates, cheerful as she seems pregnant again, helps them fit some things to borrow from Cora's wardrobe, but after another grim meeting over the hospital, where Violet seems to loose even Dr. Merton's support, Cora scolds them all for not having asked. Rose admits she failed to pass the message, so Cora apologizes generously by donating a frock. Thomas hopes for a butler-like job a fellow veteran Sir Michael Reresby's grand house, but the grim widower is living in a past he can no longer afford. Denker believes finally to have Spratt over a barrel as she suspects his jail-escaped kin was sheltered from the police on the estate. Charming acquaintance Bertie Pelham not only understands Edith has to cancel their lunch date as she must reach the magazine deadline having fired hostile editor Skinner after another deaf ears-row, but volunteers to help her all day. The church and school hall wedding is a jolly success, with opportunity for Molesley's scholarly side to be noticed by headmaster and a generally cheered surprise arrival: Tom is back with Sibyl, to stay indefinitely.—KGF Vissers"], "genres": "N/A", "imdbID": "4557968", "rating": 8.6, "votes": 1651, "number_of_episodes": 52}