{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "0328828": "Matthew Goode", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0178674": "Paul Copley", "0107372": "Patrick Brennan", "1981245": "Brendan Patricks", "5921359": "Charlotte Hamblin", "0242762": "Sebastian Dunn", "2227000": "Harry Hadden-Paton", "0718619": "Douglas Reith", "7658803": "Phoebe Sparrow", "0549990": "Ian Marr", "3426180": "Milly Thomas", "6790514": "Tom Morley", "2058980": "Wendy Albiston", "1756652": "David Keeling", "7415871": "Noah Jupe", "6697291": "Oliver Barker", "8965395": "Zac Barker", "1553405": "Antonia Bernath", "4708733": "Fifi Hart", "2765309": "Thomas Howes", "5148571": "Rachel Marquez", "5854276": "Adrian Mitchell", "7188212": "Eva Samms", "9263930": "Karina Samms"}, "geners": ["Drama", "Romance"], "runtimes": ["50"],  "plot": ["Downton Abbey opens its doors to the public for charity, Barrow's actions are misconstrued, Mary and Henry's romance blossoms, and tensions between Cora and Violet reach a dramatic climax.", "Opinion is divided upstairs and downstairs when Mary and Tom throw open the abbey to the public in aid of hospital funds, though the outcome of the ongoing battle for the hospital's future brings mixed blessings for Cora. The open day itself is a success despite the family's inexperience as tour guides and an entrance from an angry Violet. Romance appears to blossom for Mary and Henry and possibly even Mrs Patmore and Mr Mason, whilst Molesley is given an unexpected opportunity by local schoolmaster Dawes and the erstwhile Mrs Hughes finds her new husband annoyingly critical of her domestic duties.—don @ minifie-1", "Early June 1925. The Board of the Downton Cottage Hospital approves its merger with the Royal Yorkshire Hospital and invites Cora to be their new president, replacing Lady Violet to avoid similar situations in the future, but nobody dares tell the dowager timely her Charmberlain card didn't trump. Mary takes Tom to London, where Henry Talbot tells Mary he is falling in love with her, Tom convinces her to join their cars enjoyment. With Robert forced to bed rest, Tom and Mary open the house to the public for a day to raise funds for the hospital, harder to do then expected even if everyone helps, but more lucrative, yet the family isn't inclined to regular repeats, while realizing the traditional way of aristocratic life is becoming a curiosity. Spending the nights in their cottage, Carson keeps implicitly criticizing Mrs Hughes's housekeeping practices not being up to Downton standard, to her increasing annoyance, including how she makes the bed, and awaits cooking pointers from Mrs Patmore, whose upstairs leftover hampers aren't finished to perfection. Carson questions Thomas about his meetings with Andy, causing him more distress and reducing him to tears of self-pity.—KGF Vissers"], "genres": "N/A", "imdbID": "4581398", "rating": 8.2, "votes": 1517, "number_of_episodes": 52}