{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "1978579": "Nichola Burley", "10412784": "Mark Morrell", "0718619": "Douglas Reith", "0426855": "Sue Johnston", "0911575": "Howard Ward", "0178674": "Paul Copley", "0842596": "Jeremy Swift", "0094039": "Samantha Bond", "0525702": "Adrian Lukis", "0045821": "Rick Bacon", "0525924": "Nicholas Lumley", "6697291": "Oliver Barker", "8965395": "Zac Barker", "5911308": "James H. Bristow", "4300959": "Cheryl Burniston", "5020928": "Martyn Mayger", "7188212": "Eva Samms", "9263930": "Karina Samms", "8314823": "Steven F Thompson"}, "geners": ["Drama", "Romance"], "runtimes": ["66"],  "plot": ["Lady Mary's past catches up with her when an unwelcome visitor delivers an ultimatum, and news about the running of Downton Hospital puts Violet on the warpath.", "Downstairs Mrs Hughes makes a strange request of Mrs Patmore regarding her forthcoming nuptials whilst Anna, hoping for a child with John, realizes a problem of her own though she does get potentially-good news from the police. However, talk of necessary economic measures at the abbey has the staff fearing for their jobs, especially when a neighbouring estate has to be sold. Upstairs a blackmailer threatens to expose Mary's fling with Gillingham whilst Edith has a more pleasant dilemma in whether or not to move to London to run the publishing house. Elsewhere Violet and Isobel lock horns over the future of the local hospital.—don @ minifie-1", "The family host a fox hunt and sadly attends friend Sir John Darnley 's auctioning off of all he can't take to London from their neighboring grand Yorkshire home, which is being sold. William's father asks the earl to inquire if his farm lease can be taken over, but Daisy's rude intervention wrecks his chances properly with the upstart buyers. Denker heard in confidence from Violet that staff cuts are inevitable and meanly hints to Spratt he'll be first in their small house, but the dowager duly turns the fear tables. She as board president and Isobel as almoner clash again, both with allies, over whether to allow the local hospital to become a branch of the county hospital for better facilities but loosing autonomy. Butler Carson most regrets service must be reduced as notices are given and taken from an already more then halved staff, but also has to clear, via the cook, whether his marriage with Mrs. Hughes is to include intimate 'duties'. Mary fall on the hunt, plans to succeed emigrated Tom as estate agent but fails to bluff off Rita Bevan, who blackmails her with proof of her fling with Tony, but Robert handles that stunningly. Edith realizes she must chose a new future, perhaps managing her publishing firm in London.—KGF Vissers"], "genres": "N/A", "imdbID": "4178770", "rating": 8.2, "votes": 1779, "number_of_episodes": 52}