{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "0328828": "Matthew Goode", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0911575": "Howard Ward", "0910040": "Harriet Walter", "0094039": "Samantha Bond", "3310211": "Rose Leslie", "1642245": "Philip Battley", "1510188": "Richard Teverson", "0178674": "Paul Copley", "6697291": "Oliver Barker", "8965395": "Zac Barker"}, "geners": ["Drama", "Romance"], "runtimes": ["47"],  "plot": ["Anna and Mary face a crisis and a figure from the past surprises those above and below stairs.", "Ladies' maid Phyllis Baxter gets a visit from the police, which brings her closer to the supportive Mr Molesley whilst there is good news for Anna, though when disaster appears to hit her the returning Tom Branson and Mary join forces to help her. Thinking that the Crawleys are about to \"break their word\" to give Mr. Mason Yew Tree Farm, Daisy is ready to confront them though does not yet know how the situation will turn out Violet - unsuccessfully - attempts to coerce her friend Lady Shackleton into supporting her in the ongoing hospital feud but Her Ladyship does introduce Mary to her nephew Henry, a dashing racing car driver. Elsewhere Edith's plan to appoint a female editor reintroduces former housemaid Gwen, now married and successful, to the abbey, though Barrow's scheme to humiliate her only rebounds on him. And he also has cause for displeasure when the newlyweds return.—don @ minifie-1", "During the Carson honeymoon, Thomas is acting butler, but is even less popular and irritates the earl by pointing out visiting nephew John Harding's wife is none other then former maid Gwen, who hesitates to come clear but gets a warm welcome from the rest of staff. Violet is shocked as even Lady Shackleton, whom she invited to attack the hospital merger, deserts her case. Tom seeks a professional occupation while Mary wants to remain estate agent and Edith wants a female (co-)editor. When Anna gets pregnant again, Mary and Tom discretely rush her to the London gynecologist. Molesley helps Baxter accept to testify against her abusive ex in court. William's father gets to lease Yew Tree farm just when imp Daisy was about to risk her job. The Carson gets a warm welcome home, even from family and guests, and agree Mrs. Hughes retains her calling name.—KGF Vissers"], "genres": "N/A", "imdbID": "4560964", "rating": 8.3, "votes": 1581, "number_of_episodes": 52}