{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "1674947": "Robert James-Collier", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0909762": "Martin Walsh", "0107372": "Patrick Brennan", "0718619": "Douglas Reith", "0769084": "Andrew Scarborough", "1266378": "Emma Lowndes", "0094039": "Samantha Bond", "0701248": "Paul Putner", "1495502": "Devon Black", "0178430": "Trevor Cooper", "1510188": "Richard Teverson", "7090187": "Andrew Caley", "0178674": "Paul Copley", "6697291": "Oliver Barker", "8965395": "Zac Barker", "8007687": "David Ellis", "7188212": "Eva Samms", "9263930": "Karina Samms", "6343834": "Charlie Watson"}, "geners": ["Drama", "Romance"], "runtimes": ["50"],  "plot": ["What begins as a happy day out for the family and servants ends in panic and leaves Robert with a difficult decision to make.", "With Tom now in America Mary is farm manager and has an awkward innocent encounter when Mrs Drewe sees Marigold, Edith's daughter, leading to a panic at an agricultural show. Edith herself, in conflict with her editor over her new ideas, is briefly joined in London by Mary, seeking help for Anna's health problem whilst the battle for the future of the hospital continues, with Cora supporting Isobel's progressive view, much to Violet's annoyance. Daisy tries to find work for her father-in-law, recently evicted, whilst Barrow also considers pastures new and Mrs Hughes is not happy at the prospect of her wedding venue.—don @ minifie-1", "Thomas fears his job so insecure, he starts applying, with Carson's cynical permission, only to find the advertised new post of 'assistant butler' would mean being footman, driver and more under an even meaner butler, while Andy keeps politely turning down help from 'uncle Thomas'. Violet and Isobel muster equal support against/ for merging the cottage hospital into the county one, still without government support. Mary bulldozers Cora's remark Mrs. Hughes might not want to wed on Donwton, but Carson promises to convey the message to his lordship they prefer a town venue but backs down. Cora insists to have Anna checked up by her London gynecologist, who recommends a likely therapy for her type of miscarriage. Edith feels ignored and discriminated by her editor and misses for that an opportunity to accompany the children to the regional farm animal show, where Tim Drewe realizes his wife Marge took Marigold 'home' claiming the girls is neglected, so he accepts Robert's offer to help move the couple away from Downton.—KGF Vissers"], "genres": "N/A", "imdbID": "4545908", "rating": 8.0, "votes": 1560, "number_of_episodes": 52}