{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "0328828": "Matthew Goode", "2227000": "Harry Hadden-Paton", "4141252": "Lily James", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0730191": "David Robb", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0426855": "Sue Johnston", "0842596": "Jeremy Swift", "0107372": "Patrick Brennan", "0718619": "Douglas Reith", "0094039": "Samantha Bond", "3923285": "Alastair Bruce", "0388092": "Patricia Hodge", "7658803": "Phoebe Sparrow", "0338785": "James Greene", "0178674": "Paul Copley", "2758578": "Charlie Anson", "3195528": "Matt Barber", "0250718": "Peter Egan", "0696126": "Paul Prescott", "7817067": "Alice Shuttleworth", "2021434": "Kyra Williams", "1553405": "Antonia Bernath", "0168253": "Michael Cochrane", "5778421": "James Francis Andrews", "6697291": "Oliver Barker", "8965395": "Zac Barker", "5011016": "Alan Billingham", "5148127": "Dilyana Bouklieva", "3678627": "Ray Burnet", "11018265": "Richard Butler", "7618414": "Nick Davison", "4708733": "Fifi Hart", "7864516": "Amir Heath", "8373276": "Isis", "4639288": "Matt Jamie", "6640101": "Hilary Joyce", "7941485": "Paul Leon", "5045226": "Hugh O'Brien", "7188212": "Eva Samms", "9263930": "Karina Samms", "5590700": "Graham Saxon", "6343834": "Charlie Watson"}, "geners": ["Drama", "Romance"], "runtimes": ["93"],  "plot": ["Mary endeavors to build bridges with her sister while Edith's secret continues to pose a threat. As Henry settles into the role of husband and stepfather, finding his place at Downton proves more difficult.", "Aware of her secret, Bertie proposes to Edith. However, his morality-obsessed mother threatens to stand in their way, after Edith has confessed to her. Henry forsakes motor racing for a new venture with Tom. Molesley and Spratt also embark upon new careers and Barrow finds another position - with a curmudgeon - while Carson's health begins to fail. Isobel responds to some bad news from Lord Merton and Violet encourages her to thwart the plans of his greedy family. New Year's Eve 1926 sees, downstairs, romance flourishes.—don @ minifie-1", "29 September 1925 - 1 January 1926: Carson fumbles serving dinner when his hands begin shaking. Thomas finally secures a job with an elderly couple but stays on during the holidays, as Molesley leaves service when the Headmaster asks him as teacher, with a cottage. Lord Merton still wants to marry Isobel who insists on it after he's diagnosed with incurable pernicious anemia, but his cruel daughter-in-law Amelia prevents Isobel from visiting, so indignant Violet intervenes, and he enthusiastically agrees to marry Isobel. Andy falls for Daisy, who was uninterested, but she gradually grows to like him. Eventually she decides to live at the farm. Mary arranges a meeting of Edith and Bertie, now marquess of Brancaster, where he again proposes, knowing about Edith's child, and she accepts. At Brancaster Castle to announce the engagement, the Crawleys meet Bertie's moralistic mother Miranda. Edith tells her about her illegitimate daughter Marigold, winning over Mrs Pelham with her honesty. Henry and Tom go into business together selling cars, Mary tells Henry she expects his child. Edith and Bertie are finally married on New Year's Eve 1925 and leave on their honeymoon. Dr Clarkson informs Lord Merton that he was misdiagnosed: it's only a mild form of anemia allowing a long life. During the reception, Anna suddenly goes into labor and gives birth to a healthy son. Carson realizes his illness will ultimately prevent him from performing his duties, hence tenders his resignation, which Robert reluctantly accepts, but then suggests that Thomas succeeds as Butler, Carson can retire pensioned, retaining an oversight mentor role.—KGF Vissers"], "genres": "N/A", "imdbID": "4419112", "rating": 9.2, "votes": 2621, "number_of_episodes": 52}