{"cast": {"0095017": "Hugh Bonneville", "3882295": "Laura Carmichael", "0141697": "Jim Carter", "0144237": "Raquel Cassidy", "0185354": "Brendan Coyle", "1890784": "Michelle Dockery", "0236413": "Kevin Doyle", "5320024": "Michael Fox", "0296219": "Joanne Froggatt", "0328828": "Matthew Goode", "1674947": "Robert James-Collier", "1395602": "Allen Leech", "0517642": "Phyllis Logan", "0001527": "Elizabeth McGovern", "2904789": "Sophie McShera", "0630149": "Lesley Nicol", "0001749": "Maggie Smith", "0934362": "Penelope Wilton", "0242762": "Sebastian Dunn", "2201547": "Christos Lawton", "7658803": "Phoebe Sparrow", "0842596": "Jeremy Swift", "0426855": "Sue Johnston", "0178674": "Paul Copley", "1553405": "Antonia Bernath", "0094039": "Samantha Bond", "2227000": "Harry Hadden-Paton", "1660065": "Peter Hamilton Dyer", "0107372": "Patrick Brennan", "1277551": "Hayley Jayne Standing", "6028969": "Jake Rowley", "6697291": "Oliver Barker", "8965395": "Zac Barker", "2729049": "Richard Bevan", "4990981": "Victoria Emslie", "16468921": "Lily Eustace", "3450725": "Sarah Maddocks", "5529535": "Shaun Newnham", "7159966": "Dan Noye", "7004239": "Ross O'Connor", "4054541": "Vanessa Quiney"}, "geners": ["Drama", "Romance"], "runtimes": ["51"],  "plot": ["The family face a shocking turn of events at Brooklands racetrack while Molesley and Daisy are put to the test.", "Despite opposing her over the hospital, a concerned Violet sets out to protect Isobel against Lord Merton's relatives before setting sail for the French Riviera. The Crawley family meanwhile travels to Brooklands racing circuit, where Edith introduces her editrix Laura to Tom, to watch Mary's now-boyfriend Henry race. Unfortunately an accident puts a blight on the relationship, though there is a better prospect for Edith. At Downton Andy is offered help by Mr. Dawes for his situation whilst there is excellent news for Molesley.—don @ minifie-1", "July 1925. Molesley and Daisy sit for their exams; he does so well that the headmaster offers him a teaching job at the school, the ideal way out of shriveling house staff. Thomas still can't find a job and is replaced as Andy's reading teacher by the headmaster when everybody finds out at the celebratory staff picnic. Henry invites the family to a local automobile race, where a deadly accident kills Henry's best friend Charlie Rogers, yet Mary adds to Henry's grief by claiming they wouldn't work as a couple, which Tom warns to be a cowardly mistake. Violet works out Isobel's puzzling invitation to the wedding of Lord Merton's hostile son Larry is bride Amelia Cruikshank's bid to dispose of her sickly father in law. Mrs Hughes pretends to have injured her hand, forcing Mr Carson to do the cooking and housekeeping at the cottage, exhausting him to gain respect for housewife's work. Mrs Patmore's B&B opens with its first guests. Bertie proposes to Edith, who asks for time to consider and demands to take in Marigold without saying why. Violet has departed to the south of France but has Spratt deliver for elated Robert a new pup he calls Teo.—KGF Vissers"], "genres": "N/A", "imdbID": "4581592", "rating": 8.4, "votes": 1551, "number_of_episodes": 52}