{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0000524": "Mary Stuart Masterson", "0706619": "William Ragsdale", "1078382": "David de Lautour", "4645564": "May Miyata", "2550192": "Satomi Okuno", "1352285": "Samantha Whittaker", "1376097": "Slade Pearce", "1043126": "Skyler Stone", "0315288": "John Getz", "0359695": "James Handy", "0931898": "Wade Williams", "1193110": "Mark Kelly", "2616303": "Kat Purgal", "0055657": "Julian Barnes", "0385478": "Pippa Hinchley", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["In their escape from New York, Martin and Jake pass through Martin's old stomping grounds of the Willamette Valley in Oregon. Although he has no intention of stopping in his old home town of McMinnville, Martin is forced to stop and stay because of car problems in part initiated by Jake. Old memories die hard as a story that he wrote at the beginning of his reporting career twenty years ago created some hard feelings amongst the townsfolk, many who do not welcome him back. One person who does welcome him is Henry Williams, the editor of the local newspaper and Martin's mentor who sees Martin's time at the newspaper as its glory years. Someone who provides a more reserved welcome is Martin's old girlfriend, Beth Cooper née Young, who now works for Henry. Shortly after Martin's arrival, Henry goes missing with evidence pointing to someone trying to kill him. Martin is pretty sure that it has to do with whatever the latest story on which Henry is working. As Martin reads through Henry's notes, he finds a story that isn't all it appears on the surface of those notes. Martin and Jake's stay in McMinnville also intersects with a story of a teen-aged boy trying to help his family by proving he's a man. It also coincides with the cell phone that Martin retrieved at JFK Airport month's earlier that belonged to Brit Simon Plimpton arriving in the area, and which makes another electronic trip back to its original owner and his distraught wife, Nell.—Huggo", "Every action has an impact, Jake says in a voiceover, especially if it originates with love. On an Oregon highway, Jake contrives to get Martin to pull over in the town where he grew up. Jake then loses the car keys, so they're stuck for a few hours. Martin runs into his former boss, the editor of the local paper, who's working on a story of corporate malfeasance and whose life may be in danger. An old flame is working at the paper as well, a teenage boy has gone into the woods to survive on his own for a week to prove his manhood, and in London, a woman grieving a lost child decides she should leave her husband.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2364992", "rating": 7.3, "votes": 369, "number_of_episodes": 26}