{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0004742": "Maria Bello", "0327020": "Ian Gomez", "0219748": "Catherine Dent", "0116749": "Roxana Brusso", "0001183": "Bodhi Elfman", "0322182": "Matthew Glave", "0421116": "Brent Jennings", "0000674": "Tamlyn Tomita", "1186652": "Junichi Yanagita", "4645564": "May Miyata", "2550192": "Satomi Okuno", "5082449": "Luc Azuma", "5082636": "Lex Ishimoto", "0614003": "Peter Murnik", "2206182": "Ian Jensen", "2807610": "Kaori Taketani", "1356635": "Aramazd Stepanian", "0847032": "Mio Takada", "3537172": "Jacqueline Scislowski", "2451280": "Alan Gray", "0052436": "James Bannon", "0000418": "Danny Glover"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["As the Aster Corporation increases their interest in Jake, Martin joins forces with Abigail as the stakes of Jake's custody escalate. When Avram reiterates to Martin that Jake and Amelia, a presumed dead girl with similar characteristics as Jake, are connected, Martin sets out on a passionate mission to uncover the truth. Meanwhile, circumstances intensify when Lucy enters the picture and seemingly unrelated events are tied together.—Fox Publicity", "Jake, in a voiceover, reflects on chance. On a Pacific coast beach, a man scavenges for debris from the Japanese tsunami; a woman interrupts his work. In Japan, a boy seeks to break the record for continuously keeping a soccer ball in the air. Martin searches for Amanda; with Jake's help, he finds her police file and, later, her medical file and Arthur Teller's video tapes of her. Meanwhile, it becomes clearer that Jake is a pawn in the same shadowy corporate research that Teller feared was behind Amanda's disappearance. What or who can break free from this gyre of power?—<jhailey@hotmail.com>", "Abigail tells Martin that Möbius is a front for Aster Corp., Aster Corp. has been pursuing Jake since he was born, she has been working for them just to keep tabs on their interest in Jake, the imminent custody hearing has been rigged by Aster Corp. against Martin, and providing her with custody is the only way that they can stop Aster Corp. from getting Jake. Martin still isn't sure he can trust her. Further actions by Jake lead to more problems for Martin in that custody hearing. While Clea takes Jake back to the facility and deals with Sheri while also assuring Martin that Sheri can't do anything with Jake while she's still working on the case, Martin, following Jake's latest numbers, leads to his pursuit of a probably still alive Amelia despite she being listed as dead for the past three years. As Martin gathers evidence to this belief, he returns to the facility to find that Clea has made an uncharacteristic move. Meanwhile, a man is camped out on a beach in the Pacific Northwest, collecting debris washing ashore from the Japanese tsunami. He is being berated by another woman on the beach for what she believes he is doing: selling the items on-line, and thus profiting from the misfortune of the tsunami victims. She herself seems to be on the beach waiting for someone. As their encounter progresses, they will connect half way around the world to a Japanese family affected by the tsunami, its pre-teen son who is trying to restore honor back into the family as is befitting their lineage. Their encounter will also lead her to what she hopes will be the meeting with the person for who she is waiting.—Huggo"], "genres": "N/A", "imdbID": "2337663", "rating": 7.7, "votes": 424, "number_of_episodes": 26}