{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0438500": "Ravi Kapoor", "0621244": "Meera Simhan", "0116749": "Roxana Brusso", "0345466": "Vincent Guastaferro", "0682063": "Jim Piddock", "0240043": "Anne Dudek", "1587188": "Tiya Sircar", "0662475": "Marisa Petroro", "2642953": "Pasquale Cassalia", "1886898": "Ian Alda", "0662019": "Sherri Parker Lee", "1855183": "Tomas Pais", "5040514": "Emma Pasarow", "3794525": "Shanice Archer", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Most of the people at the facility are going on an outing to the museum. Clea warns Martin that Sheri will be watching them closely for the upcoming evaluation. This day, Jake is continually playing cat's cradle by himself, always stopping at the triangular figure. Clea notices that the symbol matches the logo of Abilgail Kelsey's company, Aster Corps. At the live video link section of the museum, the link currently to the feed outside of the Louvre in Paris, Jake makes a connection with a young woman through the video link. That woman, named Veronique, notices another woman in the background at the museum in New York that she swears solely from a photograph that she has that she is her biological mother, who she was told died in childbirth. After seeing the look in Jake's eyes, Martin is certain that that woman is indeed Veronique's mother. As Martin tries to track her down, he finds another part of the Veronique side of the triangle. Later, still at the museum, they are treated to a video feed from an astronaut at the International Space Station, she who talks about triangulation. The numbers that she talks about leads to Martin finding the third part of the triangle, which itself has two parts, both of which were in a cab driving through New York City. By the end of the outing, Clea and Sheri confront each other about secrets each believes the other is keeping, Clea's accusations specifically about the patient in room 6 and Abigail Kelsey's connection to the facility.—Huggo", "Jake's voice-over reflects on water's ability to find its way to the sea and people's ability to find connections. On a trip to a museum, Jake contrives to bring two women face-to-face, one in Paris and one at the museum. An obstetrician and a cabbie share a long and revealing ride. On a city bus, Martin hands a vacuum tube for an old ham radio to a man who dropped it. Two astronauts - one outside a space station, and one inside - set about to repair the ship. Jake plays cat's cradle with a piece of red string. Humans connect.—<jhailey@hotmail.com>", "Following numbers from Jake, Martin helps reunite a French woman with her biological mother and twin sister, then he attempts to find the person responsible for their estrangement. In the meantime, a superstitious young Italian woman is fretting when her astronaut husband loses contact with earth.—Fox Publicity"], "genres": "N/A", "imdbID": "2379607", "rating": 7.5, "votes": 438, "number_of_episodes": 26}