{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0000418": "Danny Glover", "0920038": "Titus Welliver", "0216342": "Simon Delaney", "1314042": "Karen David", "1078382": "David de Lautour", "1352285": "Samantha Whittaker", "1375816": "Rana Alamuddin", "4190050": "Shak Ghacha", "4645564": "May Miyata", "3967234": "Wesam Keesh", "0618577": "Joey Naber", "4548815": "Zarif Kabier", "2793922": "Wasim No'mani", "4868556": "Philip Sha", "4868962": "Camila Carmona", "1717255": "Philip Shahbaz", "2287029": "Nick Hodaly", "2550192": "Satomi Okuno", "2011629": "Eijiro Ozaki", "0891825": "Franco Vega", "1112952": "Ray Ford", "1483930": "Javier Calderon", "0535142": "Mike Madrigal", "2855627": "Judy Echavez", "0786537": "Bill Seward", "0703419": "Maria Quiban", "0907765": "Glen Walker", "3083465": "Stevens Gaston", "13777024": "Ken Heang", "8811648": "Kathlynn Steingall", "0796325": "Yousuf Azami", "4397025": "Tamara Chambers", "0161980": "Jude Ciccolella", "3317479": "Marmee Regine Cosico", "5880121": "Aaron Drexler", "4370618": "David Haag", "6037532": "Jade Holden", "0403486": "Patrick John Hurley", "4036401": "Ben Lautman", "3029577": "Waymond Lee", "12236654": "Lynette Sideris", "0805930": "Amy Sloan", "5563145": "Brent Yoshida"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["51"],  "plot": ["For the third time in three weeks, Jake has run away from school and climbed atop a cell phone tower, breaking the tower's security alarms at precisely 3:18 in the afternoon each time. For Child and Family Services, they, who have previously diagnosed Jake as autistic, see Jake's behavior as Martin not being able to handle Jake on his own, they who send Clea Hopkins to investigate. To perform a proper assessment, she removes Jake from the home and places him in an institution for two weeks where she can monitor him. Martin not only finds that move contemptible, but also believes that Jake is trying to tell him something, especially as the numbers Jake is scribbling seem to pop up elsewhere in their lives, as Jake makes the stray cell phones that Martin has found for him ring simultaneously, and after the lottery ticket Jake temporarily steals ends up being the multimillion dollar jackpot winning numbers. In his search to find out if Jake is just mute or if he has some other condition affecting his behavior, Martin finds Arthur Teller of the Teller Institute, he who tells Martin his theory of Jake's condition. Clea begins to believe that their autism diagnosis is incorrect when she views Jake first hand. Meanwhile, one of those cells phones which almost made it into Jake's possession makes a 'round the world trip from London to Ireland to JFK to Japan to Baghdad where it ends up making it full circle from its owner, a distraught father, to the wannabe pop singer to the enterprising prostitute to the teen who wants to help his family by buying a commercial oven for their baking business.—Huggo", "A father searches for a cell phone containing photos of his daughter; an Iraqi teen will do anything to buy an oven for his father; an older colleague promises stardom to a singer in Dublin; a New Yorker buys a lotto ticket playing the same numbers he has for years; a mute lad of 11, with autistic behaviors, climbs a radio tower at the same time every day for three days; his father, a baggage handler at JFK who is grieving a death, doesn't believe he's getting through to his son, who now may be placed in foster care. The boy himself narrates: there are patterns everywhere if others would just see them. The stories come together like a Fibonacci sequence. What's going on?—<jhailey@hotmail.com>", "Martin Bohm is a widower and single father who is haunted by an inability to connect to his emotionally challenged 11-year-old son Jake. But when Martin discovers that Jake can predict events before they happen, everything changes. Martin meets social worker Clea Hopkins and Professor Arthur Teller who may have the keys to help unlock Jake's mind.—Fox Publicity"], "genres": "N/A", "imdbID": "2085589", "rating": 8.4, "votes": 1584, "number_of_episodes": 26}