{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0219748": "Catherine Dent", "0001183": "Bodhi Elfman", "0116749": "Roxana Brusso", "0367496": "Don Harvey", "2328539": "Sean Peavy", "4306795": "Eden Modiano", "0001679": "Mark Rolston", "0001680": "Robert Romanus", "0083586": "Jeremiah Birkett", "0436613": "Katherine Kamhi", "1506644": "Stacey Newsome Santiago", "3542722": "Marwan Naji", "3260894": "Hillel", "3680233": "Aline Elasmar", "0052436": "James Bannon", "4226607": "Jeremy Timmins"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["For Jake's sake in more ways than one, Martin extends an olive branch to his sister-in-law Abigail, which she seems to accept. However, Abigail's support may not be enough in getting Jake back as Martin follows the next set of numbers provided to him by Jake in Amelia's sequence. Jake points Martin to the docks and a shipping company called Möbius, which they learn was funding Teller's research. A case of mistaken identity leads to Martin helping some of Möbius' dock workers steal an unknown but lucrative shipment coming into the Port of New York. Martin does provide his assistance as who the dock workers believe is \"Mike\" despite knowing that if they are caught and he is sent to jail, or that if the dock workers find out that he is not really who they think he is, that he will lose Jake for good. Through the process, Martin comes to the realization that he was meant to help specifically one of those dock workers, Joey Deluca, who is committing the theft because of a personal issue. Other connections to the story unknown to Martin include Abraham's young cousin Tomer in the Middle East who is in love with a Palestinian woman, and whose relationship is threatened by the greater Israeli-Palestinian conflict. Meanwhile, Clea catches Sheri giving Jake a developmental test using dodecahedrons, which Clea later learns from Abraham was developed by Teller to test if the subject is one of the thirty-six righteous ones in the universe. Clea does whatever she can to find out for who Sheri is doing this work and why Sheri is using Teller's research which she previously dismissed.—Huggo", "When Martin is mistaken for a criminal, he must involve himself with a heist crew in order to win back an innocent dock worker's job. Meanwhile, an Israeli boy and Palestinian girl fight to keep their relationship afloat. Clea uncovers some surprising documents about Jake, while Martin and his late wife's sister meet to make a pivotal decision.—Fox Publicity"], "genres": "N/A", "imdbID": "2379605", "rating": 7.5, "votes": 413, "number_of_episodes": 26}