{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0000418": "Danny Glover", "0920038": "Titus Welliver", "0337042": "Sprague Grayden", "0255309": "Iseluleko Ma'at El 0", "1010931": "Monique Gabriela Curnen", "0502671": "Joshua Leonard", "1620562": "Josiah Early", "4190050": "Shak Ghacha", "3967234": "Wesam Keesh", "0554457": "Jamie Martz", "0757993": "Dahlia Salem", "2184310": "Johnny Kostrey", "0005248": "Mari Morrow", "1269193": "T.W. Leshner", "0052436": "James Bannon", "6822347": "Cody Esquivel"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Jake's voice-over reflects on the human love of communication. Martin and Jake visit a cemetery. A man is at the grave of Martin's wife; he leaves before Martin can learn why he's there. In Iraq, a teen wants to show off his comedy chops; a female soldier is in a firefight and tries to rescue a wounded colleague. A lotto winner who hasn't cashed his ticket looks for redemption and chances on a young minister who delivers disorganized sermons in a church in disrepair. At 9:50 in the morning, Jake lets go of a kite, and he and his father follow it. The kite, the Internet, two men burdened by guilt and shame, wounded soldiers, and Jake's single-minded focus come together.—<jhailey@hotmail.com>", "Martin receives the sad but not unexpected news that Sarah's remains will never be recovered from the twin towers site. Later, while Martin and Jake visit Sarah's grave marker, they come across a young man named Bobby Aresa who is also visiting her grave site. Martin has never met Bobby before and has never heard his name, despite he mentioning that he was a friend of Sarah's. He seems reluctant to provide any more information. Jake, on another of his wanderings, later leads Martin to Bobby's apartment. Bobby is not happy to see Martin, but does tell him of his relationship to Sarah, some of it which Martin may not want to hear, but which will ultimately lead him to a precious memento. Meanwhile, Randall Meade, the fireman with the winning lottery ticket that Jake stole weeks ago, returns to his hometown of Lynchburg, Virginia, looking for answers to his life. He receives a direct sign that those answers may be found at a church undergoing renovations, but those answers are not forthcoming, at least not in the way he expected when he entered the church. Beyond the direct connection of which Martin and Meade are both unaware, Meade's story is connected back to Martin and Jake through a wounded soldier in Iraq who remembers someone telling her to place one foot in front of the other to get to where she's going, an Iraqi teenager who aspires to be Chris Rock, and a former band roadie and so-called amplifier expert using the moniker King Roadie.—Huggo"], "genres": "N/A", "imdbID": "2318197", "rating": 7.8, "votes": 561, "number_of_episodes": 26}