{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0000418": "Danny Glover", "1014989": "David Julian Hirsh", "0121620": "Carlease Burke", "0116749": "Roxana Brusso", "0566783": "Matt McCoy", "0472891": "Michelle Krusiec", "0155166": "Camille Chen", "0785517": "Diego Serrano", "0102430": "Boyuen", "1960185": "Kelly Keaton", "1966321": "Kofi Natei", "0734176": "Kevin Rock", "1954592": "Natalia Castellanos", "4181849": "Matthew Lepper", "0419855": "JJ Snyder", "0921473": "Roy Werner", "1356573": "Caroline Whitney Smith", "0933296": "Desi O'Brian Wilson", "4670679": "Allegra Carpenter", "1944865": "London Vale", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Martin provides Teller with all the leftover numbers that Jake has thus far provided him, these numbers with the exception of the last three missing from Jake's list matching Teller's own list which he calls \"the Amelia sequence\", named after one of his former patients who he is trying to find. Teller knows that his sequence of numbers is still incomplete and wants Jake's help to complete the sequence in order to find Amelia. Martin is reluctant to let Teller speak to Jake at this time if only to stay under the radar of the authorities who want to find any reason to take Jake away. Meanwhile, Clea receives news that her schizophrenic mother, who she has not seen in six years, is in hospital for psychiatric evaluation following being picked up for shoplifting. Clea's mother is able to escape from the hospital. Based on Martin's recent stops, including at the hospital when Clea is there, and information from Clea about her mother's recent ramblings, the two believe that her mother has taken a young boy, now reported missing, confusing the child as her own. Martin and Clea embark on a quest to locate her mother and the missing boy, which requires Clea to revisit some painful memories from childhood. Their quest ends up being connected to a jazz aficionado working for a real estate developer he who is regretting his latest deal, an Asian lesbian couple who are trying to conceive a child through artificial insemination but who have so far been unsuccessful in this endeavor, and a recurring dream that Martin has of Jake on a playground swing.—Huggo", "Fathers and sons, mothers and children. Jake's voice-over reflects on the North Star and the constancy of those who love us. Two people meet at JFK; she's a career woman, he's a real estate agent hoping there's more to life. A hospital calls Clea to say that her mother has been brought in. Arthur want to see Jake because the lad may be able to help with a number sequence that Arthur thinks explains everything. Martin meets a man whose child is missing, perhaps kidnapped. Misplaced luggage, a childhood home, a basement where Count Basie rehearsed, a plane crash, cough syrup, a toy car and a sperm donor connect.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2362869", "rating": 7.5, "votes": 471, "number_of_episodes": 26}