{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0000418": "Danny Glover", "1755731": "Deidrie Henry", "0070810": "Rob Benedict", "0335691": "Vince Grant", "0357885": "Graham Hamilton", "0116749": "Roxana Brusso", "1462340": "Yetide Badaki", "0750037": "Olesya Rulin", "1361042": "Stephen Boss", "4645564": "May Miyata", "2550192": "Satomi Okuno", "2173078": "Kwesi Boakye", "3293126": "Dante Brown", "4855565": "Akida Burns Burns", "0594785": "Khanya Mkhize", "2148656": "Ike Onuoha", "3034542": "Darrell Lake", "2368538": "Ochuwa Oghie", "2740213": "Elijah Nelson", "1798142": "Sam Stefanski", "1158992": "Kate Fuglei", "1699378": "Janeline Hayes", "2358605": "Jim Saviano", "1022263": "Karen Strassman", "3399357": "Lamont Couch", "1629518": "Marci Michelle", "0827366": "Craig Stepp", "0905814": "Brett Wagner", "0052436": "James Bannon", "2262592": "Elena Campbell-Martinez", "1078382": "David de Lautour", "2999525": "Stephen Janousek", "2542759": "Christian Ijin Link"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Jake is still in the custody of Child and Family Services. Despite Martin knowing that Jake is now communicating with him via numbers, Martin is still concerned that the review will find him an unfit parent as he chases these numbers. He gets some help from Arthur in this matter. Martin is also concerned about the news that Jake feels pain until the issue with each of these numbers is resolved. Regardless, Jake is able to provide Martin with another number, this one scribbled on a piece of paper with the picture of a dragon. At an accident scene where a woman is hit by a vehicle, Martin runs across a seemingly homeless and off kilter man calling himself the Invisible Prince. Martin eventually learns that this man has a special connection to numbers like Jake as witnessed by the same number Jake provided him scribbled over and over in a notebook. This leads Martin to a class action lawsuit and a former junior colleague at the New York Herald. He just has to figure out the connection between these situations and the homeless man's ramblings about slaying the dragon with a magic sword, which the King buried. These goings-on have a further connection to the World Championship Dance Battle being shown and conducted online, a South African villager who wants to move to the city but equally wants to get her friend out of an abusive relationship, someone from Clea's troubled past, and the move-it-forward cell phone which goes from the hands of the two Japanese girls to a stood up girl in a red dress.—Huggo", "In a voice-over, Jake explains how fire ants survive floods. He gives his father a dragon's picture and four numbers. Martin visits Arthur for help then witnesses a car strike a woman and a disheveled man grab a notebook from her purse. Jake chases the man and discovers someone fixed on the same numbers Jake handed him. Martin follows him on his rounds of seemingly random acts of kindness. What connects a woman in Soweto studying computers, her brother entering a virtual dance contest, her neighbor beaten by a lover, a woman meeting an Internet acquaintance at the same dance contest in New York, people suing an investment bank, a King and his brother, a reporter, and a dragon?—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2156535", "rating": 7.9, "votes": 806, "number_of_episodes": 26}