{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0004742": "Maria Bello", "0161980": "Jude Ciccolella", "0920038": "Titus Welliver", "0219748": "Catherine Dent", "0001183": "Bodhi Elfman", "0116749": "Roxana Brusso", "0070810": "Rob Benedict", "2006006": "Jackson Davis", "0643041": "Sundra Oakley", "0690754": "Melissa Ponzio", "2628285": "Charles Henry Wyson", "4645564": "May Miyata", "2550192": "Satomi Okuno", "0122073": "Jernard Burks", "3361594": "Kai Braden", "0675189": "Manny Perry", "1295887": "Sean Carrigan", "4858505": "Emeka Amene", "0052436": "James Bannon", "6835551": "Jonathon M. Smith", "5679564": "Chris Tomlinson", "1536169": "Patrick Weil"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Jake's voiceover reflects on the constants of motion and change. Child protective services seems intent on taking Jake from Martin; the final decision may depend on Clea's recommendation. A recording engineer seeks to bring Jamaican brothers together to sing again; he's on the West Coast and gets a ride from Amelia's mother, still looking for her daughter. Martin is desperate to stop CPS from moving Jake; he buys a gun from Arnie. Randall has finished his work renovating the church, and although he's established the beginnings of a relationships, he believes he must keep moving. With all this movement, will the ensuing change be positive or tragic?—<jhailey@hotmail.com>", "Now that Sheri and Aster Corp. have managed to gain custody of Jake with Clea's help, Martin, despite Abigail's pleas for him to go through legal channels, believes there is no other way to get Jake back than by direct force. But just before Jake is to be transferred to another facility fifty miles away, Martin learns that his new enemy Clea is not as mutinous as he first believed. Managing to abscond with Jake, Martin goes on the run in trying to elude the authorities i.e. Aster Corp., who will stop at nothing, including killing Martin, to get Jake back. Along the way, Martin and Jake get some much needed help from current friends, while getting some unexpected help from some old friends. Jake gives Martin a sign that perhaps every little thing's gonna be all right. Meanwhile, Randall Meade is just at the completion stage of the church project in Lynchburg, Virginia. Despite having built a relationship with a youth named Colin Davis and Colin's mother Gwen Davis, Randall still feels that he has unfinished business somewhere. When he gets the sign as to his next destination, he decides to leave Lynchburg, at least for the time being, until he knows what life holds for him at that next place. And Lucy Robbins, the woman at the beach in the Pacific Northwest she who is Amelia's mother and who is looking for her own signs in finding who she believes is her still alive daughter, follows the road map given to her by her new friend Wade. Along the way, she encounters a young man who is working on a global music project, and who hopes in the process to reunite two Jamaican brothers who used to be a singing group. Lucy herself hopes that providing assistance to this man is part of the puzzle in finding Amelia.—Huggo"], "genres": "N/A", "imdbID": "2392307", "rating": 8.0, "votes": 442, "number_of_episodes": 26}