{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0116749": "Roxana Brusso", "0001183": "Bodhi Elfman", "0274371": "Louis Ferreira", "1555781": "Linara Washington", "0132843": "Scott Michael Campbell", "3422312": "Malachi Smith", "0888154": "Deborah Van Valkenburgh", "4226665": "Tre C. Roberts", "0135584": "Francis Capra", "3775103": "Alfredo Correa", "0679888": "Phil Miler", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Jake's voice-over reflects on the music of the spheres. Jake leads his father to a 13-year-old from the Bronx intent on robbing a violinist. In Brazil, a street musician who dreams of moving to New York City expresses his love for a café owner - she's nearly broke and the café is all she has of her family. Clea, then Martin and Jake, meet a diamond dealer who says that Arthur was his best friend. Jake uses his tablet computer to show an accident victim how to communicate. Martin comes to a new accommodation of Jake's silence, and Jake reminds us where the music of the spheres originates.—<jhailey@hotmail.com>", "Since Sheri has taken Clea off of Jake's case, the Bohms and Clea have to meet clandestinely to figure out what and who Sheri is hiding behind the locked room 6 door, and to decipher Arthur's mound of research. Clea is initially tasked with the latter job as Martin once again is preoccupied by Jake's wanderings. Martin encounters a thirteen year old black youth named Elliot Demar, who has just committed a robbery at gunpoint. But Martin can see that the robbery is just a means of survival as he is the sole caregiver to his disabled older brother, Andres Demar. But Elliot is not divulging the entire story, which includes his dealings with his parole officer, John Tenney. The story also involves a rare musical instrument seller, a lovestruck street guitarist in Brazil and the object of his affections, a café owner whose business is all she has left of her family but who is having troubles making ends meet running it. Meanwhile, Clea unexpectedly meets someone at Arthur's office, namely his roommate, an Orthodox Jewish diamond dealer named Abraham, who knows of Arthur's work and who makes a contact into Clea and the Bohm's lives now that Arthur is dead.—Huggo"], "genres": "N/A", "imdbID": "2379603", "rating": 7.5, "votes": 422, "number_of_episodes": 26}