{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "1755731": "Deidrie Henry", "0219748": "Catherine Dent", "0116749": "Roxana Brusso", "0687937": "Eyal Podell", "0089781": "Alan Blumenfeld", "0569702": "Sean McGowan", "3643173": "Amelia Rose Blaire", "3733156": "Alberto Frezza", "0331854": "Angela Gots", "0199717": "Robert Pike Daniel", "4645564": "May Miyata", "2550192": "Satomi Okuno", "0565062": "Bart McCarthy", "0561894": "Christopher May", "2028753": "Ondrej Habinak", "1274146": "Joan Wong", "0342957": "Brian Groh", "1157053": "Jeremy Luke", "4670679": "Allegra Carpenter", "2276582": "Arturo Del Puerto", "1130176": "Natalie Lander", "5025267": "Matthew Troy Litrell", "1888415": "Phil Hellmuth Jr.", "5025296": "Anastasia Theresa Brandt", "3827454": "Alexandra Dubois", "4141438": "Akanni Ayo", "3768736": "Michael Swinehart", "0052436": "James Bannon", "0000418": "Danny Glover"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Following Arthur's death, Martin and Clea review the surveillance tape of his visit with Jake. They notice some missing footage from the tape. But what they do notice on what remains of the footage takes them to the fact that Arthur gave something to Jake - a key - with the numbers 1188, which Martin surmises are the next numbers in Amelia's sequence. Martin goes on a quest to find what that key unlocks, which he believes will lead him to the dearth of Arthur's research. Although she is initially reluctant to help, Arthur's daughter Maggie provides information which takes Martin down a road which doesn't lead quite to what he was expecting, namely an underground high stakes poker game. Martin will learn that the poker game has a connection to a university math professor, with further unknown connections to the unusual bequeath in a will which isn't as easy to carry out as the beneficiary would like, and a video blog of a recently dumped girl who believes in the course of true love. Meanwhile, Martin's sister-in-law, Abigail Kelsey, makes a request to see Jake. Her request continues the antagonistic relationship between herself and Martin, which started when she first tried to get custody of Jake following Sarah's death.—Huggo", "Jake's voice-over reflects on prayer. Arthur has given Jake a key to room 1188. This sends Martin on a hunt for the place where Arthur kept his research. It takes him to a poker club and then to the office of a mathematician. A young woman named Natalie, who believes in love despite experiences with an ex-boyfriend, uses her blog to try to help a couple connect; and, a man who now lives in the U.S. returns to a remote Australian station for the reading of his father's will. A card dealer in debt, a horse, and red scarves help with connections. Abigail, Martin's sister-in-law, files for custody of Jake.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2362873", "rating": 7.4, "votes": 480, "number_of_episodes": 26}