{"cast": {"0000662": "Kiefer Sutherland", "1813221": "Gugu Mbatha-Raw", "3458761": "David Mazouz", "0000418": "Danny Glover", "0161980": "Jude Ciccolella", "0805930": "Amy Sloan", "4175221": "Karan Soni", "0793171": "Blake Shields", "2099399": "Mike Batayeh", "0411980": "Mark Ivanir", "0000871": "Randall Batinkoff", "2406548": "Daniel Polo", "4645564": "May Miyata", "2550192": "Satomi Okuno", "0154833": "Tatiana Chekhova", "2847556": "Melvin Abston", "4571051": "Alexandra Peters", "1012946": "Shane Blades", "1046400": "Tony Pasqualini", "2038484": "Tom Riordan", "0022357": "Eugene Alper", "1567354": "Olga Cramer", "0115397": "Tony Brubaker", "2262592": "Elena Campbell-Martinez", "10723473": "Stefani Raile"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Despite she witnessing Jake's possible communication through numbers and despite Jake having run away to home, Clea is still convinced that Jake is better off under Child and Family Services care. Before Clea whisks Jake away, Jake gives his father what Martin believes is a local telephone number. That number does lead Martin to a pawn shop owned and operated by Arnie Klepper. After visiting the shop, Martin believes that part of his purpose was to prevent the armed robbery that occurred while he was in the shop. Arnie is however ungrateful for Martin's appearance as Martin's action led to Arnie suffering a gunshot wound - a superficial one but a gunshot wound nonetheless. Meanwhile, Jake is able to run away once again, he who ultimately leads Martin to the rationale for the number, which will include in its story a Russian boy who wants the friendship of his classmates but who doesn't understand why they don't like him, a peanut vendor with serious money problems, a flight attendant whose current task is to track down a dog that was scheduled to depart on one of the flights but who escaped, a South Asian man who is in town to spread his dead father's ashes in the center of New York Stadium, an oft stolen seventh game league winning home run baseball, and the power of magic and second chances.—Huggo", "Jake, a mute 11-year-old, sees the world's patterns in such a way that he can tell what's going to happen. He sees the needs of six people to be touched. An Indian man carries his father's ashes to New York City to strew them in center field of a ballpark, a flight attendant is personally to escort a dog from New York to Russia (but the dog has escaped), a boy has no friends because his classmates believe his father is a gangster, a man down on his luck has only hours to pay a debt he owes a thug, and a pawn shop owner believes he's dying of cancer. Jake writes down a set of numbers, sending his father on a chase that pulls these disparate stories together.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2325329", "rating": 7.6, "votes": 740, "number_of_episodes": 26}