{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "3061574": "Saxon Sharbino", "0254862": "Greg Ellis", "0650702": "Leland Orser", "0000665": "D.B. Sweeney", "0001183": "Bodhi Elfman", "0698763": "John Prosky", "1352285": "Samantha Whittaker", "0389333": "David Hoflin", "0924502": "Bernard White", "0255001": "Nadine Ellis", "0932112": "Mykelti Williamson", "0004920": "Frances Fisher", "0599019": "Sumalee Montano", "0011386": "Tacey Adams", "0250699": "Maggie Egan", "0172366": "James J. Collins", "0260383": "Jesse Escochea", "1616334": "Elijah Alexander", "1060447": "David Lengel"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Martin finds out that Avram has not been returning his calls because he was seen to be abducted, although the news never made it to the police. Going back to where Avram was last seen, Martin runs into Dr. McCormick. Martin learns from an indirect source that Dr. McCormick is involved in a sleep study being conducted on some of the thirty-six, who believe they are being treated solely for a rare case of insomnia. Martin believes that obtaining Dr. McCormick's journal and infiltrating the so-called \"sleep\" clinic are keys to finding some answers, including Avram's whereabouts. As he is certain that the sleep clinic is being run by Aster Corps, Martin has to devise a plan to get in without detection. As he is unknown to Aster Corps, Trevor volunteers to infiltrate the clinic by posing as a walk-in patient. If Trevor's true purpose is discovered, it will probably mean his life. Meanwhile, Farington is up front with Calvin regarding her motivations and the need to speed up the experiments to yield results. Calvin has to decide if he will go along with her, partly based on the threat that she will turn him in for kidnapping Amelia, and partly on her veiled threat against William, or secretly go against her as her directive for Dr. Linus in the experiments is leading to the patients dying.—Huggo", "Jake's voice-over warns us that the most terrifying of futures is the one you know is going to happen. Jake leads Martin and Trevor to Dr. McCormick, who again refuses to talk to Martin, then he suffers a coronary. Jake and Amanda know that the \"nest of seven\" are dying: Trevor's sleuthing ferrets out the sleep center's location, and then he volunteers to infiltrate the place and look for a way to shut it down. Martin, Jake, and Amanda wait outside, their car doors locked. Once inside Trevor comes to Calvin's attention: can he trust Calvin? And when he gets into trouble, will Martin be of help? And what about the future Jake knows is coming?—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2887144", "rating": 7.6, "votes": 260, "number_of_episodes": 26}