{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0254862": "Greg Ellis", "0001183": "Bodhi Elfman", "1352285": "Samantha Whittaker", "1078382": "David de Lautour", "0411570": "Ravil Isyanov", "0492712": "David H. Lawrence XVII", "0932112": "Mykelti Williamson", "0004920": "Frances Fisher", "1352845": "David Ury", "5486797": "Ari Herstand", "0262277": "Corey Michael Eubanks", "0052436": "James Bannon", "0768947": "Tim Scanlon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Martin is despondent over the news from Trevor that Lucy was found dead. However, he assumes that since there was no second body found that Amelia is still alive. But Jake, using the cipher and who utters his first few words ever to Martin, sends Martin on another important task: find and stop Guillermo Ortiz. As Martin and Trevor use the extended number that Jake provides to try and find Ortiz, Jake, with Avram in tow, is off on his own mission. Reconnecting with Amelia, the three are off to the airport to track down an incoming shipment from London and its associated passenger, both of who have an important connection to what they are going through. That passenger, one of the thirty-six who has an indirect connection to Martin's past, has come to Los Angeles in part to participate in a sleep study to deal with her insomnia. What she is unaware of is that the sleep study is work being conducted by Aster Corps. Already housing six of the other thirty-six, the sleep study maps the brain waves of those six while they sleep for the numerical patterns. Farington, reconnecting with Calvin, uses the fact of the sleep study to try and bring him back under her and Aster Corp's control.—Huggo", "After extrasensory communication with Amelia, Jake speaks to his father, a two-word appeal for safety from Guillermo Ortiz. While Martin searches for Ortiz, the avenging priest is on his own hunt. An Egyptologist comes to L.A. to look at hieroglyphs on a stone. Avram takes Jake to the airport, but Jake has soon gone off on his own. Calvin, meanwhile, is talking again to Aster Corps. Martin, Jake, Amelia, Ortiz, the Egyptologist, and the stone end up at the same place. There's a reckoning. Ortiz gives Martin a piece of mysterious information, and Jake grabs a relic.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2578680", "rating": 7.7, "votes": 298, "number_of_episodes": 26}