{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0004742": "Maria Bello", "0254862": "Greg Ellis", "0311816": "Linda Gehringer", "0644750": "Randy Oglesby", "1668372": "John Boyd", "2636310": "Manuel Garcia-Rulfo", "0346003": "Castulo Guerra", "2699362": "Isabella Acres", "0389333": "David Hoflin", "0072673": "Wendy Benson-Landes", "1078823": "Maria Russell", "0262484": "Elena Evangelo", "1930012": "Matt Baker", "2796699": "Jaime Alvarez", "2153594": "Eric John Dugan"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Unknown to anyone else besides the two and despite not yet having even met, both Jake and Amelia make a mental connection to each other, and through their internal communication work toward meeting each other. As they manage to escape - at least in Amelia's case - they arrange for a rendezvous. However, Martin tries to find Jake, while Kase and Frances search for Amelia. In the process, Martin and Lucy become aware that they are being followed by someone, who they don't yet know is associated with Calvin, while Martin and Lucy learn why Calvin and Frances are so determined to get Amelia to complete the sequence. Meanwhile, Ortiz decides to bare his soul in a confessional, which also includes his association to the thirty-six. The priest has to decide whether to break his vow and report Ortiz to the authorities, or let a confessed murderer go free.—Huggo", "In a voiceover, Jake explains the power of deep personal bonds. We see evidence of that power between mother and daughter, father and son, and two brothers. Jake has a play date with Soleil, Lucy zeroes in on Calvin, Martin has a conversation with Calvin's mother, we meet his brother and better understand Calvin's motivation, and Amelia communicates with Jake. In Mexico, a killer seeks absolution from a priest who considers breaking the confessor's vow of confidentiality.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2477608", "rating": 7.4, "votes": 294, "number_of_episodes": 26}