{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0254862": "Greg Ellis", "0001183": "Bodhi Elfman", "1156709": "Annie Wersching", "0458136": "Scott Klace", "0574535": "Jamie McShane", "0640476": "Paul Vincent O'Connor", "1388719": "Karis Campbell", "0943927": "George Wyner", "0922184": "Kevin E. West", "2969074": "Blake Bertrand", "3925786": "Anthony Alabi", "4859603": "Daniel Steven Gonzalez", "1929663": "Patrick Brown", "1068841": "Damian Cecere"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Off-screen, Jake considers Einstein's notion that time doesn't exist. Jake hands Martin a photograph of the first patient at Dr. Teller's institute, Philip Green. Avram arrives from New York to help: he stays with Jake, who's reassembling the wheels from a clock, while Martin looks for Green. He's being executed that night for a triple murder. Martin, believing Green may be innocent, convinces his attorney to let him meet with Green, who's been silent since his arrest more than ten years before. That meeting sends Martin to Green's estranged daughter, who may hold the key to Green's pardon and release. Will Martin be in time, and what of Jake's disassembled clock?—<jhailey@hotmail.com>", "After the Bohms and Robbinses part company, the Bohms are visited by their old friend Avram, who wants to play his part in protecting Jake, most specifically from Ortiz. On Jake's urging, Martin's next task is to track down who Martin eventually learns is Phillip Green, who looks to be Arthur Teller's first subject and probably one of the thirty-six. With information he gets from Trevor, whose company has been decimated after the incident with Ortiz, Martin further learns that Green is on death row for a series of murders he committed fifteen years earlier following the robbery of the antiques store in which he was working as a high end watch repairman. After visiting Green, who has not spoken a word in fifteen years, Martin believes the answer to Green's salvation lies with his estranged daughter, child therapist Dr. Kate Gordon, and the box of clock gears Green seems to prize more than anything. But Martin's task may be more difficult because of a young couple, Mike and Jenny, the former who is still grieving a death and who has a eye for an eye mentality, that second eye being anyone who in his mind deserves death. Martin also learns that his task may be more than just trying to save Green's life.—Huggo"], "genres": "N/A", "imdbID": "2738814", "rating": 7.8, "votes": 310, "number_of_episodes": 26}