{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "3061574": "Saxon Sharbino", "0254862": "Greg Ellis", "0650702": "Leland Orser", "0726492": "Ron Rifkin", "0001183": "Bodhi Elfman", "0000665": "D.B. Sweeney", "0698763": "John Prosky", "0389333": "David Hoflin", "0247475": "Margaret Easley", "0932112": "Mykelti Williamson", "0004920": "Frances Fisher", "0062639": "Craig Baxley Jr.", "1616334": "Elijah Alexander", "0182620": "Tracey Costello", "0415846": "Nick Jaine", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Avram learns who abducted him and its connection to the work he was originally sent to do with Arthur Teller. Meanwhile, Martin, with a concussion, awakens in a hospital ER, learning that he was involved in a hit and run car accident, and that Jake and Amelia are nowhere to be found. He rightly surmises that the accident was orchestrated by Aster Corps, who now have Jake and Amelia. What he doesn't know is that Farington has them hidden on a cargo ship called Leviathan at Pier 17. She and Linus want to induce Jake and Amelia into a coma to accelerate the process of completing the sequence, as they require it before their financial report, indicating a major loss, is made public, which would ruin the company. However, Calvin warns that such a measure could possibly kill Jake and Amelia. But Calvin too is in a conundrum as his brother is close to death, the completed sequence which would save his life. As Amelia and Jake plot their escape, they hope with Calvin's help, Martin and Trevor try to track the children, starting with some evidence they find in Martin's damaged car.—Huggo", "Avram is astonished when he is taken to his abductor. Martin wakes up in hospital and learns that Jake and Amelia were not at the scene of the car accident; with Trevor's help, he sets out to find them. There's a clue in his smashed car. Nicole Farington's henchman delivers the children to a cargo ship about to leave for the open sea; she has less than a day to stave off corporate bankruptcy, knowing that if the children, placed in a deep coma, can complete the sequence in time, she'll reap billions. The coma endangers Amelia and Jake, and Calvin's allegiance keeps shifting from the children to Aster Corps, believing his brother can be saved. Avram has a gift for Martin.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2853214", "rating": 7.8, "votes": 314, "number_of_episodes": 26}