{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0004742": "Maria Bello", "0254862": "Greg Ellis", "0968405": "Adam Campbell", "1668372": "John Boyd", "0389333": "David Hoflin", "0480381": "John Lacy", "0579460": "Gonzalo Menendez", "0000665": "D.B. Sweeney", "3031063": "Katherine McNamara", "0640476": "Paul Vincent O'Connor", "0004920": "Frances Fisher", "1190376": "Anthony Molinari", "1970374": "Michael Broderick", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Following the Ortiz incident at Breakwire, Martin, Jake and Lucy either have to go on the run or go into hiding because of the detailed information that was inadvertently provided to the authorities. Through the latest number provided by Jake, they run into Calvin, who they ambush. Calvin is willing to help them as he knows that Aster Corps, most specifically his former partner Tony Rigby, was behind his mother's murder and Amelia's latest abduction probably with Kase's help. Calvin doesn't know where Amelia is beyond probably being at one of Aster Corps' many isolated facilities. Using Calvin's equipment, Jake goes on his own mission to connect with Amelia. In doing so, he accomplishes two tasks, namely putting the last piece in the puzzle for Calvin to bypass the brain injury to William Norburg so that William will be able to function again, and locating Amelia. As such, Calvin on one side, and Martin, Lucy and Jake on the other, part company to achieve their individual goals. Martin, Lucy and Jake's task will not be easy as the compound where Amelia is being held is fortified and so isolated that their approach will be seen well in advance of them being able to get there.—Huggo", "Families reunite. In a voice-over, Jake reflects on Newton's laws of motion, emphasizing the size of the force necessary to change an object's path. Amelia is being held in a remote location, and in telepathic communication with Jake, she tells him enough so that Martin and Lucy figure out where she is. With Jake, they head there. A truck driver gives them a hand; his daughter is a volunteer at the clinic where Calvin's brother stays. With Jake's help, Calvin has figured out a way for his brother to have a breakthrough. Can he rescue his brother, can Lucy rescue her daughter? What are the costs?—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2756120", "rating": 7.9, "votes": 321, "number_of_episodes": 26}