{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "3061574": "Saxon Sharbino", "0254862": "Greg Ellis", "0650702": "Leland Orser", "0968405": "Adam Campbell", "0001183": "Bodhi Elfman", "0000665": "D.B. Sweeney", "0924502": "Bernard White", "1907725": "Jennifer Riker", "1074160": "Travis Aaron Wade", "0932112": "Mykelti Williamson", "0004920": "Frances Fisher", "1495204": "Brian Maillard", "1989257": "Marcus Choi", "1325037": "Rafael J. Noble", "0575849": "Alec Medlock", "0599019": "Sumalee Montano", "4876129": "Hiram A. Murray", "0062639": "Craig Baxley Jr.", "2312843": "D.R. Lewis", "3353903": "Brett DeLuca", "2494456": "Erik R. Norris"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Because of a break-in at the house which Martin is certain was by Aster Corps thugs out to kill him so that they could abscond with Amelia and Jake, Martin, Jake and Amelia take refuge at Avram's apartment. Martin believes the fact that Detective Lang investigated both the incident at Breakwire and Guillermo Ortiz's death is a sign that he is meant to tell the detective the truth about himself, Amelia and Aster Corps. Before he takes Amelia to the police station to speak to Detective Lang, Martin gives Avram explicit instructions not to leave the apartment until they return. However, when Martin and Amelia leave, Jake urges Avram to go on their next mission, to find another of the thirty-six, a former military doctor, Dr. Robert McCormick. What Avram is initially unaware of is that Dr. McCormick is part of Aster Corps' sleep study. A problem that occurred with Dr. McCormick leads to a decision by Farington that could place his life in jeopardy, but a decision that also could help Avram and Jake find him.—Huggo", "The day after the suicide of one of the 36, Martin takes Amelia to meet with LAPD's Detective Lange, leaving Jake with Avram, giving strict instructions they're not to leave Avram's. Jake communicates with Avram that the two of them must find and help a war surgeon, Dr. McCormick, who's a semi-captive at a sleep-research facility, that's a cover for an Aster Corps site where the \"nest of seven\" may be at work. Aster's CEO, Nicole Farington, sets up Martin's arrest, schemes to get Amanda and Jake into the \"nest,\" and convinces Calvin to help her find the rest of the God sequence. In a voiceover, Jake worries that time is short.—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2543158", "rating": 7.2, "votes": 290, "number_of_episodes": 26}