{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0004742": "Maria Bello", "0254862": "Greg Ellis", "0311816": "Linda Gehringer", "1017524": "Audrey Marie Anderson", "0763631": "Ray Santiago", "2699362": "Isabella Acres", "0040015": "Mackenzie Astin", "0404656": "Patricia Bethune", "0990777": "Patricia Rae", "1991503": "Alex Ruiz", "0542492": "Rizwan Manji", "1751220": "Amol Shah", "1028592": "Sanjay Chandani", "2477806": "Rajni Kareer", "2821366": "Salmaan Bokhari", "0492153": "Marcus LaVoi", "0349993": "Jack Guzman", "5523931": "Sean Glenn", "4963608": "Kevin Alain", "3098006": "Abraham Justice", "5419632": "Gary Matthew"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Martin figures that assuming a cover as a reporter under the name Martin Bishop is the best way to get information about Amelia while eluding the authorities. Trevor helps him in this regard by offering him a real job as a reporter at Breakwire. Calvin Norburg, in hiding, eventually does summon Martin to discuss the activities of Aster Corps, Martin not knowing that Calvin now has Amelia. They devise a plan for Martin to get into the Aster Corps offices to retrieve Calvin's work by using the pass key of who Calvin sees as the one other disillusioned Aster Corps employee who has a high enough security clearance, her name being Mallory Kane. What they are initially unaware of is that Mallory has been detained at the Pakistani border because of her work at Aster Corps. They have to find her and find a way for her to be released, as if Aster Corps and the Pakistani authorities have their way, Mallory will disappear forever. Meanwhile, Lucy and Jake meet Sophia Corliss, a grief stricken woman who has a past association with Guillermo Ortiz. And Frances, now Amelia's chief caregiver, tries to understand her new charge. The reason for her need to do this work is revealed.—Huggo", "Jake tells us in a voiceover that on the edges of boundaries and borders are where people connect. An American sales representative is detained on the Pakistani border, accused of being a spy. A comet passes close to Earth, while a woman mourns her murdered twin. Lucy, going through boxes of detritus from her marriage, compares a photograph to a police sketch, and Jake wants to go to school. Martin, posing as a reporter, seeks an interview with Calvin Norburg while searches of computer records turn up Amelia's pseudonym. While one woman needs to be free of guilt and another from death in prison, who is holding Amelia captive?—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2365854", "rating": 7.5, "votes": 308, "number_of_episodes": 26}