{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0004742": "Maria Bello", "0254862": "Greg Ellis", "0001183": "Bodhi Elfman", "0968405": "Adam Campbell", "1668372": "John Boyd", "0311816": "Linda Gehringer", "2699362": "Isabella Acres", "0619365": "Rob Nagle", "1051245": "Candice Coke", "4089510": "Aidan Andrews", "2674507": "John Barbolla", "1356635": "Aramazd Stepanian", "0865084": "Toshi Toda", "1396592": "Shawn Huang", "4742939": "Joe Abraham", "2993012": "Anna Diop", "2901116": "Jonny Lee", "5537105": "David Lewis"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Calvin hands the Aster Corps access card over to Martin, who is tasked with retrieving all Calvin's computer files from Aster Corps. Calvin warns Martin to avoid his old partner, Tony Rigby, as Tony, who did not appreciate Calvin's public departure, would exact some form of retribution if he found that Martin was there helping Calvin. Once at Aster Corps, Martin makes a last minute decision to take a different tack--to not only get Calvin's files, but, also, any files related to Amelia. Lucy pieces together the seemingly random murders, similar to Claudia Corliss', which she is sure are linked to the mystery-man in her photograph. But, she does not yet know the connection to Amelia, not the identity of the man. The Bohm's old friend, Avram, receives a visit in New York from Guillermo Ortiz, who Avram can tell is an enemy of the thirty-six. With only Jake's cell phone number as a means by which to contact them, Avram tries to warn Martin and Jake that Ortiz is probably on his way. Jake, now attending public school, slowly begins to open up to those around him, especially Soleil. Kase decides to do his own experiments with Amelia. Martin and Calvin each arrive individually at a major discovery, and have to figure out what to do with the information. Martin's decision could affect his relationship with Lucy.—Huggo"], "genres": "N/A", "imdbID": "2475050", "rating": 7.4, "votes": 291, "number_of_episodes": 26}