{"cast": {"0000662": "Kiefer Sutherland", "3458761": "David Mazouz", "0001305": "Lukas Haas", "0846548": "Saïd Taghmaoui", "3061574": "Saxon Sharbino", "0004742": "Maria Bello", "0254862": "Greg Ellis", "0763631": "Ray Santiago", "0202966": "Keith David", "2997668": "Krys Marshall", "1890981": "Gabriel Luna", "3130554": "Christina Scherer", "1635845": "Bill Parks", "0481159": "Ana Maria Lagasca", "0052436": "James Bannon"}, "geners": ["Drama", "Mystery", "Sci-Fi"], "runtimes": ["43"],  "plot": ["There is torrential rainstorm passing over Los Angeles. It coincides with the arrival of Dutch, an old Special Forces friend of Martin and Trevor's who Martin has called to the Breakwire offices to help in both protecting Jake from all those trying to track him down, as well as finding Amelia. Despite Lucy's intention to leave that evening as she feels she can both better help protect Jake and Martin and find Amelia on her own, Jake orchestrates Lucy's arrival at Breakwire, where Trevor is holding a small party to welcome back Dutch. The storm causes all the party attendees to remain at the offices until the storm passes, but it also causes a blackout at the offices... or so they believe. In actuality, Ortiz has tracked Jake to Breakwire, and caused the blackout himself, so that he could go undercover into the building as a city maintenance worker. Jake knows that his life is in danger, and goes into hiding. So it becomes a race between Martin and Ortiz to find Jake, Ortiz who will kill anyone in his way. Jake gets some help in eluding Ortiz by Amelia. And Ortiz discloses why Jake is so special to him from among the thirty-six.—Huggo", "Jake reflects on perfect storms: weather patterns that join to create a storm greater than the sum of its parts. Amelia and Jake communicate through telepathy while Jake searches for a number, its meaning unknown to us. He also contrives to keep Lucy in Los Angeles, even after she has said good-bye to Jake and Martin, and set off driving east in a storm. Martin, with Jake, goes to a party at the on-line paper's office where an old friend waits. Guillermo Ortiz is also there, putting in motion a murderous plan. Jake is in danger and knows it. Which convergence is more powerful: Amelia and Jake's with Lucy and Martin's help, or the storm paired Ortiz's implacable misery?—<jhailey@hotmail.com>"], "genres": "N/A", "imdbID": "2739520", "rating": 7.6, "votes": 316, "number_of_episodes": 26}