{"cast": {"1967643": "Kendra Wilkinson", "1642866": "Jonathan Baker", "2804235": "Hank Baskett", "3104865": "Brittany Binger", "1102440": "Stacy Burke", "1553144": "Amber Campisi", "3486489": "Erin Dallesandro", "3228370": "Daniel Van Dyke", "3487261": "Kristen Eck", "0355723": "Jessica Hall", "0364573": "Crystal Hefner", "0005005": "Hugh Hefner", "0534975": "Holly Madison", "3243439": "Jonny Makeup", "3504104": "Maranie", "1355813": "Bridget Marquardt", "2071185": "Mary O'Connor", "0646208": "Brian Olea", "11258708": "Aurora Rosselli", "3291636": "Roy", "0790001": "Too $hort", "2377886": "Colin Wilkinson", "2350680": "Patti Wilkinson"}, "geners": ["Reality-TV", "Romance"], "runtimes": ["60"],  "plot": ["Kendra begins her new life in her new house, holds a housewarming party, and takes her fiancé Hank to meet her ex-boyfriend Hugh Hefner.", "Kendra Wilkinson begins her new life in her new house, having left the Playboy Mansion and having become engaged to football player Hank Baskett. Her friend Brittany comes by and they go grocery shopping together. When Kendra returns home, the first item of furniture to arrive is a stripper pole, which she has installed in the living room. Later, Kendra's mother Patti comes by and suggests that Kendra throw a housewarming party, which Kendra is enthusiastic about doing. Many of Kendra's friends show up for the party, including even Hugh Hefner with his new girlfriend Crystal. Later, Kendra struggles to get the house in order before her fiancé Hank comes to see it for the first time. She picks Hank up at the airport and takes him home to show him the house. Later, Kendra goes to the Bridal Bar with friends Amber and Brittany to start planning her wedding and try on wedding dresses. Kendra and Hank are invited to have dinner with Hef at the Playboy Mansion. This will be the first time Hank meets Hef, and both of them are nervous about how awkward the experience may be. However, Hef puts them at ease. He even invites Kendra and Hank to have their wedding at the Mansion. Kendra and Hank discuss this later, and while Hank is uncertain about the idea of getting married at Kendra's ex-boyfriend's house, he agrees to do so if that's what Kendra wants. She calls Hef and takes him up on the offer to have the wedding at the Mansion.—Anonymous"], "genres": "N/A", "imdbID": "1455398", "rating": 7.5, "votes": 18, "number_of_episodes": 45}