{"cast": {"6696752": "Mariko Higashiuchi", "1670250": "Kunihiro Kawamoto", "3401959": "Ken'ichirô Matsuda", "3628053": "Seiko Yoshida", "3263858": "Kengo Kawanishi", "4862684": "Yukari Oribe", "4893056": "Minoru Hirota", "5116803": "Takuji Katô", "1091445": "Masahiko Tanaka", "2919200": "Shinobu Matsumoto", "3572488": "Taira Kikumoto", "3160426": "Manabu Sakamaki", "1014417": "Ogie Banks", "7597176": "Alexandre Crepet", "0235006": "D.C. Douglas", "0293342": "Crispin Freeman", "1321026": "Carrie Keranen", "0569479": "Mary Elizabeth McGlynn", "1821497": "Steve Prince", "1315809": "Stephanie Sheh"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["23"],  "plot": ["In a flashback, the Hidden Sand Village celebrates Pakura for her victory against the Hidden Stone village. Maki, Pakura's student, wants to train with her despite being tired from the previous skirmish and Pakura praises Maki for her fighting prowess. After their sparring match, Pakura advises Maki to be strong so she can protect her loved ones and the village. Meanwhile, in a meeting of Hidden Sand officials they stress about a truce with the Hidden Mist village despite it is against in their favor and suggest Pakura to solve the issue. However, as Maki was told, Pakura was assassinated by ninjas from the Hidden Stone village. In a present time, Allied ninja struggle to outgun the remaining Ninja Swordsman of the Mist as well as Gari and Pakura. Pakura confronts Maki and reveals that she was actually send as a sacrificial offering from their village to be killed by the Hidden Mist ninja. Though Ruka intervenes their argument that her village discarded its bloody and vicious reputation under the new leadership of the Fifth Mizukage, Pakura refuses to accept it as Maki pleas wit her that Allied Shinobi Force will improve its relations and might change the future then she begs to remain a hero. Still skeptic, Pakura attempts to attack but she was stopped by Omoi and Zaji. In their successful coordinated attack, they manage to incapacitate Pakura but Gari arrives. Gari targets Maki but Pakura corners Gari with her fireballs and tells Maki to flee. After the group flee into the forest, with Maki praying by herself, Gari and Pakura have their minds erased by Kabuto again.—TheTVDB"], "genres": "N/A", "imdbID": "2478696", "rating": 6.6, "votes": 399, "number_of_episodes": 501}