{"cast": {"0847594": "Junko Takeuchi", "0250752": "Hisao Egawa", "0441534": "Masako Katsuki", "0856800": "Hideaki Tezuka", "1432142": "Keiko Nemoto", "0840691": "Takuma Suzuki", "2088158": "Tomohiro Tsuboi", "3288499": "Setsuji Sato", "2919200": "Shinobu Matsumoto", "1670250": "Kunihiro Kawamoto", "5256487": "Hiromichi Tezuka", "5045078": "Ryûichi Kijima", "3572488": "Taira Kikumoto", "1014417": "Ogie Banks", "0082507": "Beau Billingslea", "0170266": "Catero Alain Colbert", "7597176": "Alexandre Crepet", "2335252": "Lucien Dodge", "0281068": "Maile Flanagan", "0293342": "Crispin Freeman", "0391125": "Megan Hollingshead", "0747346": "Nicolas Roye", "1886746": "Roger Craig Smith", "0818111": "Spike Spencer", "1741007": "Joe Thomas", "0922026": "Debi Mae West", "0462086": "Yumiko Kobayashi"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["22"],  "plot": ["As she listens on to the events of A and his followers ambushed by a ninja group known as the Nokizaru, Tsunade realizes the nature of the insect as a bomb with another inside A. After explaining this and having A make a promise to her, Tsunade catches and destroys a bug which had been hovering near A for some time - unbeknownst to them that the Nokizaru had been using it as a method to spy on them. Preparing to operate, Tsunade has Shizune lead the surgery while she oversaw it. Though A initially protested, believing that Tsunade should perform the surgery, the Sannin allays his fears somewhat. As Shizune, aided by Amai begins the surgery, blood is splattered on a terrified Tsunade as she excuses herself from the room. Seeking an explanation, Shizune tells the two of Tsunade's two great loves and loss which led up to her current state. Hearing this, the Raikage states that he would not have placed the lives of his subordinates in the hands of someone in that mental state, an indignant Shizune speaks out against his chastisement of her mistress, throwing the extracted exploding bug at his feet. The flashback ends with Naruto and B heading towards the battlefield while A and Tsunade return to headquarters.—TheTVDB"], "genres": "N/A", "imdbID": "2492428", "rating": 6.1, "votes": 375, "number_of_episodes": 501}