{"cast": {"0837064": "David Suchet", "0030985": "Philip Anthony", "0061106": "Robert Bathurst", "0129492": "Anna Calder-Marshall", "0141264": "John Carson", "0236413": "Kevin Doyle", "1055413": "Michael Fassbender", "0321800": "Fiona Glascott", "0416524": "Geraldine James", "0421826": "Dominic Jephcott", "1290431": "Vicky Ogden", "1099188": "Julian Ovenden", "0700577": "Lucy Punch", "0257920": "William Russell", "2118257": "Annabel Scholey", "0002242": "Anthony Valentine", "0926368": "Benjamin Whitrow", "0230826": "Monica Dolan", "1485467": "Sean O'Connor"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["When a man disinherits his sole beneficiary and bequeaths his wealth to others just prior to his death, Poirot is called in to investigate.", "His friend, solicitor Gilbert Entwhistle, asks Hercule Poirot to help solve a riddle and a murder. The riddle has to do with Richard Abernethie's will. It would seem that he changed his will immediately prior to his death, distributing all of his wealth equally among family members but excluding George Abernethie who, in all previous wills, had been the sole beneficiary. The two had supposedly argued recently, but Entwhistle suspects the new will may be a forgery. As for the murder, he would like Poirot to investigate the death of Cora Gallaccio, who was violently beaten to death the day after Richard's funeral. She too had inherited from the suspect will, but are the two deaths and the will all part of a greater plot, or is there a simpler explanation?—garykmcd", "After blurting out \"but he was murdered, wasn't he?\" at her brother's funeral, Cora Gallaccio is found hacked to death in her cottage by an intruder. However, pieces of evidence don't add up to a very convincing burglary theory. Now, Cora's family, the dysfunctional Abernethie clan, are suspects in a murder case. Gilbert Entwhistle, the family solicitor, brings in his friend Poirot to solve the case.—christiefan1"], "genres": "N/A", "imdbID": "0479977", "rating": 8.0, "votes": 2754, "number_of_episodes": 70}