{"cast": {"0837064": "David Suchet", "0195439": "James D'Arcy", "1404408": "Alice Eve", "0268297": "Nicholas Farrell", "0302345": "Bronagh Gallagher", "0363990": "Tom Harper", "0397074": "Jane How", "2048333": "Samuel James", "0512229": "Helen Lindsay", "0586958": "Oliver Milburn", "1444665": "Jaime Murray", "0516181": "Roger Lloyd Pack", "0661096": "Etela Pardo", "1142587": "Georgina Rylance", "0800219": "Josette Simon", "0242026": "Lindsay Duncan", "0001285": "Elliott Gould", "2112350": "Andy Callaghan", "3561120": "Russell Loten", "3390045": "Gareth McChlery"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["94"],  "plot": ["Poirot investigates the brutal murder of an American heiress and the theft of a fabulous ruby on the Blue Train between Calais and Nice.", "After traveling on the Blue Train from Calais to Nice, Hercule Poirot is pressed into service to help solve the murder of heiress Ruth Kettering who is found savagely beaten in her compartment. She was the daughter of wealthy industrialist Rufus Van Alden and very much wanted a divorce. Both her husband and her lover were on the train but she had changed rooms with another passenger, Katherine Grey, so the question naturally arises as to whether she was the intended victim. Grey may also have had enemies as she had recently inherited a very large sum of money and greedy relatives had suddenly taken an interest in her. When an attempt is subsequently made on Grey's life, this appears to the case but Poirot methodically sifts through all of the clues to determine the motive and identify the killer.", "US industrial tycoon Rufus Van Aldin and his right hand Major Knighton tried everything to get suave British son-in-law Derek Kettering, an unfaithful gambling addict, to divorce his daughter Ruth, for whom he bought a priceless ruby with a bloody history. Both ignore she has a lover too, Count La Roche. They all board the Blue Train, Calais to Nice, with Poirot and his temporary protégée, Katherine Grey, a commoner who has just inherited a fortune. Ruth is found hammer-murdered in her compartment, which she switched for romantic purposes (hence leaving her maid in Paris) with Miss Grey, the ruby missing. Poirot solves the case only after digging into old and new secrets and seeing through multiple treachery.", "Heiress Ruth Kettering, daughter of American billionaire Rufus Van Aldin, is married to what her father believes to be a scoundrel, and has a lover that her husband believes to be another scoundrel. She is also the owner of a world-famous ruby. When she takes Le Train Bleu to Nice, she is not alone. Her husband, her lover, her maid, a recently rich young woman with a past, and the money-grabbing distant relatives of the young woman are all aboard, and maybe more. But she couldn't have been alone when she was brutally murdered and the ruby stolen, no matter what everyone says. Unfortunately for the murderer, Hercule Poirot was also aboard Le Train Bleu."], "genres": "N/A", "imdbID": "0465569", "rating": 7.5, "votes": 2825, "number_of_episodes": 70}