{"cast": {"0837064": "David Suchet", "0000256": "Jenny Agutter", "0049346": "Patrick Baladi", "0083795": "Eva Birthistle", "1259002": "Elliot Cowan", "0234807": "Amanda Douge", "0236069": "Penny Downie", "0243983": "Richard Durden", "0045661": "Claire Hackett", "0394037": "Richard Hope", "0408309": "Celia Imrie", "0494549": "Nicholas Le Prevost", "0683116": "Tim Pigott-Smith", "0819655": "Elizabeth Spriggs", "0868476": "Pip Torrens", "0941000": "Tim Woodward", "0947379": "David Yelland", "2078992": "Martha Barnett"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["A young widow is left in sole possession of her late husband's fortune, her brother who dominates her refuses to let her share it with her in-laws, so they enlist Poirot to prove her missing first husband might not be dead.", "Hercule Poirot finds himself trying to solve the mystery of the Cloade family. Rosaleen is the young widow of Gordon Cloade who was killed in a gas explosion in his London home. Rosaleen has inherited her late husband's substantial fortune and she and her brother David Hunter are refusing to share it with other members of Gordon Cloade's family. There have been persistent rumors that Rosaleen's first husband, an intrepid explorer, is still alive and as such would nullify her marriage to Gordon. What Poirot learns however is of a far greater deception that will alter everyone's perception of what they believe to their reality.—garykmcd", "A young woman, Rosaleen Cloade, seems to be rather unlucky when it comes to marriage. Her first husband, Robert Underhay, was declared dead after disappearing in the African jungle. Now her wealthy second husband, Gordon Cloade, and 12 guests have been killed in a gas explosion at their house. She inherits Mr Cloade's fortune but other members of the family are continuously trying to undermine her and view her as a gold digger. One of them is even making anonymous calls, threatening her. All this time her life and finances are protected by her faithful, aggressive brother, David Hunter. Then one day a man appears who claims that Robert Underhay is alive and well, and demands money from David Hunter in order to keep it a secret. The man is soon found dead.—grantss", "Just weeks after marrying a young widowed actress, Gordon Cloade, a rich businessman, is instantly killed in a gas explosion in his flat. Out of the inferno, which also killed several other people in his apartment building, however miraculously walks his 23-year-old actress wife Rosaleen almost unharmed, having been in the cellar at the time of the explosion with her brother David Hunter, choosing wine. After Gordon Cloade's death, his young widow is left in sole possession of her late husband's fortune and - in contrast to her husband who always was very generous with his money to the rest of his family - she totally withholds it from the other Cloades. Finding the sudden lack of funds very frustrating, the Cloades decide to employ detective Hercule Poirot in order to investigate the on-going rumours that Rosaleen's first husband Robert Underhay, who years ago mysteriously disappeared into the African jungle, might not be dead after all.—Anonymous", "Gordon, the wealthiest member of the Cloade family, dies in a gas explosion and leaves his vast fortune to his new wife, Rosaleen. Desperate for money, Gordon's relatives claim that her first husband may still be alive. The mystery thickens when a stranger claiming to be that husband is found dead.—shanty_sleuth"], "genres": "N/A", "imdbID": "0478227", "rating": 7.4, "votes": 2184, "number_of_episodes": 70}