{"cast": {"0837064": "David Suchet", "2114872": "James Alper", "0100900": "Philip Bowen", "0119470": "Cordelia Bugeja", "2047339": "Zigi Ellison", "0312593": "Tristan Gemmill", "0421105": "Alex Jennings", "2089706": "Lucy Liemann", "0544334": "Lesley Manville", "1203457": "Lyndsey Marshal", "1779542": "Jenny Ogilvie", "0700059": "Robert Pugh", "0718619": "Douglas Reith", "0796502": "Alexander Siddig", "0910738": "Zoë Wanamaker", "0917320": "Honeysuckle Weeks", "0922751": "David Westhead", "0942712": "Philip Wright", "3397872": "Elizabeth Ford", "3001340": "Laurence Richardson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["92"],  "plot": ["The enigmatic, sinister Mr. Shaitana, one of London's richest men, invites 8 guests, 4 of them possible murderers and 4 'detectives' to his opulent apartment.", "Hercule Poirot finds himself investigating the murder of his dinner host, Mr. Shaitana, who was stabbed in the heart while his guests played bridge. There are eight guests and Poirot finds himself in the company of three other investigators. The foursome interview each of the other guests in turn but make little headway until Poirot manages to reconstruct the various bridge hands played at the suspects' table. In doing so, he is able to identify one particular action that leads him to identify the killer.—garykmcd", "An enjoyable evening of bridge turns into a murder investigation. Can the four invited investigators - Hercule Poirot, Superintendent Battle, Colonel Race and Ariadne Oliver- discover which of the other four guests is the killer? All four had the opportunity - and all four have something to hide. After all, their host seemed certain that each of them had already got away with murder.—Anonymous", "The mysterious Mr. Shaitana invites eight people to a party, four sleuths and four people who he believes have gotten away with murder. They all start to play bridge, while Mr. Shaitana sits in his comfortable chair and relaxes. But his own murder becomes part of the game when he is found stabbed to death.—seandirector"], "genres": "N/A", "imdbID": "0478226", "rating": 7.5, "votes": 2601, "number_of_episodes": 70}