{"cast": {"0837064": "David Suchet", "0009424": "Joe Absolom", "0597133": "Simon Molloy", "0394037": "Richard Hope", "0947379": "David Yelland", "0806699": "Sarah Smart", "0144237": "Raquel Cassidy", "0226819": "Richard Dillane", "0791871": "Simon Shepherd", "0025099": "Emma Amos", "0313863": "Billy Geraghty", "0312587": "Ruth Gemmell", "1128766": "Mary Stockley", "0910738": "Zoë Wanamaker", "0722631": "Paul Rhys", "0680795": "Siân Phillips", "0751060": "Catherine Russell", "0740500": "Amanda Root", "0513201": "Richard Lintern", "2970896": "Philippa Burt", "2666694": "Alexander Donald", "3386071": "Leighton Haberfield", "2895298": "Lexie Lambert"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["A pair of photographs are the only clues that Poirot has to solve the murder of a village charwoman, and to prove the innocence of the victim's lodger.", "James Bentley is tried for the murder of Abigail McGinty, the charwoman of Broadhinny who also took in Bentley as her lodger. The evidence is overwhelming, and soon after he is sentenced to hang. Superintendent Spence is not convinced of the man's guilt, and so he visits Poirot, asking him to look into the case. Poirot then heads off to the village, where he becomes the paying guest of Maureen and Major Johnnie Summerhayes. Ariadne Oliver, Poirot's novelist friend, has also come to Broadhinny to collaborate on a stage adaptation of one of her novels with dramatist Robin Upward. With the clue of a bottle of ink purchased by the dead woman shortly before her death, Poirot searches Mrs. McGinty's belongings and finds an edition of The Sunday Comet newspaper, where an article concerning two women connected with famous murders has been cut out. With the story are two photographs of the women. Poirot discovers that Mrs. McGinty had seen one of the photographs before, and knew to whom it belonged to. But which woman was this case connected with? Are any of the people living in Broadhinny related to these women, as one of their children? Or perhaps one of them is one of the actual women? The puzzle pieces begin to fit in, especially after Poirot is shoved into the path of an oncoming train by an unknown entity. But will the murderer strike again?—shanty_sleuth", "Hercule Poirot is asked by Police Superintendent Spence to investigate the murder of Mrs McGinty, a simple, harmless cleaning lady in a small town. Her lodger, James Bentley, was recently convicted of the murder and will soon hang. The Superintendent was the investigating officer on the case but feels that Bentley is not the murderer, despite the weight of evidence to the contrary. Poirot takes the case and heads to the village of Broadhinny, where he runs into an old acquaintance, Ariadne Oliver, the novelist. She too has some theories regarding the murder.—grantss", "After James Bentley is convicted and sentenced to hang for the murder of Mrs. Abigail McGinty, the lead investigator in the case, Supt. Harold Spence, begins to have doubts. Concerned that he may have been instrumental in sending a possibly innocent man to the gallows, he asks Hercule Poirot if he would investigate further. Accompanied by his friend, the writer Ariadne Oliver, Poirot sets off and soon takes up residence where Mrs. McGinty worked as a cleaning lady.While going through her few remaining possessions he finds a newspaper dated only a few days before her death but with two photos cut out. He traces the photos and Mrs. Upward, his hostess admits to recognizing one of the photos but an attempt on his life and a second murder leads Poirot to ask why Mrs. McGinty was killed and concludes it had to be because of something she knew.—garykmcd"], "genres": "N/A", "imdbID": "0772597", "rating": 7.7, "votes": 2221, "number_of_episodes": 70}