{"cast": {"0837064": "David Suchet", "0910040": "Harriet Walter", "0416849": "Raji James", "0212148": "Adam De Ville", "0302369": "Don Gallagher", "0322510": "Georgie Glen", "2831678": "Georgia Cornick", "0534315": "Carol MacReady", "0804218": "Claire Skinner", "0941096": "Susan Wooldridge", "0514638": "Natasha Little", "2496312": "Amara Karan", "0189488": "Adam Croasdell", "0007893": "Amanda Abbington", "0707214": "Miranda Raison", "0077397": "Elizabeth Berrington", "1396037": "Jo Woodcock", "2831556": "Lois Edmett", "0371846": "Pippa Haywood", "0397074": "Jane How", "1648520": "Katie Leung", "0504320": "Anton Lesser", "3499112": "Jemma Carlisle", "3194419": "Alfie Hammali", "3386634": "Olivia Jewson", "3389754": "Aaron King", "2848644": "Laura Tarrant"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["83"],  "plot": ["A foreign revolution, a kidnapped princess, and a trove of priceless rubies are linked to a prestigious girls' school, where staff members are brutally murdered.", "When the middle-Eastern country of Ramat is over-run by anti-monarchist revolutionaries, the surviving heir to the throne, Princess Shaista, is spirited away to safety in a small girls' school, Meadowbank, which is run by the progressive Miss Bulstrode. However, when the bullying games mistress Miss Springer is found stabbed through the chest with a javelin, it appears that Meadowbank may not be the haven it promised to be. As Poirot assists Inspector Kelsey, they begin to find that some of the staff may not be quite what they appear, a situation which is compounded when another teacher, Mademoiselle Blanche is found dead and Princess Shaista is kidnapped from the school. With the princess' life in peril, and the prized rubies of Ramat missing, it is up to Poirot to discover who is the cat among the pigeons.—shanty_sleuth", "Hercule Poirot is asked by Miss Bulstrode, an old friend and the headmistress of Meadowbank school (a prestigious school for girls), to award the first prize after their annual sports event. After the ceremony Miss Bulstrode asks Poirot to stick around at the school, as she is thinking of retiring and wants Poirot to observe the staff. Among the pupils are the princess, and heir, of a middle eastern kingdom and a girl whose uncle was murdered in the recent coup in the princess' country. Then the gym teacher, a loathsome, meddling, bullying, universally-hated person, is found murdered in the gym, killed by a javelin. In addition, the tennis racket of the girl with the murdered uncle is missing.—grantss", "Poirot goes to present a sports prize at Meadowbank, a girls' boarding school run by his friend Honoria Bulstrode, who asks him to stay on and help her choose a successor as she is planning to retire. Her friend Miss Chadwick founded the school with her but Miss Bulstrode favours the younger, progressive Miss Rich. A new girl at the school is Princess Shaista, whose brother Prince Ali Yusuf was murdered in a coup in his country Ramat, and Shaista claims that she is in danger herself. She does indeed disappear, after Miss Springer, the unpopular games mistress is murdered in the sports pavilion and Poirot's help in solving the crime is welcomed by the investigating officer Inspector Kelsey. Then Miss Rich is attacked, though not fatally, and Mademoiselle Blanche, the French teaching assistant, is killed by a person she has been blackmailing. Someone has indeed set a cat among the pigeons and it is down to Poirot to unmask them.—don @ minifie-1", "Hercules Poirot visits the prestigious Meadowbank school for girls to present the Pemberton Shield to the winners of an international lacrosse tournament. He is asked to stay on by his good friend, the school's headmistress Miss Bulstrode, who tells him that she has decided to retire and would like his advice on selecting her successor. He soon finds himself trying to solve a murder when the sports mistress, Miss Springer, is found dead in the sports pavilion. One of the students, Princess Shaista, tells the police that she was the likely victim as there was political unrest in her home country recently. Poirot won't dismiss the young girl's claims but there are many suspects who might benefit from having a major disruption at the school or alternatively, have something to hide. Even when the Princess is apparently kidnapped and a second murder takes place, Poirot believes that the answer lies among the staff.—garykmcd"], "genres": "N/A", "imdbID": "1105122", "rating": 7.9, "votes": 2397, "number_of_episodes": 70}