{"cast": {"0837064": "David Suchet", "0000347": "Tim Curry", "3140729": "Jawad Elalami", "1268047": "Christina Cole", "2068559": "Tom Riley", "0132293": "Cheryl Campbell", "3018580": "Zoe Boyle", "0192209": "Emma Cunniffe", "0687081": "Angela Pleasence", "2710167": "Abdelkader Aizzoune", "0293550": "Paul Freeman", "0323764": "Beth Goddard", "1605114": "Christian McKay", "0309693": "Mark Gatiss", "2456652": "Mansour Badri", "0001314": "John Hannah", "0040510": "Zakaria Atifi", "0001527": "Elizabeth McGovern", "3149784": "Rob Madge"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["Syria 1937. While accompanying her husband on an archaeological dig, the abusive and overbearing Lady Boynton is found stabbed to death.", "Syria, 1937: Hercule Poirot is one of several people present at an archaeological dig to find the skull of St John the Baptist, led by the exuberant Lord Boynton and his loyal son Leonard. The enterprise has been financed by Boynton's rich, rude and overbearing American wife. She bullies her three adopted children, Carol, Jinny and Raymond, as well as the family's nanny. Sarah King, a young English doctor, falls for Raymond and would love to tear him from his mother's apron-strings, and another doctor, Dr Gerard, takes an interest in Jinny, as does a Polish nun, who, with Jinny, is subject to an attack - by white slavers, according to the independent travel-writer Dame Celia Westholme. A mysterious young American, Jefferson Cope, whose link to the Boyntons seems tenuous, completes the group. Only his Lordship has any love for his wife so that, when she is found stabbed to death one blisteringly hot afternoon, Poirot has more than his fair share of suspects to interrogate.—don @ minifie-1", "Hercule Poirot is in Syria. He is part of a party accompanying Lord Boynton, a famous archaeologist, on a dig to find the skull of John the Baptist. Also in the party are Lady Boynton, an evil ogre of a woman, and the main target of her malice - Lord Boynton's three children (she is not their mother, as they were born to a previous wife of his). One day, Lady Boynton is found stabbed to death. Poirot investigates but, due to the seemingly universal dislike for the woman, the suspects are many. Plus, the murder seems impossible as she was in plain view when the deed was supposed to have occurred.—grantss", "At an archaeological dig in the Middle East, Hercule Poirot finds himself investigating the death of Lady Boynton, the wife of the expedition leader Lord Boynton. She had been visiting with her three children and their now elderly nanny and was greatly disliked by virtually everyone who came into contact with her. Other visiting the site include Dr. Sarah King, Jefferson Cope, Lord Boynton's son Leonard, Dame Celia Westholme and Dr. Gerard. From all accounts, the dead woman was nothing short of cruel to her children and others put in her care. This proves to be the motivation underlying her murder.—garykmcd"], "genres": "N/A", "imdbID": "1230605", "rating": 7.5, "votes": 2703, "number_of_episodes": 70}