{"cast": {"0837064": "David Suchet", "0947379": "David Yelland", "0740383": "Jemima Rooper", "0910738": "Zoë Wanamaker", "0123779": "Clemency Burton-Hill", "0836431": "Matilda Sturridge", "2070427": "Tom Mison", "0912353": "John Warnaby", "0642109": "Caroline O'Neill", "0928134": "James Wilby", "0101248": "Peter Bowles", "2089706": "Lucy Liemann", "0827866": "Tim Stern", "0384679": "Simon Hill", "1553399": "Tessa Bell-Briggs", "0327799": "Ysobel Gonzalez", "1622698": "Sean Kingsley", "2881662": "Jade Longley", "1097354": "Juliet Howland", "0006522": "Haydn Gwynne"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["After a seemingly neurotic young heiress tells Ariadne Oliver and Poirot that she thinks she may have killed someone, her ex-nanny is found with her wrists slashed.", "Poirot is visited by a distraught girl, Norma Restarick, who fears she may have killed someone but runs away, telling him that he's too old rather than explaining further. By coincidence, Poirot's friend Ariadne Oliver lives in the same apartment block as Norma and her two roommates and recently went to their party, where Norma was distressed when she was offered ice cream. Norma's ex-nanny, Miss Lavinia Seagram, an alcoholic, also lived in the block but was recently found dead, with the verdict being suicide. Ariadne is unconvinced and searches the nanny's apartment, finding a clue which she puts in her handbag. Soon afterward she is attacked and the bag and its contents are stolen. Poirot visits the Restarick family home in the country, owned by Norma's great-uncle, Sir Roderick, an elderly and half-blind man who is dependent upon Sonia, his young personal assistant (who may well be a gold-digger). Andrew Restarick, Norma's father, explains to Poirot that he spent much of Norma's childhood working abroad, leaving her with her unstable mother and Nanny Seagram. Norma admits to Poirot that she blames herself for her mother's suicide, which took place when the little girl was on an outing with the nanny and wanted to stop for an ice cream. She now believes that if she had got home earlier she would have saved her mother, hence her revulsion at being offered ice cream. Poirot and Ariadne visit Miss Battersby, Norma's former school teacher, where they discover something very suspicious about Norma's friends and family. Also convinced that Miss Seagram's death was not suicide, Poirot enlists Norma's help in setting a trap to catch whoever killed her old nanny and is now trying to frame her.—don @ minifie-1", "Poirot is approached by a young woman, Norma Restarik, who says she thinks she murdered someone. Before he can get any information from her however, she shouts that he's too old and rushes out of his flat. It turns out that she was referred to him by his good friend, the author Ariadne Oliver. Margot and two other girls live in the flat above hers and she had only recently attended a party there. The dead woman in question is Norma's one-time nanny, Lavinia Seagram, who is found dead in her bed in what is initially believed to be a suicide but subsequently proves to be murder. Norma is a bit unstable, the product of a broken home and having discovered her own mother, also a suicide, dead in the bathtub. She is confused and while she has no recollection of having committed the murder, believes she must have done it. Poirot has many suspects to choose from: either of Norma's roommates; her father Andrew who returned to England a year ago having abandoned the family 20 years before; an artist, David Baker whose interest in Norma seems to have come about only after he's learned of her huge inheritance; and a blind uncle, Sir Roderick Horsefield, who has taken up with a much younger woman. With the help of Ariadne Oliver, Poirot deciphers the various clues to identify the murderer.—garykmcd"], "genres": "N/A", "imdbID": "0981210", "rating": 7.7, "votes": 2226, "number_of_episodes": 70}