{"cast": {"0837064": "David Suchet", "0789864": "Martin Shaw", "2632878": "Kimberley Nixon", "0539562": "Art Malik", "0078136": "Suzanne Bertish", "0384826": "Anastasia Hille", "0895812": "Ronan Vibert", "0038918": "Kate Ashfield", "0038870": "Jane Asher", "0141997": "Anna Carteret", "0670424": "Nigel Pegram", "0936300": "Tom Wisdom", "0387609": "Michael Hobbs", "2878763": "Jodie McNee", "2677403": "James Hurran", "0560806": "Tony Maudsley", "0164953": "Prue Clarke", "0947379": "David Yelland", "0005472": "Kimberly Stewart"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["94"],  "plot": ["When a vicar chokes to death on a cocktail while attending a party held by actor Sir Charles Cartwright, Poirot initially dismisses the idea of murder but reconsiders when another guest dies in the same manner.", "The inoffensive Reverend Babbington chokes to death at a cocktail party he is attending with his wife at the home of famous actor Sir Charles Cartwright. Some time later Sir Bartholomew Strange, an eminent doctor and friend of Cartwright, also dies of poisoning at a dinner party he is giving miles away. There appears to be no link between the two deaths but Poirot, assisted by Cartwright, offers to help Superintendent Crossfield in the investigation and discovers that a mysterious butler with a birthmark on his wrist was hired for the night and appeared to share a joke with the dead doctor. This man has now vanished and would seem to the killer. A third death, that of a sanatorium patient who has written to Poirot, would appear to link to the doctor's murder and there is certainly a secret which somebody will go to any lengths to conceal - but who would gain from the death of a harmless old vicar?—don @ minifie-1", "Poirot investigates a series of murders, the first of which had all of the earmarks of a natural death. At a small dinner party at the home of a famous actor Sir Charles Cartwright, the local minister, Rev. Babbington drops dead after taking a sip of his pre-dinner cocktail. There is no evidence of poison either in the body or the glass and the coroner rules the death to be from natural causes. One month later at the home of Sir Bartholomew Strange, he too succumbs at a dinner with many of the same guests as had been present the previous month at Sir Charles' home. This time, Poirot is certain it's murder and an exhumation and examination of Babbington's remains reveal that he too was in fact poisoned. The key to solving the crimes is to identify Ellis, the mysterious butler at Strange's dinner who seems to have vanished.—garykmcd", "Hercule Poirot is invited by a friend, the famous actor Sir Charles Cartwright to a dinner party. At the party, while drinking cocktails, one of the guests, Reverend Babbington, collapses and dies. Sir Charles says to Poirot that he thinks he was poisoned but the contents of his glass are free of anything toxic, and the event is put down to natural causes. Even Poirot does not suspect foul play. Then a month later, Sir Bartholemew Strange, a friend of Sir Charles, dies during a dinner party. This time it is clear that he was murdered - poisoned. Poirot suspects that the two deaths are linked and revisits his conclusion that the death of Reverend Babbington was due to natural causes. Sir Bartholomew's butler, Ellis, is the prime suspect but he has fled and is nowhere to be found. Poirot doesn't believe that the case is that simple.—grantss"], "genres": "N/A", "imdbID": "1469899", "rating": 7.7, "votes": 2367, "number_of_episodes": 70}