{"cast": {"0837064": "David Suchet", "0120111": "Amelia Bullmore", "0910738": "Zoë Wanamaker", "0277525": "Deborah Findlay", "3665035": "Mary Higgins", "0860724": "Sophie Thompson", "2415436": "Georgia King", "1675071": "Ian Hallard", "0922367": "Timothy West", "0941211": "Fenella Woolgar", "2161894": "Macy Nyman", "3701975": "Richard Breislin", "0947379": "David Yelland", "0227971": "Paola Dionisotti", "0722279": "Julian Rhind-Tutt", "1442933": "Paul Thornley", "2523661": "Vera Graziadei", "0492373": "Phyllida Law", "0843059": "Eric Sykes"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["During a village's Hallowe'en party, a young girl boasts of having witnessed a murder from years before. No one believes her tale until her body is found later on in the evening, drowned in the apple-bobbing bucket.", "When Ariadne Oliver and her friend, Judith Butler, attend a children's Halloween party in the village of Woodleigh Common, a young girl named Joyce Reynolds boasts of having witnessed a murder from years before. Joyce's story is heard by all the party, including her strange brother Leopold, the impeccable hostess Rowena Drake, her bookish son Edmund, and the local Reverend Cottrell. Mrs Whittaker, the church organist, and Frances Drake, Rowena's feisty daughter, are dismissive of her story, but later that evening Joyce's lifeless body is discovered face-down in the apple-bobbing bucket. At Mrs Oliver's behest, Poirot travels down to Woodleigh Common to investigate the murder. Although the local police and Joyce's stepmother dismiss the dead girl's claim, Poirot takes Joyce's story seriously. Mrs Goodbody, a gossiping charwoman, tells Poirot there have been a number of suspicious deaths in the village in recent years which Joyce could indeed have witnessed, and that old curses still haunt the village - a claim supported by the affable gardener, Michael Garfield. While Poirot is busy piecing together the facts, another child is found drowned in a river. He realizes that he needs to act quickly in order to save Judith's daughter, Miranda, who is also in danger.—shanty_sleuth", "Ariadne Oliver asks her good friend Hercule Poirot to travel down to Woodleigh Common after a young girl, Joyce Reynolds, is killed during a Halloween party. She was found in the tub used for bobbing apples and most tellingly, had only a bit earlier informed the group that she had seen a murder committed in that house. On the train, Poirot meets Michael Garfield, a gardener, who is returning to Woodleigh Green after a lengthy absence. He suggests to Poirot that a good source for village gossip would be the elderly Mrs. Goodbody. When he meets the old woman she suggests that there are three deaths that could have been murder. Poirot also learns of an attempt to forge a codicil to a will that would have made a young au pair the sole beneficiary of a local fortune. As he weighs and sifts through all of the clues, another child is killed.—garykmcd", "Hercule Poirot's friend, the crime novelist Ariadne Oliver, attends a Hallowe'en party in the country. At the party a young girl claims she once saw a murder. Nobody believes her but later that evening the girl is found murdered. Oliver suspects that the perpetrator of the murder the girl saw has murdered the girl and calls in Poirot.—grantss"], "genres": "N/A", "imdbID": "1535120", "rating": 7.8, "votes": 2468, "number_of_episodes": 70}