{"cast": {"0837064": "David Suchet", "3716128": "Tristan McShepherd", "0186424": "Sam Crane", "0429363": "Toby Jones", "1668284": "Brian J. Smith", "0607375": "David Morrissey", "1567113": "Jessica Chastain", "1270132": "Stewart Scudamore", "0371891": "Serge Hazanavicius", "0040586": "Eileen Atkins", "0521443": "Susanne Lothar", "1616970": "Denis Ménochet", "0001347": "Barbara Hershey", "0095017": "Hugh Bonneville", "0189887": "Marie-Josée Croze", "2720118": "Stanley Weber", "2180812": "Elena Satine", "1152798": "Joseph Mawle", "0922335": "Samuel West", "3821369": "Tiziana Azzopardi", "4459426": "Ekaterina Botziou", "0146439": "Manuel Cauchi", "3630242": "David Lyddon", "0678375": "Darren Petrucci", "3203072": "Umit Ulgen"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Poirot investigates the murder of a shady American businessman stabbed in his compartment on the Orient Express when it is blocked by a blizzard in Croatia.", "Railway director and fellow Belgian Monsieur Bouc secures Poirot a last minute berth on the Orient Express, returning to England from Istanbul. Ratchett, an abrasive American businessman, traveling with his valet and male secretary, tries to secure Poirot's services as he fears that his life is in danger. Poirot turns him down, but the next morning, whilst the train is stuck in a snowdrift in Croatia, Ratchett is found stabbed to death. There is vague talk of a man seen fleeing the train, but many of the passengers in Poirot's compartment do not appear to know either Ratchett or each other, so what could the motive be? Poirot, assisted by Bouc and Dr. Constantine, attempts to find out.—don @ minifie-1", "Hercule Poirot travels from Istanbul to Calais on the Orient Express. He is the guest of the owner of the train company, Xavier Bouc. On the train is a ruthless, obnoxious American businessman, Samuel Ratchett, plus a variety of other characters. The train is halted in Croatia after a snow drift blocks the line. Later that same night, Mr Ratchett is murdered in his sleep, stabbed multiple times. Stranded in the middle of nowhere, Poirot sets out to find out who murdered Mr Ratchett.—grantss", "Returning to London from Istanbul, Hercule Poirot finds that the Orient Express is fully booked, despite the low travel season. Thanks to Mess. Bouc, a Director of the line, he is found accommodation among the many and varied passengers. Soon after coming on board, he's approached by a rude American. Mr. Ratchett, to work for him but Poirot dismisses him out of hand. When Ratchett is found dead the next morning from multiple stab wounds, Bouc insists that Poirot solve the crime before the police arrive. He soon identifies the dead man as the infamous kidnapper Cassetti who was responsible for the death of little Daisy Armstrong but managed to evade conviction. As Poirot pieces together the clues in the case, it becomes apparent that several passengers on the train have a connection to the Armstrong case and a reason to want him dead.—garykmcd"], "genres": "N/A", "imdbID": "1554113", "rating": 8.0, "votes": 5252, "number_of_episodes": 70}