{"cast": {"0837064": "David Suchet", "0062636": "Helen Baxendale", "0292140": "Hugh Fraser", "0717176": "Anne Reid", "0822062": "John Standing", "1264521": "Aidan McArdle", "0322562": "Philip Glenister", "2393481": "Adam Englander", "2851789": "Alice Orr-Ewing", "0227681": "Shaun Dingwall", "2439913": "Matthew McNulty", "0534777": "Anna Madeley", "1721217": "Claire Keelan", "0185045": "Gregory Cox", "0947379": "David Yelland"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["An ailing Poirot returns to Styles with Hastings nearly three decades after solving their first mystery there in order to prevent a serial killer from claiming more victims.", "Still mourning the untimely death of his wife, Bella, Hastings is summoned to Styles Court in Styles St. Mary by his old friend Poirot. It is the country manor where, thirty years previously, he and Poirot had first met in England and where they had also solved their first murder mystery together. Now, Styles has changed hands and is being run as a modest post-war guest house, and it is here that Hastings makes a gut-wrenching discovery: Poirot's health has taken a turn for the worse. The Belgian detective is now old, gaunt, arthritic, and confined to a wheelchair as he battles a weak heart. But his little gray cells are as active as ever, which is why Poirot has called him to Styles in the first place - a murderer is in their midst, and may be ready to strike again. He asks Hastings to be his eyes and ears about the place, for Poirot does not know who is likely to be the killer's next victim. Being as observant and vigilant as possible, Hastings takes stock of his fellow company, which includes Styles' elderly owners Daisy and Colonel Toby Luttrell, melancholy spinster Elizabeth Cole, charming aristocrat Sir William Boyd Carrington, perceptive birdwatcher Stephen Norton, dashing womanizer Major Allerton, introverted chemist Dr John Franklin and his unpleasant wife Barbara, Mrs Franklin's caretaker Nurse Craven, and, most significantly, his fiercely independent daughter Judith, currently working as Dr Franklin's laboratory assistant. Any one of these people could be a killer, but Hastings is at a loss as to exactly who, especially since he seems more interested in reconnecting with his estranged daughter and protecting her from indecent cads like Allerton. But soon, the murderer's presence becomes apparent: first, Colonel Luttrell nearly kills his wife in a supposed shooting accident, and then Barbara Franklin dies after ingesting a toxic alkaloid that her husband has been researching. Just when a solution seems in sight, Norton is found dead from a gunshot wound. Who is behind these cold-blooded acts, and for what reason? How much has Poirot been withholding from Hastings, and were any of these events truly preventable? What has Judith been hiding from her father, and can the two be reconciled despite their differences? What role does Shakespeare play in the proceedings? And, finally, can Poirot solve his final case in spite of his deteriorating health, or will the curtain come down on him before he can bring a ruthless killer to justice?—shanty_sleuth", "Captain Hastings - accompanied by his adult daughter Judith - reunites with his old friend Hercules Poirot at the site of their very first case together, Styles Court. It's no longer a private house but a country guest house operated by Daisy and her husband Colonel Toby Lutrell. Poirot is not well however. He no longer has the use of his legs and is wheelchair-bound. Poirot has asked his friend to join him because he is certain there is a killer among the residents and needs him to be his eyes and ears. As some of the guests begin to die there are, as always, several suspects. The killer proves to be a master manipulator who gets others to do the actual murders.—garykmcd", "Hercule Poirot is ailing, and close to death. He travels to the estate Styles to convalesce and invites his old friend Hastings to join him. Styles has a nostalgic significance to Poirot as it was the location for the first case that Poirot and Hastings solved together. Poirot's reasons for calling Hastings down are not all about nostalgia or farewells - he believes a murder is going to be committed and, being unable to walk, he needs Hastings to be his eyes and ears. Hastings has another interest in being there - his daughter, Judith works there, as an assistant to chemist Dr Franklin. Sure enough, within a few days, Dr Franklin's wife dies, poisoned. The inquest calls it suicide, but to Hastings and Poirot it looks like murder. Problem is, the prime suspect is Hastings' daughter...—grantss"], "genres": "N/A", "imdbID": "2119589", "rating": 8.6, "votes": 2736, "number_of_episodes": 70}