{"cast": {"0837064": "David Suchet", "0525702": "Adrian Lukis", "0612442": "Annabel Mullion", "0910738": "Zoë Wanamaker", "0000627": "Greta Scacchi", "0322513": "Iain Glen", "0716490": "Vincent Regan", "5093301": "Alexandra Dowling", "3948952": "Vanessa Kirby", "0086860": "Caroline Blakiston", "2308101": "Elsa Mollien", "1468768": "Maxine Evans", "0235074": "Hazel Douglas", "0830831": "Jo-Anne Stockham", "2000850": "Ferdinand Kingsley", "0916073": "Danny Webb", "0184967": "Claire Cox", "0790689": "Ruth Sheen", "1752862": "Roxanne Gregory", "4489677": "Sophie Holt", "5148571": "Rachel Marquez", "4935021": "Lisa Ronaghan", "3393581": "Sprat"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Ariadne Oliver becomes an amateur sleuth when her goddaughter tasks her to find out the truth behind her parents' mysterious deaths.", "Ariadne Oliver is accosted by the unpleasant Mrs Burton-Cox, whose son Desmond has hopes of marrying Ariadne's beautiful goddaughter Celia Ravenscroft. But Mrs Burton-Cox will not give her blessings to the match until she learns the truth of the deaths of Celia's parents, who were found shot to death on the grounds of their estate a decade before. Were they murdered, or was it a suicide pact? If they were murdered, who shot whom? Despite being insulted by the woman's impertinence, Ariadne is nevertheless drawn to the cold case by curiosity, and resolves to find out the truth when she is persuaded by Celia herself. When she turns to Poirot for assistance, however, she finds him already preoccupied investigating the murder of an elderly psychiatrist who was the father of a personal friend. So Ariadne sets out to solve the Ravenscroft affair herself, with the mantra that 'elephants can remember' - no matter how much time has passed and how much people who were acquainted with the Ravenscrofts have aged, memories remain unchanged. However, the memories of the people Ariadne interviews are not as reliable as she has hoped, and soon the investigation takes a sinister turn when Desmond's life is threatened by an unknown entity. When Poirot realizes that his investigation is inextricably linked with Mrs Oliver's, the two join forces. With the help of a wigmaker, the evidence of a clever dog, and a French connection to the Ravenscroft case, Poirot is able to penetrate the fog of memory to uncover the truth of two long-ago deaths, and how that tragic story inspired the present-day killer whom he himself has been hunting.—shanty_sleuth", "Ariadne Oliver is asked to investigate the murder-suicide of an old school friend and her husband. Her \"client\" is an obnoxious woman hoping to use the old murder case to prevent the upcoming wedding of her son and the murdered couple's daughter. Poirot doesn't want to have any part in the investigation, being involved in another difficult case, the gruesome murder of an elderly psychiatrist. But soon he understands that the two cases are connected.—igorlongo", "Poirot investigates the death of a friend's father, a semi-retired psychiatrist who is found bound and floating in a hydrotherapy bathtub in the psychiatric institute he founded. The room in which he was found hadn't been used for years. His son, Dr. Willoughby, is also a psychiatrist and has run the institute for several years. With Poirot preoccupied with his case, he has little free time to help his friend Ariadne Oliver who has been asked to look into the deaths of her goddaughter Celia Ravenscroft's parents 13 years ago. The request comes from Mrs. Burton-Cox whose son it seems may marry Celia. The Ravenscrofts had been found lying dead on a cliff side and there was no evidence of their being killed by a third party suggesting a murder-suicide. From all accounts the Ravenscrofts were happily married but Poirot suggests Ariadne should interview anyone who was around at the the of the deaths as inevitably someone will remember something of importance. She interviews Celia's old nanny and learns that Mrs Ravenscroft may have had mental health issues while living in India. The two cases intersect after Celia's childhood friend and fiancé, Desmond Burton-Cox, is attacked and tells Poirot that he was once treated at the Willoughby institute. It appears that Mrs. Ravenscroft's twin sister Dorothea was also treated there. The solution to both crimes lie in mistaken identity and events that occurred long ago.—garykmcd", "Hercule Poirot's friend, the crime-writer Ariadne Oliver, is approached by a woman, Mrs Burton-Cox, who inquires about the death of General and Lady Ravenscroft, 13 years earlier. Ms Oliver is initially shocked and repulsed by her line of questioning but afterwards is intrigued about the details of the event, as it seemed like a double suicide or murder-suicide. She asks Poirot for help but he declines, having another case, so she does her own investigating. Then Doctor Willoughby, the psychiatrist who treated the sister of Lady Ravenscroft, is murdered in his own asylum. Poirot investigates and starts to think there may be a connection between the two events.—grantss"], "genres": "N/A", "imdbID": "2119591", "rating": 8.0, "votes": 2418, "number_of_episodes": 70}