{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0602954": "Pauline Moran", "0413946": "Philip Jackson", "0947379": "David Yelland", "1623508": "Tom Brooke", "0206530": "Nicholas Day", "0429995": "James Carroll Jordan", "0388092": "Patricia Hodge", "0655218": "Steven Pacey", "0523047": "Simon Lowe", "0191410": "Michael Culkin", "1881247": "Lou Broadbent", "0661703": "Sarah Parish", "0843366": "Peter Symonds", "0456117": "Barbara Kirby", "1372621": "Nicholas Burns", "0658099": "Alex Palmer", "0051995": "Teresa Banham", "4958046": "Jack Farthing", "1675071": "Ian Hallard", "6414255": "Marina"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["87"],  "plot": ["As the threat of world war looms large, Poirot seeks the help of friends both old and new when he is pitted against a dangerous group of dissidents responsible for a series of violent murders.", "A Russian grand master dies mysteriously during an international chess match. The case is related to a political intrigue involving the so-called Peace Party and its leaders Madame Olivier and Abe Ryland. Poirot investigates with his old friends Hastings, Japp and Lemon, helped by a reporter and a minor actress, but the quartet must soon fight a dangerous battle with the Big Four, a secret society manipulating for their own personal chess game a great number of international celebrities.—igorlongo", "As the international community watches the developments in Germany closely, the Peace Party, led by Chinese pacifist Li Chang Yen, American millionaire Abe Ryland, and the celebrated French scientist Madame Régine Olivier, tries to mend fences with an informal, symbolic chess match. Invited to play against Ryland is the famous Soviet grandmaster Dr. Ivan Savaranoff, and the event draws not only the elite, but also Poirot and Japp, now Scotland Yard's assistant commissioner who has been assigned to keep things in check. Without any explanation, Savaranoff drops dead during the game, sending shock-waves throughout the media and the public. A persistent journalist, L.B. Tysoe, is convinced that Savaranoff's death is connected to an enigmatic coterie of criminals called the Big Four, and that Ryland is one of them. When it is clear that Savaranoff was indeed murdered, Ryland vanishes, leaving Poirot and Japp to wonder whether the Big Four really do exist. As more murders are committed, and the victims linked to the supposed members of the Big Four, Poirot is faced with a crisis of global proportions as the already unstable political situation begins to crumble. But it is not only world peace that is at stake - it is his life.—shanty_sleuth", "As clouds of war appear on the horizon in the late 1930s, Hercule Poirot is presented with a most peculiar case. At a party at his home, pacifist and leading light in the Peace Party Abe Ryland sits down to play a game of chess with the now elderly but renowned Russian grandmaster Ivan Savaranoff. The grandmaster unfortunately dies after playing a few moves and his death is attributed to a heart attack. Poirot is suspicious and with the help of his old friend Assistant Commissioner Japp investigates. Soon two eminent members of the Peace Party go missing and and a young journalist attributes the crimes to the Big Four, a shadowy crime organization. Poirot soon sees through it all finding that the crimes had their origins in events that occurred long ago.—garykmcd", "It is the late 1930s and the world seems headed for war. Hercule Poirot and his old friend Japp, now Assistant Commissioner, are reunited at a special function - the Peace Party, lead by millionaire businessman Abe Ryland, are holding a chess match between a Russian grandmaster and Mr. Ryland. However, the Russian grandmaster is murdered during the match. Suspicion falls on a shadowy, subversive organisation known as The Big Four. It seems determined to undermine the fragile peace and lead the world into war. Poirot and Japp investigate, but, as we see from the opening scenes, this has fatal consequences for Poirot.—grantss"], "genres": "N/A", "imdbID": "2119592", "rating": 7.2, "votes": 2167, "number_of_episodes": 70}