{"cast": {"0837064": "David Suchet", "0675730": "Sean Pertwee", "5575343": "Chris Gordon", "0228960": "Richard Dixon", "0193661": "Sinéad Cusack", "0296410": "Rebecca Front", "0910738": "Zoë Wanamaker", "5710998": "Francesca Zoutewelle", "0503060": "Stephanie Leonidas", "2393646": "James Anderson", "0446844": "Sam Kelly", "0419089": "Martin Jarvis", "0044011": "Rosalind Ayres", "2919807": "Emma Hamilton", "1621849": "Daniel Weyman", "5709711": "Ella Geraghty", "3471316": "Elliot Barnes-Worrell", "0940245": "Nicholas Woodeson", "0255124": "Tom Ellis", "2841277": "Angel Witney", "6055176": "Ashley Goldberg", "3173569": "Kevin Hudson", "5959283": "Luke Jeffery", "10278476": "Issie Methven", "6628499": "Peter Jonathan Moore"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Mrs Oliver is asked to devise a murder hunt for a Devon fête, but her sense of foreboding summons Poirot to the scene. Her fears are realized when the girl playing murder victim winds up truly murdered.", "With summer in the air, wealthy squire Sir George Stubbs and his fragile, childlike wife Hattie plan a grand fête for their Devonshire neighbors to celebrate their recent acquisition of Nasse House. Fancy dress, fortune telling, and a coconut shy are all scheduled, as well as a murder hunt designed by mystery novelist Ariadne Oliver. But Mrs Oliver is convinced something is amiss, and asks Hercule Poirot to attend the festivities as a means to put her mind at rest. Poirot scrutinizes the eclectic lot, which includes officious politicos, a put-upon secretary, a rakish architect, warring holidaymakers, a garrulous ferryman, an urbane foreigner, and Nasse's former matriarch, now content to be a humble lodger. They certainly have secrets to hide, but are any of them likely murderers? Or victims? When Mrs Oliver's fears are realized, however, the events are far from how she imagined them to unfold. A murder occurs as anticipated, but bizarrely, the victim is Marlene Tucker, a local Girl Guide who was assigned the role of the victim in Mrs Oliver's murder game! Her seemingly senseless death precipitates an even greater intrigue when Hattie Stubbs vanishes into thin air, clothes and all. Then the ferryman dies in a seemingly unrelated accident. What could all of this mean? Was Marlene silenced as a witness? Was Hattie abducted against her will? Was Mrs Oliver unknowingly manipulated by an unscrupulous murderer? And how does Sir George's hideous folly figure into the mystery, if at all? Poirot is on the case, determined to put the follies of Nasse House to rest once and for all.—shanty_sleuth", "Hercule Poirot races to Devonshire when his old friend and amateur sleuth Ariadne Oliver sends him a telegram saying she is in danger. He arrives to find her perfectly well and in the process of preparing a murder game to be held on the day of the village fête to be held on the grounds of Sir George Stubbs' manor house. Ariadne has convinced herself there is going to be a murder however in the next few days. Poirot's old friend is right because on the day of the fête 14 year-old Marlene Tucker, the \"corpse\" in the murder game is found dead in the boathouse. Soon after, Sir George's wife Hattie disappears. It's the death of an elderly local boatman however that sets Poirot on the path to solving the crime.—garykmcd", "Hercule Poirot's crime-writer friend, Ariadne Oliver, asks Poirot to join her at a country estate in Devon. The estate, owned by Sir George Stubbs, is holding a garden fete and, due to her fame as a crime novelist, she has been asked to stage a murder hunt game. Ms Oliver feels that something is amiss and that a real murder is about to occur, hence her wanting Poirot to be there. Sure enough, on the day of the fete, the 14-year old girl who is playing the murder victim in the game is murdered, and the young wife of Sir George goes missing.—grantss"], "genres": "N/A", "imdbID": "2119590", "rating": 7.9, "votes": 2150, "number_of_episodes": 70}