{"cast": {"0837064": "David Suchet", "0753236": "Patrick Ryecart", "1140344": "Rupert Evans", "4589735": "Lorna Nickson Brown", "0296571": "Stephen Frost", "0585511": "Isobel Middleton", "0149435": "Tom Chadbon", "3781701": "Tom Austen", "0642605": "Fiona O'Shaughnessy", "0568988": "Nicholas McGaughey", "0937239": "Tom Wlaschiha", "1410360": "Morven Christie", "0567372": "Sandy McDade", "0103699": "Orla Brady", "0512283": "Nigel Lindsay", "1050820": "Richard Katz", "0001003": "Simon Callow", "1870434": "Eleanor Tomlinson", "5351633": "Ashley Powell"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["89"],  "plot": ["Poirot's pursuit of an infamous art thief leads him to a snowbound hotel in the Swiss Alps, where he is met with a plethora of mysteries and the reappearance of a familiar face from the past.", "In an attempt to snare the enigmatic art thief Marrascaud, Poirot and the Metropolitan Police set an irresistible trap: at the society debut of wealthy aristocrat Lucinda Le Mesurier, a priceless painting called 'Hercules Vanquishing the Hydra' by Marrascaud's favorite artist will be displayed, with Lucinda wearing exquisite diamond jewelery. A confident Poirot is convinced the criminal will be apprehended, but he does not foresee the eventual, disastrous outcome: not only does Marrascaud pinch the painting, but Lucinda herself is brutally murdered, and her jewels are stolen as well. The catastrophe weights heavily on Poirot's conscience, and he sinks into a steady depression, despite the entreaties of his physician, Dr Burton. Three months after Lucinda's murder, a lonely chauffeur asks Poirot to find his true love, the maid of celebrated Russian ballerina Katrina Samoushenka. Pitying the man, Poirot agrees to reunite the lovers pro bono and sets off to the Hotel Olympos in Rochers Neiges, Switzerland, where Katrina is supposedly staying. Run by the hearty (yet corrupt) Italian Francesco, the hotel is world-famous for its Alpine spa treatments, and much to Poirot's surprise, it is also Marrascaud's current hideout. But what identity has the villain taken? Among the guests, Poirot not only finds the bedridden Katrina, but also her imperious Austrian psychotherapist Dr Lutz, M.P. Harold Waring, who has shouldered the blame for an illicit scandal involving his superior, bossy Mrs Rice and her daughter Elsie Clayton, whose abusive husband is also staying at the hotel, parlor-game enthusiast Schwartz, and the only woman who has ever stirred his heart: former jewel thief Countess Vera Rossakoff, whose criminologist daughter Alice Cunningham is also present, along with her unsightly pet bulldog, Binky. A motley crew, indeed, and just as impenetrable. When an avalanche strands the guests, it becomes even more imperative to find Marrascaud. But several distractions prevent Poirot from facing his nemesis. Why is Katrina being deliberately evasive about the fate of her maid? Why does Dr Lutz have such a powerful hold on her? Why does Elsie's husband always dine in his room? What is Countess Rossakoff doing in Switzerland, and has she really given up her life of thievery? Why is Schwartz so hard to read? What happened to the old servant, Robert, and why is his replacement so inexperienced? Who tried to frighten Alice? As more and more questions pile up, less and less time remains as Poirot strives towards redemption for his past mistakes. But will he succeed in battling his inner demons as Hercules succeeded in conquering his twelve Labours, or will Marrascaud be the first criminal to prevail against the Belgian detective?—shanty_sleuth", "Poirot is more than depressed after a police operation to nab the renowned thief Marrascaud go very bad. Not only does the thief get away with a valuable painting, the master thief gets hold of a valuable diamond necklace killing its owner in the process. Poirot heads to Switzerland to a remote hotel, high atop a mountain and accessible only by funicular. There he finds a mixed lot of fellow travelers including the Countess Rossakoff - whom Poirot knows and greatly admires - and her daughter Alice Cunningham. Others include a mother and daughter, a British MP under a dark cloud, and a Russian ballerina who is ill and under the care of her doctor. En route to the hotel, Poirot learns from the Swiss police the Marrascaud is at the hotel, but as he soon finds, almost everyone there is a suspect.—garykmcd", "Hercule Poirot is depressed: he set a trap for ruthless killer and master-thief Marrascaud and the woman who was wearing the jewels as bait is now dead. Furthermore, Marrascaud escaped with the jewels and a priceless painting. A romantic errand sees him in Switzerland, at a hotel high in the Alps. Coincidentally, the local police are staking out the hotel, as they expect Marrascaud to be arriving there. His interest piqued, and eager to catch the criminal who has eluded him, Poirot joins in the attempt to unmask Marrascaud. One of the guests is Countess Rossakoff, an old friend of Poirot's, he hasn't seen in many years, and his affection for her seems to exceed that of friendship.—grantss"], "genres": "N/A", "imdbID": "2119593", "rating": 8.1, "votes": 2403, "number_of_episodes": 70}