{"cast": {"0837064": "David Suchet", "0522812": "Frances Low", "0142183": "Jon Cartwright", "0483070": "Annie Lambert", "0786104": "Peter Settelen", "0235889": "Angela Down", "0452715": "Timothy Kightley", "0278511": "Al Fiorentini", "0072439": "Anthony Benson", "0597649": "Patrick Monckton", "0028222": "Dimitri Andreas", "1478082": "Georgia Dervis", "1213676": "Sofia Olympiou", "1478137": "Tilemanos Emanuel", "0369110": "Giannis Hatzigiannis", "0340370": "Stephen Gressieux", "0514561": "George Little", "0924346": "Martyn Whitby"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["An enchanting beauty is fatally poisoned while Poirot holidays on the Greek island of Rhodes.", "Just as his holiday on the island of Rhodes is coming to an end, Hercule Poirot finds himself investigating a murder when one of the hotel guests, Valentine Chantry, is poisoned in the bar. The drink she had was apparently meant for her husband and had been bought by Douglas Gold, with whom she had been carrying on since her arrival. Gold is arrested and everyone assumes he is the perpetrator but Poirot thinks otherwise however and looks to the other guests in the hotel as more likely suspects. When a local pathologist confirms that the poison used was local in origin, Poirot realizes that only when he learns who purchased the poison will he learn the killer's identity.—garykmcd", "Hercule Poirot is on holiday on the island of Rhodes, at that time an Italian territory. Among the other holidaymakers are two English couples and their friends. There is a degree of acrimony between the two couples, as the one husband, Commander Chantry, believes the other, Douglas Gold, has eyes for his wife, Valentine. On Poirot's last night, Valentine Gold is murdered, poisoned by a drink meant for her husband. Suspicion immediately falls on Douglas Gold and he is arrested. Luckily for him, due to an issue with Customs, Poirot has extended his stay, and investigates the murder.—grantss"], "genres": "N/A", "imdbID": "0676192", "rating": 7.4, "votes": 2208, "number_of_episodes": 70}