{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0834438": "John Stride", "0238968": "Carmen Du Sautoy", "0534570": "Ciaran Madden", "0141264": "John Carson", "0492373": "Phyllida Law", "0769013": "Guy Scantlebury", "0919979": "Albert Welling", "0383835": "Dan Hildebrand", "0542410": "Phillip Manikum"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["A wealthy industrialist's plan to snare a German sympathizer goes awry when the secret plans for a new fighter plane inexplicably disappear.", "Tommy Mayfield is a British industrialist who has developed a new fighter plane. Up to now he has paid all development costs himself and he very much wants the government to contribute. It is reluctant to do so because of an apparent indiscretion some years before when Mayfield was supposed to have sold heavy artillery to the Japanese. In order to get back into the government's good books, he decides to lay a trap for Mrs. Vanderlyn, a known Nazi sympathizer and possible spy. The bait is the plans for the new fighter but Mayfield's wife is so concerned that she asks Hercule Poirot to spend the weekend at their house to make sure Vanderlyn doesn't get away with anything.—garykmcd", "Hercule Poirot is hired by Lady Mayfield to observe her husband's business dealings. Her husband is Tommy Mayfield, industrialist and aircraft designer. He has just designed and built a revolutionary new fighter, a fighter that surpasses anything the Germans have. However, in order to complete the project he needs funding and has invited the wealthy Mrs Vanderlyn to his estate to discuss her investing in the project. However, Mrs Vanderlyn is a known Nazi sympathizer and there are fears she may steal the plans of the plane for the Germans. Sure enough, soon after her arrival, a crucial part of the plans goes missing...—grantss"], "genres": "N/A", "imdbID": "0483460", "rating": 7.1, "votes": 1863, "number_of_episodes": 70}