{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0397563": "Richard Howard", "0014896": "Tony Aitken", "0671467": "Charles Pemberton", "0488050": "Geoffrey Larder", "0370410": "Denys Hawthorne", "0208999": "Holly de Jong", "0741317": "Clifford Rose", "0516784": "Philip Locke", "0556739": "Hilary Mason", "0355411": "Cheryl Hall", "0492915": "Marjie Lawrence", "0254332": "Su Elliot", "0054315": "John Bardon", "0905353": "Peter Waddington", "0822042": "Guy Standeven", "0533580": "Andrew Mackintosh", "1752211": "Stephen Pruslin", "0785938": "John Sessions"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["When a reclusive painter is found dead, Poirot finds the vital clue in the dead man's last meal.", "The estranged, elderly Gascoigne brothers are found dead within days of each other. The one, Anthony, died in his home in Brighton in circumstances that give no cause for suspicion. The other brother, Henry, an eccentric, reclusive painter, however, has fallen downstairs and been dead for some time before his death is discovered. Poirot had been eating in the same restaurant as Henry just before the death. Henry had been pointed out as a creature of habit, a man who always ate exactly the same meal on every visit. On this last occasion, though, he had had a completely different set of courses, which leads Poirot to suspect foul play.—don @ minifie-1", "Poirot and Hastings are dining with Poirot's dentist one evening when the waitress points out an eccentric-looking man in the corner. He is Henry Gascoigne, an artist and a man of set routines. Yet he has been varying his habits of late. A few days later Poirot is at his dentist when he is informed that Mr Gascoigne died, apparently by falling down a flight of stairs at his house. For Poirot, the change of habits and sudden death seem too coincidental and he starts looking into Gascoigne's death, suspecting it was murder.—grantss", "A series of unusual circumstances leads Hercule Poirot to investigate the death of Henry Gascoyne who reportedly broke his neck after falling down the stairs. The man was a painter and a creature of habit but his behavior recently had become uncharacteristic. He was ordering different food than he did normally and didn't acknowledge well-known acquaintances on the street. Poirot soon learns that Henry did not get along with his twin brother Anthony but it appears he too has also passed away. Their only surviving heir is George Lorimer, a nephew who manages a music hall. Poirot finds both the motive for the murder and the culprit.—garykmcd"], "genres": "N/A", "imdbID": "0676150", "rating": 7.2, "votes": 2044, "number_of_episodes": 70}