{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0060799": "Geoffrey Bateman", "0150360": "Julia Chambers", "1478860": "Dominic Rougier", "0430128": "Patrick Jordan", "0292495": "Carol Frazer", "1471069": "Sandra Freeman", "0701277": "Robert Putt", "0175447": "Patrick Connor", "0542410": "Phillip Manikum", "0428450": "Jona Jones", "0536188": "Jonathan Magnanti", "0065765": "Samantha Beckinsale"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["Poirot tries to prevent the kidnapping of a country squire's son. While his plan fails, all is not what it seems.", "Mr. Waverly, a man whose wealth belongs to his rich wife, comes to engage Poirot's services. He has had a letter telling him that his little son Johnnie will be kidnapped for ransom. Although Poirot is present at the Waverly home, the kidnapping goes ahead but all is not as it first seems.—don @ minifie-1", "A country squire, Marcus Waverly, approaches Hercule Poirot with a case. He has been receiving anonymous letters, threatening to kidnap his son, Johnny, unless a ransom is paid. Every time Mr Waverley ignores the letter and does not pay the ransom, the ransom goes up. Poirot is intrigued and takes the case. Chief Inspector Japp and the police do not consider the letters a genuine threat and are doing nothing. Poirot and Hastings head out to the Waverley estate to investigate for themselves. Not sooner have they arrived and another anonymous letter arrives, specifying the date and time that Johnny will be abducted.—grantss", "Hercule Poirot is hired by Marcus Waverly who has been receiving letters telling him to pay a large sum of money or his young son Johnny will be kidnapped at noon the next day. Together they call on Inspector Japp who claims not to have the manpower to deal with a crime that has not yet taken place. Poirot and Captain Hastings travel to the Waverly estate with the intent of preventing the crime. It is apparent that the Waverlys are having financial difficulties and Poirot soon realizes that there is something completely different going on. Meanwhile, Hastings is thrilled that he has been accepted to participate in the 24 hour race at Le Mans.—garykmcd"], "genres": "N/A", "imdbID": "0483458", "rating": 6.9, "votes": 2157, "number_of_episodes": 70}