{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0287027": "Brigit Forsyth", "0189720": "Dermot Crowley", "0235782": "Freda Dowie", "0140354": "Antony Carrick", "0614427": "Katy Murphy", "0916073": "Danny Webb", "0064826": "Richard Bebb", "0694736": "Brian Poyser", "1530570": "Frank Vincent", "0542410": "Phillip Manikum", "0428450": "Jona Jones", "0178832": "Nicholas Coppin"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["Poirot probes the disappearance of a wealthy woman's cook, and soon uncovers an elaborate plot to hide an ever darker crime.", "Poirot is approached by a Mrs. Todd, whose cook, Eliza Dunn, has suddenly disappeared. Poirot manages to track down the cook , and she tells him that a stranger, acting for a law firm, told her that she had inherited a property in the North of England but she had to go there immediately. Her heavy trunk was called for but it was deposited at the railway station, where Poirot makes an interesting discovery, connected to a recent bank robbery.—don @ minifie-1", "Hercule Poirot is approached by Mrs Todd with a case. She wants Poirot to investigate the disappearance of her cook, Eliza Dunn. To Poirot it looks like nothing more than a domestic leaving her employer but he reluctantly takes the case. He and Captain Hastings set out to the Todd household in Clapham, where nothing significant turns up. Through advertisements in newspapers they track down Eliza Dunn. The story behind her departure piques Poirot's interest and he starts to think that something far more sinister may be afoot.—grantss", "Hercule Poirot is asked to investigate a most peculiar case: Mrs. Todd asks him to locate her cook. The previous Wednesday, Eliza Dunn left the Todd residence as she does every week to go to the market and simply didn't return. While concerned that accepting such a menial task as looking for a missing cook might adversely affect his reputation, Poirot is nonetheless fascinated by the case and accepts. When he does finally locate Mrs. Dunn, she tells him strange tale of an inheritance dependent on her not being in service. Poirot soon focuses on a lodger in the Todd household, Arthur Simpson, a bank employee.—garykmcd"], "genres": "N/A", "imdbID": "0483459", "rating": 7.5, "votes": 2691, "number_of_episodes": 70}