{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0397102": "Alan Howard", "0000613": "Joely Richardson", "0848693": "Mary Tamm", "0921052": "Martin Wenner", "0766651": "Christopher Saul", "0480274": "Paul Lacoux", "0680670": "Neville Phillips", "0942886": "Tommy Wright", "0117105": "Fred Bryant", "0084318": "Donald Bisset", "0397931": "Arthur Howell", "0514561": "George Little", "0006116": "Christopher Gunning", "0064826": "Richard Bebb"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["A famous pie manufacturer tells Poirot that he has dreamt of his own suicide, then dies under the same circumstances he dreamt about the very next day.", "Hercule Poirot is puzzled when Benedict Farley summons him to a late night meeting. Farley is known as the king of pies as his company manufactures a well-known brand of meat pies. At their meeting, he tells Poirot of a recurring dream where he takes a gun from his desk drawer, walks to his office window and commits suicide. His only question for Poirot is whether someone could be manipulating him psychologically. When Farley is found dead the next day - in circumstances that appear to match those in his dream - Poirot and Captain Hastings find themselves assisting Inspector Japp in a case that involves false identities and an affair. It is Miss Lemon, however, who provides Poirot with the vital information that allows him to solve the case—garykmcd", "Hercule Poirot is invited by wealthy industrialist / pork pie king, Benedict Farley, to take on his case. When they meet at Mr Farley's factory, Mr Farley tells Poirot that he believes someone is trying to hypnotise him into committing suicide. Mr Poirot is quite dismissive of Mr Farley's suggestion and the meeting ends. The next day, Mr Farley is found dead in his office, shot through the head, apparently at his own hand. Chief Inspector Japp would normally write it up as suicide and close the case, but the fact that Poirot was previously contacted by Mr Farley makes him think it could be murder, and that Poirot's assistance is needed.—grantss"], "genres": "N/A", "imdbID": "0676173", "rating": 7.7, "votes": 1957, "number_of_episodes": 70}