{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0060766": "Anthony Bate", "0830479": "Colin Stinton", "0055502": "Barbara Barnes", "0768330": "James Saxon", "0939379": "Vincent Wong", "2844339": "Richard Albrecht", "0179592": "John Cording", "1045071": "Gloria Connell", "0278747": "Julian Firth", "0055727": "Peter Barnes", "0157865": "Hi Ching", "0950687": "Ozzie Yue", "0907614": "Chris Walker", "1752119": "Joe Frazer", "0477064": "Daryl Kwan", "0502993": "Susan Leong", "0095309": "Ian Boo Khoo", "1537265": "Lee Richards"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot investigates the disappearance of a Chinese-American who traveled to London to sell a valuable map.", "Hercule Poirot is hired by Lord Pearson, who happens to be the head of the bank where Poirot keeps his accounts, to find Mr. Wu Ling who was to have attended a meeting at the bank that morning, but who has disappeared. The missing man was to sell the bank a deed to a silver mine. When the man is found dead, Poirot finds himself searching for a killer. All of the evidence seems to point to an American, Charles Lester, but Poirot finds that to be just a little too convenient. At home, Poirot and Captain Hastings find themselves involved in a vicious game of Monopoly!—garykmcd", "Hercule Poirot is approached by Lord Pearson, head of Poirot's bank, to find an important client of the bank. Mr Wu Ling was due to meet Lord Pearson and sell he bank a silver mine, but he never appeared. Shortly afterwards, Mr Ling's dead body is discovered, murdered, in Chinatown. Suspicion falls on Charles Lester, a business associate of Mr Ling, but Poirot is not so sure it is him. Meanwhile, Poirot' bank balance has gone into overdraft, resulting in some of his cheques bouncing. More importantly, Poirot and Hastings are engaging in a bitter, seemingly interminable game of Monopoly.—grantss", "Chinese businessman Han Wu Ling has discovered a map leading to the location of a long-lost silver mine. He agrees to sell it to the London and Shanghai Bank, where Lord Pearson has called a meeting of the board of directors in order to purchase the map. But Mr. Wu Ling fails to attend the meeting, and is later found dead in Chinatown. The lead suspect, an American stock investor and speculator, is found with Mr. Wu Ling's passport. But nothing is simple as the investigation leads to opium dens, drugs, gambling, and the seedy underside of life in London.—Spirit"], "genres": "N/A", "imdbID": "0676179", "rating": 7.3, "votes": 1738, "number_of_episodes": 70}