{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0366027": "Lisa Harrow", "0395257": "David Horovitch", "0385711": "Ronald Hines", "0324009": "Patrick Godfrey", "0088772": "Timothy Block", "0254479": "Jack Elliott", "0082758": "Kate Binchy", "0818269": "Milo Sperber", "0610317": "Henry Moxon", "1477827": "Oliver Beamish", "0157716": "Anthony Chinn", "0372745": "Roy Heather", "0424150": "Daniel John", "1477983": "Sam Clifton"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["When the prime minister is kidnapped right before an important international arms summit, Poirot has just 32--and a quarter--hours to find him.", "The British Prime Minister's car is attacked by a band of thugs. He manages to escape with minor injuries but a few days later he is kidnapped. The British government are desperate for the PM to be found quickly - he is due to attend an important conference. Upon the recommendation of Chief Inspector Japp, they call in Hercule Poirot.—grantss", "En route to the train station to attend a disarmament conference in Paris, the Prime Minister's car is attacked by what the press describe as ruffians. The PM is slightly injured and does make it across the Channel to French soil, but never arrives in Paris. Poirot is called in by senior government officials as it appears the Prime Minister has been kidnapped. He soon comes to the conclusion however that the evidence from the first attack doesn't quite add up and all is not what it seems.—garykmcd", "The Prime Minister is in danger. After a failed assassination attempt that left him with a wound on his head--the bullet just grazed him--the next day on his way to a summit in France, his car is hijacked and the Prime Minister is kidnapped. With just a bit over 32 hours until the arms summit where the Prime Minister is the only person who could develop a consensus to keep Germany from rearming, Inspector Japp tells the heads of state that Poirot is the man who can find the missing Prime Minister if anyone can. Poirot then vexes the leaders when he continues to focus not on the failed assassination attempt instead of the kidnapping. Time is running out--will they find the Prime Minister dead, or alive?—Spirit"], "genres": "N/A", "imdbID": "0676177", "rating": 7.4, "votes": 1645, "number_of_episodes": 70}