{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0552774": "Mel Martin", "0171829": "Kenneth Colley", "0558729": "Tony Mathews", "0564118": "Fiona McArthur", "0063671": "Richard Beale", "0556609": "Bob Mason", "0233394": "Peter Doran", "0367843": "Stewart Harwood", "0588668": "Jonty Miller", "0610951": "Malcolm Mudie", "0713137": "Charles Rayford", "0869983": "Cy Town"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["52"],  "plot": ["Poirot wagers Chief Inspector Japp that he can solve the mystery of a missing banker without leaving his flat.", "A wealthy banker, Mathew Davenheim, disappears. He was last seen by his wife, leaving the grounds of his home. Suspicion falls on the head of Mr Davenheim's long-time business rival Gerald Lowen. Chief Inspector Japp gets Poirot involved in the case. However, due to some intellectual bravado by Poirot, he and Japp have a wager that Poirot can't solve the case without leaving his flat, resulting in Poirot being confined to his flat for seven days. This leaves Hastings to gather the clues, and we know how good a sleuth he is... Meanwhile, in between trying to solve the case, Poirot is working on conjuring tricks and looking after a friend's parrot.—grantss", "Banker Mr. Davenheim steps out of his house, into the fog, and disappears. Where has he gone? Poirot bets good friend inspector Japp five pounds that he can solve the mystery within the week, without leaving his flat, using Captain Hastings to collect the clues.—Spirit", "Just minutes before his business rival Gerald Lowen arrives to meet with him, banker Matthew Davenheim tells his wife he is going to post a letter, steps out of his home into the fog, and disappears. When his wife discovers a few days later that the safe in which her missing husband stored a variety of precious jewels he gave her as gifts has been broken in to, the jewels stolen, Poirot suspects that Mr. Davenheim's disappearance may not be the real mystery, but perhaps the mystery lies in the missing jewels. With Captain Hastings as his eyes and ears on the scene, Poirot accepts a bet from Inspctor Japp that Poirot cannot solve the mystery without leaving his London flat. Of course, Poirot solves both mysteries...but how?—Spirit", "After attending a magic show, where Poirot insists there is always a simple explanation to the conjurer's tricks, Inspector Japp challenges him to solve the disappearance of Mr. Matthew Davenheim, without leaving the confines of his apartment. Davenheim had vanished during a short walk from his country home to the village where he went to post a package. Soon after, Mrs. Davenheim realizes that their wall safe has been broken into and that all of her valuable jewels are missing. Using Captain Hastings to interview various witnesses and suspects, Poirot pieces together the reasons for the man's disappearance as well as the motivation behind the crime.—garykmcd"], "genres": "N/A", "imdbID": "0676171", "rating": 7.8, "votes": 1834, "number_of_episodes": 70}