{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0467877": "Adam Kotz", "0590310": "Caroline Milmoe", "0336607": "Elspet Gray", "0362961": "David Hargreaves", "0394531": "Gerard Horan", "0788332": "Michael Shannon", "0308827": "Amanda Garwood", "0300270": "Paul Gabriel", "0328932": "Harry Goodier", "0675116": "Jeffrey Perry", "1087607": "Anne Small", "0285384": "Miranda Forbes", "0514561": "George Little", "1102364": "Ned Williams", "1256259": "Jack Williams"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["The theft of a collection of antique miniatures draws Poirot out of retirement.", "A bored Hercule Poirot announces that he is going to retire and suggests that he and Captain Hastings go to the seaside for a short holiday. While there, they meet a pleasant young woman who is delivering a set of miniature portraits to an American buyer on behalf of her aunt, an antiques dealer. When they arrive at their destination she is shocked to find that the miniatures are missing and that the American had already bought them from an elderly lady more than an hour before. As Poirot has retired he leaves the case in the hands of Hastings who slowly puts the facts together and not surprisingly comes to the wrong conclusion. In the end, it is left to Poirot to suggest the solution to the crime and brings all of the parties together for an interesting lunch.—garykmcd", "Poirot is feeling jaded and is even contemplating retirement. To rejuvenate himself, he and Hastings head to the Midland Hotel, a seaside resort. While there they take a bus tour. Also on the bus is a young woman who is transporting a set of valuable Napoleonic-era miniature portraits to a buyer. At one of the bus's stops, the miniatures are stolen. Poirot and Hastings are on the case, with Hastings to the fore. Meanwhile, Chief Inspector Japp is also in the area, delivering a series of lectures on his life and skills as a detective. Poirot is a touch upset at this, as it appears that Japp is taking all the credit for the cases he solved.—grantss", "Bored and depressed because he has not had an interesting case in some time, Poirot decides to retire. He takes Captain Hastings north for a weekend away from London and while on the way, a young lady carrying a set of 12 Napoleon miniatures finds them stolen from her suitcase. But Poirot is retired and refuses to help her, so Captain Hastings begins the investigation. The American businessman who traveled to England to buy the miniatures tells Hastings that another woman, much older than the young woman from whom the miniatures were stolen, already delivered the miniatures for which he paid $7000 U.S. Hastings continues to prod Poirot to help but to no avail -- Poirot is a \"retired detective\" and though he occasionally helps Hastings with hints, it is up to Hastings to find the miniatures and the old woman who sold them to the businessman.—Spirit"], "genres": "N/A", "imdbID": "0676146", "rating": 7.5, "votes": 1737, "number_of_episodes": 70}