{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0908116": "Polly Walker", "0362332": "John Harding", "0949685": "Jeremy Young", "0192392": "Mary Cunningham", "0313264": "Paul Geoffrey", "0827477": "Alison Sterling", "0047779": "Christopher Baines", "0534315": "Carol MacReady", "0235941": "Elizabeth Downes", "0416528": "Godfrey James", "0188362": "John Crocker", "0602954": "Pauline Moran", "0339065": "Geoffrey Greenhill", "1554429": "Joe Bates", "1276959": "Jane Paton", "0572253": "Fergus McLarnon", "0298780": "Jenny Funnell", "1555385": "Janice Cramer", "1187025": "Edward Pinner", "3204919": "Tony Red Richards"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["103"],  "plot": ["While Poirot is staying at an exclusive Cornish resort, he meets a beautiful heiress whose life is in danger.", "While enjoying a vacation at an exclusive resort on the Cornish coast, Poirot and Hastings meet beautiful young heiress Magdala Buckley. Known to her friends as Nick, she confides to them that she has recently survived several events that might have taken her life: a heavy-framed picture dropping on her head, a boulder falling off a cliff, and failed brakes. When Poirot notices a bullet hole in her hat, they put her under their protection and discover that her dead fiance, a noted aviator killed in a tragic accident, had named her as heir in his will. In the interim, his wealthy uncle is found to have died, making her the unexpected beneficiary of a great fortune. Poirot realizes this inheritance is the motive for continued attempts on her life, and in his quest for the the truth, he uncovers a tangled web of greed, forgery, drug addiction, fraud, poison, and murder.—G. Taverney (duke1029@aol.com)", "A used car salesman takes diabolical liberties with a filthy drug addict. A woman makes a nuisance of herself in a wheelchair and another woman makes an exhibition of herself at a firework extravaganza. A man and a woman sit on a beach eating ice cream. A fat woman is feeding an ugly squashed faced dog with food from her own plate. The hero of this story falls over injuring his ankle whilst trying to attract the attention of an ancient waiter who is oblivious to the disaster that happened and a solicitor with a sour expression complains of having a visitor to his office on a weekend despite the door to his office being open. A woman from Yorkshire stays in a large house in a bedroom that is said in uninhabitable. A gardener and his son describe a disgusting affair of the slaughtering of a pig and his house keeper wife has a strange and questionable expression when answering the door to visitors. Meanwhile, a band at the hotel is playing a song which states that one should never be behind a bolted door with a man of ill repute, presumably the character in question has an ulterior motive.", "While on holiday with Captain Hastings at the posh Majestic hotel on the Cornish coast, Hercule Poirot makes the acquaintance of Magdala 'Nick' Buckley, a young woman who lives nearby in the large but dilapidated estate called End House. She mentions to Poirot that she has had a bad run of luck in the last few days narrowly escaping injury when her car brakes failed and later when a huge boulder nearly fell on her from above. Poirot is soon convinced that the young woman's life is in danger, a fact that is apparently confirmed when another young woman wearing Miss Buckley's wrap is shot. As he delves into the case, he learns of a possible motive in the case - Miss Buckley is the unknowing beneficiary of a large personal fortune. He is puzzled however by one piece of information that simply does not seem to fit.—garykmcd"], "genres": "N/A", "imdbID": "0182361", "rating": 8.1, "votes": 2532, "number_of_episodes": 70}