{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0941207": "Barry Woolgar", "0734654": "Struan Rodger", "0072035": "Rosalind Bennett", "0183122": "Oliver Cotton", "0131481": "Alister Cameron", "0328751": "Caroline Goodall", "0359431": "Stephen Hancock", "0171915": "Ian Collier", "0598757": "Bruce Montague", "0308705": "Julian Gartside", "0858530": "Bill Thomas", "0326349": "Jill Goldston"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Two wealthy women, Marie Marvelle and Yardley Chase, receive threatening letters.", "Poirot is thrilled to receive an invitation from renowned Belgian actress Marie Marvelle. She has been receiving anonymous notes about the Western Star, a valuable diamond purchased by her husband at a cut-rate price several years before. The notes speak to the mystical nature of the diamonds and that they should be returned to their rightful owners. The next day, Lady Yardly claims to have received similar notes about her own fabulous diamond, the Eastern Star. When Poirot and Hastings visit Lord and Lady Yardly the diamond is stolen in a daring robbery. Needless to say, none of this sits well with Poirot who finds he has a very tight knot to untie.—garykmcd", "Poirot is excited when Belgium's greatest film star asks him to meet her while she is in London. But when he arrives he finds her terrified by a series of threatening notes hand-delivered to the hotel's front desk from a Chinese man, stating that a precious diamond she owns will be stolen. The next day, Poirot receives a call from another woman who owns a matching diamond, stating that she too has received threatening notes, but this time through the post. When both diamonds disappear, it leads Poirot to cross paths with the adulterous, thieving husband of one of the woman, and a rather shady German businessman who likes to collect diamonds for his private collection -- and he doesn't care how the person who has them comes into possession of the diamonds.—Spirit11"], "genres": "N/A", "imdbID": "0676166", "rating": 7.2, "votes": 1586, "number_of_episodes": 70}