{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0094039": "Samantha Bond", "0585181": "John Michie", "0161441": "Jemma Churchill", "0398032": "Peter Howell", "0484958": "Jenifer Landor", "0696922": "Ian Price", "0393853": "William Hootkins", "0923568": "Gordon Wharmby", "0540587": "Nick Maloney", "0926205": "Nigel Whitmey", "0670037": "Anthony Pedley", "0370774": "Luke Hayden"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["When U.S. Navy plans for a new submarine are stolen and the thief tracked to London, the FBI sends an agent to work with Inspector Japp to recover them.", "Poirot finds himself working on two cases, the first of which is more of an amusement, or so it seems. After meeting a delightful young couple, Stella and James Robinson, at a party he sets out to prove to Captain Hastings that there must be a reason for their good fortune in getting a lovely flat at a ridiculously low price. He is also brought into a more formal investigation by Inspector Japp who is hosting a loud-mouthed American FBI Agent who is on the trail of thieves who have made away with secret US Naval plans for a new submarine. The American isn't too impressed that Scotland Yard have brought in a private detective or that Japp has taken away his gun. When Poirot sees the man the FBI is trailing, he also realizes it's the same man who he has seen lurking outside the Robinsons apartment block.—garykmcd", "Poirot is intrigued when acquaintances of his, James and Stella Robinson, tell him of the incredible bargain they got in renting a flat. Other applicants were turned away almost instantaneously but they managed to get the flat. Out of sheer curiosity, Poirot is determined to find out why they managed to get the flat, and why it's so cheap. Meanwhile, Poirot and Hastings are assisting Chief Inspector Japp with a case involving a fugitive American woman who has the plans for the US's latest submarine and is trying to sell them to the Italian government. Also involved is Agent Burt of the FBI, a man to whom Poirot takes an instant dislike.—grantss", "A young couple, the Robinson's, rent a beautiful new flat for about the half the going rate of the same flats in the building. Poirot is puzzled by this, when he hears that many others had tried to rent the flat and were turned down. Poirot believes there is something unique about the Robinson's, and that whatever it is that makes them different, that difference is somehow related to a woman who stole secret American submarine plans and has fled to London. An FBI agent has joined forces with Inspector Japp and his team from Scotland Yard to follow the thief and recover the stolen plans, but the partnership between the FBI and Scotland Yard is far from cordial.—Spirit"], "genres": "N/A", "imdbID": "0676163", "rating": 7.4, "votes": 1678, "number_of_episodes": 70}