{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0757474": "Chloe Salaman", "0101202": "John Bowler", "0932361": "Jerome Willis", "0907510": "Amanda Walker", "0903637": "Tilly Vosburgh", "0071005": "Derek Benfield", "0320911": "Laura Girling", "0746546": "John Rowe", "0613123": "Hugh Munro", "0130279": "Graham Callan", "0206391": "Edwina Day", "0104033": "Richard Braine", "0838098": "Hugh Sullivan", "0923508": "Jonathan Whaley", "5648042": "Nick Ryall"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Alice Pengelley visits Poirot in London, telling him she thinks she is being poisoned by her husband. When Poirot arrives in Cornwall the next day to investigate Mrs. Pengelley's charges, he is too late, and finds her dead.", "Poirot and Captain Hastings travel to Cornwall at the request of Mrs. Pengelly but arrive to find that the woman is dead. She had told Poirot the previous day that she feared her dentist husband, Edward Pengelly, had been having an affair with his pretty receptionist and that further, he was trying to poison her. Apart from her husband, she has a niece and her fiancé, but no other relatives in the village. When Inspector Japp arrests the husband for murder, the Belgian detective is convinced that the wrong person is in the dock.—garykmcd", "Hercule Poirot is approached by Mrs Pengelley from Cornwall. She is worried that someone, probably her husband, is trying to poison her. She returns to Cornwall and Poirot promises to follow her a day later. When he and Hastings arrive, Mrs Pengelley is dead. The local doctor rules that the cause of death was gastritis but Poirot knows better. Eventually he manages to get the police to exhume the body and they find that she was indeed poisoned. Mr Pengelley is arrested and the evidence all points to him doing it. Poirot is not convinced, however.—grantss", "Mrs. Alice Pengelley arrives in London to visit Poirot, telling him she is being poisoned by her husband. She is convinced her husband is putting weed killer into her food. Poirot makes a trip the next day to visit her in Cornwall, only to find he is too late - Mrs. Pengelley is dead. The main suspect is Mr. Pengelley, her husband, who is having an affair with his young medical assistant. However, Mrs. Pengelley's niece may also be a suspect, as she is in her aunt's will for 2000 pounds. The niece's fiancé may also be involved, as he has apparently been flirting with Mrs. Pengelley while also courting her niece. And what of Mrs. Pengelley's doctor, who changes his story about her condition once he is on the stand testifying against Mr. Pengelley. And the maid seems out to get Mr. Pengelley as well. It all comes to a head when Poirot corners the killer and obtains a written confession, promising the murderer 24 hours head start to get out of town before giving the confession to the police - a promise Poirot does not keep.—Spirit"], "genres": "N/A", "imdbID": "0676170", "rating": 7.5, "votes": 1794, "number_of_episodes": 70}