{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0053384": "Frances Barber", "0367731": "Terence Harvey", "0371339": "Carole Hayman", "0827173": "Tony Stephens", "0930464": "Don Williams", "0570247": "Lloyd McGuire", "0311474": "Peter Geddis"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["49"],  "plot": ["Poirot becomes a criminal himself when he agrees to help a beautiful woman recover a letter written in her youth that is being used to blackmail her.", "Poirot despairs at the lack of crime - and work - concluding that he, Hercule Poirot, has scared off the criminal classes. His mood brightens when Lady Millicent Castle-Vaughn - the veiled Lady of the title - asks him to recover from her blackmailer some indiscreet letters written in her youth. Unable to convince the man to reduce the amount asked for, Poirot decides to take matters into his own hands and steal them. As Poirot and Hastings learn however, not all is as it seems, starting with Lady Millicent.—garykmcd", "Hercule Poirot is approached by a woman in a veil, seeking his help. She is Lady Millicent and she is being blackmailed by a Mr Lavington over a love letter she wrote as a 16-year-old. After confronting Mr Lavington and achieving nothing, Poirot resolves to break into Mr Lavington's house and steal the letter. He and Hastings break in, but Poirot is caught (and Hastings escapes). When Japp finds Poirot in jail, he mentions that Lavington was murdered several days earlier. In a seemingly unrelated case, the police are on the lookout for jewels that were stolen from a high street jeweller.—grantss", "A mysterious veiled lady visits Poirot as he's out for a walk. She doesn't leave any name but she tells Miss Lemon she will wait for Poirot at the Athena Hotel. When Poirot and Hasting finally arrive at the Hotel and meet the mysterious lady, she tells them her name is Lady Millicent. She is about to marry a famous man but somebody blackmails her. A man has a letter she wrote when she was younger and that could ruin her reputation. The blackmailer, named Lavington, visits Poirot and tells him that, if he doesn't receive 18.000 £ before the next Tuesday evening, the letter will be delivered to Lady Millicent's husband-to-be.—cel_d", "Poirot takes on the role of a burglar to recover the letter for the veiled lady...but is the letter really what she wanted, or the mysterious Chinese puzzle box that holds the letter? And what of the missing Englishman in Amsterdam, Japp's problem with a jewelery theft last week, Poirot's boredom, and his thoughts of how successful he would be as a criminal?—Spirit"], "genres": "N/A", "imdbID": "0676191", "rating": 7.4, "votes": 1840, "number_of_episodes": 70}