{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0821749": "Anne Stallybrass", "0943823": "Tim Wylton", "0556834": "Margery Mason", "0751060": "Catherine Russell", "0083281": "Peter Birch", "0636497": "Ralph Nossek", "0121308": "John Burgess", "0604627": "Dorcas Morgan", "1047824": "Trevor Danby", "0736580": "John Rogan", "0676172": "Stephen Petcher", "1046477": "Philip Praeger"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["At a flower show, an older woman in a wheelchair approaches Poirot, gives him an empty seed packet, and asks him to visit her the next day. When Poirot arrives the next day, the woman is dead, murdered with poison.", "Poirot and Miss Lemon travel to Surrey to visit Miss Amelia Barrowby but arrive to learn that she has died during the night. Poirot had an odd encounter with her the previous day at a flower show when she made the odd gesture of giving him an empty seed packet. Upon returning home, he finds that she has written him seeking his assistance. Poirot suspects foul play and the pathologist confirms that the woman was poisoned with strychnine. Initial suspects are Miss Barrowby's niece and her husband, but when the dead woman's Russian companion runs away, Inspector Japp thinks he has the culprit. Poirot thinks otherwise.—garykmcd", "Poirot is at a flower show when he is approached by an elderly lady in a wheelchair, Amelia Barrowby. She anxiously gives Poirot an empty seed packet and asks him to visit her the next day. Poirot does visit her the next day but is too late - she is dead, poisoned. Suspicion immediately falls on Ms Barrowby's Russian assistant, Katrina Reiger, who is now nowhere to be found.—grantss", "Amelia Barrowby is in fear for her life, fearing someone in her home will kill her. When she sees Poirot at a flower show where he is receiving an award, she speaks to him for a moment, giving him a packet of flower seeds. When he arrives back at his office, he discovers the seed packet is empty, and a letter from Mrs. Barrowby arrived in the morning post, which he did not receive on time. He follows up on the letter the next morning, but discovers he is too late--Mrs. Barrowby is dead, poisoned with strychnine. Mrs. Barrowby's will leaves everything to her Russian nurse, who is suspected of the poisoning, both by inspector Japp and Mrs. Barrowby's live-in niece and her niece's drunkard husband. But did the nurse commit the murder, and if so, why?—Spirit11"], "genres": "N/A", "imdbID": "0676153", "rating": 7.6, "votes": 1692, "number_of_episodes": 70}