{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0249622": "Beatie Edney", "0727778": "David Rintoul", "0054535": "Gillian Barge", "0188788": "Michael Cronin", "0564737": "Joanna McCallum", "0129882": "Anthony Calf", "0126112": "Allie Byrne", "0516055": "Lala Lloyd", "0324138": "Michael Godley", "0675225": "Morris Perry", "0064621": "Penelope Beaumont", "0767674": "David Savile", "0613173": "Tim Munro", "0695784": "Tim Preece", "0447625": "Merelina Kendall", "0170958": "Bryan Coleman", "0832917": "Eric Stovell", "0671255": "Donald Pelmear", "0842573": "Caroline Swift", "0731918": "Ken Robertson", "1565226": "Michael Roberts", "0241328": "Gordon Dulieu", "0730659": "Jeffrey Robert", "0903890": "Robert Vowles", "0584315": "David Michaels", "7898760": "Helen Emmerton", "6671627": "Cole Henderson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["103"],  "plot": ["Hastings renews his friendship with Poirot and involves him in the mysterious poisoning of the mistress of a manor house married to a man twenty years her junior.", "Recovering from the horrors of World War I, British Army officer Arthur Hastings hopes to find peace and quiet at a country manor in the English countryside. But when the matriarch dies during the night from strychnine poisoning, Hastings enlists the help of an old friend staying nearby with other war refugees to help solve the murder: former Belgian police detective Hercule Poirot.—Mark Limvere-Robinson", "In the summer of 1917 a convalescing Lt. Hastings runs into his old friend Hercule Poirot at an opportune moment. Hastings is visiting Sir John Cavendish at his family's estate near the village of Styles St. Mary. Cavendish and his siblings are not pleased that their mother, Emily Inglethorp, has re-married and there is ill feeling among several members of the family. Mrs. Inglethorp has recently received information that caused her to change her will, pieces of which Poirot has found burned in her fireplace. When Inspector Japp of Scotland Yard arrests John Cavendish and charges him with murder however, Poirot is convinced that an error has been made.—garykmcd"], "genres": "N/A", "imdbID": "0100216", "rating": 7.9, "votes": 2521, "number_of_episodes": 70}