{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0602954": "Pauline Moran", "0703629": "David Quilter", "0393739": "Ewan Hooper", "0949942": "Paul Young", "0570569": "Lizzy McInnerny", "0662529": "Oliver Parker", "0644740": "Natalie Ogle", "0654106": "Christopher Owen", "0833609": "Jonathan Stratt", "0010869": "Dallas Adams", "0420029": "Kieron Jecchinis", "0680378": "Edward Phillips", "0403017": "Robin Hunter", "0064826": "Richard Bebb"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot is entrusted with transferring $1 million in Liberty Bonds to America on the Queen Mary, but the bonds are cleverly stolen anyway.", "London and Scottish bank officer Mr. Shaw is scheduled to ride the maiden voyage of the Queen Mary to transfer $1 million in Liberty Bonds to the bank's branch in America. But when Mr. Shaw is first almost run down in the street, and then poisoned, the assistant bank manager must take the bonds instead. The bank hires Poirot to accompany the bonds, so he and Captain Hastings are able to ride the maiden voyage of the Queen Mary, much to Hastings' delight. But when the bonds are stolen, suspicion falls on the assistant manager who has a history of large gambling debts.—Spirit11", "The London & Scottish Bank is investing in America and is transferring $1 million in liberty bonds to the U.S. to do so. But when Mr. Shaw, the bank officer who is supposed to go on the Queen Mary's maiden voyage to transfer the bonds is poisoned, the bank calls in Poirot to protect the bonds.—Spirit11", "Poirot and his friend Captain Hastings find themselves traveling to the United States on the maiden voyage of the Queen Mary when they accompany Philip Ridgeway of the London and Scottish Bank who is transferring one million dollars worth of Liberty bonds to New York. Ridgeway was a last minute substitute for a senior bank officer, Mr. Shaw, who is now bedridden after someone put strychnine in his coffee. When the bonds are stolen from Ridgeway's stateroom, Poirot must return to London where the solution to the crime is to be found.—garykmcd", "Poirot is hired by the London & Scottish Bank to investigate the security of a large bond transfer. The bonds are to be taken across the Atlantic on the liner Queen Mary (on her maiden voyage) and the courier, Mr Shaw, has been the target of two murder attempts. The second attempt leaves him unable to make the voyage so he is replaced by Philip Ridgeway. Poirot and Hastings are sent with him. This is wonderful news to Hastings, as he is a big admirer of the Queen Mary. (As it transpires, he doesn't get to enjoy the voyage nearly as much as he would have liked). A day or so from New York, the bonds are stolen. Not only does Poirot have to find the thief but he has to deal with the obstructiveness and disdain of Mr McNeil, the head of security for the bank. He has no respect for private detectives.—grantss"], "genres": "N/A", "imdbID": "0676180", "rating": 7.6, "votes": 1604, "number_of_episodes": 70}