{"cast": {"0837064": "David Suchet", "0872370": "Frederick Treves", "0170789": "Stephanie Cole", "0398147": "David Howey", "0019541": "Antony Zaki", "0585002": "Helena Michell", "1931211": "John Vernon", "0494655": "Nigel Le Vaillant", "1433522": "Robyn Moore", "0241845": "John Dunbar", "0350387": "Alessia Gwyther", "0051635": "Jonathan R. Scott", "0391814": "Edward Holmes", "0304796": "Siobhan Garahy", "0276051": "Susan Field", "0717276": "Gordon Reid", "0495359": "Christopher Leaver", "0017769": "Peter Aldwyn", "0711922": "Iain Rattray", "0852511": "James Taylor"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot reluctantly agrees to help an Egyptian prince recover a valuable royal ruby that was brazenly stolen from him during the Christmas holidays.", "When Prince Farouq of Egypt foolishly lets a tart wear a fabulously valuable royal ruby, she simply walks away with it. With Hastings away in Scotland for the Christmas holidays, Poirot finds himself spending Christmas with the Lacey family. Colonel Lacey, a well-known Egyptologist, was one of the few people who knew the ruby was in England. As Poirot investigates, he learns that the Colonel is having financial difficulties and also that one of the house guests, Desmond Lee-Wortley, may not be of the soundest character. With the help of the children in the household, Poirot sets a trap for the thief.—garykmcd", "It's Christmas time. A priceless ruby is stolen from a visiting Egyptian prince. The British Foreign Office, eager to maintain cordial diplomatic ties with Egypt, enlist the help of Hercule Poirot in finding the ruby and its thief. In order to investigate the theft, Poirot visits Colonel Lacey, a foremost Egyptologist. Poirot ends up spending a few days at Colonel Lacey's estate. On Christmas Day, much to Poirot's surprise, the ruby turns up in a plum pudding...—grantss"], "genres": "N/A", "imdbID": "0676187", "rating": 7.5, "votes": 1595, "number_of_episodes": 70}