{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0548440": "Kika Markham", "0528918": "David Lyon", "0051394": "David Bamber", "0561890": "Charmian May", "0782997": "Nicholas Selby", "0655495": "Michael Packer", "0160949": "William Chubb", "0282066": "Mark Fletcher", "0651759": "William Osborne", "0225539": "Meriel Dickinson", "1086540": "Yitkin Seow", "1379054": "Richard Ryan", "0326349": "Jill Goldston"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot helps Chief Inspector Japp try to find a jewel thief, but is sidetracked when a bewitching Russian countess arrives on the scene.", "Chief Inspector Japp, afraid that he will soon find himself unemployed, needs Poirot's assistance in solving a string of jewel robberies. Japp is under intense pressure to catch the thief but Poirot counsels patience. When the jewel thief strikes again, Poirot and Captain Hastings go to the home of Marcus Hardman, a jewelry collector from whom an emerald necklace was stolen. Poirot is apparently quite taken with the exiled Russian Countess Vera Rossakoff and to Japp's great consternation, days pass with no progress in the case. With the famous detective otherwise occupied, Hastings and Miss Lemon decide to investigate on their own. Poirot however knows well who the criminal is.—garykmcd", "Poirot is hired by Chief Inspector Japp to solve a series of jewel thefts. Japp is quite desperate as his job is on the line. Another jewel theft occurs, this time at the home of Marcus Hardman, a jewel collector. Poirot is quickly on the case but is distracted and beguiled by Countess Vera Rossakoff, a Russian who fled her country during the revolution and thus someone Poirot can relate to, as they are both refugees, in a way. With Poirot's attention elsewhere, Captain Hastings and Miss Lemon do the investigating, with...interesting results.—grantss"], "genres": "N/A", "imdbID": "0394838", "rating": 7.3, "votes": 1604, "number_of_episodes": 70}