{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0448712": "Diana Kent", "0636235": "Jim Norton", "0786865": "Shaughan Seymour", "0101886": "Roy Boyd", "0395420": "Bernard Horsfall", "0017263": "Victoria Alcock", "0871326": "Clare Travers-Deacon", "0780030": "Christopher Scoular", "0872633": "Ray Trickitt", "0926645": "Arthur Whybrow", "0534206": "Denyse Alexander"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot is taken ill during a weekend shooting party, which ends when the unpopular host is found murdered in his study.", "Hercule Poirot accompanies his friend Captain Hastings on a weekend shooting party at the home of Harrington Pace, but he isn't having a very good time. He comes down with the flu and takes to his bed but when Pace is shot dead in his study, he rises to the occasion to assist Inspector Japp in solving the case. Pace was not very likable and treated those around him badly. He refused to acknowledge his illegitimate half brother, who worked on the family estate as the gamekeeper, refusing him even a small loan that would allow him to marry. His two nephews did not benefit from the family wealth having been told they may inherit something on this death. The solution to the case lies in correctly identifying the mysterious housekeeper, Mrs. Middleton, whom Pace had hired for a month and determining her exact role in this mysterious affair.—garykmcd", "Poirot accompanies Hastings on a pheasant shoot on the estate of Harrington Pace. As a result Poirot is laid up in bed with a severe cold. Later that night Mr Pace is shot dead in his study by an unknown intruder, an intruder who apparently simply knocked on the front door and was let in my the housekeeper, Mrs Middleton. The next day Mrs Middleton disappears. With Poirot sick in bed, Hastings is helping out DCI Japp. Obviously that isn't going to get the case solved, so Poirot is soon in the thick of it.—grantss"], "genres": "N/A", "imdbID": "0676182", "rating": 7.5, "votes": 1533, "number_of_episodes": 70}