{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0567135": "Ian McCulloch", "0018446": "Geraldine Alexander", "0241885": "Alastair Duncan", "0136902": "Anita Carey", "0057595": "Desmond Barrit", "0914839": "Ralph Watson", "0223266": "Edward Jewesbury", "0841705": "Geoffrey Swann", "0785958": "Hilary Sesta", "0515952": "David Lloyd", "0444608": "Pat Keen", "0064826": "Richard Bebb"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot is drawn into a case where a man is found dead on the grounds of his estate, apparently frightened to death by the spirits that haunt it.", "Having been lured to the village of Marsdon Leigh under false pretenses - the local hotel owner is unable to solve the crime in his own manuscript and so invites the detective to solve a \"murder\" - Poirot and Hastings are asked to look into the death of Mr. Maltravers, owner of the local manor house. The local rumor mill has it that the Marsdon Manor is haunted by several ghosts and Maltravers' wife is convinced that her husband was frightened to death. In the end, Poirot initiates a clever ruse to obtain a confession from the murderer.—garykmcd", "Poirot and Hastings visit the village of Marsden Leigh, at the request of the local hotel owner, Samuel Naughton. Poirot thinks he has been invited down to solve a crime but is disappointed to discover that Mr Naughton simply wants him to read the draft of his book, a murder novel. Poirot's disappointment is compounded when, out of boredom, he reads the book and discovers that the crime is unsolvable! Fortunately, or unfortunately, for Poirot an actual murder has just been committed, at nearby Marsdon Manor, and he police seek Poirot's assistance. The owner, Jonathan Maltravers, was found dead under a tree, a tree that is believed to be haunted, leading to the suspicion that he was frightened to death. Poirot immediately ascertains that foul play was involved, and calls in Chief Inspector Japp.—grantss"], "genres": "N/A", "imdbID": "0676189", "rating": 7.6, "votes": 1635, "number_of_episodes": 70}