{"cast": {"0837064": "David Suchet", "0413946": "Philip Jackson", "0940987": "Sarah Woodward", "0779785": "Shaun Scott", "0365518": "Cathryn Harrison", "0278741": "David Firth", "0747404": "Amanda Royle", "0409907": "Richard Ireson", "0236050": "Jenny Downham", "0668920": "Eve Pearce", "0372732": "Roger Heathcott", "0543280": "Guy Manning", "0515987": "Gabrielle Lloyd", "0088069": "John Bleasdale", "0041599": "Harry Audley", "0041323": "Yves Aubert", "0744193": "George Rossi", "1035763": "Nick Mercer", "0914095": "Hilary Waters", "0695591": "Hana Maria Pravda", "0768205": "Raymond Sawyer", "1201172": "Russell Richardson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["103"],  "plot": ["While Poirot sleeps on an airplane flight from Paris to London, a notorious French moneylender is murdered with a poisoned dart.", "After spending a bit of a holiday in Paris, Poirot finds himself on a flight to London with an odd assortment of people, some of whom he had met during his stay. When one of the passengers, Madame Gisele, is murdered during the flight by a poisoned dart, Poirot is asked by Inspector Japp of Scotland Yard to assist with the investigation. Gisele was a well-known moneylender with penchant towards blackmail. When Lady Horbury denies knowing the dead woman - which Poirot knows is false - the police clearly have their prime suspect. Poirot however, sees a far more complex plot to gain access to the victims money.—garykmcd", "Hercule Poirot is on a plane from Paris to London when one of the other passengers, Madame Giselle, is murdered. The murder weapon appears to be poison, delivered from a dart fired from a South American blowpipe. On board was Lady Horbury who owed the murdered woman a great deal of money - she is the prime suspect. Soon after Madame Giselle's death is announced, her daughter appears in Paris to claim her inheritance, but then soon disappears. A cross-channel investigation into Madame Giselle's murder, involving Chief Inspector Japp, the French police and Poirot, commences.—grantss", "Set amidst the glamour of 1930s Europe, Agatha Christie's Death in the Clouds stars David Suchet as the fastidious and brilliant investigator who shrewdly tidies up the most confounding of cases. In this classic mystery, Christie offers up murder in the skies as a ruthless blackmailer is killed on board a plane full of likely suspects. Unfortunately for the culprit, a certain Belgian detective is also traveling on board.—DVD Empire"], "genres": "N/A", "imdbID": "0398545", "rating": 7.8, "votes": 2219, "number_of_episodes": 70}