{"cast": {"0837064": "David Suchet", "0413946": "Philip Jackson", "0680902": "Joanna Phillips-Lane", "0090050": "Peter Blythe", "0173220": "Carolyn Colquhoun", "0001172": "Christopher Eccleston", "0322393": "Karen Gledhill", "0364309": "Laurence Harrington", "0461063": "Rosalind Knight", "0829815": "Sara Stewart", "0395600": "Helen Horton", "0539616": "Kevork Malikyan", "0416999": "Trilby James", "1511852": "Joe Greco", "0103518": "Oliver Bradshaw", "0014713": "Jean Ainslie", "0018297": "Bruce Alexander", "0372269": "Mary Healey", "0244111": "Tom Durham", "0137513": "John Carlin", "0912255": "George Waring", "0912505": "John Warner", "0063306": "Ben Bazell", "0444502": "Dawn Keeler", "0391038": "Cassandra Holliday", "0083445": "Stephen Bird", "0676515": "John Peters", "0068663": "Nigel Bellairs", "0532759": "Eileen Maciejewska", "1496139": "Nicolas Brook", "1496364": "Keith Woodhams", "0372215": "Mark Heal", "2805043": "Chris Spicer", "0671953": "Alan Penn", "0647041": "Guy Oliver-Watts", "1496213": "Emma Grey", "0808854": "Julie Smith", "0101228": "David Bowles", "0326349": "Jill Goldston", "6671627": "Cole Henderson", "6670337": "Katherine Suchet"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["103"],  "plot": ["After Poirot pays a routine visit to his dentist, the doctor apparently shoots himself to death a short time later. Chief Inspector Japp appropriately recruits the detective as both witness and consultant.", "Poirot pays what appears to be a routine visit to Dr. Morley, his dentist, but shortly after he leaves the clinic, the doctor is found dead with a gunshot wound to his temple, an apparent suicide. Poirot suspects foul play, and all those who entered the doctor's offices after Poirot left are suspect. They include Alaistair Blunt, a prominent and very influential bank director, Frank Carter, a young fascist thug with a personal grudge against Morley, Mr. Amberiotis, an enigmatic recent arrival from India suffering from a toothache, and Mabelle Sainsbury-Seale, a charity worker also recently returned from India. When Amberiotis is found dead in his hotel room from an overdose of Novocaine and Sainsbury-Seale disappears, Poirot rightly expands his list of suspects and connects the crime to events that occurred in India 12 years earlier.—G. Taverney (duke1029@aol.com)", "Hercule Poirot's dentist, Dr Morley, dies of a gunshot wound in his surgery. The police initially believe it is suicide, a belief strengthened when one of the patients Dr Morley treated that morning, Mr Amberiotis, dies later that same day from a Novocaine overdose. The police are concerned, however, that this all may in some way be a plot to kill Mr Alastair Blunt, an influential banker, who was a patient of Dr Morley and saw him that morning. Starting to suspect that it was murder, suspicion falls on Frank Carter, boyfriend of Dr Morley's assistant, as he and Dr Morley do not see eye-to-eye. Then another of Dr Morley's patients, Mabelle Sainsbury Seale, turns up dead.—grantss"], "genres": "N/A", "imdbID": "0182352", "rating": 7.7, "votes": 2030, "number_of_episodes": 70}