{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0193868": "Iain Cuthbertson", "0276133": "Emma Fielding", "0907731": "Fiona Walker", "0908322": "Zena Walker", "0513201": "Richard Lintern", "0000562": "Jeremy Northam", "0072737": "Tushka Bergen", "0338785": "James Greene", "0188474": "Jon Croft", "0738214": "John Rolfe", "0806773": "Derek Smee"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["An obnoxious man who outbid Poirot at an auction for an antique mirror is murdered after seeking Poirot's assistance to look into the dealings of his business associate.", "Poirot is outbid at an auction for an antique mirror by the dislikeable Gervais Chevenix, who requests Poirot's attendance at his country home as he believes he is being defrauded by a business associate, John Lake. Poirot arrives at the Chevenix house with Hastings and meets Chevenix's wife Vanda, an eccentric who believes in reincarnation and predicts a death in the household, his adopted daughter Ruth and her cousin Hugo,a struggling manufacturer of tubular steel furniture, who will inherit Chevenix's money if they marry and Miss Lingard, a secretary helping Chevenix research a book he is writing. Hugo is engaged to Susan and Ruth has already married Lake in secret. As the household are dressing for dinner, the butler sounds the gong to summon them, and then a shot rings out. Vanda's prophecy has come true and her husband has been murdered.—don @ minifie-1", "Hercule Poirot is hired by Gervase Chevenix and accepts his offer to travel to his country home and take on a case. Chevenix believes he has been defrauded by a business partner, John Lake. Unknown to Chevenix is that his adopted daughter Ruth has secretly married Lake. Gervase is manipulative and generally disliked by those around him. His nephew Hugo Trent hopes that his uncle will invest in his new enterprise but Chevenix insists that he marry Ruth first. Hugo has no intention of doing so and is engaged to Susan Cardwell. Chevenix is found dead in his study, an apparent suicide, but Poirot isn't convinced. When Inspector Japp finds that the dead man had drawn up a new will, not yet signed, Poirot is convinced they are dealing with murder.—garykmcd", "Hercule Poirot is outbid for a mirror at an auction by a rather obnoxious man, Gervase Chevenix. After the auction Mr Chevenix approaches Poirot, wanting to hire him to investigate a man he believes has defrauded him out of a large sum of money. Poirot accepts and, with his friend Captain Hastings, travels to Mr Chevenix's estate to discuss the case and investigate. There he discovers that Mr Chevenix was trying to meddling in the romantic affairs of his adopted daughter and his nephew, and was generally disliked by everyone around him. That night he is found dead, shot, with a gun in his hand and the door and windows to the room locked. To Chief Inspector Japp it is clearly suicide but Poirot knows better.—grantss"], "genres": "N/A", "imdbID": "0676144", "rating": 7.7, "votes": 1505, "number_of_episodes": 70}