{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0178430": "Trevor Cooper", "0193663": "Sorcha Cusack", "0425490": "Karl Johnson", "0725830": "Elizabeth Rider", "0791871": "Simon Shepherd", "0635820": "Hermione Norris", "0827866": "Tim Stern", "0139594": "Andrew Carr", "0746522": "Graham Rowe", "1469278": "James McCusker", "0184913": "Arthur Cox", "0243104": "Eileen Dunwoodie", "0597133": "Simon Molloy", "0694167": "Jo Powell", "0446787": "Peter Kelly", "1478988": "Colin Stepney", "1813576": "Terry Sartain", "0852295": "Doreen Taylor", "0859725": "Reg Thomason", "2551260": "Tommy Windward"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["While Poirot vacations in Brighton to boost his health, the beautiful pearl necklace of a theatre actress staying at his hotel is mysteriously stolen.", "On his doctor's orders Poirot has gone to stay in the seaside resort of Brighton, where he is frequently mistaken for Lucky Len, who gives out money on behalf of a newspaper to people who recognize him. Poirot is staying at the Metropolitan hotel, as are Mr. Opalsen, a theatrical producer, and his wife who is an actress starring in a play at a local theatre. A set of valuable pearls which Mrs. Opalsen wears in the play is stolen from her room, and suspicion falls on her maid Celestine, who was in the room next door. Celestine loves Andrew, the impoverished young author of Mrs. Opalsen's play but they cannot afford to get married and she is accused of taking the jewels to finance their marriage. Poirot solves the case and unmasks the real culprit, being rewarded by Opalsen and getting a bonus when he identifies the real Lucky Len.—don @ minifie-1", "Under doctor's order to take a rest, Poirot heads to the seaside for a stay at the Grand Metropolitan hotel. Across the hall from him is a theatrical producer, Ed Opalson and his actress-wife Margaret. Something of a showman, Opalson has recently purchased an extremely valuable string of pearls to be used in his new play about theft of just such a piece of jewelry. When the jewels go missing, Opalson would like Poirot to investigate but with Captain Hastings reminding him of his doctor's instructions, he refuses. Unfortunately, a local newspaper is running a contest where anyone who finds \"Lucky Len\", whose image is printed in the paper and who bears a striking resemblance to Poirot, will receive £10. Unable to get any peace, he takes on the case.—garykmcd", "Hercule Poirot is suffering from fatigue so his doctor recommends he leave London and have a holiday. Him and Hastings go to Brighton, staying in the Grand Metropolitan Hotel. In a nearby room are Ed Opalson, a highly successful play producer, and his wife, Margaret. Mr Opalson's latest play is showing in Brighton and one of the features of it is that his wife gets act in it while wearing a very expensive, and world-famous, set of pearls. Mr Opalson has used the pearls to publicize his play. Then, during the party after the play, the pearls are stolen from the Opalsons' hotel room.—grantss"], "genres": "N/A", "imdbID": "0245183", "rating": 7.5, "votes": 1473, "number_of_episodes": 70}