{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0323764": "Beth Goddard", "0178357": "Rowena Cooper", "0243983": "Richard Durden", "0455588": "Mark Kingston", "0870564": "Susan Tracy", "0360204": "Gillian Hanna", "0362202": "Terrence Hardiman", "0491440": "Jon Laurimore", "0041029": "Edward Atterton", "0836146": "Neil Stuke", "0654599": "Stephen Oxley", "0166526": "Scott Cleverdon", "1469223": "George Beach", "0654266": "Simon Owen", "0574888": "Glen Mead", "2862608": "Stephanie Thwaites", "0331110": "Pat Gorman"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["A terminally ill man asks Poirot to be executor of his new will but is murdered before he can write it, and it is later discovered the old will has been stolen.", "In 1926, rich but childless Andrew Marsh writes a will providing generous bequests to friends, associates, and their children while leaving the bulk of his estate to a medical foundation. He conspicuously omits his young ward Violet Wilson on the chauvinistic grounds that girls will be provided for by their husbands. Marsh's sexist attitudes change over the years as Violet grows into a lovely, independent young woman and publisher of a feminist magazine. He announces that he is going to alter his will and leave 100% of the estate to his ward. On the same night he confides to Poirot that he is terminally ill and wants the detective to be executor of his estate, he is lured out of the house and murdered before he can write the new document. When his lawyer discovers that the old will has been stolen too, the dead man is declared intestate. While the local authorities attribute the death to natural causes, Poirot is given reason to believe that Marsh has an illegitimate son, the identity of whom will lead him to the murderer.—Gabe Taverney (duke1029@aol.com)", "While on a visit to Cambridge, Poirot's old friend Andrew March confides in him that he will be changing his will in favor of his ward, Violet Wilson, whom he had specifically excluded from his will 10 years before. He also asks him to be the executor of his estate. Unfortunately, Marsh is found dead the next morning and it appears that Poirot is the only man to question the cause of death. The local physician says it's a heart attack, but his foundation stood to inherit 75% of Marsh's estate. The local police constable, whose wife works for Marsh, is too eager to concur as his son also stood to inherit a small sum. When Marsh's original will also disappears, it appears that someone may be preparing a claim to be his illegitimate son and claim the entire estate as his own.—garykmcd", "Poirot visits an old friend, Andrew Marsh, an academic at Cambridge University. Mr Marsh is terminally ill and confides in Poirot that he intends to change his will. He does not have the chance to carry this out as later that same evening he dies. The doctor and police conclude that it was natural causes, but Poirot knows better. His old will has gone missing.—grantss"], "genres": "N/A", "imdbID": "0676168", "rating": 7.6, "votes": 1540, "number_of_episodes": 70}