{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0602954": "Pauline Moran", "0768350": "Rolf Saxon", "0682649": "Olivier Pierre", "0834379": "Jon Strickland", "0047153": "Bill Bailey", "0083307": "Paul Birchard", "0184716": "Simon Cowell-Parker", "0857123": "Grant Thatcher", "0188928": "Anna Cropper", "0787248": "Mozaffar Shafeie", "0716276": "Peter Reeves", "0936298": "Robert Wisdom", "0064826": "Richard Bebb"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Shortly after opening an ancient Egyptian tomb, members of an English-American museum expedition start dropping off like flies. Can it truly be the Pharaoh's curse? Poirot travels to Egypt to unravel the mystery.", "Hercule Poirot is called upon to solve a series of mysterious deaths that are centered around the Valley of the Kings in Egypt. Sir John Willard died moments after he and a group of archaeologists entered an ancient tomb. The expedition's physician, Dr. Ames, concluded it was a heart attack but soon other members begin to die in mysterious circumstances. One dies of blood poisoning from a relatively mild cut while another dies of tetanus. One member who has returned to New York has taken his own life. Rumors are soon circulating that an Egyptian curse is felling all those who desecrated the ancient tomb. Poirot and Captain Hastings set off for Egypt to determine what is happening and who might be behind it.—garykmcd", "Hercule Poirot is hired by Lady Willard to investigate the death of her husband, the archaeologist Sir John Willard. Sir John was on a dig in Egypt to open the tomb of the Egyptian Pharaoh Men-Her-Ra, a tomb which is believed to be cursed. He suffered a heart attack the moment he walked into the burial chamber. Soon after this, another member of the expedition and the financier of it, Felix Bleibner, dies from septicemia after a seemingly innocuous cut. The inheritor of his wealthy estate, nephew Rupert Bleibner, commits suicide in New York a few days later. Poirot and Hastings fly out to the dig but already another member of the party appears to be afflicted.—grantss"], "genres": "N/A", "imdbID": "0676164", "rating": 7.6, "votes": 1657, "number_of_episodes": 70}