{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0602954": "Pauline Moran", "0068029": "Ann Bell", "0020237": "Adie Allen", "0510317": "Denis Lill", "0680526": "Jonny Phillips", "0909245": "Bill Wallis", "0312245": "Ian Gelder", "0781439": "Andrew Seear", "0203421": "Lucy Davidson", "0263779": "John Evitts", "0891079": "Michael Vaughan", "1084394": "Charles Armstrong"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["Poirot investigates when the cruel CEO of a chemical company is bludgeoned to death in his home after the company's formula for a revolutionary new synthetic rubber is targeted by a thief.", "Reuben Astwell is an evil man. He is hated by his nephew, his wife, his employees, his brother, his female assistant, and Poirot himself after he meets the man. So when Astwell is found dead shortly after Poirot visits to have dinner with Astwell and view the man's collection of Belgian miniatures, Poirot has many suspects from which to choose.—Spirit", "Invited to the home of chemical company CEO Reuben Astwell for dinner and to view Mr. Astwell's collection of Belgian miniatures, Poirot finds Astwell universally disliked and shortly thereafter murdered. But the murder is only one piece of the puzzle when Poirot discovers Astwell's chemical company has developed synthetic rubber so precious that someone has broken into the company to try and steal the formula. Astwell himself is more than willing to sell it to the highest bidder, even the Nazis.—Spirit", "With Captain Hastings playing in a weekend golf tournament, Hercule Poirot goes along, not for the golf, but for the opportunity to view Sir Reuben Astwell's collection of Belgian miniatures. Poirot and Hastings are invited for dinner and the miniatures are indeed exquisite but the company is not as Sir Reuben proves to be a nasty and overbearing boor of a man. Everyone dislikes him including his wife, his brother, his employees and his nephew Charles, who is arrested for his murder after his body is found in his study. One area of disagreement was Sir Reuben's decision to license their new formula to the German chemical giant, I.G Farben which, with war clouds forming over 1930s Europe, some think is unpatriotic. Miss Lemon's recently acquired skill as a hypnotist proves to be very helpful as the great detective sifts through the evidence.—garykmcd"], "genres": "N/A", "imdbID": "0676190", "rating": 7.3, "votes": 1465, "number_of_episodes": 70}