{"cast": {"0837064": "David Suchet", "0413946": "Philip Jackson", "0190194": "Rosalie Crutchley", "0151250": "Anna Chancellor", "0209095": "David de Keyser", "0352470": "Jonathan Hackett", "0925685": "Geoffrey Whitehead", "0249103": "Mark Eden", "0055256": "Jonathan Barlow", "0177703": "James Coombes", "0516999": "Preston Lockwood", "0112697": "Linda Broughton", "1087409": "Kirsten Clark", "0067258": "Michael Beint", "0169982": "Lucy Cohu", "0220622": "Richard Derrington", "0326349": "Jill Goldston", "0859725": "Reg Thomason"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["While in Belgium, Poirot relates to Chief Inspector Japp a case from his early days in the Belgian police force that nearly eluded the brilliance of his 'little grey cells.'", "Accompanying Inspector Japp to Brussels, who is receiving an award from the Belgian government, Hercule Poirot tells him a case from 20 years before. Poirot was a young policeman at the time and at the request of Virginie Mesnard, agrees to investigate the death of rising young politician, Paul Deroulard. The courts had already ruled that he had died of a heart attack, but she believes he was murdered. Poirot believed Deroulard had been poisoned, likely from a box of chocolates he had been given by an aristocrat, Xavier St. Alard. In the end, Poirot identified the killer, even obtaining a confession, but chose not to make it public, for reasons that he explains to his colleagues.—garykmcd", "Chief Inspector Japp is in Brussels to receive an award from the Belgian government. Poirot accompanies him and, through meeting old acquaintances and seeing familiar places, recounts the details of his first case as a Belgian policeman, before World War 1. Paul Deroulard was a government minister with proposed policies, especially regarding language and religion, which make him unpopular, especially among his friends. One night, having eaten some chocolates provided by one such friend, he dies. It is ruled a death by natural causes but Poirot suspects that he was poisoned. With his superior insistent that there is no murder to investigate, Poirot investigates the death on the sly.—grantss"], "genres": "N/A", "imdbID": "0676169", "rating": 8.2, "votes": 1893, "number_of_episodes": 70}