{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0602954": "Pauline Moran", "0873739": "David Troughton", "0372317": "Dorian Healy", "0813893": "Geraldine Somerville", "0891483": "Yolanda Vazquez", "0564558": "Robin McCaffrey", "0743462": "Hugh Ross", "0519034": "Joseph Long", "0344793": "Stefan Gryff", "0892992": "Arturo Venegas", "0536597": "Leonard Maguire", "0962547": "Carol Kenyon", "2987566": "Tracy Miller"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["50"],  "plot": ["A man celebrates the two-year anniversary of his wife's sudden death by cyanide while in Argentina - a death which Poirot himself had witnessed, but could not solve at the time.", "Hercule Poirot has a rare opportunity when he gets a second chance to solve a murder circumstance prevented him from solving two years before. On his way to visit Capt. Hastings in the Argentine, Poirot had stopped in Buenos Aires. While out for dinner, a young woman named Iris Russell was poisoned. The police found cyanide in her purse and ruled her death to be suicide, something her husband Barton Russell refuses to accept. When Poirot agrees with him and raises objections to the hasty police verdict, he is quickly ordered deported. Now, two years later, Russell Barton is hosting a dinner in London on the anniversary of his wife's death with everyone who was present invited to the event. This time, Poirot has no intention of letting the killer get away.—garykmcd", "In mentioning a new restaurant in London, Hastings reminds Poirot of his only unsolved case. Two years ago he was in Buenos Aires, Argentina, at a restaurant of the same name, when a woman at a nearby table, Iris Russell, died of cyanide poisoning. It looked like suicide, but Poirot believed it was murder. However, before he able to investigate her death he was deported from the country - Argentina was in the middle of a coup and Poirot was persona non grata. The London restaurant's name is not a coincidence and Poirot now has a chance to reopen his investigation.—grantss", "Exactly two years ago, in Buenos Aires, circumstances prevented Poirot from investigating the sudden death of the beautiful Iris Russell. Now he has the chance to try again, this time in London, when a yellow iris, mysteriously left on his doorstep, alerts Poirot that the killer may strike once more.—Emily"], "genres": "N/A", "imdbID": "0676194", "rating": 7.8, "votes": 1679, "number_of_episodes": 70}