{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0696455": "Leonard Preston", "0563690": "Anna Mazzotti", "0623597": "David Neal", "0516020": "Vincent Riotta", "0443821": "Sidney Kean", "2069805": "Alberto Janelli", "0184913": "Arthur Cox", "0006467": "Vittorio Amandola", "0063306": "Ben Bazell", "0894857": "David Verrey", "0498750": "Janet Lees-Price", "1047179": "Barrie Wilmore", "0055707": "Michael Tudor Barnes", "0932577": "David Willoughby", "2273382": "Sara Kean", "2273325": "Victoria Kean"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["Poirot investigates the murder of an Italian count who was also the employer of Miss Lemon's new boyfriend. He soon learns that the victim was being targeted by a blackmailer.", "Poirot and his friend Captain Hastings find themselves investigating the murder of Count Foscatini, who was found in his flat. As it turns out, the dead man's valet, Mr. Graves, has been dating Miss Lemon and has been less than honest with her about his profession. As for the dead nobleman, the police believe he was being blackmailed. The Italian Embassy denies any knowledge of the man and denies that he had any official role in the country. Poirot doubts the veracity of their claims but also concludes that others are lying as well.—garykmcd", "A murder is committed and Poirot, Hastings and Miss Lemon are all independently connected to the victim in some way. Poirot is having dinner with a doctor friend when a patient, Count Foscatini, phones to say he has been attacked. The doctor and Poirot race to the Count's flat to find him murdered, bludgeoned to death. Hastings recognizes the Count from the Italian car dealer where he just bought his car. Meanwhile, Miss Lemon is dating the Count's valet, Mr Graves. Mr Graves had previously mentioned to Poirot that the Count may be interested in using his services, as he was being blackmailed. From Mr Graves' testimony, it appears that the main suspect is Mario Ascanio, an Italian gentleman who appeared to be the Count's blackmailer. The police set out to find Mr Ascanio.—grantss"], "genres": "N/A", "imdbID": "0676165", "rating": 7.4, "votes": 1452, "number_of_episodes": 70}