{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0607046": "Ann Morrish", "0753236": "Patrick Ryecart", "0119357": "Kate Buffery", "0381249": "Paul Herzberg", "0820653": "Julia St John", "0922272": "Norma West", "0628451": "Jonathan Newth", "0417070": "Pauline Jameson", "0667901": "Muriel Pavlow", "1264697": "Pat O'Toole", "0294372": "Geoffrey Freshwater", "0680496": "Jestyn Phillips", "0766980": "Tobias Saunders", "1264668": "Layla Harrison", "0866816": "Stephen Tomlin", "1530888": "Tim Williams", "0827319": "Sarah Stephenson", "0052159": "Geoffrey Banks", "2134688": "Snubby", "0556963": "Stephen Mason", "1750497": "Darren McSweeney"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["103"],  "plot": ["An elderly woman confides to Poirot that she fears one of her relatives is trying to kill her for her money. He persuades her to disinherit her heirs, but she is murdered anyway.", "Hastings is invited by his friend Charles Arundel to be at hand when he tries to break a water speed record on a Lake Windermere, but his boat's engine fails him. At a subsequent reception at the estate of Charles' well-to-do aunt, Poirot and the other guests witness her refusal to continue to underwrite Charles' expensive hobby, and he threatens her. Later, when she is almost killed in a freak accident involving her pet fox terrier Bob, she confides to Poirot that she suspects a family member of trying to kill her to gain part of her estate. The detective advises her to disinherit her grasping relatives and name a friend as beneficiary. Despite this precaution, she dies abruptly under questionable circumstances, but the local authorities refuse to authorize an autopsy. Suspecting foul play, Poirot looks to his wits as well as the Arundel dog, who remains a silent witness to murder.—G. Taverney (DUKE1029@AOL.COM)", "Hercule Poirot and Captain Hastings head off to see Hasting's friend, Charles Arundel, set a new speed record on water. While there, Poirot is approached by Charles' mother, Emily Arundel, who fears that someone in her family may be trying to kill her in order to inherit her estate. Poirot counsels her to change her will. Once the former heirs learn what has happened, he believes they would hold off any action against her hoping she might change her mind in the future. She does so but is soon found dead, likely having been poisoned though her physician, Dr. Grainger, insists she died of liver disease. Poirot is puzzled by the turn of events and a second death does little to clarify the puzzle. Poirot is certain there is a witness to the crime - Emily Arundel's dog, Bob - but how Poirot's new four-legged friend can help is something even the great detective cannot as yet fathom.—garykmcd", "Hercule Poirot and Captain Hastings attend an event at a lake in the country. Hastings' friend Charles Arundel is trying to break the world water speed record. While they are there, the matriarch of the Arundel family, Emily Arundel, first suffers a nasty fall down a flight of stairs and then dies in weird circumstances. The police deem the death natural but Poirot knows otherwise. He is convinced it is murder, but does not know who did it. He has a witness, Bob, but this witness isn't speaking. Bob is a dog.—grantss"], "genres": "N/A", "imdbID": "0292497", "rating": 8.0, "votes": 2269, "number_of_episodes": 70}