{"cast": {"0837064": "David Suchet", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0420219": "Paris Jefferson", "0278746": "Jonathan Firth", "0507073": "Damian Lewis", "0552341": "Gilbert Martin", "0607424": "Elinor Morriston", "0447353": "Polly Kemp", "0516028": "Jessica Lloyd", "0046002": "Sarah Badel", "0068464": "Rachel Bell", "0768365": "Granville Saxton", "0121651": "David Burke", "0515926": "Bernard Lloyd", "0240956": "Terry Duggan", "1115816": "Mark Denny", "0457078": "Tony Kirwood", "1469255": "Peter Glancy", "0511580": "Andy Linden", "0916205": "Mark Webb", "0396438": "Anthony Houghton", "0290340": "Terry Francis", "0513180": "Alec Linstead", "0567498": "Brian McDermott", "1361504": "Michael McKone", "0916160": "John Webb"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["103"],  "plot": ["A spate of petty thefts is followed by a series of brutal murders at a student hostel in London.", "When a series of apparently minor thefts plagues a university hostelry run by Miss Lemon's sister, Poirot is recruited to investigate. Celia Austin, a pharmacological major, confesses that she is a kleptomaniac and responsible for most of the thefts but denies stealing several objects including a stethoscope, light bulbs, and a student rucksack. Furthermore, she claims to know the other thief and vows to help return the missing items. Unfortunately someone substitutes an overdose of morphine for one of her sleeping powders, and she takes the identity of the thief to the grave. Japp connects the murderer's m.o. with a cold case he had investigated ten years earlier, but the prime suspect in that crime, a powerful statesman, now lies dying in a local hospital. Despite numerous obstacles, Poirot is able to link the killing to an international diamond smuggling ring but not before the murderer claims more victims.—duke1029", "Hercule Poirot's secretary, Miss Lemon, has a sister, Florence Hubbard, who runs a university hostel in Hickory Road. During a visit, Mrs Hubbard informs Miss Lemon that there has a been a spate of robberies from the hostel of late. Miss Lemon suggests that Hercule Poirot investigate under the pretext of giving a talk to the students on crime solving. He does just that and uncovers some details. A few days later, Mrs Nicoletis, the owner of the hostel, is murdered. Poirot suspects that the robberies and the murder are linked. Aided by Chief Inspector Japp, he uncovers more than just robberies and a murder.—grantss", "Hercules Poirot finds himself helping Miss Lemon's sister following a rash of thefts at the student rooming house she manages. The stolen objects are of only minor value - a stethoscope belonging to a medical student is perhaps the most valuable - but this adds all the more interest as far as Poirot is concerned. He soon learns that there is far more going in the residence than was first imagined including a strange looking character who works at a shop selling rucksacks and the presence of an undercover customs officer investigating a diamond smuggling ring illegally importing jewels from Amsterdam. With Mrs. Japp away, Poirot insists that Inspector Japp move in with him, setting the groundwork for an amusing clash of cultures.—garykmcd"], "genres": "N/A", "imdbID": "0182225", "rating": 7.6, "votes": 2242, "number_of_episodes": 70}