{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0281990": "Diane Fletcher", "0858669": "Damien Thomas", "0700399": "Ben Pullen", "0265189": "Kate Fahy", "0512672": "Sophie Linfield", "0611672": "Jacinta Mulcahy", "0066591": "Terence Beesley", "0600449": "Bill Moody", "0490065": "Bernard Latham", "1016442": "Andrew Melville", "0901211": "Henrietta Voigts", "0891049": "James Vaughan", "0064826": "Richard Bebb", "0829134": "Belinda Stewart-Wilson", "0392050": "Simon Holmes", "0309523": "Ray Gatenby", "0379043": "Randal Herley", "0946333": "Peter Yapp", "0712366": "Terry Raven", "0166762": "Margaret Clifton", "0077401": "Tim Berrington", "0497404": "Howard Lee", "1467075": "Christopher Hammond", "0608022": "Joseph Morton", "1521633": "Brian Ellis", "3001340": "Laurence Richardson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["94"],  "plot": ["While Poirot and Hastings are holidaying in France, a businessman tells Poirot that his life is in danger. The next day he is found stabbed to death on a nearby golf course.", "Poirot and Hastings are in Deauville, and Poirot is approached by business-man Paul Renaud concerning threats by Chileans. The next morning the maid finds Madame Renaud bound and gagged and her husband's corpse is later found on a nearby golf course. Giraud, a pompous French police officer, dismissive of Poirot's reputation, lays a wager with him. The detective who fails to catch the killer must make a sacrifice. Giraud will relinquish his trade mark pipe. Poirot must shave off his moustache.—don @ minifie-1", "In Deauville, France with Captain Hastings for a holiday Poirot finds himself drawn into a murder investigation. He is approached by wealthy local businessman Paul Renaud who tells him he is in fear of his life. They agree to meet the next day but when he arrives at Renaud's home, he learns that Renaud was kidnapped in the night and his wife Eloise was found bound and gagged in their bedroom. He also meets Giraud, the Frernch policeman in charge of the case. They are soon investigating a murder when Hastings finds Renaud's body on the golf course. Giraud doesn't appreciate Poirot's intervention in the case and they make a wager on who will first solve the case: Giraud's pipe against Poirot's famous mustache. Giraud suspects Renaud's stepson Jack, especially after the young man lies about his whereabouts the night his stepfather was killed. Poirot however believes that the case is far more complex involving trickery, hidden identities and ties to an infamous murder that occurred 10 years before.—garykmcd", "Hercule Poirot and his good friend Captain Hastings are holidaying at a resort in Deauville, France. A wealthy local businessman, Paul Renauld, approaches Poirot and tells him he believes his life is in danger form Chileans who are trying to defraud him. That night Renauld's wife is found tied him in their home, with Mr Renauld feared abducted. The next day Renauld is found stabbed to death on the golf course of the resort. While suspicion immediately falls on the nameless, faceless Chileans, Mr Renauld's stepson also had a motive, and had threatened to kill his stepfather. However, some of the neighbours and other parties have connections with the Renauld family that make things decidedly more complex. Poirot investigates but is hamstrung by a bullying egomaniac from the French Police, Monsieur Giraud. Giraud is no fan of Poirot and believes he is a better detective than Poirot and they take a bet on who will solve the case first. Meanwhile, Hastings falls in love.—grantss"], "genres": "N/A", "imdbID": "0182332", "rating": 7.8, "votes": 2274, "number_of_episodes": 70}