{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0333351": "Helen Grace", "0145284": "John Castle", "0020511": "Fiona Allen", "0345297": "Dominic Guard", "0180184": "Deborah Cornelius", "0947380": "Hannah Yelland", "0824356": "Tim Steed", "0631467": "Lesley Nightingale", "0345295": "Christopher Guard", "0292142": "Iain Fraser", "0063947": "Tom Beard", "0219072": "Virginia Denham", "0703231": "John Quentin", "0362967": "Janet Hargreaves", "0416266": "Aliza James", "0109251": "Mark Brignal", "0941211": "Fenella Woolgar", "0366126": "John Hart Dyke", "0034877": "Jonathan Aris", "0278756": "Rory Firth", "0584456": "Nicola Michaels", "1302059": "Gary Ross"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["99"],  "plot": ["A beautiful actress becomes the prime suspect in the murder of her tyrannical husband - except that she has a cast-iron alibi for the night of the crime.", "Lady Edgware, the well-known stage actress Jane Wilkinson, has a dilemma in that her husband has consistently refused to give her a divorce. She asks Hercule Poirot to visit the man to see if there is any possibility of convincing him. Lord Edgware is nothing short of nasty, treating all those around him very badly. When he is found dead, there is no great surprise, but there certainly are a good number of suspects. The police believe Lady Edgware to be the culprit, but she has a cast-iron alibi, having attended a private dinner over the time her husband was killed. There is also the man's nephew, who would inherit his fortune, and his personal assistant, whom he treated very badly; and then there is the family butler, who clearly has his own interests at heart.—garykmcd", "After his short-lived retirement and country living, Hercule Poirot is back in his flat in London. Miss Lemon is back as his assistant. Hastings is back from Argentina, semi-broke after a bad investment decision and sans bride. Chief Inspector Japp is around, so the old gang are reunited, and have a dinner to celebrate. A few days later, Poirot gets drawn into the private lives of curmudgeonly Lord Edgware and his beautiful young actress wife, Jane Wilkinson. Lady Jane wants a divorce and Lord Edgware won't accede to her request. She asks Poirot, as a friend of Lord Edgware, to try to convince him. When Poirot speaks to Lord Edgware it is revealed that he decided to agree a month earlier, and informed Lady Jane of this in writing. Lady Jane says she never received the letter. Later that night, Lord Edgware is murdered, and witnesses say that they saw Lady Jane entering his study around the time of the murder. However, soon hereafter an actress, Carlotta Adams, is found dead in her bed from a drug overdose. Poirot had deduced that she had impersonated Lady Jane that night, but arrived too late to prevent her death. So it looks like Carlotta Adams killed Lord Edgware, but, as Poirot believes it was murder, who killed Carlotta Adams?—grantss"], "genres": "N/A", "imdbID": "0235681", "rating": 7.9, "votes": 2360, "number_of_episodes": 70}