{"cast": {"0837064": "David Suchet", "0413946": "Philip Jackson", "0203882": "Oliver Ford Davies", "0855906": "Malcolm Terris", "0128135": "Selina Cadell", "0064584": "Daisy Beaumont", "0599778": "Flora Montgomery", "0177477": "Nigel Cooke", "0051397": "Jamie Bamber", "0296563": "Roger Frost", "0374132": "Vivien Heilbron", "0874458": "Gregor Truter", "0047472": "Rosalind Bailey", "0450580": "Liz Kettle", "0800093": "Charles Simon", "0247387": "Chas Early", "0157926": "Graham Chinn", "0116622": "Clive Brunt", "0366137": "Alice Hart", "0942963": "Philip Wrigley", "0040783": "Phil Atkinson", "3204919": "Tony Red Richards"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["99"],  "plot": ["Poirot comes out of retirement when his industrialist friend is brutally murdered a short while after a local widow who was suspected of killing her husband commits suicide.", "Living quietly in the small village of King's Abbot, sleuth Hercule Poirot becomes involved in the murder of successful industrialist Roger Ackroyd. The number of potential killers is almost as great as the population of the village itself. As Poirot investigates he sees that there might be a connection to the suicide of a local woman, and the death the previous year of her husband.—Ron Kerrigan <mvg@whidbey.com>", "Hercule Poirot is happily retired in the picturesque village of King's Abbott even if in the last year, he has been unable to grow the perfect marrow. When his friend and local industrialist Roger Ackroyd is found murdered in his study, Poirot is reunited with his old friend Chief Inspector Japp of Scotland Yard. Poirot is convinced that Ackroyd's death must somehow be connected to the suicide of Mrs. Dorothy Ferrars who had died the previous day and whom Roger Ackroyd had admitted was the love of his life. He also believed she was being blackmailed by someone. There are many secrets in the Ackroyd household, not the least of which is a secret marriage, but Poirot pieces it all together and identifies the killer.—garykmcd", "Hercule Poirot retires from sleuthing and moves to a cottage in a small country town, King's Abbott. His old friend, the industrialist Roger Ackroyd lives there and he soon makes friends with some of the other townsfolk too. One day a widow, Mrs Farris, (apparently) commits suicide, almost a year after her husband died. Then, soon after a dinner party that Poirot attended, Mr Ackroyd is found murdered in his study. Suspicion immediately falls on Ralph Paton, Mr Ackroyd adopted son, the inheritor of his estate and a man who had large debts with Mr Ackroyd. Poirot is reluctant to get involved but then the investigating officer from Scotland Yard turns out to be an old friend and ally, Chief Inspector Japp. Poirot and Japp, the old firm, get on the case.—grantss"], "genres": "N/A", "imdbID": "0236523", "rating": 7.3, "votes": 2644, "number_of_episodes": 70}