{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0413946": "Philip Jackson", "0602954": "Pauline Moran", "0383553": "Michael Higgs", "0539944": "Tamzin Malleson", "0216220": "Louise Delamere", "0575260": "Tim Meats", "0280149": "Marsha Fitzalan", "0681949": "Carolyn Pickles", "0540042": "David Mallinson", "0869871": "Russell Tovey", "0860221": "Ian Thompson", "0863817": "David Timson", "0545331": "Rosalind March", "0713961": "Paul Ready", "0426038": "Rebecca Johnson", "1153025": "Guy Vincent", "0016897": "Roger Alborough", "0601471": "Kevin Moore", "0203776": "Jason Davies", "0318131": "Kenneth Gilbert", "1416334": "Lawrence McGrandles Jr.", "0318937": "Grant Gillespie", "0247565": "Harriet Eastcott", "1412134": "Andrew MacBean", "1369746": "Steve Bennett", "1047720": "Andrew Ashby", "3001340": "Laurence Richardson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["98"],  "plot": ["Poirot's rehabilitative health retreat on an island resort becomes an even more stimulating mental exercise when a flirtatious film star is found strangled on a nearby beach.", "Recovering from a sudden collapse, Poirot finds little comfort in doctor's orders confining him to a strict regimen at an island health resort with Captain Hastings. However, better medicine is to be found in the murder of another guest, a famous film actress, and a long list of suspects.—Mark Cabot Robinson", "Hercule Poirot suffers a suspected heart attack while eating at Captain Hastings' new restaurant. His doctor suggests he rest, lose weight and get some exercise. A few days into this regime, Miss Lemon discovers a health resort on an island off Devon - perfect for Poirot. Poirot is packed off to the resort, with Hastings to accompany him. The other guests turn out to be an intriguing lot, with infidelity and hatred abounding. The centre of much of the infidelity and hatred is Arlena Stuart, the wife of wealthy Lionel Marshall. When she is found murdered, everyone's a suspect, but everyone seems to have a watertight alibi.—grantss", "Hercule Poirot attends the grand opening of the El Ranchero restaurant at the invitation of one of its new owners, none other than Capt. Hastings. He collapses however and is rushed to hospital only to be told that for a man his age, he needs to lose weight or risk a worsening heart condition. The doctor and Miss Lemon soon book him into the Sandy Cove hotel, a health spa, for two weeks with Hastings going along to keep him company. The hotel hosts the usual assortment of guests but also includes a well known actress, Arlena Stuart. She is disliked by many at the hotel including her husband and stepson, whom she treats badly; Christine Redfern whose husband Patrick is carrying on a flirtation, if not more, with her; and a fanatical Minister who sees her as the embodiment of sin. As a result, Poirot has no shortage of suspects when she is found strangled on the beach. He does however have a very difficult knot to untangle.—garykmcd"], "genres": "N/A", "imdbID": "0276115", "rating": 8.0, "votes": 2873, "number_of_episodes": 70}