{"cast": {"0837064": "David Suchet", "0292140": "Hugh Fraser", "0074672": "Ron Berglas", "0055502": "Barbara Barnes", "0820880": "Dinah Stabb", "1022231": "Georgina Sowerby", "0877952": "Jeremy Turner-Welch", "1021298": "Pandora Clifford", "0402757": "Christopher Hunter", "0100815": "Christopher Bowen", "0593395": "Iain Mitchell", "0443252": "Alexi Kaye Campbell", "0691302": "Deborah Poplett", "0869461": "Kamel Touati", "0744599": "Hichem Rostom", "0097062": "Zoubeir Bornaz", "1021853": "Dejeb Magri", "1459330": "Hammadi Maaroufi", "1247837": "Ramzi Brari"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["98"],  "plot": ["While Poirot is on holiday in Iraq, the wife of the head scientist at an archaeological dig confides to him that she is the target of threatening letters.", "While accompanying his friend Hastings to a dig in Iraq, Hercule Poirot becomes involved in the murder of an archaeologist's wife. The victim, Mrs. Leidner, had been receiving threatening letters signed by her first husband, who was known to have been killed in a train wreck. Did he survive? Was it his younger brother who was avenging his memory? Did Miss Johnson get rid of her rival for her employer's affections? Did Richard Carey kill the woman he publically announces that he hates? Is the French priest really who he pretends to be? And how many deaths will occur before Poirot unmasks the murderer?—Ron Kerrigan <mvg@whidbey.com>", "Hercule Poirot finds himself reunited with his old friend Captain Hastings who is participating in an archaeological dig not far from Baghdad. Soon after his arrival, Poirot hears a strange tale form Mrs. Leidner who is married to the archaeologist in charge of the site. She has been receiving threatening letters supposedly written by her husband who was killed many years ago. She can make no sense of it but when she is killed, there is every reason to believe that the letters and her death are connected. There is a wide selection of possible perpetrators but as Poirot sifts through the evidence, there is only one possible solution to the crime.—garykmcd", "Hercule Poirot is in Baghdad, Iraq, to meet an old acquaintance when he is invited to a nearby archaeological dig by his old friend Captain Hastings. The dig is being led by famed archaeologist, Dr Leidner. He is accompanied by his beautiful wife, her nurse - Amy Leatheran, his long-time archaeological partner - Richard Carey, his assistant - Anne Johnson, a priest - Father Lavigny, another archaeologist - Joseph Mercado, his wife and a team of local workers. The night before Poirot arrives one of the locals is murdered on the dig site. A short time after arriving the site, Mrs Leidner is spooked by a mask at her window, leading her to confide to Poirot that she is receiving death threats. They are purported from her long-dead first husband but she suspects they are from his brother. The next day, Mrs Leidner is found dead in her room, having received a savage blow to the head. There is only one way into her room, through the main courtyard, a very public place, and nobody saw anyone enter her room. How on earth was she then murdered? More importantly, who did it?—grantss"], "genres": "N/A", "imdbID": "0278634", "rating": 7.4, "votes": 2456, "number_of_episodes": 70}