{"cast": {"0837064": "David Suchet", "0830556": "Rachael Stirling", "0318821": "Aidan Gillen", "0827170": "Toby Stephens", "0912938": "Marc Warren", "1190429": "Aimee Mullins", "0185107": "Julie Cox", "0428121": "Gemma Jones", "1258830": "Sophie Winkleman", "1506908": "Talulah Riley", "0538869": "Patrick Malahide", "0046183": "Annette Badland", "0108926": "Roger Brierley", "1510188": "Richard Teverson", "1507172": "Melissa Suffield", "1507305": "Lottie Unwin", "1080007": "Darien Smith", "1509155": "Jacek Bilinski", "1507510": "Joel de Temperley"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["Lucy Crale enlists Poirot to investigate the 14-year-old murder in which her mother was hanged for poisoning her artist father.", "Fourteen years after her mother, Caroline Crale, was hanged for the murder of her artist father Amyas Crale, Lucy Crale asks Hercule Poirot to investigate her father's death. She is convinced that her mother was innocent but is prepared to accept the truth, whatever that may be. Poirot visits in turn all five persons present when the murder took place including Amyas' best friend, Philip Blake, who was visiting the Crales when Amyas was killed; Philip's brother Meredith from whom Caroline supposedly stole the poison used to kill her husband; Elsa Greer, who was sitting for a portrait and with whom Amyas was supposedly in love; Caroline's half sister Angela who despised Amyas but believed her sister to be innocent; and Miss Williams, the governess. Having heard the tale from five different perspectives, Poirot reunites them all to identify the murderer.—garykmcd", "Hercule Poirot is hired by a young woman, Lucy Crale. 14 years earlier, her father was murdered and her mother was convicted of the murder and hanged. She is convinced of her mother's innocence and wants Poirot to investigate who really killed her father. Poirot accepts the case.—grantss", "A young woman comes to Poirot for help. He recognizes her name, for her mother was tried and executed for murdering her father, a famous painter. Now, fourteen years later, Poirot must interview the five witnesses present at the time and find out whether the mother was really guilty.—Melkhior", "Hercule Poirot is employed by a young woman named Lucy Crale in order to re-investigate a case that the police closed almost two decades ago. When Lucy was a little girl, her father Amyas Crale, a painter, was murdered by poison and her mother, Caroline, was later found guilty of the crime. Before hanging for the murder in prison, Caroline Crale however wrote a letter to her daughter, professing her total innocence. Lucy Crale now wants Poirot to find out the exact truth about the tragic destruction of her family all those years ago.—Anonymous"], "genres": "N/A", "imdbID": "0392952", "rating": 8.4, "votes": 4358, "number_of_episodes": 70}