{"cast": {"0837064": "David Suchet", "0220457": "Elisabeth Dermot Walsh", "0672303": "Rupert Penry-Jones", "0717709": "Kelly Reilly", "0001524": "Paul McGann", "0517642": "Phyllis Logan", "0640949": "Marion O'Dwyer", "0703438": "Diana Quick", "0481931": "Stuart Laing", "0303177": "Jack Galloway", "0066644": "Geoffrey Beevers", "0277517": "Alistair Findlay", "0819963": "Linda Spurrier", "0852471": "Ian Taylor", "0138232": "Timothy Carlton", "1445158": "Louise Callaghan"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["Elinor Carlisle seems to be the obvious murderer of her ailing aunt and the beautiful romantic rival who broke up her engagement, but Poirot uncovers darker motives.", "Elinor Carlisle and Roddy Winter are happily engaged. Elinor's aunt is Laura Welman, wealthy but ailing and bed-ridden. Elinor receives an anonymous letter warning her that someone will try to gain favour with Mrs Welman at her expense. Her aunt's doctor, Dr Peter Lord, contacts Hercule Poirot to investigate. Mrs Welman dies with no will and Elinor, as her next-of-kin, receives everything. Shortly before Mrs Welman's death, Mary Gerrard, an old friend of the family, reappears after a long absence. Roddy falls for her and this ends his engagement to Elinor. Elinor is openly resentful of Mary ending her relationship with Roddy and says she wished Mary was dead. One afternoon, Mary stops by for tea and sandwiches with Elinor and a short while later is found dead, poisoned. After a thorough investigation, which Poirot assisted in, Elinor is charged with and ultimately found guilty of the murders of Mary and Mrs Welman. She is sentenced to hang. Doctor Lord insists that Elinor is innocent and implores Poirot to re investigate the case. Poirot agrees, resulting in a race against time to save Elinor.—grantss", "Distant cousins and childhood friends Elinor Carlisle and Roddy Welman are happily engaged to be married. One day Elinor receives an anonymous letter in the post, claiming that someone is trying their hardest to work their way into the affection, and subsequently also bank account, of her wealthy aunt Laura Welman, who is presently bedridden at her home since after a stroke and from whose death Elinor and Roddy both expect to inherit a large fortune. Not knowing what to make of the letter, the young couple eventually decide to pay Laura a visit in order to see for themselves what is really going on at the house. When they arrive, Elinor immediately becomes suspicious towards Mary Gerrard, the lodge keeper's daughter, recently returned to England after having studied in Europe and whom everyone else at the house seem to absolutely dote on. No one else however seem to share Elinor's suspicions or dislike of the young woman, and in particular not Roddy, whom Elinor one night discovers kissing Mary Gerrard in her aunt's drawing room. When Mary suddenly turns up dead, poisoned by a salmon sandwich, Elinor's dislike of Mary makes her the obvious suspect and hardly has time to take in what has happened before she finds herself on trial and condemned for murder. The only person who is not entirely convinced of Elinor's guilt is Doctor Peter Lord, who decides to contact his old friend Hercule Poirot in order to help him prove her innocence.—Anonymous", "When Elinor Carlisle receives an anonymous letter indicating someone is trying to gain control of her seriously her ill Aunt's estate, she shares the information with the family physician Dr. Peter Lord who in turn asks Hercule Poirot for his expert assistance. Elinor's aunt, Mrs. Welman, has suffered a number of strokes so her eventual death is of no surprise to anyone. As her only living relative, Elinor inherits her aunt's substantial estate, but she has other problems. Her fiancée, Roddy Winter, has taken a liking to Mary Gerrard, someone they both knew as children who has grown into a very attractive young woman. When Mary is poisoned, Elinor is convicted and sentenced to hang. It is up to Poirot to determine the identity of the killer and the motive behind the crime.—garykmcd", "Elinor Carlisle stands in the dock, accused of murder. The case against her is strong. Only Elinor seems to have motive to murder her ailing aunt, whose fortune Elinor inherited, and the beautiful Mary Gerrard, who broke Elinor's heart when she seduced her beloved fiancé Roddy Winter away from her. Only the devoted Peter Lord, the doctor who tended her aunt and who has long loved her from afar, believes in her innocence, and all would appear lost - but Peter Lord is good friends with Hercule Poirot, the brilliant detective. And there is something about the seemingly open-and-shut case that troubles Poirot.—Scott Nisbet"], "genres": "N/A", "imdbID": "0402444", "rating": 8.0, "votes": 2842, "number_of_episodes": 70}