{"cast": {"0837064": "David Suchet", "0289038": "James Fox", "0341632": "Emma Griffiths Malin", "0270625": "JJ Feild", "1289434": "Emily Blunt", "0661407": "Judy Parfitt", "0232963": "Daisy Donovan", "0283409": "Barbara Flynn", "0487406": "Daniel Lapaine", "0815800": "David Soul", "0209428": "Frances de la Tour", "0854364": "Zoe Telford", "0533258": "Alastair Mackenzie", "0671487": "Steve Pemberton", "0947964": "George Antoni", "1276182": "Elodie Kendall", "0238886": "Félicité Du Jeu"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["97"],  "plot": ["A wealthy American heiress honeymooning on a Nile cruise ship is stalked by a former friend, whose boyfriend she had stolen before making him her new husband.", "While on their honeymoon in Egypt, newlyweds Simon Doyle and Linett Ridgeway are constantly harassed by Simon's ex-fiancée Jackie De Bellefort who feels her ex-best friend has stolen the love of her life. A holidaying Hercule Poirot counsels Jackie to put an end to her antics, fearing that all of this can only end in tragedy. When one of the passengers is killed while on a cruise down the Nile, Poirot must sift through an odd assortment of passengers, who all may have something to hide. There is Linett's financial advisor from the US, her French maid who clearly has something to hide, the Austrian doctor who keeps mostly to himself and the left leaning philosopher who despises the rich.—garykmcd", "Hercule Poirot is on holiday in Egypt. Part of his travels includes a trip down the Nile on a passenger boat. On board are a mixed selection of characters. Most notable is a wealthy heiress, Linnet Ridgeway, and her husband, Simon Doyle. Also on board is the woman Mr Doyle left for Ms Ridgeway, Jacqueline De Bellefort. In revenge for Ms Ridgeway stealing the love of her life, Ms De Bellefort has been openly following Ms Ridgeway around and generally irritating her. One night, Ms De Bellefort, in a fit of anger and jealousy, shoots and wounds Mr Doyle. The next morning Ms Ridgeway is found murdered, shot through the head. However, the only two possible suspects - Ms De Bellefort and Mr Doyle - have perfect alibis and could not possibly have killed her. Who did then?—grantss", "Newly engaged and madly in love couple Jacqueline de Bellefort and Simon Doyle have fallen on hard times. In order to afford getting married, and pay for their planned honeymoon in Egypt, Jacqueline introduces Simon, who has just lost his job in the city, to her old school-friend Linnet Ridgeway in hope that Linnet might help to get him a job. Within weeks of the introduction, Linnet, a rich and achingly beautiful American heiress, has however seduced Simon and married him herself. On Simon and Linnet's honeymoon cruise down the Nile three months later, Jacqueline appears seeking revenge. The next morning Linnet is found dead - shot through the head in her sleep. Jacqueline naturally becomes the head suspect in the case, but she turns out to have a water-tight alibi for the time of the murder. Belgian detective Hercule Poirot, who is also a passenger aboard the cruise, is about to uncover a murder so carefully planned that even he must admit that the murderer has thought of everything. That is, everything except one thing: Hercule Poirot.—Anonymous"], "genres": "N/A", "imdbID": "0406516", "rating": 8.0, "votes": 4417, "number_of_episodes": 70}