{"cast": {"0837064": "David Suchet", "0129160": "Jonathan Cake", "0230155": "Megan Dodds", "0587234": "Sarah Miles", "0002081": "Edward Fox", "1112097": "Claire Price", "0000771": "Lysette Anthony", "0313702": "Tom Georgeson", "0362570": "Edward Hardwicke", "1521372": "Caroline Martin", "1164098": "Jamie de Courcey", "0847912": "Ian Talbot", "0192805": "Angela Curran", "0108939": "Lucy Briers", "0710765": "Dale Rapley", "0161409": "Teresa Churcher", "1614799": "Harriet Cobbold", "1603446": "Andrew Watson", "0414580": "Paula Jacobs"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["93"],  "plot": ["Poirot stumbles on the murder scene of philandering Dr Christow in a country house as his wife stands next to him with a revolver in her hand.", "While spending the weekend at his cottage outside London, Hercule Poirot is invited to dinner by Sir Henry and Lady Angkatell. Leaving immediately after dinner, he returns the next day to find that a weekend guest, John Christo, has been shot dead. There is any number of suspects: his former lover, Veronica Cray whom he had not seen for 12 years but suddenly turned up at a nearby cottage; his wife, Gerda who was deeply hurt by his womanizing; his current mistress Henrietta Savernake; Midge Hardcastle, who was very much in love with him, but whom he constantly ignored; and Edward Angkatell, who was in love with Midge. What Poirot finds however is that the evidence equally implicates everyone just a little too equally for it all to be just by chance.—garykmcd", "Hercule Poirot is at his country cottage, his escape from London on the weekends. He is invited to dinner at the nearby mansion of Sir Henry and Lady Lucy Angkatell. Also present are Gerda Christow, Henrietta Saverrnake, Edward Angkatell and Midge Hardcastle - all related in some way to at least one of the Angkatells - and John Christow, Gerda's husband. Henrietta is secretly having an affair with John and John is looking for a good time to tell his wife. After the dinner a woman appears to ask for matches. She is Veronica Clay, a neighbour and famous actress, and someone who was engaged to John Christow 12 years earlier. The next day, John is found murdered, shot to death, with his wife standing over him with a revolver in her hand. She is the obvious suspect, but things aren't that cut and dried.—grantss", "Detective Hercule Poirot expects to enjoy a quiet weekend in his country cottage when he becomes involved in a murder at the neighboring manor house, The Hollow. Various members of Sir Henry and Lady Lucy Angatell's extended family are down for a weekend when past love affairs, and thwarted ones, lead to violence.—Ron Kerrigan <mvg@whidbey.com>"], "genres": "N/A", "imdbID": "0393602", "rating": 7.7, "votes": 2744, "number_of_episodes": 70}