{"cast": {"0001212": "Joseph Fiennes", "0158626": "John Cho", "0202603": "Jack Davenport", "0461149": "Zachary Knighton", "0514228": "Peyton List", "0639928": "Brían F. O'Byrne", "0005524": "Courtney B. Vance", "0907427": "Sonya Walger", "2147876": "Christine Woods", "0013037": "Shohreh Aghdashloo", "0949810": "Lee Thompson Young", "0005551": "Lynn Whitfield", "0085413": "Marina Black", "0557219": "Michael Massee", "0001688": "Alan Ruck", "0201574": "Lisa Darr", "0918633": "Stephnie Weir", "3186285": "Lennon Wynn", "2462217": "Ryan Wynott", "3005555": "Marquessa Moreland", "2395944": "Sufe Bradshaw", "3272464": "Curtis Harris", "2500832": "Piper Mackenzie Harris", "3026577": "Lucky Davis", "2855622": "Taylor Geare", "3622254": "Tiffany Shinn", "3299591": "Robbie Tucker", "3716391": "Rick L. Dean", "1298809": "Genevieve Padalecki", "2899598": "Jarrod Robbins", "2397483": "Jacob Taylor"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["47"],  "plot": ["FBI's LA office has a head start on investigating the flashforward with Mark's vision and by opening a web site. At least one man didn't black out. Mark's wife meets the man from her vision. A clue brings Mark to Utah.", "The FBI begin to acquire vital clues about the blackout. The web site they've established leads them to Utah and eventually to the conclusion that there were at at least two people awake during the blackout. Mark Benford is more convinced than ever that his wife Olivia's vision, that she will take up with another man, is inevitable after she meets the man, Lloyd Simcoe, while treating his son at the hospital. Olivia insists that she will never love anyone but him but Mark's attitude may turn the vision into a self-fulfilling prophecy. Demetri Noh gets more information about his own fate. Mark learns some frightening information from his daughter Charlie about her blackout vision.—garykmcd", "After discovering someone who did not black out with the rest of the world, the FBI discovers there may be others that were, also, not affected by the incident. This leads Mark and his partner to Utah in an effort to track someone else down. Meanwhile, Mark's wife, Olivia meets the man from her vision and their daughter's teacher seems concerned when the young girl refuses to play with the other children. This only leads to more bizarre events when the girl seems to know the son of the man from Olivia's vision.—Moviedude1"], "genres": "N/A", "imdbID": "1480389", "rating": 7.8, "votes": 867, "number_of_episodes": 23}