{"cast": {"0000457": "John Hurt"}, "geners": ["Documentary"], "runtimes": ["51"],  "plot": ["In the vast icy wastes of the Arctic very little grows. It's dark for months in the winter and the freezing temperatures make it particularly inhospitable. Yet four million people live there thanks to ingenious survival techniques passed down through generations. In Greenland, where food is hard to come by and dogs are a crucial means of transport, Amos and his son Karl-Frederik embark on a remarkable journey across the frozen sea. They then fish for the giant Greenland shark by drilling a hole through the ice. This is food that will keep their precious dogs going for months. As winter gives way to spring the Inuit, of Canada, take advantage of an opportunity that only comes with the most extreme tides of the year. When the tide recedes hunters venture underneath the sea ice, where they have just minutes to gather a bounty of seafood from the ocean floor before the water returns. The elusive narwhal is an unexpected source of vitamin C for the Inuit of Northern Greenland, whose land grows few plants. Using traditional hunting techniques passed down through many generations it is still a perilous task - carried out on the very edges of the sea-ice. Early and unexpected springtime melting of the ice adds yet more danger. Another source of food comes from the millions of little Auks that flock along the coastal cliffs to breed. Oshima captures the birds with nets on the end of a long pole. They are then sewn inside sealskins and buried under the ice as food for the lean months ahead. For the residents of Churchill in northern Manitoba coexistence with one of nature's greatest predators is tricky. Each autumn the town is invaded by polar bears migrating back onto the ice, and it's Bob Windsor's job to keep both the townspeople and the polar bears safe. Behind the lens joins a particularly dangerous narwhal hunt which is carried out on the edge of the sea ice at the height of the warmest springtime ever.—Anonymous", "Although the barren Artic regions are most inhospitable, natives cultures, often (semi-)nomadic tribes, have adapted such as the Inuit and some Indians in North America and Greenland, Siberians, the Lapp in Finno-Scandinavia. Agriculture is impossible, but special techniques allow fishing and hunting. Perfectly adapted species serve as multi-functional prey or flock, draught-animal for sleds and inspiration.—KGF Vissers"], "genres": "N/A", "imdbID": "1819939", "rating": 8.7, "votes": 455, "number_of_episodes": 8}