{"cast": {"0004802": "Linda Cardellini", "0197855": "John Francis Daley", "0290556": "James Franco", "0505949": "Samm Levine", "0736622": "Seth Rogen", "0781981": "Jason Segel", "0771414": "Martin Starr", "0048250": "Becky Ann Baker", "0280886": "Joe Flaherty", "0005311": "Busy Philipps", "0005182": "Leslie Mann", "0020405": "Dave Allen", "0160004": "Claudia Christian", "0503140": "Chauncey Leopardi", "0819005": "Doug Spinuzza", "0353247": "Sarah Hagan", "0263881": "Kayla Ewell", "0305272": "JoAnna Garcia Swisher", "0823871": "Mark Allan Staubach", "0582202": "Jerry Messing", "0052446": "Steve Bannos", "0587323": "Peggy Miley", "0367228": "Charlie Hartsock", "0748873": "Ruth Rudnick", "1071252": "Alexander Gould", "0515226": "Ben Livingston", "0367245": "Brian Hartt", "0487099": "Jason Lansing", "2452260": "Jane Bordeaux", "2023977": "Forest Michael James Robin", "1516329": "Jerome Elston Scott", "0063985": "Michael Beardsley", "1363060": "Camille Bennett", "1368825": "Jodi Fleisher", "0934695": "Cynthia Windham"}, "geners": ["Comedy", "Drama"], "runtimes": ["44"],  "plot": ["When Bill talks about being allergic to peanuts in class, Alan tries to prove he's lying but Bill ends up in the hospital after an allergic reaction. Lindsay smokes weed for the first time.", "Ingesting. A new teacher draws Bill out: he admits to a peanut allergy, so Alan sneaks a few into Bill's sandwich to see if Bill's lying. Will he die? Bill's mother blames herself, Alan's father is furious, Sam and Neal find humor and romance beneath the tragedy. Meanwhile, Lindsay calls Nick out on his constant marijuana use, so he challenges her to get high. Experimentation, a babysitting job, and Millie's friendship teach a life lesson that Lindsay may or may not remember in the morning. And what about the weekend sci-fi convention?—<jhailey@hotmail.com>", "Lindsay smokes marijuana for the first time. Moments later, her father reminds her that she had promised to babysit for neighbors that night. Afraid to babysit by herself, she pleads Millie to babysit with her. Millie not only takes care of the child they are babysitting, but also takes care of Lindsay while she anxiously deals with the effects of smoking pot. The geeks are embarrassed in front of their peers when Bill reveals their allergies and ailments to Ms. Foote. Not believing that Bill is actually deathly allergic to peanuts, Alan puts peanuts into Bill's sandwich. After Bill eats one bite of the sandwich, Alan realizes that Bill was telling the truth and Bill is rushed to the hospital.—Jwelch5742"], "genres": "N/A", "imdbID": "0582671", "rating": 9.0, "votes": 2127, "number_of_episodes": 18}