{"cast": {"0004802": "Linda Cardellini", "0197855": "John Francis Daley", "0290556": "James Franco", "0505949": "Samm Levine", "0736622": "Seth Rogen", "0781981": "Jason Segel", "0771414": "Martin Starr", "0048250": "Becky Ann Baker", "0280886": "Joe Flaherty", "0005311": "Busy Philipps", "0001855": "Tom Wilson", "0020405": "Dave Allen", "0052446": "Steve Bannos", "0919169": "Shaun Weiss", "0503140": "Chauncey Leopardi", "0578184": "Natasha Melnick", "0353247": "Sarah Hagan", "0791991": "Stephen Lea Sheppard", "0135221": "Lizzy Caplan", "0507531": "Mary Margaret Lewis", "0441814": "Omri Katz", "0236946": "Judith Drake", "0332443": "Marco Gould", "0800885": "Alan Simpson", "0169700": "Renee Cohen", "0063985": "Michael Beardsley", "1516329": "Jerome Elston Scott", "1100252": "Shawn Soong"}, "geners": ["Comedy", "Drama"], "runtimes": ["45"],  "plot": ["Daniel cons Lindsay into helping him pass an algebra test, while Sam and his pals try to figure out the basics of human sexuality.", "Lindsay volunteers to help Daniel pass a do-or-die algebra test; after he flakes out on the studying, he figures out how to get her to help him cheat. Sam, meanwhile, is clueless in his sex ed class, so Daniel loans him a porn video that further confuses and dismays the geeks.—<jhailey@hotmail.com>", "When Mr. Kowchevski threatens to force Daniel to repeat algebra for another year if he doesn't pass an upcoming test, Lindsay offers to help him study for it. Instead, Lindsay finds herself helping Daniel to cheat after Daniel manages to steal a test from the teacher's office and he asks Lindsay to help him fill in the answers. Mr. Kowchevski, suspicious of Daniel's surprisingly high grade, accuses the duo of cheating. When Lindsay becomes unsure of what to do, Daniel tells her they should deny everything. Sam begins sex education class and Daniel tries to help Sam with questions he has by giving him a pornographic film. After viewing it, he is even more confused.—Jwelch5742"], "genres": "N/A", "imdbID": "0582681", "rating": 8.7, "votes": 2198, "number_of_episodes": 18}