{"cast": {"0004802": "Linda Cardellini", "0197855": "John Francis Daley", "0290556": "James Franco", "0505949": "Samm Levine", "0736622": "Seth Rogen", "0781981": "Jason Segel", "0771414": "Martin Starr", "0048250": "Becky Ann Baker", "0280886": "Joe Flaherty", "0020405": "Dave Allen", "0004936": "Ben Foster", "0503140": "Chauncey Leopardi", "0001855": "Tom Wilson", "0052446": "Steve Bannos", "0113158": "Brianna Brown", "0135221": "Lizzy Caplan", "0004807": "Gabriel Carpenter", "1544211": "David Gangler", "0332443": "Marco Gould", "0353247": "Sarah Hagan", "0173528": "Anna Coman-Hidy", "0389774": "Stacy Hogue", "0487099": "Jason Lansing", "0502044": "Jarrett Lennon", "0504516": "Ron Lester", "0578184": "Natasha Melnick", "0694368": "Ashley Power Garner", "0005311": "Busy Philipps", "0800885": "Alan Simpson", "0791991": "Stephen Lea Sheppard", "0823871": "Mark Allan Staubach", "0919169": "Shaun Weiss", "0943127": "Kristy Wu", "2107598": "Tammy Blue", "4046484": "Paul McMichael", "0836442": "Colleen Pelletier", "1026414": "Dayna Price", "1516329": "Jerome Elston Scott", "3076698": "Nicki Sixteen", "1100252": "Shawn Soong"}, "geners": ["Comedy", "Drama"], "runtimes": ["48"],  "plot": ["In 1980, a group of high school students face various social struggles. Wealthy \"brain\" Lindsay wants to rebel. Her geeky freshman brother Sam and his two friends are targeted by a bully.", "After the death of her grandmother, high school junior Lindsay Weir, up to now the perfect student, discovers existential rebellion, at least a bit. She wears her dad's old jacket, refuses to join the academic decathlon team, and starts hanging around the school freaks. She remains good hearted and stands up to some boys teasing a mentally-challenged student, but when that goes awry and she's caught cutting class with one of the freaks, she mopes. Meanwhile, her freshman brother Sam, one of several school geeks, is being picked on mercilessly by Alan. Can Sam convince his friends to face the bully with him? The homecoming dance brings some resolution.—<jhailey@hotmail.com>", "A group of high school students in 1980 faces various social struggles. Lindsay Weir rebels and begins hanging out with a crowd of burnouts, courtesy of an invitation from Daniel Desario. Her affiliation with this gang of freaks and her quitting the mathletes worries her family and her friend Millie. Her depression started after her attempt to stop the teasing of a special education student goes terribly wrong and ends in him being injured. Meanwhile, freshman Sam Weir struggles to find the courage not only to confront his and his friends' bully Alan, but also to ask cheerleader Cindy Sanders to the homecoming dance.—Jwelch5742"], "genres": "N/A", "imdbID": "0582679", "rating": 8.6, "votes": 2987, "number_of_episodes": 18}