{"cast": {"0004802": "Linda Cardellini", "0197855": "John Francis Daley", "0290556": "James Franco", "0505949": "Samm Levine", "0736622": "Seth Rogen", "0781981": "Jason Segel", "0771414": "Martin Starr", "0048250": "Becky Ann Baker", "0280886": "Joe Flaherty", "0005311": "Busy Philipps", "0573481": "Sam McMurray", "0004795": "Jessica Campbell", "0032628": "Amy Aquino", "0100762": "David Bowe", "0806982": "Tava Smiley", "0428396": "Jody Jones", "0606623": "Jane Morris", "2219163": "Ben Hecht", "0063985": "Michael Beardsley", "0496796": "Alycia Lee", "1516329": "Jerome Elston Scott", "1100252": "Shawn Soong", "0934695": "Cynthia Windham"}, "geners": ["Comedy", "Drama"], "runtimes": ["45"],  "plot": ["Neal learns his father is cheating on his mother. Ken develops a crush on the tuba player in the school's marching band and Lindsay helps set them up.", "Attractions between the sexes. At a mall, Sam sees Neal's father with another woman. Bill says they have to tell Neal - no secrets. Neal's father claims innocence. Sam begins to doubt all adult relationships, including his parents'. The freaks plan a night at Laserdome. Kim objects because that's where Daniel made out with another girl after one of their quarrels. Lindsay and Nick are sorting out the aftermath of their breakup, with Daniel advising Nick and Kim advising Lindsay. Ken trades insults with Amy, a tuba player in the band, and finds he's attracted to her. Daniel advises him, too, and Lindsay is willing to be the intermediary for Laserdome night. What about Neal?—<jhailey@hotmail.com>", "Sam and Bill both admire Neal's father until Sam accidentally sees Mr. Schweiber hugging a strange woman. Fearing that Mr. Schweiber may be cheating on Mrs. Schweiber, Sam tells Bill and then Neal. Soon after, Neal finds an unfamiliar garage door remote control in his father's car. The three friends start hunting around the neighborhood on their bicycles, searching for the garage door the remote control belongs to. Meanwhile, Ken reveals his first crush to be on a girl named Amy who plays the tuba in McKinley's marching band. The freaks, along with Amy, go to the local laser dome to see a Pink Floyd laser show, but mistakenly arrive on southern rock night.—Jwelch5742"], "genres": "N/A", "imdbID": "0582683", "rating": 8.8, "votes": 1981, "number_of_episodes": 18}