{"cast": {"0004802": "Linda Cardellini", "0197855": "John Francis Daley", "0290556": "James Franco", "0505949": "Samm Levine", "0736622": "Seth Rogen", "0781981": "Jason Segel", "0771414": "Martin Starr", "0048250": "Becky Ann Baker", "0280886": "Joe Flaherty", "0005311": "Busy Philipps", "0020405": "Dave Allen", "0919169": "Shaun Weiss", "0578184": "Natasha Melnick", "0353247": "Sarah Hagan", "0052446": "Steve Bannos", "0791991": "Stephen Lea Sheppard", "0823871": "Mark Allan Staubach", "0184445": "Allen Covert", "0332443": "Marco Gould", "0086515": "Clement Blake", "0087504": "Kenny Blank", "0071726": "Douglas Bennett", "0135221": "Lizzy Caplan", "2168649": "Laura Bottrell", "2838474": "Sterling Silva", "2476789": "Stephen Brennan", "1393584": "Sebastian Feldman", "0749225": "Kevin Ruf", "1516329": "Jerome Elston Scott", "1563827": "Brett Shady", "1100252": "Shawn Soong", "0820734": "Seth St. Laurent", "6720190": "Chuck Terrell"}, "geners": ["Comedy", "Drama"], "runtimes": ["45"],  "plot": ["When Mr. and Mrs. Weir go out of town for the weekend, Lindsay hosts a keg party. Sam, Bill, and Neal are worried that the party-goers will get too rowdy, so they substitute a keg of non-alcoholic beer for the one the freaks have on ice.", "When her parents go away for the weekend, Lindsay is in charge of her house, and Daniel convinces her to host a keg party. She likes him and can't say no. Sam fears the party-goers will trash the house, getting him in trouble, so he, Neal, and Bill substitute non-alcoholic beer for the freaks' keg. As the party unfolds, Sam removes all the glass objects, Neal seeks a way to be Lindsay's knight in shining armor, and Bill samples the real beer. Cindy shows up to dazzle Sam, Millie comes to keep her eye on Lindsay, and Kim throws a wrench in Lindsay's hopes with Daniel. When the revelers find money to get another keg, Lindsay knows she's sunk. Is big trouble inevitable?—<jhailey@hotmail.com>", "When the Weir parents go out of town for the weekend, Lindsay's new friends suggest she throw a party. Lindsay hesitantly agrees in the hopes of impressing Daniel, who has broken up with Kim. She asks Sam not to tell their parents and he agrees, though the thought of serving beer at a party worries him after going to a school assembly focusing on alcohol-related deaths. When Sam discusses the matter with his friends Neal and Bill, Bill suggests that they switch the real beer with non-alcoholic beer. Despite the fake beer, the rowdy teenagers begin to think they are drunk and Lindsay soon finds herself having a terrible time when she sees that Daniel is back with Kim.—Jwelch5742"], "genres": "N/A", "imdbID": "0582669", "rating": 8.5, "votes": 2451, "number_of_episodes": 18}