{"cast": {"0857620": "Justin Theroux", "0000312": "Amy Brenneman", "0001172": "Christopher Eccleston", "0000239": "Liv Tyler", "3024712": "Chris Zylka", "4960279": "Margaret Qualley", "4689420": "Carrie Coon", "2007030": "Emily Meade", "2581729": "Amanda Warren", "0235652": "Ann Dowd", "0309461": "Michael Gaston", "3083571": "Max Carver", "3083350": "Charlie Carver", "2859792": "Annie Q. Riegel", "0500894": "Brad Leland", "0430667": "Paterson Joseph", "6604189": "Piper Birney", "0000916": "Peter Berg", "0064438": "Sydni Beaudoin", "0193160": "Catherine Curtin", "0246044": "Michael Eric Dyson", "4010137": "Jim C. Ferris", "4373174": "Jack Ferry", "2974069": "Danny Flaherty", "1932619": "Natalie Gold", "1320715": "Frank Harts", "2013789": "Casey Jordan", "2772701": "Bill Heck", "0401091": "Marceline Hugot", "0405079": "Edward James Hyland", "6604190": "Dana Iannuzzi", "3860305": "Lola Kirke", "0480775": "Adam LeFevre", "4028956": "Pedro Saint Morillo", "0623085": "Andrea Navedo", "1024952": "Michael Nostrand", "1501384": "Jake Robinson", "5064707": "Christina Saragaglia", "1074382": "John Sierros", "6604191": "Emily Soell", "5209988": "Noah Unger", "4979414": "Madison Zamor", "7283792": "Daniel Alain Birch", "6549862": "Lyndsey Bloise", "9050053": "Linwood Brown", "2554251": "Dean Curtis", "5964696": "Rita Duran", "4863188": "Marcos A. Gonzalez", "5459103": "Heather Connolly Granger", "4691414": "Daniel Grote", "9450635": "Michael I. Haber", "4296997": "Cal Koury", "4948970": "Kevin Mui", "2360853": "Chris Nuñez", "6071249": "Rajeev Pahuja", "8672385": "Laura Rothschild", "5889216": "Stuart Schnitzer"}, "geners": ["Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["69"],  "plot": ["The police chief faces struggles in both his personal and professional life, as the third anniversary of the departure approaches.", "Three years after millions of people - some 2% of the world's population - have vanished into thin air, residents of Mapleton, NY weigh the pros and cons of a \"Heroes Day\" tribute to the local \"Departed.\" Attempting to maintain a sense of normalcy in his strained community, police chief Kevin Garvey faces additional challenges at home with his daughter, Jill, who's lost in a cloud of apathy with her friend Aimee, and son, Tom, who has gravitated to a cult led by the charismatic Holy Wayne. Also of concern is a silent, white-clad group of chain-smoking men and women called the Guilty Remnant, who team up in pairs to stake out people and places around town. As tension in Mapleton escalates, the lives of Laurie, an unexpected member of the Guilty Remnant, and Meg, a recently engaged young woman, converge.—Jiilo_Kim", "Three years ago on October 14, 2% of the world's population - some 160 million people - simply vanished into thin air. No one knows exactly what happened. Some think it's the rapture others just have no explanation. Those left behind all feel a sense of loss. In the small town of Mapleton, pretty well everyone knows someone who disappeared. As the third anniversary of the disappearances approaches, Chief of Police Kevin Garvey disagrees with Mayor Lucy Warberton's plan to hold a parade and a memorial service. He is particularly concerned that a local cult, the Guilty Remnant who dress in white and have taken a vow silence, may disrupt the proceedings. He also has to deal with his own emotions as do his two children.—garykmcd", "3 years after the sudden departure, Kevin prepares for disaster as the first Heroes Day is celebrated in Mapleton, New York; Jill acts out at school and goes to a classmate's party with Aimee; Laurie and Gladys watch Meg; Tom drives a congressman to see Wayne, who tasks him with protecting Christine; Kevin tries to do his job when a runaway dog is murdered in front of him.—chingeeflingee"], "genres": "N/A", "imdbID": "3203968", "rating": 7.9, "votes": 7670, "number_of_episodes": 28}