{"cast": {"0857620": "Justin Theroux", "0000312": "Amy Brenneman", "0001172": "Christopher Eccleston", "0000239": "Liv Tyler", "3024712": "Chris Zylka", "4960279": "Margaret Qualley", "4689420": "Carrie Coon", "2007030": "Emily Meade", "2581729": "Amanda Warren", "0235652": "Ann Dowd", "0309461": "Michael Gaston", "3083571": "Max Carver", "3083350": "Charlie Carver", "2859792": "Annie Q. Riegel", "0001277": "Scott Glenn", "0430667": "Paterson Joseph", "3818969": "David Turner", "0931879": "Victor Williams", "3129464": "George Aloi", "0000916": "Peter Berg", "1794016": "Brendan Burke", "0223694": "Toni Di Buono", "0227196": "Anthony DiMaria", "3903200": "J.J. Dunlap", "0242595": "Ian Campbell Dunn", "3205673": "Tracy Friedman", "0350017": "Susanna Guzman", "1763493": "Travis Hammer", "1320715": "Frank Harts", "2772701": "Bill Heck", "0401091": "Marceline Hugot", "0404086": "Patrick Husted", "2123203": "Kyle Mattocks", "4948970": "Kevin Mui", "2343064": "Angel Pai", "0725975": "Frank Ridley", "0795780": "Mary Shultz", "0827735": "Jenna Stern", "6604191": "Emily Soell", "3819620": "Mikal Vega", "0921550": "Gary Werntz", "4747667": "Linn Yen", "1250650": "Ruth Barrie", "5889216": "Stuart Schnitzer"}, "geners": ["Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["55"],  "plot": ["Kevin goes to see a therapist, after he has some unsettling encounters. Meg makes a decision about her future. Tom and Christine are left in a dicey situation. Jill and Aimee are interested as to where Nora is.", "In the wake of a series of disturbing encounters, Kevin pays a visit to a therapist. Tom finds himself in a precarious situation with Christine, a favorite of Wayne's. A frustrated Meg is asked to part with pieces of her past. Jill and Aimee tail Nora Durst, who became a local celebrity when her entire family disappeared in the Departure.—Jiilo_Kim", "Federal officers raid Holy Wayne's ranch seemingly intent on shooting first and asking questions later. Tom Garvey rescues Christine, the woman Wayne told him to stay away from and delivers her to him. Kevin is seeing a therapist who seems to question his account of shooting the dogs. The truck supposedly owned by the shooter shows up in Kevin's driveway. Kevin speaks to Meg Abbott but she says she's with the GRs of her own volition. Her fiancé doesn't react as Kevin expected. Nora Durst, whose husband and children are among those who vanished, is acting strangely leading Aimee and Jill to follow her.—garykmcd", "Kevin is under investigation and visits his father as his mental stability seems to be in question; Meg struggles through her orientation at the GR with Laurie; Jill and Aimee spy on Nora; Tom and Christine narrowly escape an FBI raid and Wayne orders Tom to stay cautious on the road ahead; Kevin investigates Meg's appearance at the GR.—chingeeflingee"], "genres": "N/A", "imdbID": "3603056", "rating": 7.4, "votes": 6284, "number_of_episodes": 28}