{"cast": {"0121895": "Tom Burke", "3310211": "Rose Leslie", "1108312": "Anca Androne", "4963600": "Ed Birch", "1571439": "Trystan Gravelle", "0570570": "Tim McInnerny", "0870722": "Kevin Trainor", "0939619": "Clive Wood", "2604679": "William Belchambers", "3767750": "Vincenzo Ferrara", "5790745": "Aine Garvey", "1452416": "Sutara Gayle", "0692139": "Ian Porter", "5017041": "Mason Rooney", "6618638": "Harley Rooney", "1525341": "Velile Tshabalala", "3307735": "Michael Yare", "1508111": "Jordan Metcalfe", "8619189": "Nigel Black", "5921715": "Solomon Mousley", "5636825": "Nig Richards", "1729422": "Bruno Vespa", "4716838": "Patricia Winker"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["52"],  "plot": ["1974, England - Scientist Philip Carvel has a fateful meeting with a young woman, Milner, bonding over a shared ideology their influence on each other will lead to the creation of a virus - their solution to the world's over-population.", "1974:- In an England beset by strikes and shortages young scientist Philip Carvel is father to the seriously reticent toddler Pietre - who will one day become Arby - and conducts a macabre experiment with a pet rabbit in an unsuccessful attempt to get a response from the child. At a thinkers' convention Philip meets a young woman called Milner, who is impressed by his view that the world is over-populated and who introduces him to an influential group who encourage him to create Janus, a virus which will suppress procreation. He begins manufacture but is appalled when Milner and her assistant kill the co-workers to ensure their silence, along with Milner's mentally dependant husband Tom. At the same time his wife dies giving birth to Jessica. Five years later Milner and the assistant are desperate for Philip to give them the formula, in the process killing politicians to whom he has turned for help and influencing the general election. Told that Jessica will be tortured if he fails to cooperate Philip hides the virus inside her and sends her to safety whilst retreating to a psychiatric hospital.—don @ minifie-1"], "genres": "N/A", "imdbID": "3371724", "rating": 9.1, "votes": 1623, "number_of_episodes": 12}