{"cast": {"2253821": "Adeel Akhtar", "0383467": "Paul Higgins", "0556453": "Neil Maskell", "0642605": "Fiona O'Shaughnessy", "0677944": "Alistair Petrie", "3789989": "Alexandra Roach", "2805533": "Nathan Stewart-Jarrett", "4359366": "Oliver Woollford", "0253126": "Kevin Eldon", "0416524": "Geraldine James", "0494649": "Sylvestra Le Touzel", "0540585": "Michael Maloney", "0001519": "Ian McDiarmid", "0713961": "Paul Ready", "0179680": "Allan Corduner", "5177929": "Pixie Davies", "3760477": "Leemore Marrett Jr.", "1854269": "Diane Morgan", "1456647": "Gerard Monaco", "5921715": "Solomon Mousley", "0703629": "David Quilter", "7409518": "Craig Thomas Lambert", "0824868": "Matthew Steer"}, "geners": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["3 months after the destruction of the manuscript, things have been quiet for Ian, Becky and Grant. Believing the Network to be finished, they each try to resume some semblance of normality, but the Network's plan is only just beginning.", "Jessica is the prisoner of Milner - the real Mr Rabbit - who tells her that a sample of Janus has been extracted from her but she needs to know any adjustment made by Philip. Arby is hoping for a quiet life with his new girlfriend and is shocked when Lee, whom he had presumed dead, turns up to say they have to kill scientist Christian Donaldson, the man who supplies Becky with the drugs she needs to control her Deals disease and who introduces her to elderly mystic Anton, who speaks no English but seems to understand Deel's. Ian, having told his boss Joe of his recent ordeal, meets up with Grant, Becky and Donaldson but when Arby arrives he refuses to kill Donaldson and the group go on the run. Nor is Wilson dead but willing to serve Milner whilst the health department has taken over Corvadt, with Dugdale as its puppet CEO. A new vaccine has been marketed to combat the recent Russian flu outbreak and Geoff is shocked when Milner tells him about V Day, a campaign to provide the vaccine to rich and poor alike.—don @ minifie-1"], "genres": "N/A", "imdbID": "3850852", "rating": 8.5, "votes": 1029, "number_of_episodes": 12}