{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0318821": "Aidan Gillen", "3229685": "Kit Harington", "0654295": "Alfie Allen", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0838910": "Donald Sumpter", "0384152": "Conleth Hill", "0181920": "James Cosmo", "0853583": "Owen Teale", "0001097": "Charles Dance", "0568400": "Ian McElhinney", "4263213": "John Bradley", "0891092": "Peter Vaughan", "0002103": "Julian Glover", "2167445": "Gethin Anthony", "0141582": "Dominic Carter", "1164730": "Natalia Tena", "2657974": "Esmé Bianco", "4440305": "Mark Stanley", "1086981": "Josef Altin", "4430828": "Luke Barnes", "3822505": "Amrita Acharia", "1861467": "Roxanne McKee", "1175468": "Elyes Gabel", "1502469": "Dar Salim", "1414435": "Robert Sterne", "0523047": "Simon Lowe", "1783582": "Sahara Knite", "1378721": "Graham Charles", "1987270": "Brian Fortune", "4475335": "Jeffrey O'Brien", "4475182": "Dennis McKeever", "4475303": "Phil Dixon", "4475204": "Tristan Mercieca", "0597388": "Jason Momoa"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["58"],  "plot": ["Robert has been injured while hunting and is dying. Jon and the others finally take their vows to the Night's Watch. A man, sent by Robert, is captured for trying to poison Daenerys. Furious, Drogo vows to attack the Seven Kingdoms.", "Ned confronts Cersei about her children but she dismisses his allegations. The head of the Lannister clan tells his son Jaime to be a leader and sends him to rescue Tyrion. Ros, the prostitute from Winterfell begins working for Littlefinger in King's Landing. At the wall, a riderless horse belonging to Jon Snow's uncle Benjen returns to the wall. Jon takes his vows as a Night's Watchman but is disappointed to not having been named a Ranger but Sam sees it differently. King Robert is injured while out boar hunting with his brother. He knows he will not survive and names Ned Lord Regent until Joffrey comes of age. Knowing that Joffrey is not Robert's son, he feels Robert's brother should succeed him but Littlefinger counsel's otherwise. A wine vendor tries to poison Daenerys and Drogo promises to put their son on the throne of the Seven Kingdoms.—garykmcd", "While hunting, King Robert is lethally wounded by a boar and designates Ned as Lord Regent until Joffre comes of age. Ned knows that Joffre is not son of Robert and believes that Robert's brother Stannis should be his successor. Meanwhile Jon Snow is assigned as steward of Alliser Thorne and not a ranger, and he is near to quit the Night's Watch; however Sam convinces him that he will be probably trained to be the next commander and Jon takes his vows. A wine merchant tries to poison Daenerys but Jorah saves her life. In gratitude, Drogo gives a horse to Jorah and promises the Iron Throne to his wife. Immediately after the death of Robert, Ned is summoned by King Joffrey.—Claudio Carvalho, Rio de Janeiro, Brazil", "In King's Landing, Ned confronts Cersei, saying he knows Jaime fathered her children and will inform King Robert. Before he can, Robert is critically wounded while hunting boar. As Robert lies dying, he signs a proclamation naming Ned \"Protector of the Realm,\" until Robert's heir can assume the throne. Ned amends the wording to say the king's rightful heir. Ned sends word to Stannis, Robert's brother, the legal heir to the throne. Ned asks Petyr Baelish to secure the City Watch's loyalty. After Robert's death, Ned confronts Cersei and Joffrey in the throne room, where Baelish and the City Watch betray Ned and attack his men. At the Wall, Benjen Stark disappears during a foray north of the Wall. Jon and Sam are assigned as stewards, with Jon as Lord Commander Jeor Mormont's personal servant. Jon is disappointed he was not chosen as a ranger until Sam points out that Commander Mormont likely intends to groom him for command. The stewards swear their loyalties to the Night's Watch. In Essos, King Robert's hired assassin is exposed by Ser Jorah before he can poison Daenerys. Drogo vows to conquer the Seven Kingdoms for his unborn son and starts marching towards Westeros.", "Explaining that the future of the Lannisters is at stake, Tywin presses Jaime to \"be the man you were meant to be\" as they prepare for battle. Ned confronts Cersei about the secrets that killed Jon Arryn. With the fate of the missing Benjen very much on his mind, Jon Snow takes his Night's Watch vows, though not with the assignment he coveted. After Ser Jorah saves Daenerys from treachery, an enraged Drogo vows to lead the Dothraki where they've never gone before. An injured Robert takes pains to ensure an orderly transition at King's Landing.—HBO Publicity"], "genres": "N/A", "imdbID": "1837863", "rating": 9.1, "votes": 43095, "number_of_episodes": 74}