{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0516003": "Harry Lloyd", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0534635": "Richard Madden", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0227759": "Peter Dinklage", "0838910": "Donald Sumpter", "0803397": "Jamie Sives", "0231871": "Ron Donachie", "1152798": "Joseph Mawle", "1861467": "Roxanne McKee", "1502469": "Dar Salim", "3822505": "Amrita Acharia", "4424689": "Sarita Piotrowski", "3330122": "Wilko Johnson", "4430905": "Rhodri Hosking", "4430828": "Luke Barnes", "0734498": "Lalor Roddy", "1406364": "Conor Delaney", "4422626": "Callum Wharry", "4048461": "Aimee Richardson", "0597388": "Jason Momoa", "7512462": "Frédéric André", "4207240": "Phil Barnhill", "4595425": "Boyd Rankin", "3169635": "Robert Render"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["56"],  "plot": ["While Bran recovers from his fall, Ned takes only his daughters to King's Landing. Jon Snow goes with his uncle Benjen to the Wall. Tyrion joins them.", "Although his son Bran is lying in bed unconscious from his fall, Ned Stark must return with King Robert to King's Landing. His wife Catelyn stays behind in Winterfell, though there appears to be little hope of Bran's recovery. The King has agreed that his son Joffrey and Ned's daughter Sansa should marry, uniting their families forever. Problems arise when Joffrey challenges the butcher's boy who is out playing with Sansa's younger sister Arya. Joffrey is injured when Arya's pet wolf attacks him. The King's justice is swift but fair even if his wife Cersei doesn't agree. Meanwhile, Ned illegitimate son heads north to join the Night Watch. Across the Narrow Sea, Daenerys is having some difficulty accommodating herself to married life. She turns to one of her servants, a slave whose job it once was to pleasure men, to learn how she could make her husband happy.—garykmcd", "In Winterfell, Catelyn stays in Bran's room with her son that is in coma while Ned Stark travels with King Robert to King's landing. An assassin tries to kill Bran, but Catelyn protects him and Bran's wolf kills the man. Arya is playing with the butcher's boy nearby the river and Joffrey and Sansa meet them and Joffrey picks fight with the boy that does not react. Arya throws Joffrey's sword in the river and he attacks the girl but her wolf protects Arya. Daenerys has difficulties to sexually satisfy Khal Drogo and her slave teaches her how to please her man. Jon Snow travels with his uncle Benjen to The Wall to join the Night Watch. Catelyn investigates the location where Brans felt and she finds a hair. Meanwhile Bran awakes from his coma.—Claudio Carvalho, Rio de Janeiro, Brazil", "King Robert and his chosen next hand reminisce further on the way back to King's Landing. Jamie isn't impressed by Cersei's fear that surviving Bran might betray her adultery, as the boy remains speechless at Winterfell, with only mother Cathlyn, who suspects Bran was pushed, and castle staff remaining. Preparing to leave for the Nightwatch with uncle Benjen Stark, Jon gives his brat half-sister Arya a specially made light sword to practice fencing with butcher boy Mycah. Joffrey, who was strolling with fiancee Sansa, planned to impress her by humiliating the commoner knave, but is knocked down by Arya, looses his cool and gets bitten by her wolf. Robert must pass judgment, Cersei demanding draconian punishments, Ned justice, Sansa forced to say she didn't witness all, only the cub is condemned, weakling Joffrey further belittled. Daenerys learns from a sex slave how to please and win respect from her husband, khal Drogo.—KGF Vissers", "Ned, the new Hand of the King, travels to King's Landing accompanied by his daughters, Sansa and Arya. Catelyn remains at Winterfell to care for the still unconscious Bran. An assassin attacks Bran, but Catelyn fends him off and Bran's direwolf, Summer, kills him. Catelyn suspects the Lannisters were behind the attack. Ned's illegitimate son, Jon, heads north with his uncle, Benjen Stark, to join the Night's Watch, the protectors of the Wall, a massive ice structure that keeps the Wildling tribes and the mythical White Walkers from civilized Westeros. Before departing, Jon gave tomboy Arya a thin sword she names, \"Needle.\" Queen Cersei's younger brother, Tyrion Lannister, a dwarf also known as \"The Imp,\" accompanies Jon to the Wall. Along the Kingsroad on their way towards King's Landing, Prince Joffrey threatens Arya's young commoner friend, later having him killed. Nymeria, Arya's direwolf, defends her, biting Joffrey. Cersei demands that Robert have the wolf killed, but Arya releases Nymeria to the wild. Sansa's direwolf, Lady, is killed instead. In Winterfell, Brandon awakens, remembering nothing about his fall. Meanwhile, Daenerys is befriended by Ser Jorah Mormont, a disgraced knight, while she focuses on learning how to please Drogo."], "genres": "N/A", "imdbID": "1668746", "rating": 8.6, "votes": 46006, "number_of_episodes": 74}