{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0516003": "Harry Lloyd", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0534635": "Richard Madden", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0227759": "Peter Dinklage", "0838910": "Donald Sumpter", "0803397": "Jamie Sives", "0231871": "Ron Donachie", "1152798": "Joseph Mawle", "0019885": "Roger Allam", "1502469": "Dar Salim", "2657974": "Esmé Bianco", "0114742": "Susan Brown", "0916037": "Bronson Webb", "0822062": "John Standing", "3209935": "Rob Ostlere", "0443825": "Dermot Keaney", "3280686": "Art Parkinson", "4422626": "Callum Wharry", "4048461": "Aimee Richardson", "3964231": "Kristian Nairn", "4422639": "Rania Zouari", "1613839": "Ian Whyte", "1872855": "Spencer Wilding", "4422708": "Claire Wright", "0597388": "Jason Momoa", "9188542": "Caroline Davis", "6265635": "Owen Dickey", "0242915": "Tommy Dunne", "4595425": "Boyd Rankin", "1369598": "Robert Yates"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["62"],  "plot": ["Lord Eddard Stark is concerned by news of a deserter from the Night's Watch; King Robert I Baratheon and the Lannisters arrive at Winterfell; the exiled Prince Viserys Targaryen forges a powerful new alliance.", "At the castle Winterfell, Lord Ned Stark begins to believe that something is amiss. A deserter from the Night Watch, the guardians of the giant ice wall at the northern boundary of their territory, says he's seen the white walkers. Later, Ned and his sons find animals slain in the woods, including a she-wolf whose six pups they keep, one for each of Ned's children. They also welcome the arrival of Ned's good friend King Robert who was once betrothed to Ned's sister. She was killed before they could marry and he wed Cersei Lannister who has given him a son, Joffrey. Along with them are Cersei's two brothers, the handsome Jaime and Tyrion, a dwarf with very large appetites. The King wants Ned to return with him to his capital, King's Landing, and become the King's Hand. Ned accepts but his young son Bran accidentally sees something he should not have and suffers a serious fall as a result. Meanwhile, in the land across the narrow sea, Viserys Targaryen needs an army to attack King's Landing and retake the throne that he believes is rightfully his. He arranges for his pretty sister Daenerys to marry warlord Khal Drogo.—garykmcd", "In the northern frontier of Winterfall, the warriors of the Night Watch patrol are searching for savages but out of the blue they are attacked by white walkers. One of them survives and deserts the Night Watch and is considered mad and decapitated by Lord Eddard 'Ned' Stark in accordance with their laws. Lord Stark also learns that his friend Jon Arryn, the Hand of the king, is dead and King Robert Baratheon, who is his friend, is traveling from the King's Landing to Winterfall to invite him to be his Hand of the King and travels with him to the capital. The King was betrothed to Lord Stark's sister but she died and he married Cersei Lannister, who has two brothers and a secret love affair. Meanwhile in the exile, the greedy Viserys Targaryen forces his sister Daenerys Targaryen to get married with the brutal warrior Khal Drogo since he needs an army to overthrow King Baratheon and take the power.—Claudio Carvalho, Rio de Janeiro, Brazil", "Lord Eddard 'Ned' Stark, governor of the North, prepares his castle Winterfell for a visit of the court of his youth friend Robert Baratheon, sovereign of the Seven Kingdoms, who will ask Ned to succeed his recently deceased mentor Jon Arryn, as Hand (royal prime minister), requiring him to move to the capital King's Landing in central realm Westeros, leaving his wife Catelyn and kids behind. Eddard personally beheads young Wildlands patrol deserter from his northern border's Night Watch, which Ned's bastard son Jon Snow is bound to join, dismissing his warnings that the ogres of 'winter' are returning to the wall. Jon gets the overseen extra pup of a hunt-killed shadow wolf after the five legitimate children -heir Rob and four siblings- are each allowed to keep one and care for it. Ned's shy daughter Sansa is about to be betrothed to Robert's immature firstborn Joffrey. Queen Cersei is accidentally making incestuous love to royal guard captain Jamie Lannister, champion knight and heir to the richest family, by Ned's youngest Bran, whom Jamie pushes down the high semi-ruin tower, yet survives. Meanwhile Drogo, the imposing 'khal' (war king) of the proud horseman people Dothraki, pledges his mounted army of 100,000 to help pretender Viserys Targaryen regain the Iron Throne which his mad father lost to Robert in exchange for the hand of his sister Daenerys, who feels practically raped by both.—KGF Vissers", "North of the Seven Kingdoms of Westeros, Night's Watch soldiers are attacked by supernatural White Walkers. One soldier escapes but is captured at Castle Winterfell. Eddard \"Ned\" Stark, Warden of the North, executes him for desertion. Later, six orphaned dire wolf pups are found and one given to each Stark sibling, including Ned's bastard son, Jon Snow. In King's Landing, the Seven Kingdoms capital, Jon Arryn, the Hand of the King, dies suddenly. King Robert Baratheon, Ned's old friend, travels to Winterfell to recruit Ned and propose a marriage between his heir Joffrey and Ned's daughter, Sansa. Lysa Arryn, Jon Arryn's widow, sends her sister (Ned's wife), Catelyn, a letter claiming the Lannisters, Queen Cersei's family, murdered Arryn. Catelyn believes the Lannisters are now plotting against King Robert. Ned's young son, Brandon, climbs a tall tower and witnesses Cersei and her twin brother, Jaime Lannister, inside having sex. To hide their incest, Jaime pushes Bran from the high window. Across the Narrow Sea in Essos, exiled Prince Viserys Targaryen forces his sister, Daenerys, to marry the Dothraki warlord, Drogo, in exchange for an army to conquer Westeros and reclaim the Iron Throne. The ancient Targaryens once commanded dragons, and Daenerys is given three fossilized dragon eggs as a wedding gift."], "genres": "N/A", "imdbID": "1480055", "rating": 8.9, "votes": 61089, "number_of_episodes": 74}