{"cast": {"0000293": "Sean Bean", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0318821": "Aidan Gillen", "3229685": "Kit Harington", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0227759": "Peter Dinklage", "0838910": "Donald Sumpter", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0181920": "James Cosmo", "0853583": "Owen Teale", "0231871": "Ron Donachie", "0001097": "Charles Dance", "0568400": "Ian McElhinney", "4263213": "John Bradley", "0002103": "Julian Glover", "1115654": "Miltos Yerolemou", "0225483": "Kate Dickie", "0141582": "Dominic Carter", "1164730": "Natalia Tena", "0114742": "Susan Brown", "0544139": "Clive Mantle", "4440305": "Mark Stanley", "1086981": "Josef Altin", "4430828": "Luke Barnes", "0428765": "Mark Lewis Jones", "0815420": "Mia Soteriou", "3822505": "Amrita Acharia", "1861467": "Roxanne McKee", "3964231": "Kristian Nairn", "1175468": "Elyes Gabel", "1502469": "Dar Salim", "1414435": "Robert Sterne", "0312245": "Ian Gelder", "2996220": "Lino Facioli", "3280686": "Art Parkinson", "0064155": "Ian Beattie", "4492930": "Simon Stewart", "0780321": "Matthew Scurfield", "0642751": "Frank O'Sullivan", "1987270": "Brian Fortune", "3292422": "Chris Gallagher", "4492916": "Rick Burn", "4164318": "Hugo Culverhouse", "0597388": "Jason Momoa", "5651524": "Mark Coney", "2162079": "Ivailo Dimitrov", "4475182": "Dennis McKeever", "4385245": "Tobias Winter"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["The Lannisters press their advantage over the Starks; Robb rallies his father's northern allies and heads south to war; The White Walkers attack the Wall; Tyrion returns to his father with some new friends.", "Joffrey has claimed the throne and he and is mother eliminate Ned Stark's supporters. Ned is imprisoned and Sansa remains engaged to Joffrey but Arya seems to have escaped. Cersei gets Sansa to write to her eldest brother Robb to ask him to swear loyalty to the new King. Robb agrees to go, but at the head of an army. Catelyn receives word of her husband's imprisonment and learns that her sister will not support her. Tyrion and Bronn encounter the Stone Crows and makes them an offer they can't refuse. At the wall Jon's wolf, Ghost, alerts him to trouble and it seems that the White Walkers have returned. Daenarys has trouble accepting the rape of new female slaves and when Drogo supports her, he is called out by one his men.—garykmcd", "The Lannister guards slaughter Stark guards and staff and take Sansa arrested. They try to capture Arya, but Syrio Forel defends her and she escapes but finds her sword Needle and beings with her. When a boy tries to grab her, she accidentally kills him. Varys visits Ned in the dungeon and gives water to him and updates him with the news. Sansa agrees to send a letter to Robb to protect her father. Jon is frustrated that he cannot join his brother in the imminent war. He saves Commander Mormont during the night when a monster tries to kill him. Tyrion and Bronn are under siege of hill tribes and the cunning dwarf negotiates with them and they travel together to the place where the Lannister army is camped. Khal Drogo and his warriors destroy a village to take people to sell as slave to finance his invasion of the Seven Kingdoms. Daenerys orders to stop killing and raping the villagers and one of the Drogo's men offends Daenerys and challenges Drogo to fight with him. Drogo is wounded on his chest and one of the women she saved that is a witch treats his wound. Robb has a meeting with the lords and consolidates his leadership. When his men capture a Lannister scout, Robb releases him and sends a message to Lord Tywin telling that he will fight against him. Tyrion meets his father with the hill tribes that join their army. Sansa begs to her father's life in the court and Joffrey says that he will not kill Ned if he confesses his treason and recognizes him as king.—Claudio Carvalho, Rio de Janeiro, Brazil", "Deposed Hand Ned learns in the dungeon from eunuch lord Varys that his rebellion to the enthronement on Robert's bastard Joffrey will cost him his head for high treason, and that Tyrion was lost as possible bargaining chip. The clever imp is in fact heading with Bronn through dangerous hill tribes country to join the Lannister army under clan head Tywin, which prepares to crush the Northern rebellion under Stark heir Robb, whose wolf's bite swings the mobilization of vassals. Jon isn't allowed to leave his life-long watch duty, saves Mormont from an undead White Walker attack at night and shares the mounting fear the 'winter' of monsters awakening may flood the wall. Traitor's daughter Sansa is dismissed as royal bride but allowed to prove her innocence by writing to Winterfell Robb must come pledge allegiance to the new boy king, who -with his meddling mother Cersei- bestows honors and offices but dismisses a loyal knight into 'retirement' on a windy border castle. The khal's mounted army atypically raids and pillages peasant villages to pay for ship passage north, but Drogo is now so excited by Daenerys that he successfully duels to the death the warrior who stands up against her denying them the right to rape harvested slave women. Arya escaped seizure by the golden guard, thanks to her valiant sword 'dance' teacher' Syrio Forel, and fatally stabs a servant boy \"in her way.\"—KGF Vissers", "Arya escapes the Red Keep after Syrio Forel, her Braavosian sword master, fends off guards sent to arrest her, while Sansa is captured. Robb hears the news and prepares the Northern armies to fight the Lannisters, leaving Bran behind to rule Winterfell. Lysa refuses to fight the Lannisters, and Catelyn leaves to join Robb's camp. Tyrion and Bronn are surrounded by Shagga, leader of the Stone Crows tribe. Tyrion convinces them to escort him to his father Tywin Lannister, who will pay them. At the camp, Tywin asks Shagga to help them confront the Starks in exchange for even greater payment. At the Wall, some bodies affected by the White Walkers are found. One awakens as a wight and attack Commander Mormont, but Jon kills it. In Essos, Drogo's soldiers begin attacking nearby settlements, enslaving locals in order to sell them to raise money to buy ships to cross the Narrow Sea. Drogo is wounded in a fight. Joffrey appoints his grandfather, Tywin, as Hand of the King. Sansa begs Joffrey to show Ned mercy. Joffrey agrees if Ned publicly recognizes Joffrey's claim to the throne and admits to committing treason."], "genres": "N/A", "imdbID": "1837864", "rating": 8.9, "votes": 40410, "number_of_episodes": 74}