{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0318821": "Aidan Gillen", "0516003": "Harry Lloyd", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "3652842": "Isaac Hempstead Wright", "0534635": "Richard Madden", "0322416": "Jack Gleeson", "0227759": "Peter Dinklage", "0384152": "Conleth Hill", "0181920": "James Cosmo", "0853583": "Owen Teale", "0803397": "Jamie Sives", "0568400": "Ian McElhinney", "0231871": "Ron Donachie", "1152798": "Joseph Mawle", "0535837": "Francis Magee", "0002103": "Julian Glover", "2167445": "Gethin Anthony", "0891092": "Peter Vaughan", "1115654": "Miltos Yerolemou", "0424191": "Margaret John", "0114742": "Susan Brown", "1414435": "Robert Sterne", "4440305": "Mark Stanley", "1086981": "Josef Altin", "4430828": "Luke Barnes", "1175468": "Elyes Gabel", "3822505": "Amrita Acharia", "1638294": "Eugene Simon", "1015968": "Paul Portelli", "2089809": "Nikovich Sammut", "4440118": "Seamus Kelly", "4440307": "Emily Diamond", "0597388": "Jason Momoa"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["58"],  "plot": ["Jon begins his training with the Night's Watch; Ned confronts his past and future at King's Landing; Daenerys finds herself at odds with Viserys.", "After the attempted assassination of young Bran, Catelyn leaves for King's Landing to see her husband, convinced that the Lannisters were behind the attempt. On arrival, she is met by a former beau, Petyr Baelish, who tells her that the knife used in the attack on Bran was his - until he lost it in a wager to Tyrion Lannister a year ago. When presented with the evidence, Ned isn't convinced. He's kept busy as the King's Hand and is shocked at King Robert's spendthrift ways. Cersei tells her son Joffrey that when he is King, he can do anything he wants. Across the Narrow Sea, Daenerys begins to act like a queen and has a confrontation with her brother who makes it clear that he is in charge. She also realizes she is pregnant. At the wall, Ned's illegitimate son Jon Snow undergoes training to become a member of the Night's Watch.—garykmcd", "Ned Stark arrives at the King's Landing and is summoned to attend a meeting of the small council and he learns that King Robert is bankrupted. The he meets Arya and explains the attitude of her sister that will marry Joffrey. Bran does not remember what happened to him and will never walk again. Catelyn travels to King's landing with Rodrik Cassel to show the dagger to her husband and she is protected by her old friend Petyr 'Littlefinger' Baelish that hides her in her brothel. Jon Snow uses his skills to train the Night's Watch. Daenerys uses sex to control and impose on Khal Drogo and his warriors. Catelyn and Ned Stark discover the name of the owner of the dagger used by the assassin.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ned attends the King's Small Council and learns Westeros has been poorly managed and is deeply in debt. Catelyn travels to King's Landing to covertly warn her husband about the assassination attempt, but she is intercepted by her childhood friend, Councillor Petyr \"Littlefinger\" Baelish. Bran learns he will never walk again and remains unable to remember the events leading to his fall. Jon struggles to adapt to life on the Wall. The once elite Night's Watch now recruits many low-born and/or convicted criminals who are unimpressed by Jon's bloodline. Lord Commander Mormont asks Tyrion to plead with the King to send more recruits to the Night's Watch. Daenerys, now pregnant, stands up to her brother, Viserys, threatening him if he ever abuses her again.", "Arriving at King's Landing after his long journey, Ned is shocked to learn of the Crown's profligacy from his new advisors. At Castle Black, Jon Snow impresses Tyrion at the expense of greener recruits. Suspicious that the Lannisters had a hand in Bran's fall, Catelyn covertly follows her husband to King's Landing, where she is intercepted by Petyr Baelish, aka \"Littlefinger,\" a shrewd longtime ally and brothel owner. Cersei and Jaime ponder the implications of Bran's recovery; Arya studies swordsmanship. On the road to Vaes Dothrak, Daenerys finds herself at odds with Viserys.—HBO Publicity"], "genres": "N/A", "imdbID": "1829962", "rating": 8.5, "votes": 43544, "number_of_episodes": 74}