{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0318821": "Aidan Gillen", "0516003": "Harry Lloyd", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0534635": "Richard Madden", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0227759": "Peter Dinklage", "0838910": "Donald Sumpter", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0853583": "Owen Teale", "0803397": "Jamie Sives", "0231871": "Ron Donachie", "0535837": "Francis Magee", "0568400": "Ian McElhinney", "0141582": "Dominic Carter", "0002103": "Julian Glover", "2167445": "Gethin Anthony", "2047170": "Emun Elliott", "0114742": "Susan Brown", "0424191": "Margaret John", "4263213": "John Bradley", "4440305": "Mark Stanley", "1086981": "Josef Altin", "4430828": "Luke Barnes", "1947403": "Conan Stevens", "3822505": "Amrita Acharia", "1861467": "Roxanne McKee", "3964231": "Kristian Nairn", "2131630": "Jefferson Hall", "1478079": "Joe Dempsie", "0928408": "Andrew Wilde", "4422626": "Callum Wharry", "4048461": "Aimee Richardson", "4450657": "Kevin Keenan", "3122423": "Patrick Ryan", "4416560": "Ryan McKenna", "3126053": "Susie Kelly", "0597388": "Jason Momoa", "1638294": "Eugene Simon"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["56"],  "plot": ["Eddard investigates Jon Arryn's murder. Jon befriends Samwell Tarly, a coward who has come to join the Night's Watch.", "Ned begins to look into the death of his predecessor and mentor John Arryn. He learns that Arryn was interested in a particular book and also visited a local blacksmith known for making quality arms. There he meets someone quite interesting. At the northern wall, Jon befriends Samwell Tarly an overweight, bumbling young man whose father gave him the choice of joining the Night's Watch or dying in a hunting 'accident'. Sam is the object of scorn from other trainees and their instructor. Jon makes it clear that no harm will come him. Sansa is still not speaking to her father after he was forced to kill her wolf. She is preparing to become Queen someday. Her sister Arya meanwhile is taking sword fighting lessons and sees herself as a knight. Across the Narrow Sea, Daenerys defends herself when her brother Vyseris slaps her making it very clear that she too can exercise some authority.—garykmcd", "Daenerys and Viserys Targaryen have an argument and Viserys hits his sister. However she reacts and tells him that he will lose his hands if he strikes her again. Tyrion Lannister visits Bran at Winterfell and has a cold reception by Robb Stark. The cynical dwarf gives the design of a special saddle for Bran so that he can ride again. The fat and coward Samwell Tarly joins the Night's Watch and is bullied by the other recruits, but Jon Snow protects him. In King's Landing, Ned investigates the death of Jon Arryn and discovers that he was reading a book. Littlefinger sits side by side with Sansa in the tournament and tells the story of two brothers to her. Catelyn and Rodrik Cassel are having lunch in a inn and they have an unexpected encounter with Tyrion.—Claudio Carvalho, Rio de Janeiro, Brazil", "While returning to King's Landing, Tyrion stops at Winterfell where he presents the Starks a saddle design that will allow the paraplegic Bran to ride a horse. Ned secretly investigates Jon Arryn's death. In the process, he discovers one of King Robert's illegitimate children, Gendry, an armorer. Robert and his guests attend a tournament honoring Ned, which Ned considers an extravagance. Jon takes measures to protect Samwell Tarly, an awkward and friendless Night's Watch recruit, from the other Watchmen's abuse. A frustrated Viserys clashes with his newly-empowered sister. Sansa dreams of one day becoming queen, while Arya envisions a far different future. At a roadside tavern, Catelyn, who is Lord Hoster Tully's daughter, unexpectedly encounters Tyrion Lannister. She rallies her father's Riverrun allies to arrest Tyrion for conspiring to murder her son.", "Ned looks to a book for clues to the death of his predecessor, and uncovers one of King Robert's bastards. Robert and his guests witness a tournament honoring Ned. Jon takes measures to protect Samwell from further abuse at Castle Black; a frustrated Viserys clashes with Daenerys in Vaes Dothrak; Sansa imagines her future as a queen, while Arya envisions a far different future. Catelyn rallies her husband's allies to make a point, while Tyrion finds himself caught in the wrong place at the wrong time.—HBO Publicity"], "genres": "N/A", "imdbID": "1829963", "rating": 8.6, "votes": 41464, "number_of_episodes": 74}