{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "0318821": "Aidan Gillen", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0227759": "Peter Dinklage", "0838910": "Donald Sumpter", "0384152": "Conleth Hill", "0803397": "Jamie Sives", "0231871": "Ron Donachie", "0283492": "Jerome Flynn", "0535837": "Francis Magee", "0568400": "Ian McElhinney", "0225483": "Kate Dickie", "0002103": "Julian Glover", "2167445": "Gethin Anthony", "0019885": "Roger Allam", "2047170": "Emun Elliott", "3645691": "Finn Jones", "1947403": "Conan Stevens", "2197118": "Ciaran Bermingham", "0114742": "Susan Brown", "2657974": "Esmé Bianco", "2131630": "Jefferson Hall", "2996220": "Lino Facioli", "1788152": "Brendan McCormack", "1414435": "Robert Sterne", "3354768": "Alan Paris", "4450657": "Kevin Keenan", "4416560": "Ryan McKenna", "1638294": "Eugene Simon", "4460936": "Antonia Christophers", "4440307": "Emily Diamond", "4422626": "Callum Wharry", "4048461": "Aimee Richardson", "5394592": "Melissa Reid"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["55"],  "plot": ["Catelyn has captured Tyrion and plans to bring him to her sister, Lysa Arryn, at the Vale, to be tried for his supposed crimes against Bran. Robert plans to have Daenerys killed, but Eddard refuses to be a part of it and quits.", "When King Robert learns that Daenerys and the Dothrakis are preparing for war, he decides to attack first. Ned is against the idea saying they should go slowly and learn more but the King calls him a weakling and dismisses him as the King's Hand. Playing in the dungeons, Arya overhears two men plotting against her father. She tells him what she heard and he decides the time has come for him to return to Winterfell. He delays his departure when given the opportunity to speak to the last person his predecessor spoke to, a whore who gave Robert another illegitimate son. The delay is costly however and leads to a serious injury. Catelyn meanwhile takes Tyrion to her sister Lysa, who also happens to be the John Arryn's widow.—garykmcd", "Among festering palace intrigues, partly overheard by Arya, Jaime Lannister is all too pleased to encourage king Robert to demand unconditional loyalty which Ned can't pledge, even if that costs him the Hand position as opinions differ how to handle the pretender's still hypothetical threat of seizing the throne by force. Things come to a tragic climax at the end of the already bloody royal tournament, including Ned's arrest. Meanwhile his wife lures Tyrion Lannister to illegal arrest as presumed son-killer in her native tribal Vake, but her mad, ruling sister aspires only a career for her weakling son. The gentle, naive sixth prince in line for the throne is lured by his gay knightly lover to aspire the throne 'to do good.'—KGF Vissers", "Tyrion discovers that Catelyn is actually bringing him to the Vale of Arryn, and not to Winterfell as she said, to mislead the Lannister and to meet her sister Lysa. However the group is attacked by a hill tribe and Tyrion protects Catelyn. Meanwhile Ned discovers dangerous secrets in King's Landing and Arya overhears two men in the dungeons plotting a war and the assassination of her father. There is a meeting of King Robert and the small council and the king orders Ned to kill Daenerys, her unborn son and Viserys, but he replies that this would be a dishonorable assignment and resigns to his position of Handship. He goes to a Littlefinger's brothel and finds a bastard son of Robert. When he leaves the place, Jaime is waiting for him with a little army because he heard about the imprisonment of Tyrion. They slaughter Ned's guards and Ned is stabbed on the back on his leg.—Claudio Carvalho, Rio de Janeiro, Brazil", "King Robert's eunuch spy, Varys, has uncovered that Daenerys Targaryen is pregnant. Ned rejects Robert's plan to assassinate her, considering Daenerys a non-threat. He resigns in protest as Robert's Hand, angering the king. Catelyn and her prisoner, Tyrion, arrive at her sister Lysa Arryn's fortress home in the Eyrie. News of Tyrion's capture reaches King's Landing where Jaime Lannister, the Queen's twin brother, demands answers from Ned. A vengeful Jaime orders Ned's men killed and fights Ned until Jaime's man stabs Ned in the leg from behind, leaving him wounded."], "genres": "N/A", "imdbID": "1829964", "rating": 9.0, "votes": 43204, "number_of_episodes": 74}