{"cast": {"0000293": "Sean Bean", "0265610": "Michelle Fairley", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0318821": "Aidan Gillen", "3229685": "Kit Harington", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0227759": "Peter Dinklage", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0181920": "James Cosmo", "0231871": "Ron Donachie", "0001097": "Charles Dance", "0535837": "Francis Magee", "4263213": "John Bradley", "0002103": "Julian Glover", "0891092": "Peter Vaughan", "1402546": "Sibel Kekilli", "0103195": "David Bradley", "0544139": "Clive Mantle", "3330122": "Wilko Johnson", "4440305": "Mark Stanley", "1086981": "Josef Altin", "4430828": "Luke Barnes", "0428765": "Mark Lewis Jones", "0815420": "Mia Soteriou", "3822505": "Amrita Acharia", "1861467": "Roxanne McKee", "1175468": "Elyes Gabel", "1502469": "Dar Salim", "0312245": "Ian Gelder", "1305845": "Edward Mercieca", "2228622": "Marcus Lamb", "1794801": "Colin Carnegie", "0565472": "Bryan McCaugherty", "4503947": "Stephen Grech", "0597388": "Jason Momoa", "0141582": "Dominic Carter", "4958677": "Kelly Long", "0564516": "Vinnie McCabe", "4385245": "Tobias Winter"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["57"],  "plot": ["Robb goes to war against the Lannisters. Jon finds himself struggling on deciding if his place is with Robb or the Night's Watch. Drogo has fallen ill from a fresh battle wound. Daenerys is desperate to save him.", "Sansa begs King Joffrey to spare her father's life. With his mother's support he agrees to spare him provided Ned publicly confesses that he is a traitor and recognizes him as the rightful king. Ned refuses at first but soon recognizes that the lives of his children are at stake and eventually agrees. Arya has eluded capture living in the town and scrounging for food. She goes to the square when she hears her father is to appear. Tyrion arrives at his father's camp but the elder Lannister is dismissive of his diminutive son. He also tells him that he will be in the vanguard of the attack to take place the next day against Robb Stark's forces arriving from the north. For his part, Robb is proving to be an able field general and takes a Lannister prisoner. Daenerys finds she has little influence after Drogo falls ill and is unable to ride.—garykmcd", "Knave king Joffrey obtains Ned's public 'confession' and acknowledgment of his claim to the crown but surprisingly afterward proclaims only to spare his kids' lives. Robb's northern troops' urgent march against the Lannister army is blocked by a rogue lord's castle, so he agrees to exorbitant alliance terms. Tyrion reminisces the domestic root of his debauchery when received coldly in his father's army, although the tribal warriors he brought prove valuable. A vast deception, sacrificing 2,000 men, enabled Robb to capture Jaime. Jon has a loyalty crisis but keeps proving himself a worthy right hand for the grandmaster. Khal Drogo's presumably incurable fresh battle wound threatens to end his reign and spells elimination for ambitious wife Daenerys and their unborn son, so she resorts to a witch for a magically healing sacrifice, his mount's blood.—KGF Vissers", "Varys visits Ned again in the dungeons and tells what Sansa did to save his life and advises him to accept the offer. Catelyn negotiates with the repulsive Lord Walder Frey the crossing of the river by Robb and his army and Frey accepts provided Arya and Robb marry with his children. Jon Snow receives a valuable sword from Mormont and lives a dilemma to make a choice of helping Robb or stay with the Night's Watch and to live with the consequences for the rest of his life. The infection in the wound of Drogo makes him weak and Daenerys summons the witch to heal him. She tells that a life must be sacrificed in exchange and she kills Drogo's horse. The Lannister army attacks Robb's army and discovers that Robb lured them, leaving only two thousand men behind, while eighteen thousand men have attacked Jaime's army and made him prisoner. Arya sees her father being brought chained in front of the crowd and falsely confessing his treason to save Sansa and Arya. However Joffrey betrays the deal and Ned is beheaded.—Claudio Carvalho, Rio de Janeiro, Brazil", "The Stark army arrives at the Twins castle; Catelyn persuades Lord Walder Frey to allow them to pass through his land and assist them in exchange for Robb and Arya marrying two of Frey's many unattractive offspring in the future. At the Wall, Jeor Mormont gives his family Valyrian steel sword to Jon in gratitude; Maester Aemon reveals to Jon that Aemon is a Targaryen. In Essos, Drogo's wound becomes septic and his death imminent. Daenerys asks a mystic slave woman to use blood magic to save him. The woman tells everyone to remain outside the tent until after the spell is cast. Daenerys goes into labor, and Jorah brings her into the tent seeking aid. Robb sacrifices 2,000 soldiers to fight the Lannister army as a diversion so he can move his army and capture Jaime. In a public hearing, Ned confesses to treason and publicly affirms Joffrey is the rightful heir. However, rather than sparing his life as negotiated, the vengeful and increasingly insane Joffrey has him beheaded, while Sansa, Cersei, and other counselors object futilely. Sansa is forced to watch her father die while Arya is nearby in the crowd."], "genres": "N/A", "imdbID": "1851398", "rating": 9.6, "votes": 56993, "number_of_episodes": 74}