{"cast": {"0000293": "Sean Bean", "0004692": "Mark Addy", "0265610": "Michelle Fairley", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0318821": "Aidan Gillen", "0516003": "Harry Lloyd", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "0227759": "Peter Dinklage", "0283492": "Jerome Flynn", "0231871": "Ron Donachie", "0568400": "Ian McElhinney", "3645691": "Finn Jones", "0225483": "Kate Dickie", "0002103": "Julian Glover", "2167445": "Gethin Anthony", "2047170": "Emun Elliott", "1115654": "Miltos Yerolemou", "2197118": "Ciaran Bermingham", "0114742": "Susan Brown", "1164730": "Natalia Tena", "2996220": "Lino Facioli", "2657974": "Esmé Bianco", "3822505": "Amrita Acharia", "1861467": "Roxanne McKee", "3964231": "Kristian Nairn", "1788152": "Brendan McCormack", "1175468": "Elyes Gabel", "1502469": "Dar Salim", "1638294": "Eugene Simon", "0315567": "Amira Ghazalla", "0193656": "Niall Cusack", "1651043": "Stephen Don", "0734304": "Paddy Rocks", "4473207": "Barrington Cullen", "1239578": "Barry O'Connor", "2364108": "David Michael Scott", "0597388": "Jason Momoa", "4201260": "Bernadette Dobbin"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["53"],  "plot": ["While recovering from his battle with Jaime, Eddard is forced to run the kingdom while Robert goes hunting. Tyrion demands a trial by combat for his freedom. Viserys is losing his patience with Drogo.", "A calmer King Robert mends fences with Ned Stark and reinstates him as the King's Hand despite the objections of his wife Cersei. While he goes hunting with his brother Renly he puts Ned on the throne. A group of farmers complain of having been attacked by a Knight and his army and knowing the culprit orders him stripped of all titles and lands. Ned decides to send Arya and Sansa back to Winterfell for their protection. Sansa in particular doesn't want to leave saying she wants to marry Joffre and have blond babies. Her offhand remark leads Ned back to the book his predecessor was so interested in and he now understands why John Arryn was visiting King Robert's bastard children. Meanwhile, Daenerys and her brother Viserys have yet another confrontation but this one is settled by Drogo himself. An imprisoned Tyrion Lannister demands to be tried and asks for trial by combat.—garykmcd", "Throne pretender Viserys Targaryen, jealous of his sister's growing power as Khal Drogo's Dothraki queen, uses a dragon egg himself, but harvests a golden crown that kills. Horribly treated captive murder suspect Tyrion Lannister needs bribery just to get a trial, then finds his only real chance an ordeal, for which surprisingly a local knight volunteers as formidable champion against the vicious regent's. King Robert puts his vindictive queen in her place and old friend Ned back in office as Hand, even shortly on the throne during another royal hunt, long enough to shock the nobility by outlawing an allegedly rogue knightly lord without even hearing him.—KGF Vissers", "King Robert reinstates Ned as the King's Hand and goes hunting. Ned is recovering his wound on the leg but is forced to take tough decisions against Gregor \"The Mountain\" Clegane in the name of the King. Tyrion demands a trial by combat and finds a knight to represent him. Viserys disrespects his sister Daenerys and Khal Drogo in front of their people demanding his golden crown and Drogo immediately resolves the situation.—Claudio Carvalho, Rio de Janeiro, Brazil", "King Robert reappoints Ned as Hand and tasks him with running affairs until Robert returns from hunting. Villagers from Riverrun arrive with news of atrocities committed by raiders, who Ned deduces were led by Ser Gregor Clegane, a Lannister retainer. Ned sentences Ser Gregor to death and summons Tywin Lannister to a trial. Ned decides to send Sansa (now reconciled with Joffrey) and Arya back to Winterfell. Ned has discovered that Joffrey and his two siblings are not Robert's biological children, and were fathered by Jaime Lannister. Bran, while testing his new saddle, is attacked by rogue Wildings. Robb, Ned's oldest son, and Theon, Ned's captive ward, whose father, King Balon, was a fallen rebel, rescue him, and the woman Wilding, Osha, is enslaved. In the Vale, Tyrion demands a trial by combat. Lysa chooses Ser Vardis as her champion. The sellsword Bronn volunteers as Tyrion's champion. He defeats Vardis and obtains Tyrion's release. Meanwhile, Viserys grows impatient and angry waiting for Drogo to fulfill his promise, and he threatens to kill Daenerys' unborn child. Drogo kills Viserys by pouring molten gold on his head."], "genres": "N/A", "imdbID": "1837862", "rating": 9.1, "votes": 42625, "number_of_episodes": 74}