{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0318821": "Aidan Gillen", "0322513": "Iain Glen", "3229685": "Kit Harington", "0192377": "Liam Cunningham", "3652842": "Isaac Hempstead Wright", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "4263213": "John Bradley", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "0181920": "James Cosmo", "0283492": "Jerome Flynn", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0838910": "Donald Sumpter", "0231871": "Ron Donachie", "0002103": "Julian Glover", "0700059": "Robert Pugh", "1164730": "Natalia Tena", "0203882": "Oliver Ford Davies", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "1478079": "Joe Dempsie", "3444954": "Ben Hawkey", "2869309": "Eros V", "1861467": "Roxanne McKee", "3822505": "Amrita Acharia", "1175468": "Elyes Gabel", "0170799": "Steven Cole", "3964231": "Kristian Nairn", "2657974": "Esmé Bianco", "0141582": "Dominic Carter", "4523680": "Kerr Logan", "0915453": "Tony Way", "2356940": "Hannah Murray", "0203801": "Karl Davies", "0064155": "Ian Beattie", "4982704": "Pat Mooney", "1783582": "Sahara Knite", "3996678": "Maisie Dee", "4460936": "Antonia Christophers", "4048461": "Aimee Richardson", "4422626": "Callum Wharry", "0928408": "Andrew Wilde", "4505122": "Natalia Lee", "1101680": "Gordon Fulton", "3037643": "Marko Cindric", "4982706": "Josephine Gillan", "4982614": "Dennis Stokes", "0169512": "Jonathan Cohen", "7835502": "Graham Gill", "5193652": "Sarah Mac Keever", "3960800": "Filip Lozic", "4475182": "Dennis McKeever", "7407610": "Graeme Peacock", "2160590": "Ginger A. Taylor", "4385245": "Tobias Winter"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["53"],  "plot": ["Tyrion arrives at King's Landing to take his father's place as Hand of the King. Stannis Baratheon plans to take the Iron Throne for his own. Robb tries to decide his next move in the war. The Night's Watch arrive at the house of Craster.", "Winter is coming as the Night Watch go to meet the threat north of the Wall, the standoff between the Stark and the Lannisters boils with new rumors of King Joffrey's birthright and the rise of the Baratheon brothers in the warfare. All the while Dany leads her band of broken things through the dead lands barely hanging on. Trust...Joffrey will do whatever it takes to keep his crown.—O-Neg", "Tyrion arrives in King's Landing with news that he is to be acting as the King's hand until his father returns. The news doesn't sit well with Cersei, King Joffrey's mother. Tyrion makes a point of telling her just how badly she has handled the situation of Ned Stark's execution and Arya Stark's escape. Rumors abound that Cersei's children are the product of an incestuous relationship with her brother Jaime. Even King Joffrey has heard them and challenges his mother to tell the truth but she denies it. Soon, the King's guards are seeking out and killing all of the late King Robert's illegitimate children. One, Gendry the armorer's apprentice, seems to have made his escape. In Winterfell, Bran continues to have his dreams and is told that the red comet in the sky means only one thing: dragons. Daenerys and her small group of followers are in a seemingly endless desert. She sends riders in all directions to see what they can find. The Night's Watch has ventured beyond the wall and learn that the King who lives north of the wall is amassing an army. The dead King Robert's brother Stannis Baratheon prepares for war but sees all others as his enemies. Summer is coming to an end and everyone is preparing for a winter of unknown duration.—garykmcd", "The Lord Commander Mormont is tracking down Benjen Stark with the Night's Watch. Tyrion arrives in King's Landing to assume his position of Hand of the King making Cersei furious and he strikes back telling that she allowed the execution of Ned and the escape of Arya. Stannis has received the letter sent by Ned to him telling that he should be the heir of the throne and he sends copies of the letter to all Lords in the realm claiming that he is the legitimate successor. Cersei forces Littlefinger to find Arya threatening his life. Joffrey orders a massacre of Robert's bastards in King's Landing. Daenerys and her small group face starvation and she tries to feed her dragons anyway.—Claudio Carvalho, Rio de Janeiro, Brazil", "Tyrion arrives to save Joffrey's crown from threats old and new; Daenerys searches for allies and water in the Red Waste; Jon Snow and the Night's Watch face the wilderness beyond the Wall; on the island of Dragonstone, Stannis Baratheon plots an invasion to claim his late brother's throne, allying himself with the fiery Melisandre."], "genres": "N/A", "imdbID": "1971833", "rating": 8.6, "votes": 38197, "number_of_episodes": 74}