{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0318821": "Aidan Gillen", "0322513": "Iain Glen", "3229685": "Kit Harington", "0192377": "Liam Cunningham", "0654295": "Alfie Allen", "3586035": "Maisie Williams", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "0283492": "Jerome Flynn", "0384152": "Conleth Hill", "4263213": "John Bradley", "1402546": "Sibel Kekilli", "0002103": "Julian Glover", "0700059": "Robert Pugh", "0538869": "Patrick Malahide", "0535837": "Francis Magee", "0141582": "Dominic Carter", "0937239": "Tom Wlaschiha", "1478079": "Joe Dempsie", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "1861467": "Roxanne McKee", "3822505": "Amrita Acharia", "0170799": "Steven Cole", "3444954": "Ben Hawkey", "2869309": "Eros V", "2657974": "Esmé Bianco", "0065874": "Andy Beckwith", "2247629": "Gemma Whelan", "4523680": "Kerr Logan", "1748634": "Lucian Msamati", "2356940": "Hannah Murray", "0203801": "Karl Davies", "3687008": "Amy Dawson", "1783582": "Sahara Knite", "0641596": "Jer O'Leary", "0429956": "Gerard Jordan", "4535552": "Daniel Portman", "1613839": "Ian Whyte", "0130538": "Sam Callis", "0717235": "Derek Reid", "4982706": "Josephine Gillan", "4982614": "Dennis Stokes"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["54"],  "plot": ["Arya makes friends with Gendry. Tyrion tries to take control of the Small Council. Theon arrives at his home, Pyke, in order to persuade his father into helping Robb with the war. Jon tries to investigate Craster's secret.", "In the wake of a bloody purge in the capital, Tyrion chastens Cersei for alienating the king's subjects. On the road north, Arya shares a secret with Gendry, a Night's Watch recruit. With supplies dwindling, one of Dany's scouts returns with news of their position. After nine years as a Stark ward, Theon Greyjoy reunites with his father Balon, who wants to restore the ancient Kingdom of the Iron Islands. Davos enlists Salladhor Saan, a pirate, to join forces with Stannis and Melisandre for a naval invasion of King's Landing.—JustHayden", "Tyrion takes steps to reinforce his position at King's Landing, despite Cersei's objections. Arya reveals her true identity to Gendry after two of the King's guards arrive looking for him. Theon Greyjoy returns home to the Iron Islands to enlist his father Balon's fleet for Robb's war against the Lannisters. The old man doesn't trust him and has no intention of letting him command the fleet or of allying himself with his old enemies. North of the wall, the men of the Night's Watch have encamped with Craster but have been forbidden to talk to any of his many wives. Jon Snow sees something he shouldn't have however. Stannis Baratheon meanwhile enlists the help of pirates for the sea power he needs to do battle. Daenerys receive bad news when one of her riders' horses returns to their camp.—garykmcd", "Arya is traveling with Yoren and the Night's Watch recruits when two Golden Cloaks arrive at their camping requesting Gendry, but Yoren uses his sword to send them back. However they promise to return with more guards. Cersei does not accept the peace terms proposed by Robb. Tyrion arrests Janos Stynt, and names Bronn as the new Commander of the City Watch. Theon Greyjoy travels to the Iron Islands to meet his father Balon and deliver Robb's proposal of alliance that is immediately rejected by Balon. He also meets his sister Yara that is the pride and joy of Balon. Beyond the Wall, Jon Snow sees Craster leaving a baby in the woods during the night. He follows him but Craster hits him on the face.—Claudio Carvalho, Rio de Janeiro, Brazil", "Robb's hopes to win the though men of the barren Iron islands for the cause of the North, as Winterfell-raised prince Theon Greyjoy practically assures, but when he returns home, his scrooge father Balon scolds Theon effeminated by the Starks, preferring his kenau daughter Yara to fight for his Greyjoy claim to a throne. Squire Gendry sees trough Arya's cross-dressing but agrees to keep his fellow refugee's gender and identity secret after knight Yoren fights off the Golden Cloak guardsmen, whose indignant 'flippant' City Watch commander Janos Stynt mistrusting Hand Tyrion, who waves regent Cersei's objections as further incompetence, replaces by loyal Bronn. Daenerys's part's despair grows as rival splinter khals decapitated the most promising scout, loyal Rakharo. Stannis dislikes the red witch demanding his adulterous 'devotion' despite his ill spouse and buys the pirate chief's fleet for his own war effort. Jon scolds Sam's naive intent to help a pregnant daughter of the incestuous Wildling patriarch escape with the Watch party if she gets a son, but can't resists rescuing a newborn, only to be clobbered by Craster himself. Petyr pulls rank on his brothel stock, Varys reverses the threat of Tyrion, whose private whore he discovered.—KGF Vissers"], "genres": "N/A", "imdbID": "2069318", "rating": 8.3, "votes": 36228, "number_of_episodes": 74}