{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0322416": "Jack Gleeson", "3849842": "Sophie Turner", "0564920": "Rory McCann", "0226820": "Stephen Dillane", "0283492": "Jerome Flynn", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0234541": "Roy Dotrice", "0002103": "Julian Glover", "1638294": "Eugene Simon", "4523680": "Kerr Logan", "3645691": "Finn Jones", "1783582": "Sahara Knite", "0915453": "Tony Way", "3330122": "Wilko Johnson", "1443574": "Stephen Swift", "4422626": "Callum Wharry", "4535552": "Daniel Portman", "3034964": "Gordon Mahon", "0243696": "James Doran", "0192371": "Kieran Cunningham", "1214477": "Michael Grennell", "6516429": "Robert Atkinson", "3033499": "Hugh Irvine", "7407610": "Graeme Peacock"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["55"],  "plot": ["Stannis Baratheon's fleet and army arrive at King's Landing and the battle for the city begins. Cersei plans for her and her children's future.", "Confident of victory, Stannis Baratheon's fleet and army arrive at King's Landing and the battle for the city begins. The Lannisters are badly outnumbered but Tyrion has made sensible preparations and strikes a blow. When no one else will lead the troops beyond the city wall, Tyrion decides he will do so himself. Cersei plans for her and her children's future. It appears they are all headed for certain death but help suddenly arrives.—garykmcd", "As Joffrey Baratheon prepares to face his uncle Stannis with his new weapon, Sansa plays the game, trying to get the young king killed. Tyrion leads his his men against the the Baratheon invaders in the climatic battle of the war, but is vastly outnumbered by Stannis. Cersei prepares for the worst.", "The War of the Five Kings reaches its climax, when Stannis Baratheon invades King's Landing, to overthrow his nephew Joffrey. The young ruler is soon unnerved and Tyrion has to rally the remaining Lannister troops in order to save his family from doom. Sansa plays tha game of thrones, and Cersei prepares for the worst.", "Stannis' fleet arrives to assault King's Landing. Sansa tries to manipulate Joffrey into leading the attack, hoping he gets killed, but Joffrey rather returns to Cersei's quarters as his mother requested, refusing to realize the royal castle may fall the first time in centuries, blinded by her lust for revenge on hand-brother Tyrion for marrying of her daughter. Leading the defense, Tyrion destroys many attacking ships with wildfire he had grand maester Pycelle prepare, forcing Stannis to attack on land with the survivors. Sandor Clegane's valiant defense outside the gate is defeated and he retreats \"tactically,\" denouncing his king. Joffrey retreats in fear as Tyrion rallies the Gold Cloaks into fighting with him. Stannis' forces enter the castle, but Tyrion leads his men behind Stannis' forces via sewage tunnels for a rearguard attack. Cersei goes to the throne room with Tommen, intending to kill him to save him from being captured. Shae convinces Sansa to hide in her chamber. Sandor Clegane offers to take Sansa to Winterfell, but she refuses to leave. With Tyrion wounded and Cersei about to poison Tommen, Tywin's army, joined by Loras, arrives and chases Stannis.—KGF Vissers"], "genres": "N/A", "imdbID": "2084342", "rating": 9.7, "votes": 61136, "number_of_episodes": 74}