{"cast": {"0227759": "Peter Dinklage", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0318821": "Aidan Gillen", "0322513": "Iain Glen", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0322416": "Jack Gleeson", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "1754059": "Natalie Dormer", "0283492": "Jerome Flynn", "0564920": "Rory McCann", "2167445": "Gethin Anthony", "0087432": "Nicholas Blane", "1996829": "Nonso Anozie", "0568385": "Michael McElhatton", "1478079": "Joe Dempsie", "1638294": "Eugene Simon", "2772105": "Oona Chaplin", "3729225": "Gwendoline Christie", "0360171": "Ian Hanmore", "1861467": "Roxanne McKee", "3822505": "Amrita Acharia", "0170799": "Steven Cole", "3444954": "Ben Hawkey", "3645691": "Finn Jones", "2657974": "Esmé Bianco", "1613839": "Ian Whyte", "0064155": "Ian Beattie", "0915453": "Tony Way", "1677757": "Anthony Morris", "4368919": "Sam Mackay", "2411784": "David Fynn", "3464945": "Andy Kellegher", "3996678": "Maisie Dee", "0610312": "Gina Moxley", "0571654": "Fintan McKeown", "4673504": "Emmet O'Riabhaigh", "1983637": "Donal Gallery", "0432838": "Slavko Juraga", "7835502": "Graham Gill", "1079822": "Paul Kealyn", "7407610": "Graeme Peacock"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["51"],  "plot": ["Lord Baelish arrives at Renly's camp just before he faces off against Stannis. Daenerys and her company are welcomed into the city of Qarth. Arya, Gendry, and Hot Pie find themselves imprisoned at Harrenhal.", "Robb attacks a Lannister encampment and afterward meets Lady Talisa Maegyr who treats the wounded in the battlefield. Tyrion puts a stop to King Joffre's mistreatment of Sansa and also blackmails his cousin Lancel, Cersei's lover, into being his spy. Petyr Baelish visits King Renly but Catelyn is not pleased with his presence. He offers to help protect her daughters but a trade for Jaime is the only solution. Catelyn however tries to get Stannis and Renly to bury the hatchet and unite their forces. Davos Seaworth delivers Stannis' witch, Melisandre, to a remote cave where she gives birth. In the desert, one of Daenerys' riders returns with news that the elders of Qarth will receive them. Arya arrives at Harrenhal where one person is killed every day. Lord Tywin arrives unexpectedly and she is soon his cup bearer.—garykmcd", "Robb Stark has another victory against the Lannister army. Arya Stark is imprisoned in a stable of an old castle with Gendry and Hot Pie, and they witness the torture and death of prisoners by sadistic torturers. Gendry is chosen to be tortured, but Lord Twyn Lannister arrives and interrupts the torture and assigns Arya for the kitchen. After acknowledging that Robb has defeated the Lannister army, Joffrey tortures Sansa with a crossbow and then he orders Meryn Trant to beat and strip her in front of the court. Tyrion arrives and stops the mistreatment of Sansa. Littlefinger arrives at Renly's camp to avoid him to go to King's Landing. Then he delivers Ned's bones to Catelyn and proposes to exchange Arya and Sansa for Jaime. There is a meeting between Stannis and Renly but they do not have an agreement. Daenerys and her group go to the City of Qarth and The Thirteen in principle do not welcome her. Davos brings Melisandre to the shore and the witch delivers a creature made of shadow.—Claudio Carvalho, Rio de Janeiro, Brazil", "Robb wins another easy surprise victory over Lannister troops, but southern nurse Lady Talisa Maegyr efforts to help the many wounded fores him to consider the cruel injustice of an ill-considered civil war. Hand Tyrion steps in to curb Joffrey publicly flogging his loyal bride Sansa as 'punishment' for the Stark rebellion, but the harlots Tyrion sends as private distraction get a provocative taste of Joffrey's sadist streak. Catlyn pleads an alliance with Robb to unwilling king Renly and rudely dismisses, despite the gift of Ned's cremated remains to entomb, Littlefingers' idea for a private settlement based on princely prisoners exchange. When regent Cersei sends her lover-cup-bearer Lancel Lannister to order Pycelle's release, Hand Tyrion blackmails him to spy on her to avoid exposure of their incestuous affair. At the gates of rich Qarth city, only the personal guarantee of the immigrated member of the governing Thirteen prevents mother of dragons Daenerys's Dotraki band being left to starve outside the gates. After Renly turns the anti-Lannister alliance suggested by Catelyn with rival king Stannis (and Robb), the latter sets a one day ultimatum to submit and sends his ex-pirate cousin Davos Seaworth to get red witch Melisandre to force a magical advantage in a hidden cove.—KGF Vissers", "Robb's Army attacks a Lannister Army at Oxcross and claims another victory, meeting a healer girl named Talisa Maegyr in the aftermath. In response, Joffrey publicly abuses Sansa as revenge for Robb's victories until Tyrion intervenes. The dwarf sends two prostitutes to the young King to calm his tempers, but Joffrey makes one of them beat the other brutally, thus threatening Tyrion not to interfere with his business. Catelyn attempts to unite the Baratheon brothers against the Lannisters, but Stannis demands Renly's loyalty to him as king. Littlefinger visits Catelyn and offers to trade Jaime for her daughters. Davos witnesses Melisandre giving birth to a shadow creature. Tyrion releases Pycelle and dismisses him from the Small Council. When Tyrion discovers Cersei's incestuous relationship with their cousin, Lancel, he blackmails Lancel into spying on Cersei, threatening to reveal the relationship to Joffrey. Arya and Gendry are taken to Harrenhal castle as captives. Prisoners are systematically tortured to death until Tywin arrives and demands they be used as labor. Recognizing Arya is a girl, he makes her his servant without knowing her true identity. After an exhausting journey through the desert, Daenerys arrives at the prosperous city of Qarth. Daxos, a member of the Council of Thirteen, persuades fellow councilmen to allow Daenerys and her retinue to enter the city."], "genres": "N/A", "imdbID": "2069319", "rating": 8.6, "votes": 34835, "number_of_episodes": 74}