{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0318821": "Aidan Gillen", "0322513": "Iain Glen", "3229685": "Kit Harington", "0001097": "Charles Dance", "3652842": "Isaac Hempstead Wright", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "4263213": "John Bradley", "0322416": "Jack Gleeson", "1754059": "Natalie Dormer", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0838910": "Donald Sumpter", "0002103": "Julian Glover", "0360171": "Ian Hanmore", "1164730": "Natalia Tena", "0937239": "Tom Wlaschiha", "1409802": "Simon Armstrong", "3729225": "Gwendoline Christie", "3310211": "Rose Leslie", "1996829": "Nonso Anozie", "1478079": "Joe Dempsie", "2772105": "Oona Chaplin", "2657974": "Esmé Bianco", "3645691": "Finn Jones", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "3444954": "Ben Hawkey", "0408591": "Ralph Ineson", "1861467": "Roxanne McKee", "0170799": "Steven Cole", "3964231": "Kristian Nairn", "3280686": "Art Parkinson", "2589085": "Edward Dogliani", "1978998": "Forbes KB", "4535552": "Daniel Portman", "0641433": "Patrick O'Kane", "0787237": "Michael Shaeffer", "2687517": "Chris Reilly", "0126298": "Terry Byrne", "1368643": "Ross Mullan", "5083763": "Wren Ros Elliot-Sloan", "0597388": "Jason Momoa", "4707474": "Noel Cecil", "7835502": "Graham Gill"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["64"],  "plot": ["Joffrey puts Sansa aside for Margaery Tyrell. Robb marries Talisa Maegyr. Jon prepares to meet Mance Rayder. Arya says farewell to Jaqen H'ghar. Daenerys tries to rescue her dragons.", "With the battle won, King Joffrey names his grandfather, Tywin Lannister, as the Hand of the King. It has an immediate impact on Tyrion, who awakens in new and much smaller quarters wounded from the battle . Petyr Baelish is rewarded for his loyalty. The King takes an interest in Lady Margaery Tyrell and decides to marry her. Lord Varys recruits a new spy. Arya has managed to escape from Harrenhal with Jaqen H'ghar's help. He shows her something of himself. Theon and his men are surrounded at Winterfell and are forced to abandon their position. They don't leave much behind. North of the wall, Jon impresses his captor in a fight with one of his own. King Robb and Talisa are married despite the promise he had previously made. Brienne and Jaime Lannister continue their journey but not without difficulty. In Qarth, Daenerys enters the House of the Undying to retrieve her dragons.—garykmcd", "Sansa is released from marriage to Joffrey. Bran and Rickon escape Winterfell. Robb marries Talisa Maegyr. To get her dragons back, Daenerys must face the House of the Undead. Jon joins the wildlings as a spy. Arya says goodbye to Jaqen H'ghar.—Chris Green", "Tyrion is not rewarded but ostracized instead. Joffrey rewards Lord Tywin, Littlefinger and Loras Tyrell that asks Joffrey to marry his sister Margaery and he puts Sansa aside. Sansa is happy for his decision, but Littlefinger advises her that Joffrey will not stop bothering her and offers to help her to escape from King's Landing. Robb marries Talisa despite the advice of Catelyn that is against. Brienne saves Jaime from three Stark men that have recognized him on the road. Theon and his men are under siege in Winterfell and Dagmer stabs Luwin with a spear; hits Theon and they flee, burning Winterfell to the ground. Arya, Gendry and Hot Pie cross paths with Jaqen. He tells to Arya that he is going to Braavos and invites her to go with him. The say farewell to each other and Jaqen calls Arya Stark by her name and changes his face. Daenerys enters in the House of the Undying and is tempted by the Iron Throne; by Drago and her son; and she finally finds her three dragons that burn Pyat Pree to ashes. Then Daenerys finds that Xaro is a liar and does not have a fortune and she locks him and his lover Doreah in the safe. Jon and Halfhand have a sword fight provoked by Halfhand and Jon kills him, earning the confidence of the Lord of Bones. Sam is left behind and sees an army of wights and White Walkers heading to the Fist.—Claudio Carvalho, Rio de Janeiro, Brazil", "Tywin's Lannister army having beaten off Stannis, Joffrey rewards him, Littlefinger and the Tyrells, by marrying Loras's sister Margaery instead of Sansa, who is discarded on the premise any Stark engagement promise was already \"treason-taunted.\" Varys explains to Tyrion his part in saving the crown won't be rewarded except by \"popular gratitude,\" he's dismissed as hand and left to recover in a petty room, with squire Podrickn who saved his life, and equally loyal Shae as only comfort. Theon holds a great speech to motivate his men to die fighting Robb's hugely superior siege forces, but after acclamation is knocked down and carried away on sneaky retreat while Winterfell burns and master Luwin, who failed to convince him to flee and join he Nightwatch, is mortally stabbed but gets to see Bran and Rickon return safely. Robb weds Talisa Maegyr, waving Catelyn's warning that breaking his engagement promise to lord Frey will compromise his royal credibility and vassal loyalty. Jon suffers endless taunting from Ygrette and is forced to kill in a sword duel Halfhand, who scolded him a traitor. Daenerys buries her dubious benefactor Xaro alive with his mistress with Jorah and enters alone the magical Iron Tower of Qarth to retrieve her dragons, who burn the magicians who chained her up. Stannis bitterly blames the red witch Melisandre for his failed siege and nearly strangles her, but by fire vision she convinces him to embrace a dire fate as king betraying all he loves. Arya, Gendry and Hot Pie a surprised to see death angel Jaqen, who invites Arya in vain to join him to Braavos and chances face. Cuffed Jamie keeps taunting Brienne, who insists serving only Catelyn, not the Starks, and fights off three of Robb's men who recognized the Kingslayer.—KGF Vissers"], "genres": "N/A", "imdbID": "2112510", "rating": 9.3, "votes": 42475, "number_of_episodes": 74}