{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0318821": "Aidan Gillen", "0322513": "Iain Glen", "3229685": "Kit Harington", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0654295": "Alfie Allen", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "3586035": "Maisie Williams", "0226820": "Stephen Dillane", "1754059": "Natalie Dormer", "0181920": "James Cosmo", "0283492": "Jerome Flynn", "0838910": "Donald Sumpter", "0234541": "Roy Dotrice", "0231871": "Ron Donachie", "3729225": "Gwendoline Christie", "1164730": "Natalia Tena", "2167445": "Gethin Anthony", "0360171": "Ian Hanmore", "0937239": "Tom Wlaschiha", "1478079": "Joe Dempsie", "1638294": "Eugene Simon", "1409802": "Simon Armstrong", "4440305": "Mark Stanley", "3645691": "Finn Jones", "0174005": "Ben Crompton", "1861467": "Roxanne McKee", "3822505": "Amrita Acharia", "0170799": "Steven Cole", "1996829": "Nonso Anozie", "2247629": "Gemma Whelan", "3964231": "Kristian Nairn", "3444954": "Ben Hawkey", "0408591": "Ralph Ineson", "1978998": "Forbes KB", "0571654": "Fintan McKeown", "0876128": "Edward Tudor-Pole", "3671418": "Laura Pradelska", "0280659": "Patrick FitzSymons", "3280686": "Art Parkinson", "4048461": "Aimee Richardson", "1677757": "Anthony Morris", "0214343": "Donagh Deeney", "1380606": "Kristina Krepela", "0432838": "Slavko Juraga", "13415231": "Guadalupe Fiñana"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["55"],  "plot": ["Tyrion investigates a secret weapon that King Joffrey plans to use against Stannis. Meanwhile, as a token for saving his life, Jaqen H'ghar offers to kill three people that Arya chooses.", "Catelyn and Renly come to an agreement and he agrees to join forces with Robb but witchcraft intervenes forcing her to flee with Brienne. As Stannis' fleet approaches Renly's camp, Petyr Baelish has advice for Margaery and her brother. At King's Landing, Cersei assures Tyrion that siege preparations are well under way and he learns the specifics from Lancel. In the Iron Islands Theon sets sail though has some difficulty gaining his crew's respect. Arya makes a deal with Jaqen H'ghar who promises her three lives in return for her having saved his. North of the Wall the Watchmen arrive at their camp. In Qarth, Daxos has gifts for Daenarys and has a proposition for her: access to his untold riches - and the Iron Throne - if he marries her. In Winterfell, Osha sees something in Bran's dreams.—garykmcd", "Catelyn and Renly agree to join their armies but out of the blue, he is assassinated by the shadow creature in front of Catelyn and Brienne who are forced to flee from the camp. Renly's army joins Stannis's army and Tyrion foresees an attack on Cersei, who is not worried. Tyrion forces Lancel to tell him what she is plotting and he tells that she had contacts with the alchemists. Tyrion learns that they have thousands of pots of the dangerous flammable Wildfire for the protection of the King's Landing. Arya stumbles with Jaqen that is now a guard and he promises three deaths for her because she saved his and two other prisoners lives and she asks the torturer Tickle. Daenerys is welcomed in Qarth and Xaro proposes to marry her and help her to retrieve the Iron Throne.—Claudio Carvalho, Rio de Janeiro, Brazil", "King Renly's pact with Catelyn to join Robb's forces fails as the red witch's black magic kills him and guards, forcing her to flee with Brienne. Queen-widow Margaery Tyrell convinces her brother, royal lover-guard Loren, to flee into safety to take revenge later. Renly's troops join Stannis's for an attack on King's landing. There Tyrion learns from spy Lancel that regent Cersei counts for the defense on alchemists' flammable 'wildfire', which he deems insufficient. Raid captain Theon finds his disrespecting crew the leftover of his sister's 30 ships, yet his boatswain proves valuable. In castle Harrenhal, mysterious Jaqen H'ghar, one of three prisoners Arya saved from the Gold Cloaks, rewards her with a promise to kill three enemies of her choice- she starts with Lannister torturer Tickler. In Qarth, co-regent Xaro Xhoan Daxos offers Daenarys immense riches if she marries him, enough to gain the Iron Throne.—KGF Vissers", "At Harrenhal, Jaqen H'ghar, one of three caged prisoners Arya previously saved, pledges to kill any three people she chooses to repay his debt to her. Her first choice is the Tickler, the man who mortally tortures the captives. Renly is killed by Melisandre's shadowy assassin. Lady Brienne is accused of the murder and Catelyn forces her to flee the camp. Excluding the Tyrells, Renly's forces join Stannis. Brienne swears life-long fealty to Catelyn and will protect her daughters. Theon sails from Pyke, and against Yara's orders, intends to prove he is a true Ironborn by capturing Winterfell during Robb's absence. Lancel tells Tyrion about wildfire, a mass-produced explosive substance hidden in the city's dungeons and intended to destroy Stannis' fleet and army during the impending siege. Tyrion then takes control of the scheme. In the north, the Night's Watch arrives at an ancient fortress called the Fist of the First Men. Jeor Mormont allows Jon to join the team led by a veteran named Halfhand, to kill the enemy leader. In Qarth, Daxos proposes marriage to Daenerys in exchange for providing her his wealth to conquer the Seven Kingdoms. Ser Jorah convinces her to instead gain the Westerosi peoples' support."], "genres": "N/A", "imdbID": "2074658", "rating": 8.6, "votes": 35002, "number_of_episodes": 74}