{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0318821": "Aidan Gillen", "3229685": "Kit Harington", "0001097": "Charles Dance", "3652842": "Isaac Hempstead Wright", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "0322416": "Jack Gleeson", "1402546": "Sibel Kekilli", "0564920": "Rory McCann", "0838910": "Donald Sumpter", "0231871": "Ron Donachie", "1164730": "Natalia Tena", "0568385": "Michael McElhatton", "1996829": "Nonso Anozie", "0087432": "Nicholas Blane", "0937239": "Tom Wlaschiha", "3310211": "Rose Leslie", "3729225": "Gwendoline Christie", "2772105": "Oona Chaplin", "1409802": "Simon Armstrong", "0408591": "Ralph Ineson", "0064155": "Ian Beattie", "0571654": "Fintan McKeown", "1978998": "Forbes KB", "3822505": "Amrita Acharia", "3964231": "Kristian Nairn", "0170799": "Steven Cole", "0894857": "David Verrey", "0050520": "Peter Ballance", "2231505": "David James Coakley", "4048461": "Aimee Richardson", "3280686": "Art Parkinson", "4422626": "Callum Wharry", "1168404": "Reg Wayment", "0174449": "Aiden Condron", "0432837": "Marko Juraga", "5037688": "Rea Separovic", "4781280": "Paul Caddell", "3285925": "Aidan Crowe", "7835502": "Graham Gill", "0385945": "Marijan Hinteregger"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["54"],  "plot": ["Theon seizes control of Winterfell. Jon captures a wildling named Ygritte. The people of King's Landing begin to turn against King Joffrey. Daenerys looks to buy ships to sail for the Seven Kingdoms.", "In a surprise attack, Theon Greyjoy captures Winterfell demanding an oath of loyalty from everyone there in return for their lives. He is chastised however by the locals for turning on the family that raised him. The execution of a Stark family retainer shows just how serious Theon is. Robb Stark can't believe what's happened and swears to get his revenge. He is also growing fonder of Lady Talisa. At King's Landing, Tyrion knows better than most that war will devastate them and makes arrangements for Cersei's daughter, Myrcella, to be send away to marry. On returning to the palace after seeing her off, King Joffrey and others of the royal court learn exactly what the public thinks of them. North of the wall, Jon Snow and others are on patrol looking for wildlings. They kill a few but one of the survivors is an attractive young woman, Ygritte. At Harrenhall, Arya continues to work as Lord Tywin Lannister's cup bearer. She's taken aback however when a visitor from King's Landing - someone who could recognize her - arrives for a meeting.—garykmcd", "The greedy Theon Greyjoy takes over Winterfell, forces Bran to surrender to spare his people and beheads Rodrik Cassel to be respected by his men. However, Maester Luwin succeeds in sending a message to Robb using a raven. Robb Stark wants to return to the North to fight against Theon, but is convinced by Lord Roose to move forward since he will send his bastard son Ramsay with his soldiers to capture Theon for him. Twyn receives Littlefinger at the Harrenhal Castle and Arya tries to hide her face from Littlefinger. She steals a letter that is left on the table but Armory takes the letter and heads to Tywin. Arya finds Jaqen and tells him that Armory is the second one that must immediately die. In King's Landing, Joffrey, Cersei, Tyrion, Sansa are at the docks watching Myrcella departing for Dorne. When the group is returning to the castle through the streets of King's Landing, they are attacked by starving people. The Hound saves Sansa from being raped. Beyond the Wall, the party fights against the Wildings and only a woman named Ygritte survives. Jon Snow is assigned to kill her but Jon hesitates and holds her as a prisoner.—Claudio Carvalho, Rio de Janeiro, Brazil", "Greedy Theon Greyjoy's surprise attack takes Winterfell, but after Bran's surrender and master Rodrik Cassel's beheading the people refuse homage to the 'traitor' whose own men still don't respect him either, and Maester Luwin sends a raven to warn Robb, whom Lord Roose convinces to continue the march on King's Landing, promising his bastard son Ramsay's soldiers will capture Theon. In the capital, starving commoners almost attack Joffrey's royal party who sent princess Mycella safely to Dorn as bride. EScaping recognition by Littlefiner at Harrenhal castle, Arya indicates Armory, bearer of a letter to Tywin Lannister, as second victim to Jaqen. Jon Snow takes surviving hostile Wildling party member Ygritte prisoner, ignoring orders to kill them all.—KGF Vissers", "Against Cersei's wishes, Tyrion sends her and Jaime's daughter, Myrcella, to Dorne for protection. Theon captures Winterfell and executes Ser Rodrik Cassel. Osha, the captive Wildling, along with Hodor, helps Bran and Rickon escape. In the aftermath of another battle, Robb reunites with Talisa. At the Fist of the First Men, Jon captures a Wildling named Ygritte, but is separated from his patrol while pursuing her after she escapes. Joffrey's presence among the people incites a riot at King's Landing, in which he is nearly killed and Sansa almost raped. Tywin allows Littlefinger to seek the Tyrells' allegiance. At Harrenhal, Arya has H'ghar kill an officer who is suspicious of her. Robb receives news about Theon's treachery and sends men to retake Winterfell. At Qarth, Daenerys works to procure a ship to transport an army to Westeros while keeping Daxos at bay. One of Daenerys' maids is killed and her dragons stolen."], "genres": "N/A", "imdbID": "2085238", "rating": 8.9, "votes": 36483, "number_of_episodes": 74}