{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "3229685": "Kit Harington", "0001097": "Charles Dance", "3652842": "Isaac Hempstead Wright", "0534635": "Richard Madden", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "1402546": "Sibel Kekilli", "0564920": "Rory McCann", "0838910": "Donald Sumpter", "0360171": "Ian Hanmore", "0087432": "Nicholas Blane", "1996829": "Nonso Anozie", "1164730": "Natalia Tena", "0568385": "Michael McElhatton", "3310211": "Rose Leslie", "3729225": "Gwendoline Christie", "2772105": "Oona Chaplin", "0408591": "Ralph Ineson", "3671418": "Laura Pradelska", "0821471": "John Stahl", "0203801": "Karl Davies", "1978998": "Forbes KB", "3964231": "Kristian Nairn", "0170799": "Steven Cole", "1613839": "Ian Whyte", "3280686": "Art Parkinson", "0214343": "Donagh Deeney", "2407387": "Sara Dylan", "2384733": "Steve Wilson", "0432838": "Slavko Juraga", "5049934": "Tyrone McElhennon", "3418529": "Neill Fleming", "0050520": "Peter Ballance", "2231505": "David James Coakley", "4781280": "Paul Caddell", "3795370": "Duncan Lacroix", "1423916": "David Sheehan", "3285925": "Aidan Crowe", "1168404": "Reg Wayment", "5981376": "Paul Monahan"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["56"],  "plot": ["Bran and Rickon have escaped Winterfell. Theon tries to hunt them down. Daenerys' dragons have been stolen. Jon travels through the wilderness with Ygritte as his prisoner. Sansa has bled and is now ready to have Joffrey's children.", "At Winterfell, Osha arranges for Bran and his younger brother to escape. Theon is outraged and sets off after them but can't quite seem to find them. Osha improvises, as does Theon so as not to lose face. North of the Wall, Jon finds himself lost and separated from the other members of the Night's Watch. His prisoner, Ygritte, soon turns the tables on him. At Robb's camp, Jaime Lannister escapes but is soon recaptured. At Harrenhal, Tywin Lannister wants to find the assassin who struck so near to him. At King's Landing, Sansa has nightmares about her near rape but also begins to menstruate. Cersei has advice for her but the young woman is clearly worried about having to marry Joffrey. In Qarth, Daenerys meets with the ruling council and demands the return of her dragons.—garykmcd", "Osha wakes up early in the dawn and leaves Theon's room, stabs a guard and flees with Bran, Rickon and Hodor. Tywin believes that the murder of Amory was an attempt against his life and orders Gregor to burn villages to the ground. Sansa menstruates during the night and tries to hide it with Shaw but they are surprised by The Hound and Sansa has a meeting with Cersei. Jaime kills Alton Lannister in his cell and when Torrhen comes to see, he strangles him and flees. However he is captured and Lord Rickard wants to kill him for the death of his son Torrhen but Catelyn protects Jaime. Jon Snow searches the Night's Watch patrol with Ygritte and she leads him to an ambush. Daenerys finds who had stolen her dragons, as part of a coup d' etat in Qarth.—Claudio Carvalho, Rio de Janeiro, Brazil", "Irate that Osha arranged for Hodor to escape carrying Bran with kid brother Rickon, Theon gives chase, cruelly torturing every rustic on the way, fearing ridicule if this fails. Robb has noble prisoner Alton Lannister locked in with Jaime, for lack of cells, where he is strangled as a trick for the Kingslayer to escape at last, only to be caught again. Alone, Jon Snow patiently rebukes impertinent Wildling prisoner Ygrette's sneers about guardsmen not being free, virtually castrated by their oath, but he ends up lured into an ambush and taken prisoner himself. Cersie is surprisingly understanding and maternal when Shaw fails, due to the Hound, to help Sansa hide she's menstruating, hence can bear Joffrey an heir. Pouting over the death and theft of her dragons, Danaerys discovers it's all part of a power struggle in Qarth. Tywin is amused by cup-bearer Arya while he spares no cruelty to punish the murder of Amory, believing it an attempt on his own life.—KGF Vissers", "Theon and his men pursue Brandon and Rickon. Tywin has Harrenhal searched for his officer's killer. Jon recaptures Ygritte, but she escapes again, leading him into a trap. Still shaken from the riot, Sansa is horrified that she has begun menstruating and is now old enough to marry and bear Joffrey's children. Cersei warns her to love no one but her children, not even Joffrey. In Robb's camp, Jaime's failed escape leaves a guard dead and some soldiers seeking retribution. In Qarth, the warlock Pree says he stole Daenerys' dragons; he offers her the opportunity to reunite with them, then slaughters the Council of Thirteen and establishes Daxos as king. In Winterfell, Theon presents the charred corpses of two farm boys to Maester Luwin, claiming they are Brandon and Rickon."], "genres": "N/A", "imdbID": "2085239", "rating": 8.8, "votes": 35432, "number_of_episodes": 74}