{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0265610": "Michelle Fairley", "0318821": "Aidan Gillen", "3229685": "Kit Harington", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "1754059": "Natalie Dormer", "0181920": "James Cosmo", "0283492": "Jerome Flynn", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0838910": "Donald Sumpter", "0231871": "Ron Donachie", "0002103": "Julian Glover", "0700059": "Robert Pugh", "0538869": "Patrick Malahide", "0535837": "Francis Magee", "2167445": "Gethin Anthony", "1478079": "Joe Dempsie", "0937239": "Tom Wlaschiha", "3729225": "Gwendoline Christie", "3645691": "Finn Jones", "3444954": "Ben Hawkey", "2869309": "Eros V", "2247629": "Gemma Whelan", "3964231": "Kristian Nairn", "2356940": "Hannah Murray", "0571654": "Fintan McKeown", "3464945": "Andy Kellegher", "0065874": "Andy Beckwith", "0429956": "Gerard Jordan", "0752638": "Jonathan Ryan", "4048461": "Aimee Richardson", "4422626": "Callum Wharry", "3996678": "Maisie Dee", "4385245": "Tobias Winter", "2226594": "Ken Fletcher", "4007028": "Darren Killeen", "0130538": "Sam Callis", "5418720": "Aaron Archer", "4475182": "Dennis McKeever"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["53"],  "plot": ["Tyrion tries to see who he can trust in the Small Council. Catelyn visits Renly to try and persuade him to join Robb in the war. Theon must decide if his loyalties lie with his own family or with Robb.", "Jon is reprimanded for interfering with Craster and Sam has a gift for one of Craster's wives. In Winterfell, Bran continues to dream but begins to believe they are visions. Lady Catelyn approaches King Renly Baratheon to form an alliance with her son Robb. In the Iron Islands, Balon decides to attack the north while the Robb Stark's armies are in the south fighting the Lannisters. Theon is given the command of a ship while his sister Yara is put in command of a fleet of 30 ships. In King's Landing, Tyrion plays the council members against one another and learns the identity of the spy among them. He also wants to protect Shae from those who might try to find his weaknesses and she soon begins work as Sansa's new hand maiden. The King's guards return and Arya and Gendry are taken prisoner.—garykmcd", "Craster orders the Nighy's Watch to leave his home and Lord Commander Mormont reprehends Jon Snow since Craster is important for his men. Catelyn visits Renly expecting an alliance with him. Tyrion tests the loyalty of the small council and tells a different plan of marriage alliance for Princess Myrcella to Pycelle, Varys and Littlefinger and Bronn arrests Pycelle for betrayal. Theon has to decide whether he is loyal to his family or to Robb Stark. The Lannister men arrive at Yoren's camping and kill him; Polliver takes the Needle from Arya and stabs Lommy in the throat with the Needle. When the captors ask to the prisoners who Gendry is, Arya points out to Lommy that had stolen Gendry's helm.—Claudio Carvalho, Rio de Janeiro, Brazil", "Tyrion gets his private harlot Shae to become Sansa's bumbling handmaiden and sets a trap for the small council members by telling each another prospective bride for Joffrey's sister Myrcella, proving learned master Pycelle the traitor and queen-regent's spy rather then Varys or Littlefinger. Desperate for an ally in Robb's northern secession war, kin Cathlyn approaches still carefree king Renly Baratheon of Stormlands, who knights the visor-masked tournament winner Brienne of Tarth and admits her to the body guard of seven, to the dismay of his gay lover Loras Tyrell, while his pragmatic queen Margaery offers any threesome if only they beget an heir. Theon duly scolds his father Balon Greyjoy for reproaching him the effects of the banishment to the Stark court imposed on the surviving son, finds his sister is given command of thirty ships, he only one, and considers warning Robb that the Iron Islands king plans to raid and submit most of the north. Watch commander Jeor Mormont duly reprimands but rescues Jon for intervening with indispensable Wildling ally Craster's boy sacrifices. Bran doubts his tutor's assurances that his recurring visions are mere nightmares of magical bedtime stories about extinct dangers like dragons. King's guards capture Arya and Gendry, whose identity they can hide.—KGF Vissers", "Catelyn arrives at Renly's camp to negotiate an alliance. The female warrior, Brienne of Tarth, wins the right to join Renly's king's guard through combat. Renly has recently wed Margaery Tyrell, Loras's sister. Renly avoids consummating his and Margaery's marriage due to his homosexuality and sexual relationship with Loras. In the Iron Islands, Balon plans an attack on the North, led by Yara. After burning his letter to Robb warning of Balon's impending attack, Theon affirms his allegiance to House Greyjoy in a water-based ceremony. In King's Landing, Tyrion imprisons Pycelle after determining he is Cersei's informant. Tyrion appoints his lover, Shae, as Sansa's handmaiden, both to protect Shae and watch Sansa. Beyond the Wall, Craster demands the Night's Watchmen leave. Jon discovers that Jeor Mormont has always known about and ignored Craster's incestuous crimes in exchange for his men's respite at his keep. On the road to the wall, the Night's Watch recruits are attacked by Lannister soldiers searching for Gendry. Yoren is killed, and Arya and Gendry are taken prisoner. To protect Gendry, Arya falsely states that a boy the guards have killed was Gendry."], "genres": "N/A", "imdbID": "2070135", "rating": 8.7, "votes": 35799, "number_of_episodes": 74}