{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "0182666": "Nikolaj Coster-Waldau", "0265610": "Michelle Fairley", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "3229685": "Kit Harington", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0322416": "Jack Gleeson", "3652842": "Isaac Hempstead Wright", "0534635": "Richard Madden", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "4263213": "John Bradley", "0226820": "Stephen Dillane", "1402546": "Sibel Kekilli", "0283492": "Jerome Flynn", "0384152": "Conleth Hill", "0838910": "Donald Sumpter", "1164730": "Natalia Tena", "2772105": "Oona Chaplin", "0568385": "Michael McElhatton", "0937239": "Tom Wlaschiha", "3310211": "Rose Leslie", "1409802": "Simon Armstrong", "2247629": "Gemma Whelan", "1478079": "Joe Dempsie", "3729225": "Gwendoline Christie", "0408591": "Ralph Ineson", "0312245": "Ian Gelder", "0821471": "John Stahl", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "3444954": "Ben Hawkey", "2657974": "Esmé Bianco", "0065874": "Andy Beckwith", "0170799": "Steven Cole", "2589085": "Edward Dogliani", "3964231": "Kristian Nairn", "0429956": "Gerard Jordan", "3280686": "Art Parkinson", "4535552": "Daniel Portman", "1613839": "Ian Whyte", "4523680": "Kerr Logan", "3974805": "Moe Dunford", "3169912": "Mark Byatt", "1423916": "David Sheehan", "0174449": "Aiden Condron", "0572999": "Ciaran McMahon", "7835502": "Graham Gill", "6497659": "Kristy Robinson"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["54"],  "plot": ["Stannis is just days from King's Landing. Tyrion prepares for his arrival. Jon and Qhorin are taken prisoner by the wildlings. Catelyn is arrested for releasing Jaime. Arya, Gendry, and Hot Pie plan to escape from Harrenhal.", "Theon's sister Yara arrives at Winterfell with reinforcements but he still can't seem to earn her respect. She tells him he was stupid to kill the Stark boys as they were valuable prisoners. Theon learns that his father wants him to return home. North of the Wall, Jon had been taken prisoner by wildlings. At Harrenhal, Arya identifies the last of the three lives Jaquen H'ghar promised her for saving him. Robb is dismayed at the deal his mother has made with Jamie Lannister and places her under arrest. Danerys refuses to leave Qarth without her dragons and decides to retrieve them from the House of the Undying. Stannis and his army approach King's Landing from the sea. Tyrion plans for the defense of the city but Cersei wants him to keep her son King Jeoffrey out of the fighting. He realizes that he must take steps to protect Shae.—Abigail Thomas", "Jon Snow is brought to the Lord of Bones that wants to kill him, but Ygritte saves him claiming that he is a Stark. Jon sees that Halfhand that was captured and he wants Jon as a spy of the Wildings. Luwin sees Osha in the crypt and she shows Bran and Rickon alive, and the burned bodies belonged to the farm boys. Stannis and his fleet is arriving to King's Landing and Tyrion is plotting a plan to defend the castle, while Joffrey shows a false courage. Robb arrests Catelyn for releasing Jaime Lannister from his cell to exchange him for her two daughters.—Claudio Carvalho, Rio de Janeiro, Brazil", "To Theon's dismay, his sister Yara and a party of troops arrive not with praise for his capture of Winterfell, but scolding it pointless, with orders from father to return to the Iron Islands, but he holds on, confident even Robb can't retake it easily. Stannis and his prospective hand Davos Seaworth ponder their larger fleet and army's chances of seizing the never-taken capital, where Tyrion desperately plots a defense with Varys as Cersei's misplaced stubborn pride and refusal to let Joffrey stand tall with his troops only increase the risk for all Lannisters to be slaughtered. Captured, Jon is taunted but saved by Ygrette from slaughter by band leader Lord of Bones, presented as interesting Stark hostage for actually full-blood Wildling king Mance and reunited with rescue party survivor watchman Halfhand, finding buried relics from the First Men. Dismayed Catelyn freed Jamie behind his back in a bid to save his sisters, Robb has her grounded under guard for treason, ignoring is kid brothers are safe, mistaken for the burned farm-boys. Danerys ignores Jorah's advice to leave Qarth, determined to retrieve the stolen dragons from the House of the Undying. Arya tricks Jaquen H'ghar to help her escape with friends.—KGF Vissers", "Robb learns that Catelyn secretly freed Jaime Lannister, who Brienne is escorting to ransom him in exchange for Sansa and Arya; Robb places his mother under house arrest and sends men to capture Jaime. Robb is attracted to a spirited medic, Talisa Maegyr, a woman from Volantis. Yara arrives at Winterfell and criticizes Theon's seizing it, saying it has no strategic value to the Ironborn. He refuses to return to Pyke with her. When Tywin leaves Harrenhal to attack Robb, Arya coerces H'ghar into helping her, Gendry, and their friend, Hot Pie to escape. In King's Landing, Cersei attempts to blackmail Tyrion by abducting Ros, whom the former believes is his secret lover. Joffrey chastises Varys for not having more knowledge of Stark positions, and prepares to lead the attack against Stannis himself. En route to King's Landing, Stannis promises to make Davos his Hand of the King. Beyond the Wall, the Wildling leader, \"Rattleshirt,\" leads the captured Jon and Halfhand to his king, Mance Rayder. At the Fist of the First Men, the brothers of the Night's Watch find a hidden cache of dragonglass weapons, left there by a previous Night's Watch brother. In Qarth, Jorah agrees to accompany Daenerys to the House of the Undying to retrieve her dragons. Brandon and Rickon are revealed to be alive and hiding in Winterfell."], "genres": "N/A", "imdbID": "2085240", "rating": 8.6, "votes": 34919, "number_of_episodes": 74}