{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3229685": "Kit Harington", "0534635": "Richard Madden", "0265610": "Michelle Fairley", "1754059": "Natalie Dormer", "3652842": "Isaac Hempstead Wright", "0322416": "Jack Gleeson", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "2772105": "Oona Chaplin", "1478079": "Joe Dempsie", "3310211": "Rose Leslie", "4263213": "John Bradley", "0181920": "James Cosmo", "1402546": "Sibel Kekilli", "0564920": "Rory McCann", "0001671": "Diana Rigg", "0001354": "Ciarán Hinds", "0188871": "Mackenzie Crook", "0443373": "Paul Kaye", "3729225": "Gwendoline Christie", "0852965": "Noah Taylor", "1164730": "Natalia Tena", "0568385": "Michael McElhatton", "3701064": "Iwan Rheon", "1970465": "Kristofer Hivju", "3645691": "Finn Jones", "1032473": "Thomas Brodie-Sangster", "1697771": "Ellie Kendrick", "3444954": "Ben Hawkey", "0821471": "John Stahl", "1528121": "Philip McGinley", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "4430828": "Luke Barnes", "3964231": "Kristian Nairn", "3280686": "Art Parkinson", "4407586": "Michael Shelford", "5612835": "Joe Purcell", "5610468": "Joe Cassidy", "4105029": "Will Rastall", "6044736": "Tyrone Kearns"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["56"],  "plot": ["Bran and company meet Jojen and Meera Reed. Arya, Gendry, and Hot Pie meet the Brotherhood. Jaime travels through the wilderness with Brienne. Sansa confesses her true feelings about Joffery to Margaery.", "Bran dreams of the three-eyed raven but Osha doesn't want to hear the details. He meets Jojen Reed and his sister Meera. Bran and Jojen seem to have a great deal in common. Robb learns of the fall of Winterfell and also that Catelyn's father has died. He leads his troops to Riverrun for his grandfather's funeral and en route Catelyn tells Talisa of her desire that Jon Snow die when he was just a babe. Cersei tries to warn Joffre about Margaery's ambition but it falls on deaf ears. Brienne and Jamie continue their journey to King's Landing but run into trouble. Sansa believes that Baelish's desire to help her is because he loved her mother. Shae explains the nature of men to her. Sansa meets Margaery and her grandmother Lady Olenna and reveals her the truth about Joffrey. Samwell Tarley is having trouble keeping up as what remains of the Night's Watch as they try to reach the Wall. Arya is also trying to get to Riverrun but she and her companions meet up with the Brotherhood without Banners. At a nearby tavern, someone recognizes her.—garykmcd", "Bran has another strange dream and out of the blue, the boy of his dreams appears in their camp and introduces himself as Jojen Reed. After a moment of tension, Jojen and his sister team up with the group they head together to The Wall. Theon is tortured by his captors but a servant releases him and he rides to meets his sister. Loras Tyrell escorts Sansa to meet his sister Margaery and their grandmother Oleanna. The old lady asks to Sansa how Joffrey is like and after a moment of reluctance, Sansa tells that he is a monster. Robb and his mother Catelyn leave Harrenhal to go to the funeral of her father. They are also informed about the fate of Winterfell and that Bran and Rickon are missing. Arya, Gentry and Hot Pie are captured by the Brotherhood and brought to an inn to eat and drink. But they also capture The Hound and Arya's identity is disclosed. Jaime lures Brienne and takes her spare sword and they fight on a bridge, but they are surprised by riders from the House of Bolton led by Locke.—Claudio Carvalho, Rio de Janeiro, Brazil", "Theon squirms and squeals desperately under apparently pointless foot press torture at the Bolton castle, but is sneakily helped to an escape on horseback by their henchman Ramsay Snow. Pre-teen Jojen Reed first appears in Bran's dream, then joins his party to the wall with his sister Meera. Hearing of Catelyn's father's death, Robb takes his army to the funeral at castle Riverrun, where she confides in an uncle her guilt over having jealously prayed for Ned's infant bastard Jon Snow's death and remorsefully for recovery, as if this karma-triggered the constant misery since. Joffrey already heeds his Maergery Tyrell more then the regent Cersei, grandmother Olenna Tyrell gets discarded bride Sansa, who trusts Bailish as her mother's admirer, to confide Joffrey's cruelty into the new one. Brienne's haughty refusal to let Jaime help fight off Locke's Bolton party of northern cavalry gets them captured by the brigand band. The Brotherhood without Banners catches Gentry, Arya, and Hot Pie on a forest path to Riverrun and takes them to an inn, where next captive Sandor 'The Hound' Clegane betrays Arya's identity. Commander Mormont pulls rank against other Night Watch survivors tempted to leave screw-up Samwell behind to die.—KGF Vissers", "Brienne continues escorting Jaime Lannister across the Riverlands to King's Landing. He engages her in a fight, which is interrupted by Bolton soldiers who capture them. Robb Stark receives news that Winterfell was sacked, and his brothers Bran and Rickon have vanished. Robb diverts his attention from the war against the Lannisters to attend the funeral of Hoster Tully, Catelyn's father, in Riverrun. This angers Rickard Karstark, who seeks vengeance against the Lannisters for killing his sons. Arya Stark, Gendry and Hot Pie also make for Riverrun, but are waylaid by the rebel group \"Brotherhood without Banners.\" They stop at an inn, where the captured Hound exposes Arya's identity. Margaery and her grandmother Olenna, the \"Queen of Thorns,\" persuade Sansa to describe Joffrey's deviant character. Theon Greyjoy is tortured by unknown captors. Bran, Rickon, Osha, and Hodor encounter siblings Jojen and Meera Reed, children of Stark bannerman, Howland Reed. Jojen, who shares Bran's strange dreams, tells Bran that he can enter animals' minds."], "genres": "N/A", "imdbID": "2178772", "rating": 8.4, "votes": 34337, "number_of_episodes": 74}