{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0265610": "Michelle Fairley", "0001097": "Charles Dance", "1754059": "Natalie Dormer", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "1478079": "Joe Dempsie", "0322416": "Jack Gleeson", "0564920": "Rory McCann", "0384152": "Conleth Hill", "0181920": "James Cosmo", "0001671": "Diana Rigg", "0700059": "Robert Pugh", "3729225": "Gwendoline Christie", "0568400": "Ian McElhinney", "0443373": "Paul Kaye", "0233807": "Richard Dormer", "0852965": "Noah Taylor", "3701064": "Iwan Rheon", "2356940": "Hannah Murray", "1032473": "Thomas Brodie-Sangster", "1218607": "Burn Gorman", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "4430828": "Luke Barnes", "0383835": "Dan Hildebrand", "2812026": "Nathalie Emmanuel", "2657974": "Esmé Bianco", "1528121": "Philip McGinley", "0057965": "Clifford Barry", "5341634": "Sophie Reid", "3467013": "Bryan Quinn", "5636928": "Harold James McMullan", "6044736": "Tyrone Kearns", "4475182": "Dennis McKeever", "1652341": "Jamie Michie"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["53"],  "plot": ["Jaime mopes over his lost hand. Cersei is growing uncomfortable with the Tyrells. The Night's Watch is growing impatient with Craster. Daenerys buys the Unsullied.", "In King's Landing, Tyrion seeks out Varys' advice on getting revenge against those who tried to kill him. He learns the Varys' approach is to go slow. Cersei is troubled that Margaery has Joffrey wrapped around her little finger. Her father won't take her advice and tells her why. Varys approaches Margaery's grandmother to discuss matters of mutual interest. North of the Wall, some of the Night's Watch are on the brink of rebellion. Jaime is continually humiliated by his captors but Brienne has words of encouragement for him. Arya reaches the main group of the Brotherhood without Banners and Sandor Clegane learns his fate.—garykmcd", "Jaime is humiliated by his captors and Brienne unsuccessfully tries to protect him. Tyrion meets with Varys, who tells of how he was sold to a sadistic sorcerer that castrated him. He advises Tyrion to be patient and finishes opening a large box and Tyrion sees the sorcerer locked inside. Joffrey shows The Great Sept of Baelor to Margaery and Cersei realizes that Margaery has Joffrey under control. Then she meets her father and tells him that she is worried since Margaery is manipulating Joffrey. Varys meets Olenna and they have a long conversation about Sansa. Then Margaery meets Sansa and tells her that they would be sisters if Sansa married her brother Loras. The Hound is judged by The Brotherhood without Banners through a trail by combat. Theon is led by the youngsters that saved him to meet his sister Yara in a dark chamber and soon he finds that his escape was another sadistic means of torturing him. Lord Commander Mormont tries to calm down his men that are starving but one of them kills Craster and another one stabs Mormont in the back, effectively killing him. Sam flees with Gilly and her son through the frozen woods. Daenerys has a surprising attitude toward Kraznys mo Nakloz and leaves Astapor with her dragons and the army.—Claudio Carvalho, Rio de Janeiro, Brazil", "Miserable Theon confides his consuming guilt over failure both as Greyjoy and near-Stark into Ramsay, on the way to safety with his sister, only to end back up the torture saltire as it was a ploy. Locke keeps terrorizing Jaime, before and after a valiant left-hand sword-grabbing escape attempt, with Brienne finally realizing he deserves respect and they must collaborate, the Hound survives a Brotherhood 'trial' by combat while Arya's party arrives. Patriarch and Hand Tywin duly dismisses Cersei's claim to be 'his listening child' as she warns of Maergery's manipulative influence on almost enchanted royal groom Joffrey, who basks sharing her popularity while preparing their grand wedding. Varys explains to Tyrion his miserable youth as petty actor sadistically castrated, working himself up by dirty tricks and finally ready for revenge, then agrees with Olenna Tyrell that Sansa, abandoned by ambitious Littlefinger, would be a fit bride for Loras at the family seat. Mounting discontent among the hungry, shit-shoveling Night watch men leads to a brawl with stingy host Craster that gets him and intervening commander Mormont fatally stabbed. Daenerys pays Kraznys mo Nakloz a dragon, only to order it to incinerate the slave soldier merchant and order the Unsullied to murder every free man in Astapor, then declares them free trusting none knows an alternative to following her.—KGF Vissers", "Theon's \"rescuer\" betrays him, returning him to the prison for more torture. After a failed escape attempt, Jaime believes himself lost without his sword hand; Brienne urges him to remain hopeful. Varys tells Tyrion how he became a eunuch, then shows him the sorcerer who castrated him, who is now his captive. He advises Tyrion to be patient for vengeance. At Craster's Keep, the surviving Night's Watchmen, starving, come into conflict with their host. Craster and Mormont are slain in the struggle, and Sam flees with Gilly and her new-born son. Arya and Gendry are taken to the Brotherhood's secret cave, meeting their leader, Beric Dondarrion, who later sentences Sandor Clegane to trial by combat with him. Margaery proposes that Sansa marry Loras, which Sansa finds agreeable, unaware he is gay. Daenerys meets with slaver Kraznys to trade one dragon for the Unsullied army. Once the deal is struck, she commands the Unsullied to kill all the slave masters, and has her dragon burn Kraznys; she frees the Unsullied, who willingly follow her."], "genres": "N/A", "imdbID": "2178798", "rating": 9.5, "votes": 46873, "number_of_episodes": 74}