{"cast": {"3592338": "Emilia Clarke", "3229685": "Kit Harington", "0534635": "Richard Madden", "0322513": "Iain Glen", "0265610": "Michelle Fairley", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "3586035": "Maisie Williams", "2772105": "Oona Chaplin", "3310211": "Rose Leslie", "0564920": "Rory McCann", "0103195": "David Bradley", "0188871": "Mackenzie Crook", "0568385": "Michael McElhatton", "0568400": "Ian McElhinney", "0751085": "Clive Russell", "0580014": "Tobias Menzies", "1970465": "Kristofer Hivju", "1164730": "Natalia Tena", "1032473": "Thomas Brodie-Sangster", "1697771": "Ellie Kendrick", "2356940": "Hannah Murray", "4534098": "Ed Skrein", "2760664": "Jacob Anderson", "2812026": "Nathalie Emmanuel", "3964231": "Kristian Nairn", "1623508": "Tom Brooke", "1043031": "Tim Plester", "0352901": "Kenneth Hadley", "3280686": "Art Parkinson", "5093301": "Alexandra Dowling", "0118688": "Sean Buckley", "0447888": "A.J. Kennedy", "5314226": "Grace Hendy", "0569859": "Pat McGrath", "4958677": "Kelly Long", "2547222": "Oddie Braddell", "1363194": "Will Champion", "5967072": "James Bleakney", "2336143": "Logan Bruce", "5142195": "Katie Creaven", "2911170": "Laurence Doherty", "0564890": "Kevin McCann", "6740076": "Darragh O'Connor", "7741570": "Daniel Wiffen", "7741571": "Nathan Wiffen"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["51"],  "plot": ["Robb and Catelyn arrive at the Twins for the wedding. Jon is put to the test to see where his loyalties truly lie. Bran's group decides to split up. Daenerys plans an invasion of Yunkai.", "Robb, his wife Talisa and mother Catelyn arrive for the marriage of Edmure Tully to one of Walder Frey's daughters. There is considerable tension between the two families but Robb's sincere apology for not marrying one of Frey's daughters is well received. It doesn't stop the elderly Frey from being both crude and rude towards his guests. Edmure is pleasantly surprised to see that his bride is to be Frey's prettiest granddaughter, Roslin. The festivities continue but Walder Frey has something very special planned. Arya and Sandor Clegane arrive at the Twins but too late to do anything. Daenerys meanwhile orders the attack on Yunkai based on information provided by Daario. Brandon learns the strength of his powers. Jon Snow is forced to choose between the Watch and Ygritte.—garykmcd", "Walder Frey sarcastically welcomes apologetic king Robb for the consolation prize wedding of one of his royally scorned (grand)daughters with Lord Edmure Tully, who is relieved it's presentable Roslin. When everyone enjoys the lavish feast, the Twins castle hall doors are locked and crossbows murder most of Robb's men. Walder ignores Catelyn's threat to slit his wife's throat, preferring his revenge on Robb over his own family. Sandor 'The Hound' Clegane arrives disguised as pork seller to deliver Arya during the slaughter, which even includes Robb's wolf, and manages to take her away before she can tempt fatally futile revenge. On their travel to the wall, Bran's party seeks shelter in an old tower, where he must force himself to use his warg powers to keep undetected. Jon arrives just there with the Wildling party while stealing horses, refuses to murder the breeder and seizes the opportunity to kill off the others, except Ygritte, who fought with him until he bolts. Bran decides to send his kid brother and spare Stark heir Rickon to a separate hideout with Osha, while he, Jojen and Hodor continue seeking the Wall. Jorah and Baristan fear Daario Naharis lures them into a trap, but despite the number of slave guards the trio takes the Yunkai gate and the others surrender to Danaerys.—KGF Vissers", "Catelyn, Talisa and Robb arrive at the Twins for the wedding of Edmure Tully. Dany plots to conquer Yunkai with the help of her crew. Jon and the wildings come to a misunderstanding which will test Jon's loyalty. Bran and his crew make a big decision", "Sam, Gilly, and her son arrive at the Wall. While hiding in a tower during a thunderstorm, Bran enters Hodor's mind to prevent his revealing their hiding place to Wildlings below with his laments. Nearby, Jon refuses to murder a farmer, whom Ygritte kills; Jon is attacked by the other Wildlings but escapes. Bran uses his warg ability to save Jon, who kills Orell before escaping, leaving a furious Ygritte behind with chief Tormund. Osha, Rickon, and his direwolf, Shaggydog, depart for the Last Hearth, while Bran, Meera, Jojen, Hodor and Bran's direwolf, Summer, plan to go beyond the Wall. Daenerys sends Jorah, Naharis, and Grey Worm to infiltrate Yunkai and open the city gate for her army. Yunkai slaves willingly surrender to her forces. Robb arrives at the Twins and apologizes to Walder for reneging on his agreement to marry a Frey daughter. Walder appears to accept his apology while Edmure marries Roslin Frey, Walder's sole pretty granddaughter. After the newlyweds leave the feast, Walder's men murder Catelyn, Talisa and the Stark bannermen, while Roose Bolton, now a Lannister loyalist, kills Robb. Ser Brynden Tully, Catelyn's uncle, survives, having excused himself from the feast just prior to the slaughter. The Hound and Arya arrive at the Twins during the massacre, but the Hound carries her to safety."], "genres": "N/A", "imdbID": "2178784", "rating": 9.9, "votes": 130393, "number_of_episodes": 74}