{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0534635": "Richard Madden", "0322513": "Iain Glen", "0265610": "Michelle Fairley", "0318821": "Aidan Gillen", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "1754059": "Natalie Dormer", "4263213": "John Bradley", "0322416": "Jack Gleeson", "3849842": "Sophie Turner", "2772105": "Oona Chaplin", "1402546": "Sibel Kekilli", "3310211": "Rose Leslie", "0181920": "James Cosmo", "0283492": "Jerome Flynn", "0001354": "Ciarán Hinds", "0568385": "Michael McElhatton", "0568400": "Ian McElhinney", "3645691": "Finn Jones", "0504320": "Anton Lesser", "1970465": "Kristofer Hivju", "2657974": "Esmé Bianco", "0821471": "John Stahl", "1748634": "Lucian Msamati", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "4535552": "Daniel Portman", "0383835": "Dan Hildebrand", "2812026": "Nathalie Emmanuel", "4430828": "Luke Barnes", "2589085": "Edward Dogliani", "0064155": "Ian Beattie", "1613839": "Ian Whyte", "2489799": "Elisa Lasowski", "5451805": "Michael Power", "2983094": "Aisling Jarrett-Gavin", "5141232": "Max Barber", "5390029": "Lottie Steer", "4293539": "Rhys Howells", "7835502": "Graham Gill", "5866229": "Omar Youssef"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["55"],  "plot": ["Jon is brought before Mance Rayder, the King Beyond the Wall, while the Night's Watch survivors retreat south. In King's Landing, Tyrion asks for his reward. Littlefinger offers Sansa a way out.", "Beyond the wall, those of the Night's Watch that have survived try to go south to warn everyone of what is coming. Samwell is taken to task for not having sent the ravens. Jon Snow meets Mance Rayder, the King beyond the Wall and is accepted among them. In King's Landing, Tyrion's face has healed and Cersei pays him a visit worried about what he might say about her to their father. Tyrion enlists Bronn, now a knight, to protect him. He doesn't get much satisfaction from his father who promises him better living quarters but not much else. Lady Margaery is cementing her place at court. Sansa meanwhile may have a way out of King's Landing courtesy of Lord Baelish. Davos Seaworth has survived and is rescued. He returns to Dragonstone intent on stopping Melisandre but soon finds himself in the dungeons. Robb Stark arrives at Harrenhal to find all of its occupants dead. Daenerys arrives in Astapor looking for an army. Ser Jorah tells her the Unsullied are the best fighters in the world.—garykmcd", "In the aftermath of a decisive battle, the newly formed Lannister-Tyrell alliance rules from the battered capital of the Seven Kingdoms. Elsewhere the tables have turned; Robb Stark makes his way across a bloodstained landscape while his captive runs free and his seat of power sits in ruin; Stannis Baratheon lies broken and defeated while unseen forces gather Beyond the Wall and Across the sea.—GibsonExplorer1976", "Sam is saved from a wight by Ghost first and then by Mormont and a few survivors and Mormont tells that they need to return to The Wall to warn people that danger is coming to Westeros. Jon Snow meets Mance Rayder and he questions why Snow wants to join them and Mance is satisfied with his explanation. Tyrion has a meeting with his father that does not believe that he saved King's Landing from Stannis. Littlefinger offers to help Sansa to Leave King's Landing with him while Ros advises Shae to take care of Sansa and to not trust in Littlefinger. Davos is rescued from an island by Salladhor and he asks to be bought to Dragonstone with the intention of killing Melisandre. Robb and his army arrive at Harrenhal and find all prisoners murdered and only one survivor. Daenerys arrives at Astapor and she negotiates slave-soldiers known as Unsullied with the trader Kraznys mo Nakloz. She is also saved from an attempt of murder from a magician by Barristan Salmy.—Claudio Carvalho, Rio de Janeiro, Brazil", "After a disrespectful visit from Cersei, probing what he'll tell their father about her and Joffrey, new Hand Tywin haughtily laughs away 'unfortunately not proven' bastard son and predecessor Tyrion's appeal for gratitude and reward with the ancestral castle for his part in the defense of the capital. While king and regent hide, Maergery's charitable military orphanage visit completes the Tyrell presence as prominent courtiers. Newly knighted Bron becomes Tyrion's guard again, for a raise. Anxiously Jon appeals to Wildling king Mance Rayder, an amused but suspicious fellow human, his bid to join their fight against the Undead winter monsters. The other Night Watch survivors realize, no raven having been sent by Samwell, they must rush back to warn the Wall it's time to prepare all for the ultimate defense. Salladhor's pirate ship rescues Davos Seaworth from a desert rock island and drops him at beaten king Stannis's castle Dragonstone, where his failure to discredit the red witch and her pyre-obsessed religion 'of the light' gets him locked up. After her remaining loyal Dothraki puke their guts out aboard, Danaerys and Jorah reach the city Astapor, where Kraznys mo Nakloz ruthlessly trains the unconditionally loyal 'Unsullied' slave soldiers for sale, which they want all 8,000 yet ready. Sacked guard commander Barristan Salmy is just in time to save her from a magical attempt on her life and offers his services 'to atone for his failure'. Robb and his men hoped for another battle to win, but find only corpses and one survivor at Harrenhal's ruins.—KGF Vissers"], "genres": "N/A", "imdbID": "2178782", "rating": 8.6, "votes": 37050, "number_of_episodes": 74}