{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0322513": "Iain Glen", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "3652842": "Isaac Hempstead Wright", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0654295": "Alfie Allen", "0322416": "Jack Gleeson", "3310211": "Rose Leslie", "4263213": "John Bradley", "1478079": "Joe Dempsie", "0564920": "Rory McCann", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0103195": "David Bradley", "0538869": "Patrick Malahide", "0568385": "Michael McElhatton", "0891092": "Peter Vaughan", "0002103": "Julian Glover", "3729225": "Gwendoline Christie", "3701064": "Iwan Rheon", "0568400": "Ian McElhinney", "0504320": "Anton Lesser", "2356940": "Hannah Murray", "1032473": "Thomas Brodie-Sangster", "1697771": "Ellie Kendrick", "2247629": "Gemma Whelan", "4535552": "Daniel Portman", "4534098": "Ed Skrein", "3964231": "Kristian Nairn", "2812026": "Nathalie Emmanuel", "2760664": "Jacob Anderson", "1086981": "Josef Altin", "5081192": "Kerry Ingram", "2308450": "Ciaran O'Grady", "0509502": "Michael Liebmann", "1446772": "Alex Mileman", "3727276": "Will O'Connell", "5019482": "Maro Drobnic", "4381947": "Marin Tudor", "5719035": "Roxana Kadyrova", "5719222": "Jamal Ouarraq", "5718777": "El Hasani", "5719301": "Mustapha Mekanassi", "2415584": "Mustapha Rachidi", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["63"],  "plot": ["Bran and company travel beyond the Wall. Sam returns to Castle Black. Jon says goodbye to Ygritte. Jaime returns to King's Landing. The Night's Watch asks for help from Stannis.", "The news of the red wedding has reached King's Landing and Tywin Lannister calls a meeting of the small council. Joffery rejoices at the news but no one supports his plan to present Sansa with Robb's head at his wedding to Margaery. Arya flees the Twins with Sandor Clegane as her protector but not before she sees what they've done to Robb. She exacts a modicum of revenge. Ygritte catches up with Jon Snow but he survives the encounter making it to Castle Black as do Sam and Gilly. Bran makes it through the wall and into the unknown lands. Jaime and Brienne arrive in King's Landing.At Yunkai, Daenerys awaits the reaction of the thousands of slaves who are now free.—garykmcd", "Arya and The Hound escape riding through the massacre of the Stark's army and Arya sees the decapitated body of her brother Robb. When Arya sees a group of drunken soldiers mocking her brother, she steals The Hound's knife and stabs one soldier in his throat while The Hound kills the others. The castrated Theon is tortured and his father and sister receive his penis in a box. Yara Greyjoy travels with fifty men to bring her brother back home. In King's Landing, the Lannisters celebrate the death of Robb. Ygritte reaches Jon Snow and he is seriously wounded by his lover. Davos releases Gendry and gives a boat to him. Sam and Gilly meet Bran and his friends and he gives the dragonglass dagger to Bran. Daenerys is worshiped by the former slaves of Yunkai.—Claudio Carvalho, Rio de Janeiro, Brazil", "Walder Frey celebrates the Starks slaughter, despite his wife's death, unaware Sandor the Hound Clegane rescues Arya. The small council also rejoices in the news, attended by king Joffrey, whom only hand Tywin can stop from serving Robb's head to Sansa at his wedding with Maergery. While Ramsay tortures Theon into even deeper despair, begging for a mercy kill, receiving his penis and threat other body parts follow unless Balon Greyjoy surrenders his conquests doesn't impress the heartless father, but sister Yara Greyjoy sails off on a risky rescue mission with 50 warriors. Jaime gets a lukewarm welcome, master Aemon works on a hand prosthesis. The other surviving halflings suspect Ygritte of deliberately failing to wound Jon mortally when their paths cross, he reaches Castle Black just like Sam and Gilly, while Bran's party passes the Wall into the unknown with the dragon glass knife Sam gave him. Davos liberates Gendry, who gets a boat to return. The freed slaves of Yunkai hail queen Daenerys Targaryen.—KGF Vissers", "The massacre's mastermind is revealed to be Tywin Lannister, who rewards House Frey with the Seat of Riverrun and appoints Roose Bolton as Warden of the North. Theon learns his men surrendered him in return for safe passage from Winterfell and that his captor is Ramsay Snow, Bolton's bastard son. Against Balon's wishes, Yara leads a mission to rescue Theon. Arya and the Hound kill some Frey soldiers mocking Robb's death. Jaime and Brienne arrive in King's Landing where Jamie is reunited with Cersei. Sam and Gilly encounter Bran's party and, unable to prevent them traveling beyond the wall, Sam gives them dragonglass weapons. Sam returns to Castle Black with Gilly. Maester Aemon has Sam send ravens to alert the Seven Kingdoms about the White Walkers. Ygritte finds Jon and shoots him with three arrows, deliberately only wounding him. He escapes, returning to Castle Black. In Dragonstone, Davos helps Gendry escape to prevent his being sacrificed; Stannis forgives Davos, then heads north to aid the Watch against the White Walker threat. In Essos, the freed Yunkai slaves receive Daenerys as their \"mother\"."], "genres": "N/A", "imdbID": "2178796", "rating": 9.1, "votes": 39393, "number_of_episodes": 74}