{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0534635": "Richard Madden", "0322513": "Iain Glen", "0265610": "Michelle Fairley", "0318821": "Aidan Gillen", "0001097": "Charles Dance", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "0654295": "Alfie Allen", "4263213": "John Bradley", "3586035": "Maisie Williams", "2772105": "Oona Chaplin", "1478079": "Joe Dempsie", "3310211": "Rose Leslie", "0181920": "James Cosmo", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0564920": "Rory McCann", "0001354": "Ciarán Hinds", "0700059": "Robert Pugh", "0568400": "Ian McElhinney", "3729225": "Gwendoline Christie", "0188871": "Mackenzie Crook", "0443373": "Paul Kaye", "0751085": "Clive Russell", "0580014": "Tobias Menzies", "1970465": "Kristofer Hivju", "0002103": "Julian Glover", "3701064": "Iwan Rheon", "0852965": "Noah Taylor", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "4430828": "Luke Barnes", "1218607": "Burn Gorman", "2356940": "Hannah Murray", "3444954": "Ben Hawkey", "2657974": "Esmé Bianco", "4535552": "Daniel Portman", "1528121": "Philip McGinley", "0383835": "Dan Hildebrand", "2812026": "Nathalie Emmanuel", "4407586": "Michael Shelford", "0057965": "Clifford Barry", "1588500": "Gary Lightbody", "1999508": "Michelle Costello", "4409663": "Lisa Walsh", "4982706": "Josephine Gillan", "2933452": "Kylie Harris", "4768858": "Pixie Le Knot", "2835616": "Dean-Charles Chapman", "5624523": "Timothy Gibbons", "4264828": "Mark Drake", "3155708": "Matt Butcher", "7835502": "Graham Gill", "6044736": "Tyrone Kearns", "4475182": "Dennis McKeever", "0628040": "Christopher Newman"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["56"],  "plot": ["Robb and Catelyn arrive at Riverrun for Lord Hoster Tully's funeral. Tywin names Tyrion the new Master of Coin. Arya says goodbye to Hot Pie. The Night's Watch returns to Craster's. Brienne and Jaime are taken prisoner.", "Arya may have found a new protector but one of her friends decides not to continue on their journey. Robb arrives in Riverrun for his grandfather's funeral but is not pleased to hear that his uncle Edmure failed to follow his orders and attacked Tywin Lannister's army. His plans to entrap the Lannister's army are now ruined. At King's Landing, Tywin Lannister relieves Baelish of his duties as treasurer and assigns the task to his son Tyrion, who openly admits that he has far more experience spending money than managing it. While collecting the accounting books at Baelish's brothel, Tyrion has a gift for Podrick. In Astapor, Daenerys decides to buy all 8000 of the Unsullied and offers one of her dragons as payment. North of the Wall, the surviving members of the Night's Watch try to stay alive. They stop at Craster's keep and Samwell sees that Gilly is giving birth. Jaime manages to convince his captors that Brienne could bring a hefty ransom provided she is unharmed and left with her virtue intact. His captors agree but Jaime is forced to pay a dear price.—garykmcd", "Daenerys, Jorah and Barristan walk along the Walk of Punishment where slaves are punished and left to die tied to a cross. Against the will of Jorah and Barristan, Daenerys buys 8,000 Unsullied soldiers and the slave translator Missandel giving her biggest dragon in return. Mance sends a small group to scale The Wall and attack Castle Black. Tywin summons the small council and names Tyrion as the new Master of Coin. Soon Tyrion finds that The Iron Throne has a great debt to the Iron Bank of Braavos. Theon is recaptured by his captors but a stranger saves him. Jaime and Brienne are prisoners of Locke and Jaime tries to convince him to let him go. Locke cuts his right hand off.—Claudio Carvalho, Rio de Janeiro, Brazil", "Arriving at Riverrun castle for his grandfather's funeral, Robb is furious that vindictive uncle Edmure Tully foolishly attacked the Lannister army as they can afford the greater losses better due to gold for recruiting while the element of surprise is lost. Tyrion warns the lavish royal wedding compromises the treasury 'earns' him an appointment to master of coin, he explains to his ignorant novice knight guard the Lannister gold is actually borrowed from the Iron Braavos bank, and must ultimately be repaid or they'll finance the enemy. Rewarded for loyal service with a first-ever brothel treat, squire Pod astounds them as the whores refuse payment for the mutual pleasure. Wounded Theon can't stay ahead of his Bolton persecutors, but when they have his butt bared for flight-punitive rape, Ramsay Snow catches up and slays them by archery. Wildling king Mance sends Jon Sow as local expert with an advanced party to have the Wall prepared. Before leaving by ship, Melisandre promises suspicious Stannis she'll be back and help him on the Iron Throne. In Astapor, Daenerys is told she's far too poor to pay for even a fraction of the 8,000 Unsullied, but Kraznys mo Nakloz accepts the largest dragon and throws in the interpreter girl Missandel as demanded. Jamie tries to sweet-talk brigand boss Locke to spare him and rape-readied Brienne for promises of sapphires and gold, but the \"insulted\" fiend severs the \"spoiled-rotten daddy boy\" Kingslayer's right hand.—KGF Vissers", "Robb and Catelyn attend Hoster Tully's funeral in Riverrun. Tywin Lannister sends Littlefinger to the Eyrie to marry Lysa Arryn to secure her alliance, and makes Tyrion the new Master of Coin. Hot Pie is employed by the inn, while Arya and Gendry follow the Brotherhood. Learning of the massacre at the Fist of the First Men, Rayder sends Jon and a band of Wildlings to scale the Wall and attack the Watch while it is weakened. The surviving Night's Watch men return to Craster's Keep, where Gilly gives birth to a son. Theon is freed by an unknown man, who later rescues him again. Melisandre leaves Dragonstone, mysteriously stating that the blood of a king is required for victory. Daenerys barters for the 8,000 Unsullied and the translator Missandei in exchange for one of her young dragons, ignoring Selmy's and Jorah's advice. Jaime persuades his captor, Locke, to prevent Brienne being raped by claiming her father will pay a huge ransom; Locke agrees but he then severs Jaime's right hand without warning."], "genres": "N/A", "imdbID": "2178802", "rating": 8.7, "votes": 34744, "number_of_episodes": 74}