{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0534635": "Richard Madden", "0322513": "Iain Glen", "0265610": "Michelle Fairley", "0318821": "Aidan Gillen", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "1754059": "Natalie Dormer", "2772105": "Oona Chaplin", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "1478079": "Joe Dempsie", "3310211": "Rose Leslie", "0564920": "Rory McCann", "0001671": "Diana Rigg", "3729225": "Gwendoline Christie", "0568400": "Ian McElhinney", "0568385": "Michael McElhatton", "0443373": "Paul Kaye", "0233807": "Richard Dormer", "0188871": "Mackenzie Crook", "0504320": "Anton Lesser", "0751085": "Clive Russell", "0580014": "Tobias Menzies", "1970465": "Kristofer Hivju", "0852965": "Noah Taylor", "3645691": "Finn Jones", "0821471": "John Stahl", "0001216": "Tara Fitzgerald", "5081192": "Kerry Ingram", "2812026": "Nathalie Emmanuel", "2760664": "Jacob Anderson", "1528121": "Philip McGinley", "4535552": "Daniel Portman", "4831584": "Will Tudor", "2835616": "Dean-Charles Chapman", "5624523": "Timothy Gibbons", "4377217": "Shaun Blaney", "6044736": "Tyrone Kearns", "1652341": "Jamie Michie", "5541966": "Niall O'Donnell", "2022142": "Rachel Puchkoff"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["57"],  "plot": ["Robb's army is falling apart. Jaime reveals a story to Brienne that he has never told anyone. Jon breaks his vows. The Hound is granted his freedom. The Lannisters hatch a new plan.", "Brienne and Jaime are delivered to Lord Bolton where Jaime has his wounds treated. He tells Brienne about the events leading up to killing the King and acquiring the name Kingslayer. Sandor Clegane engages in mortal combat but succeeds in gaining his freedom much to Arya's annoyance. At King's Landing, Cersei begins plotting against the Tyrells and seeks Baelish's assistance. Tyrion discusses the cost of the upcoming wedding with Lady Olenna and she agrees to pay half the cost. Tywin Lannister has become aware of the Tyrells plans to have Sansa Stark marry Ser Loras Tyrell but he has his own idea as to who she should marry. Robb has to deal with the murderers of Tywin Lannisters young nephews including Lord Rickard Karstark whom he executes against the advice of those around him. Daenerys' army is on the move. North of the wall, Jon and Ygritte become lovers.—garykmcd", "Jon Snow is questioned about the defenses of The Wall. Then he goes with Ygritte to a cave where they have sex. Daenerys asks her officers who should be their leader and they indicate Grey Worm. Lord Rickard Karstark kills the Tywin's grandsons and Catelyn, Talisa and Edmure advise Robb to keep Rickard as a hostage since if he executes Rickard, his men will leave him and return home. However Robb beheads Rickard in the name of the justice and he loses half of his army. Jaime and Brienne are delivered to Lord Bolton and he gives accommodations to them and Jaime's arm is treated to avoid gangrenous. The Hound defeats Dondarrion and is released by the Brotherhood. Tyrion makes financial arrangements with Oleanna to share the expenses of the wedding. Then Cercei and he are summoned by their father that explains that each one of them will get married.—Claudio Carvalho, Rio de Janeiro, Brazil", "Tyrion is relieved when lady Olenna Tyrell agrees to pay half the lavish royal wedding, to appease the war-tested people, but shocked like Cersei that Hand Tywin decides to curb and balance the growing Tyrell sway by marrying Tyrion to Sansa, presumed heiress of the North when Robb falls, and Cersei, instead of Sansa, to gay heir Loras Tyrell, who is successfully seduced into bed by handsome squire Olyvar, actually one of Petyr's \"working boys.\" Jon Snow finds his Halfling commander most suspicious of him as \"military expert,\" and finally rewards Ygritte for her help by breaking his vow of celibacy, bathing naked and making love in a cave pool. Robb almost halves his army by refusing to spare uncle Rickard Karstark's life, even beheads him in person, for the cowardly vengeful murder of Tywin's innocent boy grandsons Martin and Willem Lannister, fears Walter Frey won't forgive his broken promise to marry a daughter and intends to seize the undefended Lannister home estate. Arya pouts as Sandor Clegane survives a duel to the death with flaming swords and sees his adversary Dondarrion revived by the magic of the light religion, sighing he looses part of himself at every resurrection, pouts worse as Podric deserts her quest for Beric's merry brigand band. Jamie's agony end sin a climax when he's delivered to Lord Bolton, has a barred master fire-cleanse his severed hand and finds relief bathing with shy Brienne, who learns the noble truth about his bad reputation as Kingslayer, actually attempting to prevent senseless bloodbaths. Knights Jorah and Barristan Selmy however happily serve blindly loyal under Daenerys, who has her Unsullied soldiers choose new, 'free' names and an executive officer: Grey Worm, who chooses to keep his slave name as it stands for this moment of emancipation, his birth name for the enslavement.—KGF Vissers", "Tyrion, knowing the Crown is deeply in debt to the Iron Bank, persuades Olenna to pay for half of the royal wedding. Sansa tells Littlefinger she wants to remain in King's Landing. Tywin discovers the Tyrells' intend to marry Sansa to Loras. To circumvent this, he plots to marry Sansa to Tyrion, and Cersei to Loras over both Lannister's objections. Stannis confesses his infidelity to his wife, Selyse, who says she knows and approves. Their daughter, Princess Shireen, sneaks into the dungeon to visit Davos and teaches him to read. Sandor is released after killing Dondarrion in the trial by combat. Thoros resurrects Dondarrion, using the Lord of Light's power. Gendry remains with the Brotherhood, who intend to ransom Arya to Robb. After being delivered to Roose Bolton, Jaime tells Brienne he killed \"Mad\" King Aerys Targaryen to prevent his destroying King's Landing with wildfire. Robb executes Lord Karstark after the latter murders two captive Lannister boys. With the Karstarks abandoning him, Robb hopes to make a new alliance with Walder Frey. Ygritte seduces Jon, who breaks his Night's Watch vows. Daenerys encourages the Unsullied to choose a leader among them; they choose Grey Worm."], "genres": "N/A", "imdbID": "2178788", "rating": 8.9, "votes": 35977, "number_of_episodes": 74}