{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3229685": "Kit Harington", "0534635": "Richard Madden", "0265610": "Michelle Fairley", "0318821": "Aidan Gillen", "0001097": "Charles Dance", "0396924": "Carice van Houten", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "1478079": "Joe Dempsie", "0322416": "Jack Gleeson", "3310211": "Rose Leslie", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0001671": "Diana Rigg", "3729225": "Gwendoline Christie", "0568385": "Michael McElhatton", "0443373": "Paul Kaye", "0233807": "Richard Dormer", "0188871": "Mackenzie Crook", "1164730": "Natalia Tena", "0751085": "Clive Russell", "0580014": "Tobias Menzies", "1970465": "Kristofer Hivju", "3701064": "Iwan Rheon", "2356940": "Hannah Murray", "3645691": "Finn Jones", "1032473": "Thomas Brodie-Sangster", "1697771": "Ellie Kendrick", "2657974": "Esmé Bianco", "1528121": "Philip McGinley", "3964231": "Kristian Nairn", "1623508": "Tom Brooke", "1043031": "Tim Plester", "2407387": "Sara Dylan", "3280686": "Art Parkinson", "7835502": "Graham Gill", "6044736": "Tyrone Kearns", "1652341": "Jamie Michie"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["53"],  "plot": ["Jon and the wildlings scale the Wall. The Brotherhood sells Gendry to Melisandre. Robb does what he can to win back the Freys. Tyrion tells Sansa about their engagement.", "In King's Landing, Tywin Lannister and Lady Olenna meet to discuss his children's proposed marriages. She puts up a good fight but in the end is forced to admit defeat. Tyrion and Cersei bemoan their fate. Tyrion is forced to tell Sansa what his father has decided. Baelish meanwhile eliminates a spy in his midsts. Arya takes an immediate dislike to Melisandre when she arrives at their camp. That dislike grows when she learns Melisandre is taking someone away with her. Jaime negotiates his release and return to King's Landing. Robb, his army depleted, realizes he has no choice but to repair relations with the Freys. However, since Robb didn't marry one of the Frey daughters as promised, they demand Edmure Tully marry one of them instead. Jon, Ygritte and many others arrive at the Wall and begin the 700 ft. climb—garykmcd", "Tywin summons Lady Olenna Tyrell and forces her to accept the marriage of Loras and Cersei. Meanwhile Tyrion discloses his father's decision to Sansa in front of Shae. Melisandre meets the Brotherhood without Banners and takes Gendry into her custody, delivering two sacks of gold to them. Edmure is forced to marry Walder Frey's daughter to help Robb. Theon Greyjoy continues to be tortured and loses his little finger. Jon Snow, Ygritte and the wildling party climb the Wall, but when the ice cracks, they almost die.—Claudio Carvalho, Rio de Janeiro, Brazil", "Hand Tywin blackmails Olenna Tyrell into accepting Loras's shambles marriage to Cersei and Tyrion's to Sansa, as feared by both his kids and bemoaned by their betrothed. Ramsay intensifies Theon's torture, tearing up a little finger, and withdraws his promise of release if Theon guesses where he is and who takes revenge why, smirking he just enjoys sadism. Robb gets a last change to replete his Northern army: Walter Frey will join if his scorned daughter gets to marry, as second choice after Robb failed to, unwilling vassal Edmure Tully, who thus redeems himself. Bran makes his jealously bickering girl companions make up wile Jojen Reed suffers heavy spasms during a vision of Jon's peril. Trying to climb the wall is snowy weather, Jon can barely hook up with Ygritte dangling by a rope after they are cut off as a crack makes a large ice slate come loose and drags half their Wildling party down. The Brotherhood without Banners welcomes red witch Melisandre, who is amazed at the sixfold resurrection and promises Gendry a great future while he's wheeled away to be sold for gold to sustain the brigands and villagers.—KGF Vissers", "In King's Landing, Tywin coerces Olenna into an agreement to marry Cersei to Loras. Cersei admits to Tyrion that Joffrey tried to have him killed during the siege. Tyrion informs Shae and Sansa about his and Sansa's betrothal. Littlefinger tells Varys that he discovered Ros was Varys' informant and that Joffrey killed her. In the Riverlands, Melisandre buys Gendry from the Brotherhood, and foretells Arya that she will kill many people with brown eyes, green eyes, and blue eyes; she promises they will meet again. Having married Talisa, Robb strikes a new agreement with Walder Frey by giving him Harrenhal and having his uncle, Edmure Tully, marry a Frey daughter or granddaughter. Roose Bolton plans to send Jaime to King's Landing, but refuses to allow Brienne to accompany him. At an unknown location, the mysterious man continues torturing Theon. In the North, tension arises between Osha and Meera. Beyond the Wall, Sam continues his flight with Gilly, while Jon and Ygritte scale the Wall with two other Wildlings."], "genres": "N/A", "imdbID": "2178812", "rating": 8.7, "votes": 35312, "number_of_episodes": 74}