{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "0322513": "Iain Glen", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "1754059": "Natalie Dormer", "0322416": "Jack Gleeson", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "1478079": "Joe Dempsie", "1402546": "Sibel Kekilli", "0564920": "Rory McCann", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0001671": "Diana Rigg", "0002103": "Julian Glover", "0568400": "Ian McElhinney", "2356940": "Hannah Murray", "3645691": "Finn Jones", "4534098": "Ed Skrein", "2760664": "Jacob Anderson", "2812026": "Nathalie Emmanuel", "2075330": "Mark Killeen", "0863130": "Ramon Tikaram", "4535552": "Daniel Portman", "0064155": "Ian Beattie", "0072855": "Paul Bentley", "5682064": "Talitha Luke-Eardley", "1368643": "Ross Mullan", "2407387": "Sara Dylan", "5341634": "Sophie Reid"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["56"],  "plot": ["Daenerys tries to persuade the Second Sons to join her against Yunkai. Stannis releases Davos from the dungeons. Sam and Gilly are attacked by a White Walker. Sansa and Tyrion wed.", "The time for Tyrion's wedding to Sansa has arrived. His resolve to not go through with wedding has evaporated and he now accepts its inevitability. He explains to Sansa why he feels he has to go through with it and she too is prepared to do her duty. Joffrey goes out of his way to embarrass them both at the ceremony. Arya assumed Sandor Clegane was taking her to King's Landing and is surprised when tells her where they're going. The Yunkai have hired an army to protect them and Daenerys tries to convince their leaders to come to her side. Most reject her proposal but one decides to take matters into his own hands. Melissandre returns home intent on showing the power of a king's blood. Sam and Gilly encounter a white walker.—garykmcd", "Daenerys asks Barristan to schedule a meeting with the leaders of the 2000- professional mercenaries Second Sons. The vulgar Captain Mero, Captain Prendahl na Ghezn and Lieutenant Daario Naharis discuss with Daenery and she gives two days to the leaders to think about her proposal. Mero returns to his camp and decides to kill Daenerys. During the night, Daario comes to Daenerys tent and gives the heads of the two captains to her and swears to serve her. Sam, Gilly and her baby head to Castle Black and they are surprised by a White Walker. Sam stabs the creature with the dragonglass dagger that he found and he kills the White Walker. The Hound is bringing Arya to The Twins to deliver her to Robb. Melisandre brings Gendry to Dragonstone and seduces him. Then she places three leeches on his body to suck Gendry's blood. Then Stannis throw them into the fire as part of the witchcraft and says the name of people he wants dead: the usurpers Robb Stark, Balon Greyjoy and Joffrey Baratheon. Tyrion gets married with Sansa and gets drunk in the feast. Then he tells to Sansa in their room that he will sleep in a separate bed, and will only consume the marriage if she wants.—Claudio Carvalho, Rio de Janeiro, Brazil", "Joffrey enjoys humiliating dwarf groom Tyrion and scorned teen bride Sansa, but Hand Tywin prevents a real conflict among his offspring. By legendary analogy, Cersei viciously refuses \"upstart\" Maergery calling her sister (in law). Drunk Tyrion sends off Shae and decides against the consummated wedding night Tywin is after. Gendry is seduces in bed by with Melisandre, but only for leeches to harvest his royal blood, which Stannis uses to magically curse his three \"usurper\" rivals. Yunkai hired 2000 mounted mercenaries, the Second Sons, to scare off Danaerys, but she offers to buy off \"to the winning side\" their captain Mero, Prendahl na Ghezn and lieutenant Daario Naharis, denied for credibility, yet Daario, elected to assassinate her at night, decapitates his superiors instead, coveting her. Arya is surprised Sandor 'The Hound' Clegane, who caught her trying to flee the Brotherhood, plans to sell her not to Joffrey but to Robb. Facing the first White Walker, Sam discovers the \"dragon glass\" knife he found kills such monsters.—KGF Vissers", "King's Landing hosts Tyrion and Sansa's wedding. Cersei shows her displeasure toward Margaery and Loras. At the wedding feast, Tyrion causes a drunken scene. Tywin demands that Tyrion quickly produce a Lannister heir, but Tyrion later assures Sansa their marriage will never be consummated without her consent. Sandor tells Arya they are heading for the Twins to ransom her to Robb. Stannis releases Davos, demanding he respect Melisandre. She arrives in Dragonstone with Gendry, whom she seduces to extract his blood using leeches. In a magical ritual, Stannis casts the blood-filled leeches into a fire while naming three usurpers: Robb Stark, Balon Greyjoy, and King Joffrey. Daenerys learns that Yunkai has employed mercenaries called the \"Second Sons\". One of their handsome lieutenants, Daario Naharis, kills the other leaders and pledges the company's loyalty to Daenerys. Sam and Gilly are attacked by a White Walker, which Sam destroys with a dragonglass dagger."], "genres": "N/A", "imdbID": "2178806", "rating": 8.9, "votes": 34977, "number_of_episodes": 74}