{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0001097": "Charles Dance", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "3586035": "Maisie Williams", "0564920": "Rory McCann", "3310211": "Rose Leslie", "1970465": "Kristofer Hivju", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "1402546": "Sibel Kekilli", "0001354": "Ciarán Hinds", "0891092": "Peter Vaughan", "0002103": "Julian Glover", "0504320": "Anton Lesser", "0568400": "Ian McElhinney", "0734654": "Struan Rodger", "1032473": "Thomas Brodie-Sangster", "1697771": "Ellie Kendrick", "3964231": "Kristian Nairn", "0001216": "Tara Fitzgerald", "0141582": "Dominic Carter", "2760664": "Jacob Anderson", "2812026": "Nathalie Emmanuel", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "1086981": "Josef Altin", "4535552": "Daniel Portman", "0204010": "Trevor Allan Davies", "5282143": "Brenock O'Connor", "5081192": "Kerry Ingram", "3238466": "Octavia Selena Alexandru", "5485781": "Hafþór Júlíus Björnsson", "2662620": "Darren Kent", "1146807": "Gary Oliver", "1613839": "Ian Whyte", "2456829": "Alice Hewkin", "5967072": "James Bleakney", "7361455": "Mark Quigley", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["65"],  "plot": ["Jon makes an important decision. Daenerys experiences new consequences. Brienne and Podrick have an unexpected encounter. Bran achieves a goal, while Tyrion makes an important discovery.", "Jon Snow meets Mance and they discuss a peaceful alternative to the battle. Out of the blue, Stannis and his army put the Wildlings under siege and Mance surrenders. Jon asks for mercy for Mance to Stannis since he was well treated by him when he was his prisoner. Tywin wants to force Cersei to marry Loras and they have an argument. Cersei discloses her affair to her father and tells that she will make it public if he insists in marrying her. Jaime and Lord Varys help Tyrion to escape, but he kills Shae that is in Tywin's bed with his hands and his father with a crossbow. Then he leaves king's Landing with Varys in a ship. Daenerys learns that her black dragon killed a three year-old girl and she locks them up in the dungeons. Brienne and Pod meet Arya and The Hound and Brienne has a deadly sword fight with The Hound to keep Arya. Bran, Jojen, his sister and Hodor reach their target but they are attacked by Wights.—Claudio Carvalho, Rio de Janeiro, Brazil", "Jon Snow goes beyond the wall to kill Mance Ryder. He captures Jon Snow, but treats him well and offers peace. Unexpected riders storm in from all directions and slaughter Mance Ryder's men. The army is that of Stannis Baratheon, who takes Ryder as a prisoner on Jon Snow's advice. Cersei confronts her father regarding her supposed marriage to Loras Tyrell, and confesses the truth about hers and Jamie's incest. Daenerys listens to the grievances of her people and puts the dragons under captivity in the dungeons after her missing dragon Drogon kills a small girl. Bran and company travel north and finally reach their destination, where they are attacked by the Wights. A mysterious little girl leads them to safety who claims to be one of an ancient race of the Children, born before the First Men. Brienne and Podrick encounter Arya and the Hound on their journey towards the Eyrie. A fight ensues, and the Hound is left mortally injured; Arya escapes. Elsewhere, Jamie frees Tyrion and tells him that Lord Varys will help him escape, and bids him farewell. Tyrion has a mission of his own. He murders Shae, lying on Tywin's bed and then kills his own father. He is then hidden inside a crate and put aboard a ship departing for the Free Cities. In the end, Arya rides to a seaport and finds a ship ready to sail. She is allowed to travel in it after gives the captain the iron coin given to her by Jaqen, uttering \"Valar Morghulis.\"—Shuvam Nandi", "John Snow arrives at Raydor's encampment claiming to want to negotiate a truce but intent on something else altogether. He is soon found out but help comes from an unexpected source. Brienne and Pod come across the Hound and Arya. When she realizes who Arya is, she feels it's her duty to fight the Hound and return her to her family. Even Arya has other ideas. At King's Landing, Cersei wants her father to cancel her engagement to Loras. As far as he is concerned, the marriage is needed now more than ever but Cersei threatens to reveal her secret if he doesn't agree. Jaime and Varys assist Tyrion in escaping from his cell. Before he leaves the city he calls on his father and there finds Shae in his father's bed. He takes care of both of them. In the east, Daenerys has to deal with her dragons, the cause of death and destruction throughout the countryside.—garykmcd", "Mance Rayder receives Jon Snow fairly well, even after seeing through his assassination aspiration, but the tables turn suddenly after 'only true king' Stannis Baratheon's mounted troops arrive and win the day. Jon is recognized as noble Ned Stark's son and advises sparing Mance. Tywin haughtily waves Cersei's refusal to wed Loras as he promised the Tyrells, dismissing her claim the rumors of incest with Jaime are true and her threat to render that public. Jaime meanwhile helps condemned Tyrion to escape, but first the imp strangles his traitor whore Shae and confronts her present client, patriarch Tywin, whom he crossbow-hits during bowl movement. Bran Stark's part finally reaches the magical tree of the three-eyed raven, but only after passing a last frozen obstacle where corpses come to life, the Wights, to attack them and kill Jojen who expected so resigned, but the survivors are welcomed by the Children, a magical ancient race claiming to be born before the First Men. After an old former slave demands permission to re-sell himself in the service of his master, unable to adapt to the new regime, Daenerys allows contracts up to a year, then learns her dragons also burn children alive as prey and chains them up in the dungeons. Arya is somewhat amused when Podrick accidentally finds her with Brienne, who engages in an absurd duel with Sandor 'The Hound' Clegane over he will be her protector, during which he makes a fatal fall and is cruelly abandoned by Sanya, she buys passage on a ship with the iron coin given to her by Jaqen, uttering \"Valar Morghulis,\" while Varys ships off Tyrion to the 'Free Cities.'—KGF Vissers"], "genres": "N/A", "imdbID": "3060860", "rating": 9.7, "votes": 57866, "number_of_episodes": 74}