{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0001097": "Charles Dance", "1754059": "Natalie Dormer", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "0322416": "Jack Gleeson", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0564920": "Rory McCann", "4263213": "John Bradley", "3310211": "Rose Leslie", "1970465": "Kristofer Hivju", "2356940": "Hannah Murray", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0050959": "Pedro Pascal", "0890055": "Indira Varma", "0401264": "Michiel Huisman", "0891092": "Peter Vaughan", "0568400": "Ian McElhinney", "0002103": "Julian Glover", "0853583": "Owen Teale", "0464305": "Yuri Kolokolnikov", "0141582": "Dominic Carter", "2760664": "Jacob Anderson", "2812026": "Nathalie Emmanuel", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "4535552": "Daniel Portman", "0915453": "Tony Way", "4831584": "Will Tudor", "2835616": "Dean-Charles Chapman", "1086981": "Josef Altin", "0064155": "Ian Beattie", "2181128": "Joel Fry", "0528297": "Finbar Lynch", "5081192": "Kerry Ingram", "5282143": "Brenock O'Connor", "0908422": "Jem Wall", "5532656": "Raewyn Lippert", "1092837": "Lois Winstone", "1782191": "Lu Corfield", "1395532": "Joseph Gatt", "1987270": "Brian Fortune", "0072855": "Paul Bentley", "3561455": "Patrick J Molloy", "0233266": "Emilio Doorgasingh", "4980372": "Trixiebell Harrowell", "4982706": "Josephine Gillan", "6442299": "Xena Avramidis", "2471942": "Derek Horsham", "5290577": "Joshua Sher", "6442298": "Conor Watters", "5967072": "James Bleakney", "2911170": "Laurence Doherty", "8648654": "Marion McDowell", "0621178": "Daniel Naprous", "6432319": "Keti Pjevic", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["57"],  "plot": ["Tyrion is arrested for murder and awaits trial. Sansa escapes King's Landing. Sam sends Gilly to Mole's Town as the Night's Watch finds itself in a tight spot. Meereen challenges Daenerys.", "In the aftermath of the Purple Wedding, the players in King's Landing reassess their situation. In the meantime, the wildling threat to the Night's Watch is becoming imminent, Arya and the Hound continue their journey to the Vale, and Daenerys reaches Meereen.—balerionthecat", "With the death of King Joffrey, Tywin begins laying his plans for the future. Joffrey's younger brother Tommen will become king with Tywin guiding him. The senior Lannister also makes a pact with Oberyn Martell and invites him to sit on the small council. Cersei is grieving over her son's dead body and wants Jaime to kill Tyrion. He refuses and is satisfied to let justice take its course. He also decides it's time for he and his sister to renew their relationship. Margaery is in something of a quandary, not knowing if she is queen or what the future might have in store. Sansa learns the identity of her rescuer.The wildlings attack a village as they head to Castle Black. Davos Seaworth may have a way out of their financial problems. Daenerys arrives in Meeren and has a message for the slaves living there.—garykmcd", "Tywin instructs Tommen how a good king shall rule his realm. Then he makes an agreement with Oberyn Martell to help the Lannister House. Sansa escapes with Dontos to a ship where Littlefinger welcomes her and tells that she is safe now. Tyrion releases his squire Pod from his duties to save his life. Arya and The Hound are received by a farmer and his daughter that offer food and shelter to them; on the next morning, The Hound steals his silver and follows his journey with Arya. Two rangers escape from Craster's Keep and arrive at Castle Black. Jon advises that Rast and Karl must be killed since they know the defenses of Castle Black and they will disclose them to Mance if they are captured. Daario easily kills the champion of Meereen and Daenerys promises to release all the slaves in the city.—Claudio Carvalho, Rio de Janeiro, Brazil", "While kingmaker Tywin starts preparing kid prince Thommen to succeed as king, Jaile can't resist making love with reluctant, vindictive Cersei at Joffrey's coffin and Petyr 'Littlefinger' Baelish evacuates Sansa by ship. Proudly bisexual Oberyn Martell explains to perfect toy boy Olyvar only a prince like he remains most desirable -for both sexes- even after gravity kicks in, but chases all nude toys when Hand Tywin arrives to convert hatred for the Lannisters in an alliance with Dorne to save Westeros from Daenerys when she bids for the iron throne, so Oberyn accepts to sit on the tribunal to judge Tyrion for Joffrey's murder. Jon Snow warns the Watch council that Wildling king Mance may never learn he only lied they have enough troops, so none may escape from the cannibal Thenn clan raiding the countryside. Ser Davos realizes Stannis's only hope to capitalize on Robb's death is borrowing from the Iron Bank in Braavos for mercenaries, lacking enough vassals. The haughty Meereen elite expected their champion to chase Daenaerys, but after Daario slays him effortlessly, she calls for a slave revolt.—KGF Vissers"], "genres": "N/A", "imdbID": "2972426", "rating": 8.7, "votes": 37089, "number_of_episodes": 74}