{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0001097": "Charles Dance", "0654295": "Alfie Allen", "4263213": "John Bradley", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "3310211": "Rose Leslie", "1970465": "Kristofer Hivju", "2356940": "Hannah Murray", "3701064": "Iwan Rheon", "0384152": "Conleth Hill", "0564920": "Rory McCann", "0322513": "Iain Glen", "0050959": "Pedro Pascal", "0890055": "Indira Varma", "0568385": "Michael McElhatton", "0568400": "Ian McElhinney", "0002103": "Julian Glover", "0004355": "Roger Ashton-Griffiths", "0464305": "Yuri Kolokolnikov", "2760664": "Jacob Anderson", "2812026": "Nathalie Emmanuel", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "1086981": "Josef Altin", "0227971": "Paola Dionisotti", "0889338": "Rupert Vansittart", "5485781": "Hafþór Júlíus Björnsson", "0289018": "Grahame Fox", "2996220": "Lino Facioli", "1092837": "Lois Winstone", "1561546": "Jody Halse", "1368037": "Alisdair Simpson", "5275941": "Richard Doubleday", "1782191": "Lu Corfield", "2461009": "Tim Landers", "1938672": "Cormac McDonagh", "1215275": "Andy Moore", "6537691": "Samuel Paul Small", "8648654": "Marion McDowell", "7361455": "Mark Quigley"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["52"],  "plot": ["Theon helps Ramsay seize Moat Cailin. The wildlings attack Mole's Town. Sansa comes up with a story to protect Lord Baelish. Daenerys finds out a secret about Jorah Mormont. Oberyn Martell faces Gregor Clegane, the Mountain.", "Theon Greyjoy is sent by Ramsey to Moat Cailin to convince an ironborn garrison to surrender, promising that they will return to their land. The Wildlings slaughter Mole's Town but Ygritte spares Gilly and her baby. When Sam hears the news in Castle Black, he becomes worried with Gilly, but his friends comfort. A boy gives a scroll to Barristan with the pardon of Jorah signed by Robert Baratheon and Daenerys expels him from the city. Littlefinger is explaining the death of his wife Lysa to a court and Sansa is asked to testify as a witness, and she lies to protect him. Oberyn fights against the Mountain and wants him to confess that he raped and killed his sister Elia Martell.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ramsay now trusts slavish Riek enough to approach the exhausted Ironborn garrison at Moat Cailin \"posing\" as Theon Greyjoy and convince his countrymen to surrender it for safe passage home, which they do after killing their mistrusting commander, and Roose Bolton rewards Ramsay for the ruse by recognizing the bastard as his son and heir of the largest territory in the seven realms. Jon and his mates guessed right that Sam's wife and baby may have survived the Willdling pillaging of Mole's Town by. Littlefinger is acquitted by the lords of the Vale sitting in court for the death of Lysa, ruled a suicide after false testimony in his favor by Sansa, who fears the unknown more and accepts wedding Robin. Jorah is banished at pain of death after Barristan shows Daenerys the anonymously delivered pardon scroll signed by Robert Baratheon proving Mormont was a royal \"spy.\" To Jaime's pleasant surprise, Tyrion's champion Oberyn Martell dances around Cersei's masterly, but by sparing him fatal wounds to incessantly demand a confession for the rape and murder of his sister Elia at Cersei's orders, ends up fatally gripped by the already decked Gregor 'The Mountain' Clegane, sealing Tyon's death sentence for regicide by Tywin in Tommen's name.—KGF Vissers", "The Wildlings attack Mole's Town. Ygritte discovers Gilly hiding and spares her and Little Sam. Ramsay forces Theon to negotiate with the Ironborn to surrender Moat Cailin. The Ironborn agree, hoping to return home, but Ramsay flays and slaughters them. As a reward for securing Moat Cailin, Roose legitimizes Ramsay as a Bolton, making him his heir. In the Vale, Sansa tells the council investigating Lysa's death her true identity and claims that Littlefinger is innocent of murdering her aunt. While Littlefinger starts grooming Robin as the Lord of the Vale, the Hound and Arya arrive, only to leave upon learning of Lysa's death. In King's Landing, the trial by combat begins. Oberyn gains the upper hand but momentarily relaxes his guard while demanding that Ser Gregor confess his crimes. Near death, Ser Gregor trips Oberyn and crushes his skull while boasting that he raped and murdered Elia. Tywin sentences Tyrion to death. In Essos, Grey Worm and Missandei grow closer. Barristan Selmy intercepts a long-delayed pardon from King Robert for Jorah as a reward for spying on Daenerys. She then exiles Jorah from Meereen as a result."], "genres": "N/A", "imdbID": "3060782", "rating": 9.7, "votes": 66780, "number_of_episodes": 74}