{"cast": {"3229685": "Kit Harington", "4263213": "John Bradley", "2356940": "Hannah Murray", "3310211": "Rose Leslie", "1970465": "Kristofer Hivju", "0891092": "Peter Vaughan", "0853583": "Owen Teale", "0141582": "Dominic Carter", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "0464305": "Yuri Kolokolnikov", "1086981": "Josef Altin", "5282143": "Brenock O'Connor", "1395532": "Joseph Gatt", "1613839": "Ian Whyte", "2807170": "Neil Fingleton", "5651858": "Joe Claflin", "7835502": "Graham Gill", "0551076": "Neil Marshall", "2516193": "Jack Roth", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["51"],  "plot": ["The battle between the Night's Watch and the wildlings has come.", "Jon and Samwell are on duty on top of the Wall. Ygritte wants to be the one who kills Jon Snow. A petrified Gilly returns with her baby to Castle Rock, reporting about the wildling attack at Mole's Town. The Nights Watch prepare for battle. The wildling army attack the wall in the night, with giants riding mammoths. Jon sets out on a dangerous journey to help set things right.—Shuvam Nandi", "The Night's Watch men are ready to defend Castle Black against the Wildlings. Gilly arrives with her baby and Sam hides them in a food store. Jon is assigned to protect the Wall by Ser Allister and he goes down to protect the gate. The battle begins with giants and one mammoth trying to open the outer gate. Meanwhile Ygritte and Tormund fight inside Castle Black. Will Castle Black and the Wall fall to the Wildlings attack?—Claudio Carvalho, Rio de Janeiro, Brazil", "The battle at the wall begins. John Snow has urged his superiors to destroy the tunnel entrance but they refuse. Sam is pleased with the sudden re-appearance of Gilly and her baby and hides them in a storage room knowing that he may not survive the attack. When the battle begins, they are beset on both sides of the wall. From the north, Mance Raydor's army attacks sending men climbing up the wall and others to attempt entry through the tunnel. From the south, they are attacked by the raiding party that includes Ygritte. The battle is deadly, and not many survive. While the Night's Watch survives the first night of battle, John Snow realizes that they will not survive a second and sets off to negotiate with Raydor.—garykmcd", "Mance Raydor's huge army arriving at the wall, Watch commander Alliser Thorne practically admits to Jon he should have listened, but can't \"seem weak,\" then rushes off with his deputy as the castle is attacked from both sides, leaving Jon to step up in de facto command on the wall. After maester Aemon finds him in the library reading up on Wildlings and winter monsters, Sam insists to join the defense, promising to survive to Gilly whom he smuggled in with the baby against regulations, and is saved by a squire's arrow. An elite suicide squad dies while preventing a single giant passing the inner tunnel gate after a mammoth opened the outer one. As the Thenn part attack from the south must be repelled, Jon moves down and is saved from Ygraine's arrows by squire Olly, then has her romantically dying in his arms, wishing they never left the icy cave of passion. After poring oil and launching the reaper knife at the wall climbers, the Watch carries the day. Jon however realizes they are too badly outnumbered to afford such losses and sets out on a desperate last chance mission: finding and killing Mance, as the decapitated winter army may then disintegrate as before his rise.—KGF Vissers"], "genres": "N/A", "imdbID": "3060858", "rating": 9.6, "votes": 59663, "number_of_episodes": 74}