{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0001097": "Charles Dance", "1754059": "Natalie Dormer", "0322416": "Jack Gleeson", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "3310211": "Rose Leslie", "1970465": "Kristofer Hivju", "0564920": "Rory McCann", "3729225": "Gwendoline Christie", "0283492": "Jerome Flynn", "1402546": "Sibel Kekilli", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0050959": "Pedro Pascal", "0890055": "Indira Varma", "0401264": "Michiel Huisman", "0568400": "Ian McElhinney", "0891092": "Peter Vaughan", "0853583": "Owen Teale", "0504320": "Anton Lesser", "0464305": "Yuri Kolokolnikov", "2760664": "Jacob Anderson", "2812026": "Nathalie Emmanuel", "0141582": "Dominic Carter", "4535552": "Daniel Portman", "0064155": "Ian Beattie", "0915453": "Tony Way", "4831584": "Will Tudor", "3464945": "Andy Kellegher", "2687517": "Chris Reilly", "3516668": "Stuart Martin", "1395532": "Joseph Gatt", "0909762": "Martin Walsh", "0704893": "Daniel Rabin", "1987270": "Brian Fortune", "4757478": "Dez McMahon", "2407387": "Sara Dylan", "4982706": "Josephine Gillan", "0318958": "Kristen Gillespie", "0242915": "Tommy Dunne", "4562135": "Gabrielle Dempsey", "6411644": "Maria Sikavica", "7835502": "Graham Gill", "6432319": "Keti Pjevic", "10056465": "Kylie Zimmer"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["58"],  "plot": ["Tyrion welcomes a guest to King's Landing. At Castle Black, Jon stands trial. Daenerys is pointed to Meereen, the mother of all slave cities. Arya runs into an old enemy.", "Tywin Lannister gives his son Jaime a new sword and wants him to return to rule at Casterly Rock in his stead. Jaime wants to rejoin the King's guard. Cersei hasn't forgiven her brother for leaving her. Prince Oberyn Martell arrives in King's Landing for the royal wedding. He and his lover, Ellaria Sand, take their pleasure at Littlefinger's establishment. His hatred of the Lannisters becomes apparent as he blames them for the death of his sister. Daenerys' army is marching toward the slave city of Meereen. She comes to realize that her dragons can never be tamed. Sansa still grieves over the loss of her family at the Red wedding. At Castle Black, Jon Snow faces an enquiry before the commanders of the Watch. Arya and Sandor Clegane come across someone from Arya's past.—garykmcd", "Tywin gives a sword made of Valyrian steel to Jaime and orders him to return to Casterly Rock, but Jaime refuses to go. Tyrion is assigned to welcome Prince Doran Matell but he learns that his brother Oberyn will attend the wedding instead and has arrived earlier. Tyrion finds Oberyn with his mistress in the brothel and he finds that he hates the Lannisters. Cersei gives a golden right hand for Jaime and her maid discloses information about Shae that she had overheard. Dontos meets Sansa to thank her for saving his life and gives a necklace that belonged to his mother to her. Tormund and the wildlings team up with the cannibals Thenn under the command of Styr. Jon Snow recovers from the injuries and goes to a hearing with the leaders of the Night's Watch. Arya and The Hound reach a tavern with five men and The Hound is forced to fight against them. Arya kills two men, one of them with her Needle. Daenerys find 163 slaves nailed to crosses and she reaches the front gate of the city of Meereen.—Claudio Carvalho, Rio de Janeiro, Brazil", "Jaime is delighted with the Valyrian steel sword Tywin had forged -first in ages, with a second from the leftover- from Robb's, but refuses to leave the royal guard to the ancestral castle, planning to stay with sister-lover Cersei, only to hear, after fitting the golden hand master Aemon forged, the ingrate blames him for returning \"too late.\" Tyrion's boasting about his diplomatic accomplishment doesn't impress novice knight Bronn as prince of Dorn he as to welcome only sent his younger brother, fierce warrior Obryn Martell, who picks harlots together with his mistress Ellaria Sand and commandeers on top Littlefinger's gay brothel manager Olyvar, the picks a fight there with two junior Lannisters and pierces one's wrist, then elaborates his old hatred for the family to Tyrion. Recovered from his arrow wounds, Jon informs the Night watch council about his mission, braving absurd calls for extreme punishment as oath breaker, to warn how grave the danger s, while Tormund's Wildling party is joined by Styr's cannibal band from the detested rival clan of Thenns. Daenerys finds her dragons no longer reliably tame, 'punishes' Daario and Grey Worm for bickering who can woe her and is greeted by 163 crucified slaves, one per mile to front gate of slave city Meereen.—KGF Vissers", "Tywin oversees the reforging of Ice, House Stark's ancestral Valyrian steel sword, into two new ones. One is for Jaime, who grieves the loss of his sword hand and Cersei's love, and the other is a wedding present for King Joffrey, which Joffrey names Widow's Wail. Prince Oberyn Martell, representing his infirmed brother, Prince Doran of Dorne, arrives in King's Landing to attend the royal wedding. He and his paramour, Ellaria Sand, are greeted by Tyrion. Oberyn secretly seeks revenge against the Lannisters and Gregor Clegane for the rape and murder of his sister, Elia, wife of the unfaithful Prince Rhaegar Targaryen. In the North, Styr and the cannibalistic Thenns reinforce Tormund, Ygritte and the other Wildlings. Maester Aemon absolves Jon after he explains his actions while with the Wildlings and reveals that their army of 100,000 plans to attack Castle Black. In the Riverlands, the Hound and Arya head to the Eyrie where the Hound intends to ransom Arya to her Aunt Lysa, Jon Arryn's widow. Along the way, Arya reclaims her sword, Needle, from Polliver, killing him. In Essos, Daenerys marches her army towards Meereen, the last of the three great slave cities; she fears she is losing control over her growing dragons, now horse-sized."], "genres": "N/A", "imdbID": "2816136", "rating": 9.0, "votes": 42564, "number_of_episodes": 74}