{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "0001097": "Charles Dance", "1754059": "Natalie Dormer", "0192377": "Liam Cunningham", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "0654295": "Alfie Allen", "0322416": "Jack Gleeson", "3652842": "Isaac Hempstead Wright", "3849842": "Sophie Turner", "3729225": "Gwendoline Christie", "1402546": "Sibel Kekilli", "3701064": "Iwan Rheon", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0001671": "Diana Rigg", "0050959": "Pedro Pascal", "0890055": "Indira Varma", "0568385": "Michael McElhatton", "0002103": "Julian Glover", "0852965": "Noah Taylor", "0001216": "Tara Fitzgerald", "0004355": "Roger Ashton-Griffiths", "3645691": "Finn Jones", "1032473": "Thomas Brodie-Sangster", "1697771": "Ellie Kendrick", "3964231": "Kristian Nairn", "2835616": "Dean-Charles Chapman", "4535552": "Daniel Portman", "0064155": "Ian Beattie", "0915453": "Tony Way", "5081192": "Kerry Ingram", "3745225": "Charlotte Hope", "4205735": "Jazzy De Lisser", "0072855": "Paul Bentley", "3531913": "Elizabeth Webster", "0570363": "James McHale", "4768858": "Pixie Le Knot", "1743706": "Jon Thor Birgisson", "1743714": "Orri P. Dyrason", "1743730": "Georg Holm", "0341739": "Raymond Griffiths", "3453345": "Maxwell Laird", "2482781": "Dean Whatton", "3338062": "George Appleby", "6318834": "Krysten Coombs", "6268374": "Neil Baltus", "2643685": "Bryan Cogman", "0378609": "Paul Herbert", "9918149": "Mark Kelvin Ryan", "2429650": "Stella Lutz", "6432319": "Keti Pjevic", "0734654": "Struan Rodger", "1460176": "Sigur Rós", "0806905": "C.C. Smiff", "4422708": "Claire Wright", "10056465": "Kylie Zimmer"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["52"],  "plot": ["Joffrey and Margaery's wedding has come. Tyrion breaks up with Shae. Ramsay tries to prove his worth to his father. Bran and company find a Weirwood tree.", "Sansa still hasn't recovered from the death of her family and refuses to eat despite Tyrion's requests that she do so. She receives a gift from an unexpected source. It's time for the royal wedding and King Joffrey is on his worst behavior with Tyrion the object of his dislike. He adores the sword given to him by his grandfather but uses it to chop up a book given to him by Tyrion. At the reception after the wedding ceremony, a drunken Joffrey ridicules his uncle and orders him to become his cup bearer. Tyrion does as he's told but Joffrey gets his comeuppance. Meanwhile, Lord Bolton returns home to find what his bastard son did to Theon Greyjoy.—garykmcd", "In Dragonstone, Melisandre sacrifices three men that are tied to stakes and offered to the Lord of Light. Roose returns to Dreadfort and finds that Ramsey has tortured and flayed Theon and he is furious with his bastard. At King's Landing, King Joffrey humiliates Tyrion during the feast. Out of the blue, he is poisoned and the guards arrest Tyrion, accused by Cersei of poisoning Joffrey.—Claudio Carvalho, Rio de Janeiro, Brazil", "Desperate to learn left-handed fencing before his helplessness gets known, Jaimie gets a discrete sparring partner: Tyrion's knight Bronn, who also helped finally shipping home his master's doting, beloved harlot Shae to escape Cersei and Tywin's threats. All King's Landing and the royal wedding guests enjoy the grand cathedral ceremony and lavish feast, where despite queen Maerery's attempted distractions, king Joffrey eagerly receives from Tywin the second Valyrian sword but systematically humiliates uncle Tyrion, forced to act as cup-bearer while Sansa is desperate to retire. Returning from the red wedding, Roose Bolton rebukes bastard Ramsay at castle Dreadfort for his failed initiative to exact lands from king Greyjoy for tortured hostage Theon, who now demonstrates his abject submission as dogsbody Riek, then sends them both on a mission. Jojen warns Bran the temptation to escape his misery as warg by sharing a wolf or raven's thoughts is addictive and can cloud his human brain. Stannis allows Melsiandre to alienate more men by burning unconverted subjects. Cersei calls for Tyrion's arrest as Joffrey dies from poisoned wine from the cup Sansa handed her spouse.—KGF Vissers", "Roose Bolton returns to the Dreadfort with his bride, one of Walder Frey's daughters. He chastises Ramsay for torturing and castrating Theon, devaluing him as a hostage. Theon, who has degenerated into a subservient persona called \"Reek,\" discloses that Bran and Rickon Stark are alive and threaten Roose's legitimacy as Warden of the North. Roose orders Ramsay to reclaim the territories under Ironborn occupation, promising a reward if he succeeds. In Dragonstone, Melisandre sacrifices three people, including Stannis' brother-in-law, burning them to death as a tribute to the Lord of Light, delighting Queen Selyse and disgusting Ser Davos and Princess Shireen. To protect Shae from his family, Tyrion arranges to send her to Pentos on Essos, leaving her distressed. Bronn coaches Jaime in left-handed swordplay. King Joffrey and Margaery Tyrell are wed. During the Royal Wedding feast, Joffrey humiliates Tyrion and taunts Sansa just before Joffrey fatally succumbs to poisoned wine. A distraught Cersei has Tyrion arrested for his murder, while Ser Dontos, a former knight, persuades Sansa to leave the feast with him for her protection."], "genres": "N/A", "imdbID": "2832378", "rating": 9.7, "votes": 66943, "number_of_episodes": 74}