{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0396924": "Carice van Houten", "4263213": "John Bradley", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0564920": "Rory McCann", "3729225": "Gwendoline Christie", "0283492": "Jerome Flynn", "0322513": "Iain Glen", "0050959": "Pedro Pascal", "0401264": "Michiel Huisman", "0853583": "Owen Teale", "0001216": "Tara Fitzgerald", "0225483": "Kate Dickie", "0141582": "Dominic Carter", "0569547": "Barry McGovern", "4440305": "Mark Stanley", "0174005": "Ben Crompton", "1086981": "Josef Altin", "4535552": "Daniel Portman", "2996220": "Lino Facioli", "5282143": "Brenock O'Connor", "0065874": "Andy Beckwith", "3444954": "Ben Hawkey", "5485781": "Hafþór Júlíus Björnsson", "1987270": "Brian Fortune", "0429956": "Gerard Jordan", "1839878": "Marko Jelic", "7512462": "Frédéric André", "7835502": "Graham Gill", "5117722": "Phelim Kelly", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["51"],  "plot": ["Tyrion tries to find a champion. Daenerys sleeps with Daario. The Hound becomes wounded. Jon's advice is ignored at Castle Black. Brienne and Podrick receive a tip on Arya's whereabouts.", "Having demanded a trial by combat, Tyrion must now find someone to fight for him. Jaime would gladly do it but admits that he cannot wield a sword effectively with his left hand. Bronn, who has fought for him once before, has accepted the Queen Regent's offer of an arranged marriage with a noblewoman and so is not available. Tyrion finds a champion in someone unexpected. Brienne and Pod stop at an inn and meet Arya's old friend, Hotpie, who tells them she's alive and probably heading to the Eyrie. Daenerys takes Daario into her bed but seeks advice on ruling from her most trusted source. At the Eyrie, Peter Baelish has shocking news for both Sansa and his wife Lysa.—garykmcd", "Jaime visits Tyrion, scolding his self-damning rejection of Tywin's deal, however defeatist, and sadly can't be his champion as his left hand isn't nearly trained enough, Bronn refuses to risk his new-found wealth and spare heiress wedding for a weird friend. Jon returns with his survivors, hailed by the men but scorned by the acting commander, who orders his wolf caged and details him to night rounds, dismissing the urge to disable any access by caving as the Watch stands no chance against the vastly greater army Mance is fielding. Surprise visitor Obyron promises Tyrion to be his champion against Gregor 'The Mountain' Clegane, Cersei's seemingly unbeatable champion, who practices to chopping helpless convicts to pieces. Mercenary leader and suitor Daario finally gets his carnal night with Daenerys after a strip muster, but Jorah talks her out of deputizing him to reconquer Yunkai. Sansa regrets only after the act annoying her groom host Robin Arryn, but Petyr reassures her he'll deal with the regent aunt Lysa, whose protest of ingratitude is punished by pushing her through the moon door. Visited while bathing, Melisandre tells Stannis's devout queen about deceptive \"magic\" tricks with her potions. While Sandor 'The Hound' Clegane and Arya, who finds out about his burning trauma, put a mortally wounded old peasant out of his misery, Podrick and Brienne learns about their whereabouts from the \"deserted\" cook boy.—KGF Vissers", "Cersei appoints Ser Gregor Clegane as her champion in Tyrion's upcoming trial by combat. Jaime and Bronn decline to fight Ser Gregor for Tyrion, but Oberyn accepts. He seeks to avenge his sister, Elia's rape and murder by Ser Gregor during the rebellion. Daenerys takes Daario as her lover, then sends him to handle the resurgent slavers at Yunkai. Melisandre and Selyse prepare to depart Dragonstone, intending to take Shireen with them. As the Wildlings approach Castle Black, Alliser Thorne rejects Jon's suggestion to seal the tunnel. At an inn, Brienne and Podrick meet Hot Pie, who updates them about Arya. They resolve to travel to the Vale, deducing she would seek her living relatives there. In the Vale, Lysa witnesses Littlefinger kissing Sansa. Enraged, she later threatens to throw Sansa through the moon door, a circular opening in the floor with a steep drop to rocks below; Littlefinger intervenes and shoves Lysa to her death."], "genres": "N/A", "imdbID": "3060876", "rating": 9.0, "votes": 38579, "number_of_episodes": 74}