{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0226820": "Stephen Dillane", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "0890055": "Indira Varma", "3586035": "Maisie Williams", "3849842": "Sophie Turner", "4263213": "John Bradley", "2356940": "Hannah Murray", "2812026": "Nathalie Emmanuel", "0401264": "Michiel Huisman", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0654295": "Alfie Allen", "3701064": "Iwan Rheon", "3729225": "Gwendoline Christie", "0937239": "Tom Wlaschiha", "0322513": "Iain Glen", "0000596": "Jonathan Pryce", "0853583": "Owen Teale", "0001216": "Tara Fitzgerald", "0064155": "Ian Beattie", "0504320": "Anton Lesser", "0002103": "Julian Glover", "0796502": "Alexander Siddig", "2760664": "Jacob Anderson", "4535552": "Daniel Portman", "3849670": "Faye Marsay", "0649046": "Deobia Oparei", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "5282143": "Brenock O'Connor", "3745225": "Charlotte Hope", "0312245": "Ian Gelder", "4836100": "Nell Tiger Free", "4514519": "Toby Sebastian", "1821446": "Hannah Waddingham", "5485781": "Hafþór Júlíus Björnsson", "1987270": "Brian Fortune", "1638006": "Michael Condron", "3442270": "Nigel O'Neill", "1378629": "Maggie Hayes", "9169923": "Mary Jordan", "4262187": "Hattie Gotobed", "6839012": "Ella Tweed", "7277068": "Isabelle Jones", "4241029": "David Fennelly", "7394648": "Jason McLaughlin", "3295900": "Tristan McConnell", "6919834": "Laurence O'Fuarain", "0166163": "Ralph Clemente", "3051197": "Anthony John Crocker", "7394886": "Kirsty Nicholls", "2795612": "Munro Graham", "2364487": "Ben Kelly", "7098431": "Rebecca Van Cleave", "5967072": "James Bleakney", "0385945": "Marijan Hinteregger", "4751443": "Ammar Mesic", "7407610": "Graeme Peacock"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["60"],  "plot": ["Stannis arrives at Winterfell. Tyrion runs Meereen as Daario and Jorah go after Daenerys. Jaime and Myrcella leave Dorne. Jon sends Sam and Gilly to Oldtown. Arya challenges the Many-Faced God. Cersei confesses her sins.", "Stannis attacks Winterfell. Sansa and Theon find themselves on a difficult situation. Arya challenges the many face god. Daenerys is surrounded by acquaintances. Jaime and Myrcella leave Dorne. Cersei confesses. Sam goes to oldtown to become the new maester. Jon receives news about his uncle Benjen.", "Stannis and his armies march against the Boltons, meanwhile in Winterfell Sansa finds a new ally. Across the narrow sea Daenarys is surrounded by strangers and Arya plans against Meryn Trant. Jamie sauls back to Kings Landing and Cersei meets with the High Sparrow. At Castle Black Jon's authority is challenged.", "Daenerys finds herself in open country after her exhausted and wounded dragon has set her down and she is soon surrounded by hordes of Dothraki horsemen. Back in Meereen Jorah and Daario set out to find her, leaving Tyrion as regent, helped by Varys. Stannis's attempt to take Winterfell is disastrous - although it affords Sansa and Theon the chance to escape - and there is severe loss of life, culminating in a meeting with Brienne, still out to avenge the death of Renly. Melissandre escapes to Castle Black, where Jon is facing mutiny and Jaime departs from Dorne with Myrcella, who is aware he is her father, though they too encounter treachery. Arya has her revenge on Trant but in disobeying the Many Faced God by not killing the appointed victim she also ends up being disadvantaged. Cersei is forced to perform a walk of shame by the High Sparrow but is saved from total humiliation by Qyburn.—don @ minifie-1", "Stannis awakens to find the winter storm has passed, something Melissandre attributes to the Lord of Light and the sacrifice they made. He also learns that half his army has deserted him and someone close to him has committed suicide. He nonetheless marches on Winterfell but the Boltons are waiting for him. At Castle Black, Sam asks Jon to send him to Oldtown so he can learn to become a maester. Ser Davos pleads Stannis' case but the Watch simply doesn't have the forces to spare. Jon Snow doesn't realize the extent to which some of his men disagree with his actions. In Braavos, Arya visits Ser Meryn Trant and strikes one name off her list. She pays a heavy price however. In Dorne, Jaime, Myrcella and Trystane say their farewells and set sail for home but Ellaria has the last laugh. In Meereen, Ser Jorah and Daario set off to find Daenerys while Tyrion stays behind with Missandei and Grey Worm to govern the city. Daenerys has traveled to a faraway and unfamiliar place. In King's Landing, Cersei decides to confess and pays a heavy penance.—garykmcd"], "genres": "N/A", "imdbID": "3866862", "rating": 9.1, "votes": 51230, "number_of_episodes": 74}