{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "0318821": "Aidan Gillen", "1754059": "Natalie Dormer", "0890055": "Indira Varma", "3586035": "Maisie Williams", "3849842": "Sophie Turner", "0283492": "Jerome Flynn", "0654295": "Alfie Allen", "0568385": "Michael McElhatton", "3701064": "Iwan Rheon", "0937239": "Tom Wlaschiha", "2835616": "Dean-Charles Chapman", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0000596": "Jonathan Pryce", "0796502": "Alexander Siddig", "0649046": "Deobia Oparei", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "3645691": "Finn Jones", "4831584": "Will Tudor", "1638294": "Eugene Simon", "3849670": "Faye Marsay", "0015382": "Adewale Akinnuoye-Agbaje", "4514519": "Toby Sebastian", "4836100": "Nell Tiger Free", "3745225": "Charlotte Hope", "3531913": "Elizabeth Webster", "3307735": "Michael Yare", "0732709": "James McKenzie Robinson", "4262187": "Hattie Gotobed"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["54"],  "plot": ["Arya is put to the test. Tyrion and Jorah are captured by slavers. Loras Tyrell is judged by the Sparrows. Jaime and Bronn face the Sand Snakes. Sansa marries Ramsay Bolton.", "Arya is tested by Jaqen H'ghar in the House of Black and White and he tells that she is ready to become someone else. Tyrion and Jorah have a conversation about Daenerys and Jorah's father and how he was murdered by his own men; out of the blue, they are captured by pirates and turned into slaves. Little Finger stumbles with Lancel in King's Landing and has a meeting with Cersei and he plots against Stannis Baratheon and the Bolton. Jamie and Bronn are riding in Dornes and they meet Myrcella; however they need to fight against the Sand Snakes. Lady Olenna meets with Cersei to discuss the future of Loras Tyrell. He is judged by the High Sparrow and Margaery Tyrell is involved and arrested with her brother to a formal trial. Sansa marries Ramsay Bolton and he humiliates her.—Claudio Carvalho, Rio de Janeiro, Brazil", "In Braavos, Arya grows weary of living in the House of Black and White where no one will explain to her just what she is meant to be doing. She finally learns what they do with the bodies she has been washing when they take them through the door she has been forbidden to go past. Ser Jorah and Tyrion continue to make do with few rations and Jorah learns that his father died north of the wall. They also encounter slavers who take them to Slaver's Bay where Ser Jorah is to fight in the pits. Littlefinger returns to King's Landing telling Cersei of the forthcoming battle between the Boltons and King Stannis. In return for his assistance in fighting the eventual winner, he asks her to name him Warden of the North. Lady Oleanna returns to obtain the release of her grandson but the High Sparrow's inquest into his behavior does not go well - nor does it go well for Queen Margaery. In Dorne, Trystane wants Marcelle to marry him as soon as possible. As Jaime and Bronn arrive in the capital, the Sand Snakes are waiting for them. At Winterfell, Sansa's wedding day arrives.—garykmcd", "Disguised as mounted Dorne guards, Jaime and Bronn reach prince Doran's court and find Myrcella kissing her betrothed Trystane Martell, whom Jaime knocks down. Before they can explain, Elaria's Sand Snakes attack them, but a fight is stopped by Doran's guardsmen, who arrest all. Petyr arrives in King's landing, can only pass Lancel's sparrow militia by insisting Cersei awaits him and tells her about Sansa's survival, whereabouts and impending Bolton wedding, advising her to wait until Stannis attacks Winterfell and crush the weakened winner, even offers to do it for her with men from the Vale. Cersei promises Olenna the alliance with the Lyrells isn't compromised by Loras's impending sparrow 'inquisition' for sodomy, as he would be acquitted, but after he and queen Maergery bluntly deny everything, Olyvar's testimony to his intimate services as squire, even boy king Tommen is horrified to hear both are to be tried and risk execution. On his nuptial day, Ramsay enjoys tormenting bride Sansa, who ends up raped, and Riek, who must give her away as Theon again and witness the 'wedding night' mortified. Crossing ruined Valyria on foot, Jora and Tyrion, who finally gets him talking, learn about each-other's family and motivation, but are captured by slavers from a pirate ship. Tyrion convinces them to keep him alive until they meet a buyer for his dwarf cock, and Jora because the distinguished warrior knight would make a unique fighting pit challenger, so they head for Meereen. Ja'qen duly beats Arya, who meets a former fellow aristocratic postulant, for persistent lies and rebellion, concluding she's not ready to finally abandon her identity, but for one change.—KGF Vissers", "H'ghar takes Arya to a chamber filled with the faces of dead people. Jaime and Bronn reach the Water Gardens and find Myrcella with Trystane. The Sand Snakes attack them but Dornish guards arrive and arrest everyone. Jorah and Tyrion are captured by pirates. They narrowly escape slavery when Tyrion manages to talk their way to the fighting pits of Meereen. Littlefinger informs Cersei that Roose Bolton intends to marry Sansa to Ramsay. He offers to lead the knights of the Vale to Winterfell to defeat whichever weakened side wins the conflict between Roose and Stannis. If successful, Littlefinger will be named Warden of the North. Olenna Tyrell arrives in King's Landing and warns Cersei that imprisoning Loras has jeopardized their alliance. At Loras' inquest, Loras and Margaery both deny his homosexuality. The male prostitute, Olyvar, contradicts their testimony and Margaery is arrested for lying to the gods. Tommen is uncertain and ineffective. At Winterfell, Sansa weds Ramsay. On their wedding night, Ramsay rapes her in front of Theon."], "genres": "N/A", "imdbID": "3866842", "rating": 7.9, "votes": 37814, "number_of_episodes": 74}