{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0226820": "Stephen Dillane", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "0890055": "Indira Varma", "3586035": "Maisie Williams", "0283492": "Jerome Flynn", "4263213": "John Bradley", "1970465": "Kristofer Hivju", "0937239": "Tom Wlaschiha", "0401264": "Michiel Huisman", "2812026": "Nathalie Emmanuel", "0322513": "Iain Glen", "0853583": "Owen Teale", "0001216": "Tara Fitzgerald", "0309693": "Mark Gatiss", "0796502": "Alexander Siddig", "0649046": "Deobia Oparei", "2181128": "Joel Fry", "0064155": "Ian Beattie", "0004355": "Roger Ashton-Griffiths", "0174005": "Ben Crompton", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "4836100": "Nell Tiger Free", "4514519": "Toby Sebastian", "5081192": "Kerry Ingram", "5282143": "Brenock O'Connor", "1613839": "Ian Whyte", "0099610": "Nicholas Boulton", "0534062": "Oengus MacNamara", "1640863": "Lacy Moore", "2524113": "Jack Hickey", "3330066": "Sarine Sofair", "6494921": "Karla Lyons", "4153860": "Ali Lyons", "1987270": "Brian Fortune", "1638006": "Michael Condron", "1051129": "Danny O'Connor", "5424641": "Garry Mountaine", "3280723": "Dylan McDonough", "7394648": "Jason McLaughlin", "7378767": "Ollie Kram", "5106314": "Gemita Samarra", "3392227": "Irma Mali", "7378768": "Aifric O'Donnell", "6018087": "Fiach Kunz", "7378769": "Michael Johnston", "6526717": "Adam Basil", "5967072": "James Bleakney", "9230301": "Robert Brown", "7733897": "Derek Dubery", "0418744": "Charles Jarman", "1242406": "Danko Jordanov", "8256997": "Andrew McClay", "7407610": "Graeme Peacock", "7361455": "Mark Quigley", "10764035": "Mariola Sanz", "5792452": "Michael Stuart", "5206935": "Pablo Verdejo"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["52"],  "plot": ["Jon and the wildlings return to Castle Black. Jaime meets with Doran Martell. Stannis makes a hard choice. Arya runs into Meryn Trant. Daenerys attends the grand reopening of the fighting pits.", "Things are not going well for Stannis and his army. Winter is upon them and they are attacked in the night losing most of their stores. Unable to move forward or back, he dispatches Ser Davos Seaworth to seek help from Castle Black. Jon Snow and the survivors of the attack at Hardhome make it safely back to the wall but the reception they get is anything but warm. In Dorne, Doran Martell takes the diplomatic route telling Jaime that Myrcella can return to King's Landing with him provided certain conditions were met. In Braavos, Arya sees Lord Tyrell who arrives to speak to representatives of the Iron Bank. He's accompanied by Meryn Trant, one of the men on her list. In Meereen, the Great Games begin but the needless killing is not to Daenarys or Tyrion's liking. Ser Jorah defeats his opponents in the arena but a trap is sprung and the Sons of the Harpy attack. Rescue is at hand however.—garykmcd", "Prince Doran Martell of Dorn saves the peace: Jaime is welcome to return his niece Myrcella to Tommen's court, with Dornish groom prince Trystan, who will take Obryn's small council seat. Even Bronn is released, at a small condition, while insolent warmonger Ellaria Sand is forced to repent on her knees. Ramsay's small party successfully raids Stannis's winter-blocked army, rendering his situation desperate by depleting food and other supplies, even horses. Stannis orders Davos, who pleads negotiations in vain, to return to Castle Black and demands supplies from the Night Watch. Meanwhile the grim king finally allows Melisandre to sacrifice his daughter Selyse on the stake on account of her royal Baratheon blood, and Ser Allester moodily opens the gates for commander Jon Snow and the surviving Wildlings he gathered. In Meereen, consort Hizdahr zo Loraq eagerly instructs moody Daenerys, gleefully bantering with pit veteran Daario, how to preside over the great gladiatorial games, bloody enough for the crowd, to her further dismay also starring banished Jorah. His spear is just in time to prevent an assassin killing the queen as suddenly many golden masks are up and the Sons of the Harpy attack, stabbing Hizdahr. The Unsullied guard can barely protect the royal party, until the free dragon arrives and wins the day, allowing 'mother' to mount it. During her invisibility training, Arya witnesses the arrival of master of coin Mace Tyrell, who come discuss the royal debt with the Iron bank, while his knightly escort visits the brothel and Meryn Trant insists on a young harlot.—KGF Vissers", "Ramsay leads a covert attack on Stannis' camp, destroying siege equipment, food stores, and killing many horses. After dispatching Davos to Castle Black to request more supplies, Stannis, with Selyse's approval, allows Melisandre to sacrifice Shireen, burning her alive at the stake, believing it will help win the war. Jon and the other survivors return to the Wall, allowing the Wildlings to pass South. In Dorne, Prince Doran has permitted Jaime and Bronn to return to King's Landing with Myrcella, provided Trystane accompanies them and serves on the small council in Oberyn's stead. Doran also pardons Ellaria and her daughters. Arya aborts her first assassination assignment after spotting Trant accompanying Mace Tyrell, the Master of Coin, who has arrived in Braavos to negotiate with the Iron Bank. In Meereen, combat at Daznak's fighting pit resume. Daenerys is stunned that Jorah is among the fighters. His victory is interrupted when the Sons of the Harpy launch a surprise attack. Loraq is killed while Jorah saves Daenerys. The Harpies quickly swarm Daenerys and her supporters, forcing them and Jorah to retreat into the pit. Drogon suddenly arrives, burning many Sons of the Harpy; Daenerys mounts Drogon and commands him to fly away."], "genres": "N/A", "imdbID": "3866826", "rating": 9.4, "votes": 52420, "number_of_episodes": 74}