{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "1754059": "Natalie Dormer", "0226820": "Stephen Dillane", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "4263213": "John Bradley", "1970465": "Kristofer Hivju", "2356940": "Hannah Murray", "2835616": "Dean-Charles Chapman", "0654295": "Alfie Allen", "3849842": "Sophie Turner", "3701064": "Iwan Rheon", "3729225": "Gwendoline Christie", "0283492": "Jerome Flynn", "0401264": "Michiel Huisman", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0000596": "Jonathan Pryce", "0891092": "Peter Vaughan", "0853583": "Owen Teale", "0174005": "Ben Crompton", "0649046": "Deobia Oparei", "0162281": "Enzo Cilenti", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "4535552": "Daniel Portman", "2181128": "Joel Fry", "4836100": "Nell Tiger Free", "5282143": "Brenock O'Connor", "1638294": "Eugene Simon", "0015382": "Adewale Akinnuoye-Agbaje", "1821446": "Hannah Waddingham", "1987270": "Brian Fortune", "1638006": "Michael Condron", "2988542": "Ian Lloyd Anderson", "1071171": "Jonathan Byrne", "7293493": "Nikola Bace", "4172785": "Roman Beguns", "5967072": "James Bleakney", "1545953": "Rob de Groot", "7407610": "Graeme Peacock", "7361455": "Mark Quigley", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["Jon heads east as trouble begins to stir for Sam and Gilly at Castle Black. Sansa asks Theon for help. Tyrion and Jorah are sold as slaves. Cersei savors her triumph over the Tyrells as new plots are developed in the shadows.", "At Castle Black, Jon Snow, Tormund Giantsbane and a few Rangers head north of the Wall. Master Aemon has reached the end of his days and Sam gets a warning. Stannis and his army face the ravages of winter and Ser Davos recommends they return to Castle Black. At Winterfell, Sansa begs a terrified Theon to help her escape but he proves an inadequate ally. Tyrion and Ser Jorah are sold at a slave market. In Meereen, Daenerys gets unexpected advice from Daario. In King's Landing, Lady Olenna calls on the High Sparrow to seek her grandchildren's release but gets no satisfaction. She may have found an ally. A gloating Cersei visits Margaery in the cells below the Red Keep but the High Septon has a surprise for her. In Dorne, Jaime sees Myrcella who makes it clear that she considers Dorne her home and that she has no intention of leaving.—garykmcd", "Jon Snow rides with Tormund Giantsbane to meet the Wildlings; Aemon Targeryan dies; and Sam is left alone in Castle Black. Sansa asks Theon to light a candle in the broken tower to help her; however he betrays her. Stannis' army is weak with the cold winter but he decides to continue to march to Winterfell. Melisandre wants to sacrifice Stannis' daughter to victory. Tyrion and Jorah are sold to fight in the arena. Lady Olenna has a conversation with the High Sparrow about the destiny of Margaery and Loras Tyrell. Bronn was poisoned by one Sand Snake, but she gives the antidote to him. Jorah sees Daenerys in the arena and he shows his gift to her. Cersei goes to the Black Cells to visit and annoy Margaery and the High Sparrow gives a surprise to her.—Claudio Carvalho, Rio de Janeiro, Brazil", "Captives in Dorne, Bronn only survives poisoning by begging the antidote from the Sandsnakes in the cell next door, Jaime learns in palatial confinement that Myrcella really wants to marry Trystane for love and stay. The High Sparrow tells baffled Olenna his devotion to divine justice can't be bribed in any way, Loras and Maergery face a sodomy trial, which may end not to Cersei's liking either as her incestuous affair with Lancel is known. Jon Snow leaves with Tormund Giantsbane to try rally a Wildling army as ally, leaving behind at castle Black Ser Alliser in command and Sam, who is nearly beaten to pulp trying to defend Gilly from two watchmen, and sits with her at the deathbed of king's brother and master Aemon Targaryen, who warns them to move south while they can. Stannis, who refuses to sacrifice his daughter, waves as the Boltons hoped Davos's advice to wait after winter before attacking in dire conditions Winterfell, where Ramsay constantly abuses his locked up wife Sansa and Riek dares not fail to report her pea to give the alarm signal awaited by Brienne, which gets the accomplice crone servant flailed as traitor. After making love to Daario, Daenerys reluctantly accompanies her spouse Yezzan zo Qaggaz to a reopened fighting pit. Jorah was delighted that the slaver the pirates sold him and Tyrion to took them to Meereen, but she refuses to hear him, only learns about surprise 'gift' Tyrion.—KGF Vissers", "Jon leaves for Hardhome with Tormund and some rangers. Maester Aemon dies shortly after. Gilly is attacked by two Watchmen. Samwell intervenes and is overpowered until Ghost threatens them. Samwell and Gilly consummate their relationship. Sansa begs Theon to help her escape Winterfell, but instead he informs Ramsay, who then flays Brienne's informant inside Winterfell. At his army camp, Stannis refuses Melisandre's request to sacrifice Shireen to gain the Lord of Light's favor. Jorah and Tyrion are sold to slaver, Qaggaz, and are taken to Daznak's fighting pit. Daenerys and her consort, Loraq, inspect the pit in preparation for the upcoming games. Jorah defeats the other fighters, reveals his identity and Tyrion appears as his \"gift\" to her. In Dorne, while in the dungeon, Tyene Sand gives Bronn the antidote to a poison called \"The Long Farewell\" that she has infected him with. Prince Doran allows Jaime to take Myrcella and her fiancé, Prince Trystane, to King's Landing. The High Sparrow denies Olenna's demand that Loras and Margaery be released. The High Sparrow then arrests Cersei for her previous affair with her cousin Lancel."], "genres": "N/A", "imdbID": "3866846", "rating": 8.8, "votes": 36173, "number_of_episodes": 74}