{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "2356940": "Hannah Murray", "1970465": "Kristofer Hivju", "0654295": "Alfie Allen", "2812026": "Nathalie Emmanuel", "0937239": "Tom Wlaschiha", "0568385": "Michael McElhatton", "3701064": "Iwan Rheon", "0322513": "Iain Glen", "0504320": "Anton Lesser", "0174005": "Ben Crompton", "3849670": "Faye Marsay", "2171898": "Birgitte Hjort Sørensen", "0162281": "Enzo Cilenti", "1707712": "Zachary Baharov", "1821446": "Hannah Waddingham", "5282143": "Brenock O'Connor", "0104114": "Richard Brake", "1613839": "Ian Whyte", "1090815": "Ross O'Hennessy", "0564133": "Murray McArthur", "3727276": "Will O'Connell", "0534062": "Oengus MacNamara", "3330066": "Sarine Sofair", "0428901": "Morgan C. Jones", "0516385": "Tim Loane", "4153860": "Ali Lyons", "6494921": "Karla Lyons", "12082793": "Katie Castle", "2439537": "Brann Dailor", "7580654": "Jenny Edgar", "7092861": "Cassie Friel", "2440495": "Brent Hinds", "2442352": "Bill Kelliher", "9314541": "Chelsea Mainwaring", "6096362": "Bobby Marno", "5270502": "Barrie Martin", "5504790": "Simon Millar", "7250074": "Elaine O'Dwyer", "8509117": "Jessica Odell", "6497659": "Kristy Robinson", "15176378": "Tina Rose", "5792452": "Michael Stuart", "1596668": "Royd Tolkien"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["61"],  "plot": ["Tyrion advises Daenerys. Sansa forces Theon to tell her a secret. Cersei remains stubborn. Arya meets her first target. Jon and Tormund meet with the wildling elders.", "In Braavos, Arya is learning slowly and is regularly tested. She poses as an oyster seller and is assigned a specific task. In Meereen, Daenerys sits in judgment on Ser Jorah and Tyrion. While Jorah is again banished, Tyrion soon becomes her advisor. In Winterfell, Sansa learns something important from Theon. Roose Bolton meanwhile awaits Stannis' arrival but Ramsay disagrees with his approach.In King's Landing, Cersei learns from Qyburn that the High Sparrow has a strong case against her and recommends a way out for her. At Castle Black, Sam recovers from his wounds. Jon Snow and Tormund Giantsbane arrive at their destination north of the Wall. While some of them accept the offer of land in the south, many do not. Before they can leave however, the army of walkers arrive.—garykmcd", "Tyrion convinces Daenerys to become her advisor and she spares Johar, banishing him from Meereen. In king's Landing, Cercei refuses to confess and is informed that the High Sparrow has a strong case against her. In Braavos, Arya is assigned to pose as seller of oyster to spy a gambler. In Winterfell, Theon discloses to Sansa that Ramsay has mutilated him and also that he has not killed her two brothers Bran and Rickon. Ramsey tries to convince his father to attack Stannis. Jon Snow and Tormund meet the Wildlings in their village and try to convince them to move to Castle Black, but only 5,000 of them accept the offer and embark in the ships. Out of the blue, they are attacked by the wights and White Walkers.—Claudio Carvalho, Rio de Janeiro, Brazil", "Even thirsting desperately in sparrow jail, Cersei remains too proud and selfish to take maester Qyburn's advice to confess as the evidence is overwhelming. Jon Snow and Tormund can convince only 5000 Wildlings to embark and join the Watch troops, already too late to escape an attack from Wights and White Walkers. Theon explains too viciously pouting Sansa Ramsay broke his will by torture and confides he didn't burn her kid brothers but passes off two farm boys for Bran and Rickon. Ramsay asks Roose fro twenty men to surprise-attack Stannis. Even Daenerys realizes she needs counsel if still hoping to conquer Westeros, hence accepts clever Tyrion to her small council, but he can only get her to spare Jorah the promised execution, not lift his banishment. Ja'qen now trains 'a girl' Arya in impersonation as his spy in Braavos.—KGF Vissers", "Cersei's uncle, Kevan Lannister, is appointed as the Hand of the King. Cersei refuses to confess her crimes. H'ghar tasks Arya to study a marine insurance vendor who defrauds beneficiaries. Disguised as a shellfish peddler, she is to first learn about the insurer and then poison him. Theon tells Sansa that he faked killing Brandon and Rickon. Ramsay asks Roose for twenty men to attack Stannis's camp. In Meereen, Tyrion convinces Daenerys to spare Jorah's life; she does but exiles him again. Jorah returns to Yezzan and asks to fight in the pits. Daenerys accepts Tyrion into her council. Arriving in Hardhome, Jon and Tormund recruit five thousand Wildlings but an army of wights attacks them. Jon kills a White Walker with Longclaw, his Valyrian steel sword. As he, Tormund, and the other survivors escape by sea, they witness the Night King reanimating the dead Wildlings."], "genres": "N/A", "imdbID": "3866850", "rating": 9.8, "votes": 115489, "number_of_episodes": 74}