{"cast": {"0227759": "Peter Dinklage", "0372176": "Lena Headey", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "1754059": "Natalie Dormer", "0226820": "Stephen Dillane", "0192377": "Liam Cunningham", "0384152": "Conleth Hill", "0654295": "Alfie Allen", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "4263213": "John Bradley", "3729225": "Gwendoline Christie", "2835616": "Dean-Charles Chapman", "0937239": "Tom Wlaschiha", "0568385": "Michael McElhatton", "3701064": "Iwan Rheon", "0322513": "Iain Glen", "0000596": "Jonathan Pryce", "0002103": "Julian Glover", "0504320": "Anton Lesser", "0853583": "Owen Teale", "0004355": "Roger Ashton-Griffiths", "0174005": "Ben Crompton", "3849670": "Faye Marsay", "4535552": "Daniel Portman", "0141582": "Dominic Carter", "0064155": "Ian Beattie", "1638294": "Eugene Simon", "5282143": "Brenock O'Connor", "4831584": "Will Tudor", "3645691": "Finn Jones", "3745225": "Charlotte Hope", "3822462": "Rila Fukushima", "3531913": "Elizabeth Webster", "0072855": "Paul Bentley", "1987270": "Brian Fortune", "1638006": "Michael Condron", "0567332": "Stella McCusker", "4249847": "Mishaël Lopes Cardozo", "0307585": "David Garlick", "2701745": "Matt McArdle", "2642707": "Eddie Elks", "3629158": "Gwyneth Keyworth", "0611166": "Emina Minka Muftic", "5080173": "Samantha Bentley", "6442299": "Xena Avramidis", "5243836": "Valis Volkova", "7257651": "Em Scribbler", "7288328": "Rebecca Scott", "7257652": "Rosie Ruthless", "5967072": "James Bleakney", "6096362": "Bobby Marno", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["60"],  "plot": ["Tommen and Margaery wed. Arya has trouble adapting to her new life. Littlefinger reveals his plans to Sansa. Jon gives his first orders as Lord Commander. Tyrion and Varys arrive in Volantis.", "Sansa and Littlefinger finally approach their destination where she learns she is to marry Ramsay Bolton. She initially refuses but Littlefinger convinces her that it's all part of a much greater plan. In Braavos, Arya has now entered the House of Black and White, a dark and somewhat unpleasant place. She learns from Jaqen H'ghar that as a first step, she must rid herself of all personal possessions. Tyrion and Varys arrive in Volantis where Tyrion, already fed up with traveling, heads straight to a brothel where he is recognized. In King's Landing, Tommen and Margaery are married and the young king is enjoying the pleasures of married life. Also, the High Septon is ridiculed when the Sparrows find him in Littlefinger's brothel and march him down the street stark naked. The Septon demands that Cersei does something about these outrageous acts and she decides to visit the man commonly referred to as the High Sparrow. At the Wall, the new commander hands out the assignments but one of the men pays for refusing to obey him.—garykmcd", "Freshly crowned boy king Tommen finally feels a man in the honeymoon bed with pleasing bride Maergery, who hides her hostility to queen-mother Cersei and vice versa, Loras is genuinely happy with Olyvar. Jon Snow chooses his election as watch commander over Stannis's offer to be legitimized and lead the re-conquest of the north, surprises brothers by objectively reassigning tasks, but when an opponent to his election openly refuses an order decapitates him as an example despite pitiful begging. The small council takes little notice of the \"high septon\" protesting that the ascetic purist Sparrows sect, which stripped and lashed him trough the capital after finding him in a brothel, challenges state and church, Cersei informally meets the 'High Sparrow.' Theon 'Reek' shivers at the sight of corpse of a tax-refusing vassal and his family skinned alive by Ramsay, but Roose Bolton warns that a king of the North depends on loyalty cruelty can't command, the Lannisters won't come to their aid, so a dynastic marriage is his option. Petyr reasons away Sansa's reluctance to be wed not to him but red wedding slayer Roose, the only hope for true safety. In Braavos's House of Black and White, enigmatic \"a man\" Jaqen H'ghar trains and depersonalizes \"a girl\" Arya, who pledges to sacrifice to become shadow killer but still can't part with her sword. Finally regretting her ingratitude, Brienne promises to properly train loyal squire Podrick, like Jon does with boy Olly. Arriving with Varys in Volantis, Tyrion heads straight to a brothel, where he's recognized.—KGF Vissers", "Margaery, newly wed to King Tommen Baratheon, manipulates him to consider sending Cersei to Casterly Rock to eliminate her interference. Littlefinger takes Sansa to Winterfell to cement an alliance with Roose Bolton through marriage to his son, Ramsay and Sansa without the Lannisters knowledge. Sansa's unconsummated marriage with Tyrion is considered void. Brienne trains Podrick in swordsmanship. To conform to the House of Black and White, Arya tosses her personal effects into the harbor, but hides Needle in a pile of rocks. At Castle Black, Jon names Thorne First Ranger. When Slynt disobeys Jon's orders, Jon executes him. Lancel discovers the High Septon in a brothel, and he is forced to walk the streets nude as punishment. The High Septon protests to Cersei, who imprisons him. She meets with the High Sparrow, approving the Sparrows' actions. Tyrion and Varys arrive in Volantis. Soon after, Tyrion is abducted by Jorah, intending to give him \"to the queen.\""], "genres": "N/A", "imdbID": "3866836", "rating": 8.3, "votes": 32879, "number_of_episodes": 74}