{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "1754059": "Natalie Dormer", "0226820": "Stephen Dillane", "0396924": "Carice van Houten", "0890055": "Indira Varma", "4263213": "John Bradley", "3849842": "Sophie Turner", "0283492": "Jerome Flynn", "0401264": "Michiel Huisman", "2812026": "Nathalie Emmanuel", "2835616": "Dean-Charles Chapman", "0322513": "Iain Glen", "0000596": "Jonathan Pryce", "0568400": "Ian McElhinney", "0002103": "Julian Glover", "0504320": "Anton Lesser", "0001216": "Tara Fitzgerald", "0004355": "Roger Ashton-Griffiths", "2760664": "Jacob Anderson", "0064155": "Ian Beattie", "2181128": "Joel Fry", "1638294": "Eugene Simon", "0174005": "Ben Crompton", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "5081192": "Kerry Ingram", "5282143": "Brenock O'Connor", "3645691": "Finn Jones", "4831584": "Will Tudor", "0997747": "Gary Pillai", "5908524": "Christian Vit", "4982706": "Josephine Gillan", "5159884": "Meena Rayann", "5521710": "Simon Norbury", "7257731": "Jack Olohan", "2884433": "Slavko Sobin", "4696880": "Paddy Wallace", "2803006": "Allon Sylvain", "6358787": "Will Fortune", "7257732": "Rob Brockman", "5501190": "Daniel Johnson", "7303767": "Richard Fitzwell", "7303768": "Ben Yates", "5080173": "Samantha Bentley", "6442299": "Xena Avramidis", "5243836": "Valis Volkova", "7257651": "Em Scribbler", "7288328": "Rebecca Scott", "7257652": "Rosie Ruthless", "6096362": "Bobby Marno"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["51"],  "plot": ["Jorah Mormont sets sail alongside his prisoner, Tyrion. Cersei makes a move against the Tyrells. Jaime and Bronn sneak into Dorne. Ellaria and the Sand Snakes make their plans. Melisandre tempts Jon. The Harpies attack.", "Jorah Mormont steals a boat to navigate with his captive, Tyrion. Aboard a merchant ship, Jaime and Bronn sail to Dorne to rescue Myrcella. The Iron Bank is charging their loan and Cersei sends a representative of the Small Council to negotiate with the bankers. She then has a meeting with the High Sparrow and gives an army and power to his followers to neutralize the capital's sinners, including the patrons of Littlefinger's brothel, and Ser Loras Tyrell, the brother of Margaery. Tommen and his Kingsguard are stared down by the Faith Militant, and the king refuses to fight his way to the Tyrell knight. The disappointed Margaery leaves his side to stay with her family. Stannis Baratheon plans to head to Winterfell before the snow. Jon Snow is summoning nobles to help the Night's Watch with men and supplies and he has a dilemma with the name of the Bolton family. Melisandre tries to seduce Jon Snow, but he resists the temptation and does not break his vows. Shireen, restless at Castle Black, approaches her father and he informs her of what happened to her when she was a child. Sansa visits the tombs of her ancestors and Littlefinger tells a story of her family tells her that he will depart shortly to meet Cersei. He also advises her that the even the best men can be manipulated. In Dorne, Jaime and Bronn are found by a patrol and need to fight to survive. Ellaria Sand wants war but she is warned that Jaime Lannister and his mercenary accomplice are in her lands. Across the Narrow Sea, Daenerys has a meeting with Hizdahr zo Loraq, and she persists in her refusal to allow gladiatorial combat in Meereen. Tensions between Daenerys' government and the insurgent Sons of the Harpy culminate in the Harpies' ambushing of a party of Unsullied, and the only survivors are Grey Worm and the mortally wounded Ser Barristan Selmy.—Claudio Carvalho, Rio de Janeiro, Brazil", "Cersei continues to spin her web by suggesting to the High Sparrow that the Faith Militant should be armed and given the authority to persecute the sinners of King's Landing. Soon, the organisation is terrorising the community, causing particular havoc at one of Littlefinger's brothels. Cersei also points the finger at Margaery's brother, Ser Loras Tyrell, and he too finds himself imprisoned. Margaery is outraged and expects her royal husband Tommen to do something, but his excursion to the site of the disruption only results in his being stared down by the Faith Militant. Just as Jaime and Bronn arrive in Dorne, Ellaria Sand and Oberyn's three daughters, known as the Sand Snakes, decide to take matters into their own hands. In Meereen, the Sons of the Harpy take the fight to the Unsullied after the power struggle reaches its climax. Meanwhile, at Castle Black, Jon Snow has to resist temptation when Melisandre offers herself to him.—garykmcd", "Jaime and skeptic Bronn arrive by merchant ship in Dorne on secret mission to rescue bastard daughter Myrcella and deal the hard way with a mounted patrol of four guardsman, but the bribed captain still betrayed them to Oberyn's vindictive lover Ellaria Sand and three daughters, who plan to stir a war as Sand Snakes. Prince and master of coin Mace Tyrell feels honored to be dispatched to renegotiate the crown's debt with the iron bank, but the other small council members realize she's culling them systematically. Tyrion is abducted by Jorah Mormont and amused to learn he's to be offered to Daenerys, his destination, as a make up present by the banished knight. Inspired by Cersei, the High Sparrow converts his purist sect into a militia reviving the zealot terror of the Faith Militant, which spares no \"sinners\" instant \"justice\" without recourse. Olyvar can just escape from the brothel, but even lover prince Loras is imprisoned, and despite queen Maergery's best effort boy king Tommen only gets a sanctimonious commiseration from Cersei and lacks the guts to order the golden guard to make way for him to the 'praying' high sparrow. Despite a moment of carnal temptation when Melisandre undresses on his lap, Jon Snow sticks to his sworn duty, staying in Castle Black. Petyr counsels Sansa in the Stark crypt now she accepts to be married off to Ramsay Bolton. Daenery's stubborn refusal to allow voluntary gladiator games further stirs the armed revolt of the growing Sons of the Harpy who overcome a large Unsullied patrol, killed including Ser Barristan, only commander Grey Worm escapes.—KGF Vissers", "Cersei authorizes arming the Sparrows as the Faith Militant, who then arrest Loras Tyrell for homosexuality. Queen Margaery is enraged, but Tommen proves too weak to countermand them. Melisandre attempts to seduce Jon as a means to convince him to accompany Stannis to Winterfell. In Winterfell, before Littlefinger heads to King's Landing, he dispels Sansa's misgivings about marrying Ramsay, promising that Stannis will defeat the Boltons and rescue her, and even if not, she can manipulate Ramsay. Bronn and Jaime secretly land in Dorne to retrieve Myrcella; hearing this, Ellaria and her Sand Snakes plot to avenge Oberyn's death by abducting Myrcella. Jorah intends to redeem himself to Daenerys by presenting Tyrion as a prisoner. In Meereen, Loraq again appeals to Daenerys to reopen the fighting pits, a local tradition; the Sons of the Harpy ambush an Unsullied patrol inside the citadel, critically wounding Grey Worm and killing Ser Barristan Selmy."], "genres": "N/A", "imdbID": "3866838", "rating": 8.5, "votes": 33652, "number_of_episodes": 74}