{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "1754059": "Natalie Dormer", "0890055": "Indira Varma", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0384152": "Conleth Hill", "0654295": "Alfie Allen", "3729225": "Gwendoline Christie", "0000596": "Jonathan Pryce", "0401264": "Michiel Huisman", "0568385": "Michael McElhatton", "3701064": "Iwan Rheon", "0322513": "Iain Glen", "0853583": "Owen Teale", "0174005": "Ben Crompton", "0796502": "Alexander Siddig", "0649046": "Deobia Oparei", "3849670": "Faye Marsay", "4535552": "Daniel Portman", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "1821446": "Hannah Waddingham", "4514519": "Toby Sebastian", "5282143": "Brenock O'Connor", "5485781": "Hafþór Júlíus Björnsson", "3745225": "Charlotte Hope", "0622533": "Joseph Naufahu", "6729880": "Chuku Modu", "7047874": "Staz Nair", "6356811": "Rubi Ali", "6826652": "Fola Evans-Akingbola", "0503319": "Gerald Lepkowski", "1483416": "Richard Rycroft", "6088160": "Diogo Sales", "2999602": "Junade Khan", "2407387": "Sara Dylan", "1987270": "Brian Fortune", "1638006": "Michael Condron", "3524836": "Steve Cash", "6342915": "Robert Fawsitt", "0371160": "Michael Hayes", "0283642": "Tony Flynn", "3820227": "Andrew Bryan", "4767264": "Tristan Heanue", "6928973": "Sabina Arthur", "1935652": "Colin Azzopardi", "6096362": "Bobby Marno", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["50"],  "plot": ["The fate of Jon Snow is revealed. Daenerys is brought before Khal Moro. Tyrion gets used to living in Meereen. Ramsay sends his dogs after Theon and Sansa. Ellaria and the Sand Snakes make their move. Cersei mourns for Myrcella.", "The fate of Jon Snow is revealed. Sansa and Theon flee the Boltons. Jaime and Cersei reunite in King's Landing. The High Sparrow continues to grow in power. The Sand Snakes make a daring move. Tyrion takes his first steps in ruling Meereen. Daario and Jorah pursue the Mother of Dragons. Daenerys is brought before the Dothraki.—Tyler Mathews", "To Jaime's surprise, Cersei doesn't blame him for Myrcella's death, having \"realized\" it was all foretold; he says they can fight to beet 'fate' like their adversaries. In Dorne, Ellaria murders prince Doran, two fellow sand snakes aboard the ship Trystane. Having welcomed the Rd Witch, Ser Davos and some of Snow's friends lock themselves in with him. The High Sparrow gets queen Margaery Tyrell's first confession, but demands a complete one. Theon flees with Sansa and holds off the Ramsay men long enough for them to be surprise-overcome by Podrick and Brienne, who is finally accepted as vassal - protector. Roose warns Ramsay, who already swore revenge for Myranda, that without Sansa they can't hold out against a Lannister army. Tyrion is joined by Varys assessing the worsening situation in Meereen, while Daario and Jorah find Daenerys in captivity of Khal Moro, who spares her as royal widow but also assigns her as such to the Dothraki temple nunnery.—KGF Vissers", "Alliser Thorne assumes command of the Night's Watch, while Ser Davos and several loyalists bolt themselves inside a room with Jon's body; Edd leaves Castle Black to seek help. At Winterfell, Ramsay briefly mourns Myranda, while Sansa and Theon are pursued by Bolton men. Brienne and Podrick arrive, killing the pursuers. Sansa formally accepts Brienne into her service. Jaime arrives in King's Landing with Myrcella's body and vows to Cersei to take back everything taken from them. Obara and Nymeria murder Trystane Martell while, in Sunspear, Ellaria and Tyene kill Prince Doran and Areo Hotah after Doran learns of Myrcella's murder. In Meereen, Tyrion and Varys discover ships are burning in the harbor. Jorah and Daario Naharis continue tracking Daenerys, whom the Dothraki take to Khal Moro. In Braavos, a blinded Arya begs on the street. Each day, the Waif beats her with a staff and forces her to fight. In her bedchamber, Melisandre removes her bejeweled necklace revealing her true form, a frail and elderly woman."], "genres": "N/A", "imdbID": "3658014", "rating": 8.4, "votes": 46768, "number_of_episodes": 74}