{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3229685": "Kit Harington", "3592338": "Emilia Clarke", "1754059": "Natalie Dormer", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "0318821": "Aidan Gillen", "0396924": "Carice van Houten", "2812026": "Nathalie Emmanuel", "0890055": "Indira Varma", "3586035": "Maisie Williams", "0000596": "Jonathan Pryce", "0384152": "Conleth Hill", "2835616": "Dean-Charles Chapman", "1970465": "Kristofer Hivju", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "0283492": "Jerome Flynn", "0654295": "Alfie Allen", "0401264": "Michiel Huisman", "2356940": "Hannah Murray", "0001671": "Diana Rigg", "0103195": "David Bradley", "0002103": "Julian Glover", "0504320": "Anton Lesser", "1152798": "Joseph Mawle", "3645691": "Finn Jones", "0312245": "Ian Gelder", "0004355": "Roger Ashton-Griffiths", "2760664": "Jacob Anderson", "2247629": "Gemma Whelan", "1697771": "Ellie Kendrick", "1638294": "Eugene Simon", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "0889338": "Rupert Vansittart", "0570570": "Tim McInnerny", "5485781": "Hafþór Júlíus Björnsson", "1821446": "Hannah Waddingham", "1264590": "Daniel Tuite", "1043031": "Tim Plester", "7075019": "Robert Aramayo", "4957233": "Aisling Franciosi", "0404809": "Frank Hvam", "8165602": "Bella Ramsey", "4982706": "Josephine Gillan", "2407387": "Sara Dylan", "6301068": "Sabrina Bartlett", "2049190": "Dermot Ward", "4211337": "Aron Hegarty", "0089438": "Sean Blowers", "6682365": "Tom Varey", "8127149": "Nathanael Saleh", "8120026": "Annette Hannah", "8127151": "Jesse Magee", "8127152": "Lucy Gallagher", "6462692": "Fionn Kernan", "8127150": "Michael Nevin", "8133415": "Iona Clarke", "7512462": "Frédéric André", "10093897": "Kevin-Barry Brown", "6289521": "Frank Cannon", "5105035": "Lorena Fernández", "4232488": "Micheal Fitzgerald", "8256997": "Andrew McClay", "8257864": "Megan Parkinson", "5348861": "Francisco Peramos"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["68"],  "plot": ["Cersei and Loras Tyrell stand trial by the gods. Daenerys prepares to set sail for Westeros. Davos confronts Melisandre. Sam and Gilly arrive in the Citadel. Bran discovers a long-kept secret. Lord Frey has an uninvited guest.", "Cersei and Loras stand trial for their crimes, while Jaime celebrates victory with Walder Frey at The Twins. Davos confronts Jon about Melisandre's actions, and Littlefinger reveals his intentions to Sansa. Meanwhile, Bran continues his quest for knowledge in the far North as \"winter\" finally arrives.", "Cersei is to be tried by the Seven, but has plans of her own. Jaime and Bronn celebrate with the Freys. Bran continues his quest for knowledge as the Three-Eyed Raven. Jon and Sansa discuss the impending Winter. Daenerys and her fleet finally make way for Westeros.", "The houses can barely stand by as a broken Loras Tyrell confesses his sins and asks to be branded into the service of the seven gods. Before her trial, Cersei has the Sept of Baelor blown up by the wildfyre cache in the cellar, killing the High Sparrow, most of House Tyrell, Kevan and Lancel Lannister, hundreds of minor nobles, and the Faith Militant. Cersei reveals her incest with Jamie and her murder of Robert Baratheon to Septa Unella before having Ser Gregor Clegane slowly torture her to death. Distraught over his beloved Margaery's death, Tommen plummets to his own. Qyburn has Pycelle killed and succeeds as Hand of the Queen. In Dorne, Varys meets with Lady Olenna and Ellaria Sand, seeking an alliance between Daenerys and their houses against the Lannisters. Davos scolds Melisandre for Princess Shireen's fire death; Jon banishes her instead of accepting her help. Led by child heirs, the Wildlings and surviving northern houses pledge loyalty to Jon as King in the North. Sansa bitterly rebuffs Lord Baelish's romantic overture. Arya kills Walder Frey, assumes his identity, tricks his sons and men into mirror vengeance for the red wedding. Sam and Gilly reach the Citadel in Oldtown, where he's assigned menial duties but sneaks into the secret section and is believed by the grand maester, who still feels no action is required. Benjen accompanies Bran and Meera to the wall but can't go further. In a vision, Bran sees Ned find Lyanna Stark dying after giving birth to Jon Snow during King Robert's rebellion. Jaime returns to King's Landing, where Cersei crowns herself Queen of the Seven Kingdoms. Daenerys names Tyrion Hand of the Queen and sails for Westeros with the Greyjoys, her armies, and her dragons, leaving Daario Naharis and the Second Sons behind to rule Meereen until new leaders are elected.—KGF Vissers", "Before her trial, Cersei destroys the Sept of Baelor by wildfire, killing the High Sparrow, the Tyrells, Lancel and Kevan Lannister, hundreds of nobles, and the Faith Militant; Qyburn has Pycelle killed. Cersei reveals her incest with Jamie and that she killed Robert Baratheon to Septa Unella before having Ser Gregor Clegane torture her until she dies. Distraught over Margaery's death, Tommen commits suicide. In Dorne, Varys meets with Olenna and Ellaria, seeking an alliance between Daenerys and their Houses against the Lannisters. Davos confronts Melisandre over Princess Shireen's death, resulting in Jon banishing her. Led by Lyanna Mormont, the Wildlings and the surviving northern houses pledge loyalty to Jon as King of the North. Sansa rebuffs Littlefinger's romantic overtures. Sam and Gilly reach the Citadel in Oldtown. Benjen accompanies Brandon and Meera to the Wall but is unable to go further. In a vision, Bran sees Ned finding Lyanna Stark as she lies dying after giving birth (to Jon Snow) during King Robert's rebellion. Jaime returns to King's Landing, and Cersei crowns herself Queen of the Seven Kingdoms. Daenerys names Tyrion Hand of the Queen and sails for Westeros with the Greyjoys, her armies, and her dragons, leaving Daario Naharis and the Second Sons behind to rule Meereen until new leaders are elected."], "genres": "N/A", "imdbID": "4283094", "rating": 9.9, "votes": 172004, "number_of_episodes": 74}