{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "1754059": "Natalie Dormer", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "3849842": "Sophie Turner", "2812026": "Nathalie Emmanuel", "0384152": "Conleth Hill", "1970465": "Kristofer Hivju", "0000596": "Jonathan Pryce", "0401264": "Michiel Huisman", "2835616": "Dean-Charles Chapman", "3701064": "Iwan Rheon", "3729225": "Gwendoline Christie", "0654295": "Alfie Allen", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0174005": "Ben Crompton", "2760664": "Jacob Anderson", "1164730": "Natalia Tena", "2247629": "Gemma Whelan", "3645691": "Finn Jones", "0002103": "Julian Glover", "0312245": "Ian Gelder", "0889338": "Rupert Vansittart", "4535552": "Daniel Portman", "1821446": "Hannah Waddingham", "2996220": "Lino Facioli", "0162281": "Enzo Cilenti", "1745190": "George Georgiou", "3691266": "Eddie Jackson", "1798233": "Yousef 'Joe' Sweid", "0372689": "Michael Heath", "0622533": "Joseph Naufahu", "1268748": "Tamer Hassan", "0267256": "Souad Faress", "4789912": "Hannah John-Kamen", "6729880": "Chuku Modu", "7047874": "Staz Nair", "5620867": "Deon Lee-Williams", "4363643": "Elie Haddad", "3040811": "Andrei Claude", "4892918": "Darius Dar Khan", "6826652": "Fola Evans-Akingbola", "2358898": "Wuese Houston-Jibo", "3204142": "Angelique Fernandez", "6088160": "Diogo Sales", "2999602": "Junade Khan", "6706699": "Michael Hooley", "6342915": "Robert Fawsitt", "5243836": "Valis Volkova", "8141459": "Oliver Stockwell", "6096362": "Bobby Marno", "8509117": "Jessica Odell", "10764035": "Mariola Sanz", "5792452": "Michael Stuart"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["Sansa arrives at Castle Black. Tyrion makes a deal with the slave masters. Jorah and Daario sneak into Vaes Dothrak. Ramsay sends a letter to Jon. Theon arrives at Pyke. Cersei and Olenna Tyrell plot against the High Sparrow.", "Sansa arrives at Black Castle with Brienne and Podrick and reunites with Jon Snow, who has resigned from the Night's Watch after the deception of the betrayal of his brothers. Sansa tries to convince him to attack and retake Winterfell while Brienne meets Davos and Melisandre and warns that she killed Stannis and she does not forget or forgive the assassination of Renly through black magic. Littlefinger returns to Runestone and is welcomed by his nephew Robin and convinces him to send his army to protect Sansa at Castle Black. In Meereen, Tyrion negotiates a truce and the end of the support to the Sons of Harpy with the masters of Slaver's Bay. Jorah and Daario arrive at Vaes Dothrak and they meet Daenerys, who explains a plan to them. Margaery meets the High Sparrow and he tells how he learned the truth. Tommen tells Cersei that Margaery will be exposed to the people soon, and Cersei plots a scheme with Olenna to destroy the High Sparrow. Theon returns to the Iron Island and after a cold reception from Yara, he says that he wants to support her. Ramsey stabs Osha with a knife killing her in Winterfell. Jon Snow receives a letter from Ramsey with insults and threatening him. Daenerys is brought to the khals in a temple and the set in motion her evil plan.—Claudio Carvalho, Rio de Janeiro, Brazil", "The High Sparrow tells Maergery how he converted, she pretends remorse and finds Loras broken, unwilling to fight. Tomme turns to Cersei for help, which she promises, then Jaime and she ally with Olena to secretly field the Tyrell army to wipe out the fanatics, the small council tacitly agreeing to sit back' as Tommen dares not move. Resurrected Jon Snow refuses to resume his watch command, welcomes half-sister Sansa and lets her talk him into attempting to reconquer Winterfell on Ramsay, who threatens to torment Rickon to death before them if they try and actually stabs captive Osha before she can strike. While Tyrion and Varys strike a deal with all Savers Bay masters to stop the Sons of the Harpy terror and outgrow slavery in seven years, using unhappy Grey Worm and Missandei as guarantors, Jorah and Daario, who finds out about his leprous affliction, find Daenerys at the Dothrakai city, sneak and to free her, but are told to wait as she insults the assembled khals, who consider her unworthy of the royal widows temple, burns them in it and emerges \"reborn from fire,\" planning to rule them again. Petyr shifts the blame for Sansa's captivity to a suspicious lord and has cousin Robyn \"give him a last chance\" to redeem himself on campaign against Ramsay.—KGF Vissers", "Sansa, Brienne and Podrick arrive at Castle Black. Sansa wants Jon to retake the North. In Meereen, Tyrion offers the masters of Slaver's Bay peace in exchange for slavery being abolished within seven years; this angers former slaves. Littlefinger returns to the Vale to mobilize its soldiers against Ramsay. Dario learns about Jorah's greyscale; they find Daenerys in Vaes Dothrak. In King's Landing, Margaery is allowed to visit Loras while Cersei, Jaime, Kevan, and Olenna shelve their differences and plot to defeat the Sparrows. Theon arrives at Pyke Island and supports Yara's claim to the Iron Islands throne. In Winterfell, Ramsay kills Osha, who tries to assassinate him. Ramsay sends Jon a message, threatening Rickon unless Sansa is returned. Sansa convinces Jon to retake Winterfell. In the temple of the Dosh Khaleen, Daenerys tells the Khal leaders that they are not fit to lead the Dothraki. She ignites the temple, killing them. When she emerges unscathed, the Dothraki horde kneels before her.", "Sansa arrives at Castle Black. Theon arrives at Pyke. Tyrion makes a deal with the slave masters and deals with the slaves. Littlefinger discusses his plans at The Vale. Cersei and Jaime plan their next move while Margaery vists Loras. Jorah and Daario try to rescue Daenerys, but she has other plans."], "genres": "N/A", "imdbID": "4283016", "rating": 9.0, "votes": 43885, "number_of_episodes": 74}