{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "2812026": "Nathalie Emmanuel", "3586035": "Maisie Williams", "0384152": "Conleth Hill", "0564920": "Rory McCann", "0283492": "Jerome Flynn", "3729225": "Gwendoline Christie", "0937239": "Tom Wlaschiha", "2835616": "Dean-Charles Chapman", "0001290": "Richard E. Grant", "0204583": "Essie Davis", "0002103": "Julian Glover", "0504320": "Anton Lesser", "0312245": "Ian Gelder", "3849670": "Faye Marsay", "2760664": "Jacob Anderson", "0233807": "Richard Dormer", "0443373": "Paul Kaye", "0751085": "Clive Russell", "0580014": "Tobias Menzies", "1043031": "Tim Plester", "1264590": "Daniel Tuite", "4535552": "Daniel Portman", "1638294": "Eugene Simon", "0004355": "Roger Ashton-Griffiths", "5485781": "Hafþór Júlíus Björnsson", "1778512": "Jóhannes Haukur Jóhannesson", "4927489": "Melanie Liburd", "5279916": "Leigh Gill", "6792356": "Rob Callender", "0714866": "Sam Redford", "2307468": "Ricky Champ", "7424139": "Ian Davies", "5886289": "Ross McKinney", "1920430": "Steve Love", "2732333": "Brahm Gallagher", "8215768": "Adam Turns", "5652293": "Nanna Bryndís Hilmarsdóttir", "5652121": "Ragnar Þórhallsson", "8158202": "Arnar Rosenkranz Hilmarsson", "8158203": "Brynjar Leifsson", "1944894": "Kristján Kristjánsson", "5418720": "Aaron Archer", "7733897": "Derek Dubery", "6044736": "Tyrone Kearns", "13306640": "Alba Ribó", "6069641": "Gary Wales", "2502703": "Hugh Yeaman"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["Brienne arrives at Riverrun. Arya seeks shelter. Jaime meets with Edmure Tully. Cersei challenges the Faith. Sandor Clegane hunts for revenge. Tyrion faces the consequences of earlier decisions.", "Arya recovers after being helped by the actress whose life she saved, Lady Crane, whom she finds murdered when she wakes up as Waif catches up with her. The Hound goes on a revenge trip and finally reunites himself with Beric. Cersei uses the Mountain to get back at the High Sparrow and his people. Then she receives the cruel news that her son, king Tommen, is manipulated by the high Sparrow to ban the trial by combat in the seven kingdoms. Brienne and Podrick reach Jaime and Bronn. Brienne makes an offer to Jaime to get him, Sansa and the Blackfish satisfied. She tries to convince the Blackfish to take his army North and help Sansa get Winterfell back. As Jaime threatens to kill Lord Edmure's son, Edmure decides to help Jaime take Riverrun. Daenerys comes back to the pyramid in Meereen.—Andreea D", "In Braavos, Lady Crane finds the wounded Arya hidden in her chamber. She stitches her wounds and gives a potion to Arya to sleep. When Arya wakes up, she finds that the Waif has just killed Lady Crane and wants to kill her. Arya flees and is hunted down by the Waif. In Riverlands, Clegane seeks revenge and hunts down the men from the Brotherhood without Banners that killed the settlers; he stumbles upon Beric that invites him to join his group. In Meereen, life seems to be normal; however the Masters send vessels to attack the city. In King's Landing, Cersei challenges the Faith Militant and Gregor defends her killing one fanatic that has attacked him. Out of the blue, King Tommen announces a surprising decision that affects his mother and Loras. Brienne unsuccessfully tries to convince Blackfish to surrender his castle to Jaime. But Jaime makes a deal with Edmure that is released, returns to the castle and surrenders it to Jaime.—Claudio Carvalho, Rio de Janeiro, Brazil", "Jaime, joined by Podrick and Brienne, fails to personally negotiate an honorable retreat with besieged Brynden 'Blackfish' Tully, but allows Brienne and prisoner kin Edmure to try, and the latter succeeds in handing over the castle by talking over the defenders. Cersei challenges the high sparrow by refusing a summons, trusting on the mountain as guard to protect her against cousin Lancel's sparrow militia, but king Tommen makes her hear from the throne room balcony how he sanctions the trials against her and the Tyrels and bans the alternative trial by duel. Revenging the murders on settlers the brotherhood without Banners, Sandor 'The Hound' Clegane bumps onto mate Beric Dondarrion and joins his band. Tyrion's smugness about his pacification deals, flippantly teaching Worm and Missandei to drink and jest, is shaken as a fleet from the masters attacks Meereen. Stabbed Arya is nursed by her assigned mark actress lady Crane, but Ja'qen's Waif killer is after both of them.—KGF Vissers", "Tommen abolishes trial by combat, to Cersei's dismay, who planned to win with Ser Gregor as her champion. In Riverrun, Brienne fails to persuade Brynden Tully to surrender the castle and ride safely North. After Jaime threatens to kill Edmure's infant son, Edmure enters the castle and orders the Tully forces to stand down. Brynden is killed fighting the Lannisters while Brienne and Podrick escape. Varys departs for Westeros on a secret mission. Meereen comes under naval assault by the slaving cities; Daenerys returns on Drogon, accompanied by the Dothraki. The Hound kills four of the rogues, then encounters Berric Dondarrion and Myr Thoros, who have captured the others. They execute them and ask Clegane to join the Brotherhood. Arya seeks out Lady Crane, who tends her wounds. The Waif kills Lady Crane and pursues Arya through the streets. Arya leads the Waif into darkened catacombs and kills her using Needle. Arya places the Waif's face in the House's columned collection room and tells H'ghar that she is Arya Stark of Winterfell, and she is going home."], "genres": "N/A", "imdbID": "4283074", "rating": 8.3, "votes": 43943, "number_of_episodes": 74}