{"cast": {"0227759": "Peter Dinklage", "3229685": "Kit Harington", "3592338": "Emilia Clarke", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "0318821": "Aidan Gillen", "0396924": "Carice van Houten", "2812026": "Nathalie Emmanuel", "1970465": "Kristofer Hivju", "3701064": "Iwan Rheon", "0654295": "Alfie Allen", "0401264": "Michiel Huisman", "2760664": "Jacob Anderson", "2247629": "Gemma Whelan", "1613839": "Ian Whyte", "0162281": "Enzo Cilenti", "1051151": "Paul Rattray", "2746504": "Dean Jagger", "3280686": "Art Parkinson", "8165602": "Bella Ramsey", "1745190": "George Georgiou", "3691266": "Eddie Jackson", "1259150": "Rory Mullen", "2056978": "Mark Tankersley", "4445406": "David Birkbeck", "1496206": "Paul Garrett", "7512462": "Frédéric André", "5967072": "James Bleakney", "10093897": "Kevin-Barry Brown", "9230301": "Robert Brown", "7009175": "Kadrolsha Ona Carole", "6291097": "Patrick Kelly", "8256997": "Andrew McClay", "7407610": "Graeme Peacock", "7361455": "Mark Quigley", "8132412": "Peter Rooney", "2502703": "Hugh Yeaman"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["60"],  "plot": ["Jon and Sansa face Ramsay Bolton on the fields of Winterfell. Daenerys strikes back at her enemies. Theon and Yara arrive in Meereen.", "Meereen is under siege and the fleet of the masters is attacking the city. Daenerys wants to destroy their cities but Tyrion convinces her to not incur in the same mistake of her father in King's Landing. They schedule a meeting with the masters to discuss the terms of surrender. However the masters misunderstand and believe Daenerys want to surrender. She rides Drogon and together with the two other dragons, they burn part of the fleet. Meanwhile Daario and the Dothraki attack the Sons of the Harpy. Then Yara and Theon team up with Daenerys to accept the independence of the Iron Isles and to overthrow Euron. In Winterfell, Jon Snow, Sansa, Davos and Tormund meet with Ramsay, and Jon Snow proposes a dispute between them instead of sacrificing lives in a battle. Ramsay does not accept and they schedule the battle in the morning. Jon Snow plots a scheme with Davos and Tormund and Sansa warns that Ramsay plays dirty. When both armies are ready to battle, Ramsay brings a surprise that affects Jon and his army. Who will win the bloody battle?—Claudio Carvalho, Rio de Janeiro, Brazil", "With the help of her dragons, Daenerys reclaims Meeren. Ramsay refuses a one-on-one battle with Jon. Sansa argues with Jon about his strategy. Theon and Yara reach Mereen and make a deal with Daenerys and Tyrion. Ramsay executes Rickon in his own way, right in front of Jon. Jon seems to be losing the fight of Winterfell, largely outnumbered by Ramsay's people. But then, close to his end, Jon's life is saved by the coming army, much to Sansa's delight. Ramsay tries to flee but Jon goes after him and makes it his mission to kill him. In the meantime Wun Wun goes down. Eventually the Starks have Winterfell and Sansa takes her revenge on Ramsay in a Ramsay style.—Andreea Ward", "While Daario's Dothraki army attacks the Sons of the Harpy, the fiery dragons fight off the slavers fleet, afterward Daenerys and Tyrion agree to a pact with Theon and fellow \"first-ever queen\" Yara to help them fight off uncle Euon and reconquer the Irons Islands if they salty pirates become a peaceful part of \"her\" seven kingdoms. Jon, Davos and Tormund refuse to wait or abandon an attack on the superior Bolton forces. Ramsay posts them outside Winterfell, laughs away a generals duel and proves his sadistic mastery at psychological warfare by leading Stark price Rickon onto the battle field and shooting arrows ever closer at him, drawing Jon to abandon his trenches trap-require position only to collect a juvenile corpse and have his troops, following on Davos's command, exposed to arrow salvos and pincered between impenetrable infantry shield walls. The massacre is stopped only by the late, sudden arrival of Petyr's cavalry from the Vale, which has Ramsay abandon his men in the vain belief the castle will hold out, but before dying from projectiles, the whit giant crushes the front gate. Ramsay is now taken prisoner and exposed to Sansa's beastly wrath in his kennel.—KGF Vissers", "On Tyrion's advice, Daenerys meets with three slave masters to negotiate a surrender, which they refuse. The three dragons attack and burn the slavers' ships. Grey Worm kills two of the masters, leaving one alive to report what he witnessed. Theon and Yara meet with Daenerys and Tyrion to offer an alliance in exchange for the Iron Islands being independent. Near Winterfell, the Stark and Bolton armies meet on the battlefield. Ramsay feigns releasing Rickon before killing him with an arrow. In the battle, the Stark forces are pinned by Bolton soldiers until the Knights of the Vale arrive and overwhelm them. Ramsay flees to Winterfell, but the wildling giant Wun Wun breaches the gate and Ramsay is taken prisoner after Jon beats him senseless. Later, Sansa watches Ramsay's starving hounds devour him."], "genres": "N/A", "imdbID": "4283088", "rating": 9.9, "votes": 239485, "number_of_episodes": 74}