{"cast": {"0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "1754059": "Natalie Dormer", "3586035": "Maisie Williams", "0000596": "Jonathan Pryce", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "0401264": "Michiel Huisman", "0937239": "Tom Wlaschiha", "2835616": "Dean-Charles Chapman", "2356940": "Hannah Murray", "0001671": "Diana Rigg", "0001290": "Richard E. Grant", "0103195": "David Bradley", "0204583": "Essie Davis", "1152798": "Joseph Mawle", "0580014": "Tobias Menzies", "1697771": "Ellie Kendrick", "3849670": "Faye Marsay", "0004355": "Roger Ashton-Griffiths", "0312245": "Ian Gelder", "1821446": "Hannah Waddingham", "0269077": "James Faulkner", "0819087": "Samantha Spiro", "1638294": "Eugene Simon", "1043031": "Tim Plester", "1264590": "Daniel Tuite", "0253126": "Kevin Eldon", "5279916": "Leigh Gill", "4730958": "Eline Powell", "6792356": "Rob Callender", "5354555": "Eva Butterly", "0727778": "David Rintoul", "2238815": "Freddie Stroma", "5039410": "Rebecca Benson", "7075019": "Robert Aramayo", "2088533": "Raül Tortosa", "8314450": "Lucy Hayes", "1063230": "Glen Barry", "4347622": "Brendan O'Rourke", "7592705": "Ross Anderson-Doherty", "8251159": "William Nevan Wilson", "8251160": "James Robert Wilson", "5652293": "Nanna Bryndís Hilmarsdóttir", "5652121": "Ragnar Þórhallsson", "8158202": "Arnar Rosenkranz Hilmarsson", "8158203": "Brynjar Leifsson", "1944894": "Kristján Kristjánsson", "3664502": "Kae Alexander", "0104114": "Richard Brake", "5288927": "Milly Burke Cunningham", "0265610": "Michelle Fairley", "7812128": "Tamsin Greene Barker", "0534635": "Richard Madden", "0568385": "Michael McElhatton", "4846137": "José Mellinas"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["52"],  "plot": ["Bran and Meera find a new ally. Gilly meets Sam's family. Arya makes a difficult choice. The Lannisters and Tyrells march against the High Sparrow.", "The white walkers reach Meera and Bran but they are saved in the last minute by a mysterious black rider who turns out to be Benjen Stark. Sam and Gilly arrive at Horn Hill, where Sam introduces Gilly and Crastor's son to his family. Defending Sam, Gilly confesses that she is a wildling, which is appalling to Randyll. Nevertheless, Randyll accepts the baby into his home. However, Sam changes his mind in the last moment and decides to take Gilly, the baby as well as the Valyrian sword of his father with him and leave his home for good. King Tommen is allowed to see Queen Margery. Instead of killing the actress playing Cersei by poisoning her, Arya recovers her Needle and makes different plans. Jaime and the Tyrell army march into King's Landing, trying to stop Margery's planned walk of shame but the High Sparrow already thought this event through, making sure he will succeed in the end by manipulating King Tommen to take his side. As a result, Tommen fires his father from his job as lord commander of Kingsguard. Daenerys reunites herself with Drogon.—Andreea D", "Beyond the Wall, Bran and Meera are rescued from a wight attack by a mysterious stranger. Gilly and Sam go to Horn Hill and are welcomed by his mother and sister. However when they are having dinner, his father Randyll discovers that Gilly is a Wildling and insults the couple. Tommen meets the High Sparrow that allows him to visit Margaery and she confesses that she repented her sins. Out of the blue, Jaime commands the Tyrell army through King's Landing to release Margaery and Loras, but he is surprised by the revelation of an alliance of the Faith and the Crown. In Braavos, Arya meets Lady Crane and they have a conversation about acting. Then Arya saves the actress from poisoning. However Waif witnesses her behavior and reports to Jaqen that asks her to kill Arya. Meanwhile Arya retrieves the Needle from the hidden place on the rocks and brings it to her room. Daenerys and Daario have a conversation about the number of ships she needs to cross the Narrow Sea with her army. Then she leaves him and returns riding Drogon.—Claudio Carvalho, Rio de Janeiro, Brazil", "Having escaped the cave, Bran is immersed in the Three-Eyed Raven's transferred visions, urged to take his place before the ultimate battle which will also decide their kind's fate. In the forest, the wights attack his party, but a mystery man on horseback saves them. At stately Horn Hill, Sam is welcomed warmly by his mother with Crastor's son 'little Sam', whom Sam wants to leave there with Gilly while he is on mission to become a Maester, but his father Randyll, who dotes his hunter brother, scolds Sam a cowardly bookworm and rejects Gilly as he finds out over dinner she's a Wildling. That night, Sam takes House Tarly's ancestral Valyrian steel sword Heartsbane, and leaves with his family. Jaime and the foolish vindictive guard commander attempt to rescue Margaery from the Faith Militant and Loras from the dungeon, only to find she has repented and see Tommen forge a holy alliance with the High Sparrow. King Tommen dismisses Jaime from the King's Guard and orders him to lead an army from King's Landing to help Walder Frey, who holds Edmure Tully hostage, to retake Riverrun from Brynden Tully. Arya saves star actress Crane from her planned poison assassination and retrieves Needle. Jaqen H'ghar allows the Waif, who spied on them, to find and kill Arya. Uncle Benjen Stark, who saved Brandon and Meera, says he was turned by the White Walkers but un-turned by the Children using Dragonglass. Daenerys mounts Drogon to give a rousing speech inspiring the Dothraki to cross the Narrow Sea and conquer Westeros, despite having no clue how to find a fleet.—KGF Vissers", "Meera escapes the cave with Bran, who is immersed in the Three-Eyed Raven's transferred visions. In the forest, the wights attack, but a man on horseback saves them. At Horn Hill, Sam's father, Randyll, demeans him as a soft bookworm and insults Gilly for being a Wildling. That night, Sam takes House Tarly's ancestral Valyrian steel sword, Heartsbane, and leaves with Gilly and Little Sam. Arya warns Lady Crane of her planned assassination, then retrieves Needle. H'ghar allows the Waif to find and kill Arya. Jaime attempts to rescue Margaery from the Faith Militant, only to find she has repented and Tommen has forged an alliance with the Faith. Tommen forbids Jaime to serve as a King's Guard in King's Landing and orders him to aid Walder Frey, who is holding Edmure Tully hostage, to retake Riverrun from Brynden Tully. Benjen Stark, the man who saved Meera and Brandon, says he was turned by the White Walkers but later unturned by the Children using Dragonglass. Daenerys mounts Drogon and gives a rousing speech inspiring the Dothraki to cross the Narrow Sea and conquer Westeros for her."], "genres": "N/A", "imdbID": "4283054", "rating": 8.3, "votes": 40374, "number_of_episodes": 74}