{"cast": {"0227759": "Peter Dinklage", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "3849842": "Sophie Turner", "2812026": "Nathalie Emmanuel", "3586035": "Maisie Williams", "0384152": "Conleth Hill", "3652842": "Isaac Hempstead Wright", "1970465": "Kristofer Hivju", "0654295": "Alfie Allen", "0401264": "Michiel Huisman", "3729225": "Gwendoline Christie", "0937239": "Tom Wlaschiha", "0322513": "Iain Glen", "0001884": "Max von Sydow", "3964231": "Kristian Nairn", "0001290": "Richard E. Grant", "0204583": "Essie Davis", "1561982": "Pilou Asbæk", "2247629": "Gemma Whelan", "0174005": "Ben Crompton", "1697771": "Ellie Kendrick", "3849670": "Faye Marsay", "2760664": "Jacob Anderson", "0269923": "Michael Feast", "3664502": "Kae Alexander", "4535552": "Daniel Portman", "0195928": "Darrell D'Silva", "0253126": "Kevin Eldon", "5279916": "Leigh Gill", "4730958": "Eline Powell", "6792356": "Rob Callender", "5354555": "Eva Butterly", "0298842": "Vladimir 'Furdo' Furdik", "0119804": "Ania Bukstein", "0503319": "Gerald Lepkowski", "1519719": "Annette Tierney", "4744043": "Sam Coleman", "0287562": "Wayne Foskett", "7509185": "Sebastian Croft", "5502295": "Matteo Elezi", "7509186": "Fergus Leathem", "1236825": "Kate Anthony", "1090693": "Sally Mortemore", "6706699": "Michael Hooley", "6316115": "Ruairí Heading", "3169635": "Robert Render", "2313671": "James Lecky", "1063230": "Glen Barry", "4347622": "Brendan O'Rourke", "7592705": "Ross Anderson-Doherty", "5652293": "Nanna Bryndís Hilmarsdóttir", "5652121": "Ragnar Þórhallsson", "8158202": "Arnar Rosenkranz Hilmarsson", "8158203": "Brynjar Leifsson", "1944894": "Kristján Kristjánsson", "4560675": "Kristina Baskett", "4635997": "Rachelle Beinart", "2336143": "Logan Bruce", "11584302": "Declan Curran", "7812128": "Tamsin Greene Barker", "11327263": "Tom Leavey", "6096362": "Bobby Marno", "4739464": "Casey Michaels", "6740076": "Darragh O'Connor"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["57"],  "plot": ["Sansa and Jon make plans. Arya is given another chance to prove herself. Jorah confesses a secret to Daenerys. Tyrion meets with a red priestess. Yara finds her rule tested. Bran discovers the origin of the White Walkers.", "Littlefinger faces the consequences of his actions. Sansa and Jon make plans. Daenerys decides Jorah's fate. An uneasy truce in Slaver's Bay doesn't withhold Tyrion from trying to improve the situation. The Ironborn choose their new ruler. Noone(Arya Stark) is given a new mission and witnesses a play. Bran learns about how the Long Night came to be but brings chaos upon his group. Wyllis holds the door.", "Sansa receives a sealed letter from Littlefinger and she meets him with Brienne. Sansa discloses the treatment of Ransay and despises her former friend. Arya continues her training in Braavos and Jaqen offers another assignment to her to kill an actress. Bran discovers the origin of the White Walkers in one of his visions. On the Iron Island, Theon supports his sister Yara to be the Queen; however their uncle Euron Greyjoy arrives and claims the throne for him. In Vaes Dothrak, Jorah shows his greyscale to Daenerys and discloses his love for her and Deaenery commands him to find a cure to his disease. In Meereen, people are in temporary peace and he has an encounter with a Red Priestess. Bran disobeys the Three-Eyed Raven and has a vision alone of the White Walkers. Out of the blue, he is touched by Night's Kings with tragic consequences. Sansa, Jon and Davos plot an alliance with other Houses from the North to retake Winterfell.—Claudio Carvalho, Rio de Janeiro, Brazil", "Petyr arranges by letter to meet Sansa, who only comes with hostile Brienne to disown his protection, blaming him for the abusive marriage to Ramsay, and refuse an alliance with his Vale army. Instead she joins Jon Snow and Ser Davos, hoping for other Northern houses support to reconquer at least Winterfell. Desperate to conclude her \"faceless training,\" Arya reluctantly accepts to poison on actress, solely because a rival paid Ja'qen, after attending the amateur company's grotesque performance ridiculing the deaths of kings Robert and Joffrey Baratheon. Yara expects to be elected first-ever queen of Iron Island after Theon pledges his support, but Balon's brother Euron Greyjoy arrives In time to secure the Salt Throne by ridiculing his rivals, who steal the fleet during his enthroning sea-rebirth ritual. Daenerys rides off as Dothraki queen with Daario at her side, \"commanding\" Jorah, who shows his greyscale affliction, to ride off for a cure. Bran's latest vision shows how the white walkers were magically created against hostile mankind, but he breaks the Three-Eyed Raven rules at his peril.—KGF Vissers", "Sansa secretly meets with Littlefinger, who offers the Vale's forces and says her great uncle, Brynden Tully, is building an army in Riverrun. Sansa distrusts Littlefinger and declines his help. Jon and Sansa leave Castle Black to gather Northern houses' support. Sansa sends Brienne to meet with her great-uncle, Brynden Tully. In Braavos, Arya is tasked to assassinate Lady Crane, an actress. Beyond the Wall, Brandon learns that the Children of the Forest created the White Walkers to protect themselves from mankind. In the Iron Islands, Euron wins the Kingsmoot, despite confessing he killed Balon; Yara, Theon, and their supporters flee, taking many ships. In Essos, Daenerys orders Jorah to return after finding a cure for his greyscale. In Meereen, Kinvara, a red priestess, meets Tyrion and Varys and promises to support Daenerys. In Brandon's unaccompanied vision, the Night King touches him, leaving his mark and making the cave vulnerable. The Night King, White Walkers, and hordes of wights attack the cave, killing the Three-Eyed Raven, several Children, Summer, and Hodor, whose younger self was rendered mentally disabled by Meera's order to \"Hold the door.\""], "genres": "N/A", "imdbID": "4283028", "rating": 9.7, "votes": 84431, "number_of_episodes": 74}