{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3229685": "Kit Harington", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "3849842": "Sophie Turner", "2812026": "Nathalie Emmanuel", "3586035": "Maisie Williams", "0384152": "Conleth Hill", "0000596": "Jonathan Pryce", "1970465": "Kristofer Hivju", "0654295": "Alfie Allen", "0937239": "Tom Wlaschiha", "3701064": "Iwan Rheon", "0568385": "Michael McElhatton", "3729225": "Gwendoline Christie", "2835616": "Dean-Charles Chapman", "3652842": "Isaac Hempstead Wright", "0001884": "Max von Sydow", "0538869": "Patrick Malahide", "0853583": "Owen Teale", "0174005": "Ben Crompton", "1561982": "Pilou Asbæk", "0269923": "Michael Feast", "2760664": "Jacob Anderson", "2247629": "Gemma Whelan", "3964231": "Kristian Nairn", "3849670": "Faye Marsay", "1697771": "Ellie Kendrick", "4535552": "Daniel Portman", "1613839": "Ian Whyte", "3664502": "Kae Alexander", "5485781": "Hafþór Júlíus Björnsson", "3531913": "Elizabeth Webster", "3591245": "Dylan Edwards", "1483416": "Richard Rycroft", "1051151": "Paul Rattray", "5282143": "Brenock O'Connor", "4836100": "Nell Tiger Free", "1519719": "Annette Tierney", "4744043": "Sam Coleman", "7509186": "Fergus Leathem", "0481924": "Richard Laing", "7509185": "Sebastian Croft", "8108764": "Cordelia Hill", "5502295": "Matteo Elezi", "0371160": "Michael Hayes", "1987270": "Brian Fortune", "1638006": "Michael Condron", "0283642": "Tony Flynn", "6342915": "Robert Fawsitt", "3524836": "Steve Cash", "7250066": "Elynia Betts", "6289521": "Frank Cannon", "6096362": "Bobby Marno", "8509117": "Jessica Odell"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["54"],  "plot": ["Bran trains with the Three-Eyed Raven. Tommen meets with Cersei. Tyrion makes a bold move. Theon leaves while at Pyke new issues arise. Ramsay's brother is born. Davos asks Melisandre for a miracle.", "Bran trains with the Three-Eyed Raven. In King's Landing, Jaime advises Tommen. Tyrion demands good news, but has to make his own. At Castle Black, the Night's Watch stands behind Thorne. Ramsay Bolton proposes a plan, and Balon Greyjoy entertains other proposals.", "Brandon is trained by Three-Eyed Raven and has visions of his father Ned's childhood when he was young, happy and Hodor could speak. At Castle Black, Davos and his men are threatened by the Night's Watchmen but the Wildlings break into the Castle and the position of power changes. Cersei is protected by the Mountain and Tommen, who does not allow her to go to Myrcella's funeral. However, Jaime has a conversation with him and convinces Tommen to speak with his mother. Then Jaime challenges the High Sparrow and finds out how powerful he is. Tyrion decides to release two dragons that are not nourishing. Arya is being beaten again and is still blind. Ramsey learns that his father has a baby son and he takes drastic actions. Theon decides to leave Sansa who intends to go to Castle Black to find Jon Snow. The Greyjoys will have a new heir at the Iron Islands. Davos makes an impossible request of Melisandre, but the witch is powerful.—Claudio Carvalho, Rio de Janeiro, Brazil", "Jaime attends Myrcella's grand funeral, where he almost provokes the High Sparrow, after convincing Tommen to make up with Cersei, whom he banned for her safety from leaving the red keep, only new, masked guard knight the Mountain killed the commoner who flashed during her public penance walk and keeps bragging about it. Enjoying magical visions of Ned's youth when Hodor still spoke as a stable-boy, Brandon wines the Three-Eyed Raven interrupts it so soon but is told more can harm while impatient Meera Reed is told to prepare to help Bran when they move again. Hearing his father now has a legitimate son, Ramsay stabs him to death, the official versions being \"poisoned by enemies,\" and feeds stepmother Walda and the baby to the dogs. Theon leaves Sansa, promising to go ask Jon Snow for help from the Watch. In Castle Black, Ser Davos insists that the red witch tries resurrecting, which seems to fail as she feared, but once alone with the wolf, he breaths again. Tyrion realizes the two dragons in the dungeon are pining away because of captivity and gathers the courage to looses their chains. The slavers are back in power in the other 'liberated' cities. Blind Arya finally seems to have learned humility after some stick lessons, Ja'qen starts revealing.—KGF Vissers", "In a vision of the past, Brandon sees his father Ned, Uncle Benjen, their sister Lyanna, and young Hodor at Winterfell. Edd returns to Castle Black with Tormund and a group of Wildlings, imprisoning Thorne and the other mutineers. Tommen asks Cersei to help him be strong, as the High Sparrow threatens Jaime. Astapor and Yunkai have reverted to slavery. In the catacombs, Tyrion unchains Rhaegal and Viserion. In Braavos, H'ghar allows Arya to return to the House of Black and White. Roose Bolton's wife gives birth to a male heir; Ramsay murders Roose, his stepmother, and the infant. En route to Castle Black, Brienne tells Sansa that she had encountered Arya. Theon leaves to head home to the Iron Islands. Euron Greyjoy also returns to Pyke Island and murders his brother, King Balon. Melisandre attempts and apparently fails to resurrect Jon, but after everyone leaves the room, Jon awakens."], "genres": "N/A", "imdbID": "4077554", "rating": 9.2, "votes": 54247, "number_of_episodes": 74}