{"cast": {"0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3229685": "Kit Harington", "1754059": "Natalie Dormer", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "0564920": "Rory McCann", "3586035": "Maisie Williams", "0000596": "Jonathan Pryce", "1970465": "Kristofer Hivju", "0283492": "Jerome Flynn", "0654295": "Alfie Allen", "0574534": "Ian McShane", "0001671": "Diana Rigg", "0751085": "Clive Russell", "0580014": "Tobias Menzies", "2247629": "Gemma Whelan", "3849670": "Faye Marsay", "1778512": "Jóhannes Haukur Jóhannesson", "0570570": "Tim McInnerny", "1613839": "Ian Whyte", "5485781": "Hafþór Júlíus Björnsson", "1043031": "Tim Plester", "1264590": "Daniel Tuite", "2307468": "Ricky Champ", "7424139": "Ian Davies", "0564133": "Murray McArthur", "1821446": "Hannah Waddingham", "8165602": "Bella Ramsey", "1276052": "Margaret Jackman", "3638451": "Kevin Horsham", "5967490": "Louis Rolston", "4915886": "Katie Alexander Thom", "5697839": "Jed Murray", "7504777": "Michael Patrick", "3169992": "Matt Faris", "5302078": "Neil Keery", "8197352": "Heidi Romanova", "8199964": "Danielle Claire Jenner", "7302123": "Ella Hughes", "7868429": "Zoi Gorman", "7767707": "Billy King", "6749562": "Raquel Arraes", "2336143": "Logan Bruce", "2874817": "Susan Christie", "4232488": "Micheal Fitzgerald", "3976852": "Sophia Smith"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["51"],  "plot": ["Jon and Sansa gather troops. Jaime arrives at Riverrun. Olenna Tyrell plans to leave King's Landing. Theon and Yara plan a destination. Arya makes plans to leave.", "The Hound was saved by Brother Ray, the leader of a community, and has a peaceful life working as woodman. When three men from the Brotherhood threaten the villagers, The Hound is worried about but Brother Ray does not believe in violence anymore. Margaery seems to be converted by the High-Sparrow, but when she learns that her grandmother Oleanna Tyrrell is in danger, she contacts her to convince Oleanna to leave King's Landing. Jon. Sansa and Davos are searching for allies to vanquish Ramsay and retake Winterfell. Jaime and Bronn arrive at the Blackfish Castle and Jaime tries to convince him to surrender to the siege to his castle. Theon and Yara are resting in a brothel and waiting for uncle Euron's attack. Arya makes arrangements to return to Westeros but she is stabbed by the Waif.—Claudio Carvalho, Rio de Janeiro, Brazil", "Sandor Clegane is alive and well. The high sparrow tries to persuade Margery to join king Tommen in bed and give him an heir, while threatening the life of her grandmother. Before leaving King's Landing, Lady Olenna lets Cersei know she has lost and has ended up all alone. Jon, Sansa and Davos persuade more people to join them into taking back Winterfell, including the Free Folks and House Mormont. However, they are not as successful with House Glover. Afraid of not having enough men, Sansa breaks her previous promise and asks Littlefinger for help. Yara and Theon plan to get to Daenerys and make a deal with her to reclaim the Iron Islands back. Arya gets herself a cabin on a ship sailing to Westeros before someone makes an attempt on her life.—Andy Ward", "Jaime, grumpily assisted by still unpaid Bronn, takes charge of the presently incompetent Blackfish castle siege but finds the Frey lord confident he can hold out longer then the Lannister army and indifferent to void or real threats. Jon convinces the Wildlings to help him reconquer Winterfell as a united North is their only chance to resist the winter forces, collects a meager contingent from Mormont girl lady thanks to Ser Davos, but is denied feudal service by petty lord Robett Glover due to Sansa's arrogant demand convincing him to declare Stark extinct, so she asks Petyr for help from the Vale after all. Having failed to release her offspring, Olenna Tyrell bitterly blames Cersei for allowing the zealots to compromise centuries of prominence amassed by their houses, but agrees before returning home they must join forces against the common enemy, receiving a secret message from Maergery, who pretends conversion to the high sparrow, who urges her to resume her conjugal duty as still childless Tommen's queen. Theon seems to relapse in anxious lethargy while Yara enjoys the brothel on the run for uncle Euron who chases them as challenge to his \"stolen\" salt throne, so they decide to seek an alliance with Daenerys. Veteran brother Ray sticks to non-violence even when Sandor 'The Hound,' whom he was surprised to nurse back to health, stands up to three Brotherhood men threatening their carpenter community. Arya buys passage to Westeros.—KGF Vissers", "The Hound is alive and living a simple, non-violent life, having been saved by a Septon and his followers. When rogue Brotherhood members threaten and eventually slaughter the group, the Hound seeks revenge. Margaery convinces her grandmother to return to Highgarden after the High Sparrow threatens to punish Olenna following her and Jaime's confrontation with the Faith. Margaery then secretly signals to Olenna that she has not converted to the Faith. Jon, Sansa, and Davos recruit the wildlings, House Mormont, and others but remain outnumbered by the Boltons. Sansa secretly sends a message to the Vale requesting aid. Jaime arrives in Riverrun with Bronn and assumes command of the siege. Jaime unsuccessfully parleys with Brynden Tully. Theon and Yara spend their last night in Volantis before sailing to Meereen to ally with Daenerys. Arya prepares to return to Westeros until the Waif, disguised as an old crone, viciously stabs her."], "genres": "N/A", "imdbID": "4283060", "rating": 8.5, "votes": 39585, "number_of_episodes": 74}