{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "2812026": "Nathalie Emmanuel", "3586035": "Maisie Williams", "0384152": "Conleth Hill", "1970465": "Kristofer Hivju", "3652842": "Isaac Hempstead Wright", "4263213": "John Bradley", "3701064": "Iwan Rheon", "0000596": "Jonathan Pryce", "2835616": "Dean-Charles Chapman", "2356940": "Hannah Murray", "0937239": "Tom Wlaschiha", "0001884": "Max von Sydow", "0001671": "Diana Rigg", "0853583": "Owen Teale", "0504320": "Anton Lesser", "0002103": "Julian Glover", "2760664": "Jacob Anderson", "1164730": "Natalia Tena", "0174005": "Ben Crompton", "3849670": "Faye Marsay", "0004355": "Roger Ashton-Griffiths", "0312245": "Ian Gelder", "5485781": "Hafþór Júlíus Björnsson", "5282143": "Brenock O'Connor", "3664502": "Kae Alexander", "2746504": "Dean Jagger", "1051151": "Paul Rattray", "3280686": "Art Parkinson", "5159884": "Meena Rayann", "0622533": "Joseph Naufahu", "0267256": "Souad Faress", "7047874": "Staz Nair", "4789912": "Hannah John-Kamen", "3204142": "Angelique Fernandez", "7075019": "Robert Aramayo", "1074361": "Luke Roberts", "6793798": "Eddie Eyre", "1987270": "Brian Fortune", "1638006": "Michael Condron", "2358898": "Wuese Houston-Jibo", "6088160": "Diogo Sales", "2999602": "Junade Khan", "8120026": "Annette Hannah", "8127149": "Nathanael Saleh", "8127150": "Michael Nevin", "8127151": "Jesse Magee", "8133415": "Iona Clarke", "8127152": "Lucy Gallagher", "6462692": "Fionn Kernan", "6096362": "Bobby Marno", "5504790": "Simon Millar", "6729880": "Chuku Modu", "8509117": "Jessica Odell", "10764035": "Mariola Sanz", "5792452": "Michael Stuart", "4547262": "Leo Woodruff"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["52"],  "plot": ["Daenerys arrives at Vaes Dothrak. Sam and Gilly sail for Horn Hill. Arya trains as No One. Varys finds information on the Sons of the Harpy. Ramsay receives a gift. Tommen meets with the High Sparrow. At Castle Black, a miracle occurs.", "SPOILER: Jon Snow is received by Davos and Melisandre and has difficulties to understand what happened with him. Then he is greeted by his friends. Sam is traveling by boat with Gilly and her baby to the land of his family. Bran has other visions helped by Three-Eyed Raven and finds a hidden past of his father. Daenerys arrives at Vaes Dothrak and is forced to change clothes. Varys and Tyrion discover who is financing the Sons of the Harpy. In King's Landing, Cersei orders Qyburn to send the little birds to several to spy her enemies. King Tommen confronts the High Sparrow but is manipulated by him. In Braavos, Arya continues her painful training. Umber meets Ramsay and delivers Osha and Rickon Stark to him to celebrate their union. Jon Snow executes his enemies and takes a surprising decision.—Claudio Carvalho, Rio de Janeiro, Brazil", "Ser Davos is just delighted, Melisandre almost as surprised as (re)birth-naked Jon Snow, that his magical resurrection worked, wondering if the royal destiny she expected for Stannis is his. While Tyrion finds Missandei as miserable a drinking buddy as Grey Worm, Varys finds out which master family finances the Sons of the Harpy terror and disposes of the terrified key witness generously. His 'little bird' kid spies in King's Landing are recruited into Cersei's service by maester Qyburn while Tommen finds the courage to confront the High Sparrow, but gets mother nor wife off the religious trial threat. To reestablish his authority as lord commander, Jon is forced to hang his four murderers, even squire Olly, while Sam sails to the Citadel and Oldtown to leave his family nearby. Bran enjoys watching how his father Ned's sword champion reputation is a half fake. Khal Moro delivers Daenerys to the royals widows nunnery, which must decide whether to admit the runner to their power behind the Dothraki throne. Ramsay receives ally Umber with a surprise gift: Rickon Stark and Osha. Ja'qen keeps beating and testing Arya into the part of Nobody girl.—KGF Vissers", "En route to Oldtown to train as a Maester, Samwell first visits Horn Hill, his family home, intending to leave Gilly and Little Sam with his family, claiming Little Sam is his biological son. In a vision, Brandon sees young Ned and Howland Reed, Meera's father, dishonorably defeat a Targaryen Kingsguardsmen at the Tower of Joy in Dorne. Varys discovers that the masters of Slavers' Bay are financing the Sons of the Harpy. In King's Landing, the High Sparrow preaches to Tommen, while Jaime, Cersei and her bodyguard, Ser Gregor Clegane, interrupt a small council meeting, only to be shunned by Kevan Lannister and the Tyrells. The Waif rigorously trains Arya, whose sight is restored after accepting herself as \"no-one.\" In Winterfell, Lord Umber asks Ramsay to help protect the North from the Wildlings, presenting Rickon Stark, Osha, and the head of Rickon's direwolf as gifts. Jon executes Thorne, Olly, and the other mutineers. He renounces his oath and puts Tollett in charge of the Night's Watch."], "genres": "N/A", "imdbID": "4131606", "rating": 8.6, "votes": 41052, "number_of_episodes": 74}