{"cast": {"0227759": "Peter Dinklage", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "3729225": "Gwendoline Christie", "0564920": "Rory McCann", "1970465": "Kristofer Hivju", "1478079": "Joe Dempsie", "0322513": "Iain Glen", "0233807": "Richard Dormer", "0443373": "Paul Kaye", "1152798": "Joseph Mawle", "1483416": "Richard Rycroft", "1497190": "Michael Byrch", "4178701": "Dan Euston", "0298842": "Vladimir 'Furdo' Furdik", "4368864": "Juan Carlos Martínez Antuña"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["70"],  "plot": ["Jon and his team go beyond the wall to capture a wight. Daenerys has to make a tough decision.", "Jon and his band of men go beyond the wall in search of a Wight to capture and return to Kings Landing. Arya and Sansas relationship continues to derail with the help of LittleFinger. And Tyrion and Daenerys discuss the future of her reign.—duffmanbjk", "Jon and his team go north to capture a wight. Daenerys and Tyrion discuss love, planning for future and taking risks. Arya and Sansa learn a disturbing secret about each other's past. Jon faces off with the Night King and is aided by someone unexpected", "At Dragonstone, Tyrion counsels Daenerys how to negotiate with even haughtier Cersei. At Winterfell, Littlefinger's letter plot gets Arya to bitterly blame Sansa, who pleads force majeure and youth, for begging for Robb's fealty to Joffrey. Sansa finds Arya's faces from Braavos. Beyond the Wall, Jorah declines Jon's offer to returning his father's Valyrian sword, deeming himself less worthy. The hunting party captures a wight to prove the White Walkers' existence from the vanguard of the the White Walker army, but is surrounded on a frozen lake as the main body follows too fast to escape. Only the fiery swords enable fighting off the giant bear, incurring casualties. Jon sends fastest man Gendry on foot back to Eastwatch to dispatch a raven requesting for a dragon rescue. That night, injured Thoros freezes to death. Last minute, Daenerys arrives with her dragons, destroying many wights. The Night King, the White Walkers' leader, kills Daenerys' dragon Viserion with an ice spear, later resuscitates it as zombie in his army. Daenerys flies off with most survivors, but can't rescue Jon, whom Benjen Stark saves sacrificing himself. Grateful Jon pledges himself and the North to Queen Daenerys.—KGF Vissers", "At Winterfell, Littlefinger schemes to isolate Sansa. Tensions between Arya and Sansa increase after Arya discovers the letter Sansa was forced to write, begging for Robb's fealty to Joffrey. Sansa, in turn, finds Arya's collection of faces from Braavos. At Dragonstone, Tyrion counsels Daenerys about the upcoming negotiations with Cersei. Beyond the Wall, Jon and the men hunt for a wight to prove the White Walkers' existence. After capturing one, the group is beset by the White Walker army but not before Jon sends Gendry to Eastwatch to dispatch a raven to Daenerys requesting help. During the night, an injured Thoros freezes to death. As the wight army is about to overwhelm Jon's group, Daenerys arrives with her dragons, destroying many wights. The Night King, the White Walkers' leader, kills Viserion, one of Daenerys' dragons, with an ice spear. Daenerys flies off with the men, but is unable to rescue Jon. Benjen Stark intervenes and sacrifices himself to save Jon. When Jon and Daenerys are reunited, Jon pledges himself and the North to Daenerys as Queen. The Night King reanimates Viserion, making the dragon a part of his army."], "genres": "N/A", "imdbID": "5775864", "rating": 9.0, "votes": 73276, "number_of_episodes": 74}