{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "2812026": "Nathalie Emmanuel", "0654295": "Alfie Allen", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "3729225": "Gwendoline Christie", "0564920": "Rory McCann", "1970465": "Kristofer Hivju", "2356940": "Hannah Murray", "0322513": "Iain Glen", "1561982": "Pilou Asbæk", "0233807": "Richard Dormer", "2760664": "Jacob Anderson", "0504320": "Anton Lesser", "4535552": "Daniel Portman", "5485781": "Hafþór Júlíus Björnsson", "0889338": "Rupert Vansittart", "4957233": "Aisling Franciosi", "0184698": "Brendan Cowell", "7075019": "Robert Aramayo", "1483416": "Richard Rycroft", "6251140": "Wilf Scolding", "0149435": "Tom Chadbon", "7047874": "Staz Nair", "0647041": "Guy Oliver-Watts", "2807170": "Neil Fingleton", "1613839": "Ian Whyte", "3364031": "Adam Slynn", "8251159": "William Nevan Wilson", "8251160": "James Robert Wilson", "1497190": "Michael Byrch", "7009175": "Kadrolsha Ona Carole", "0298842": "Vladimir 'Furdo' Furdik", "8120026": "Annette Hannah", "4368864": "Juan Carlos Martínez Antuña", "6071737": "Ross Moneypenny"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["80"],  "plot": ["Everyone meets in King's Landing to discuss the fate of the realm. In Winterfell, Sansa confronts Arya. Sam reaches Winterfell, where he learns from Bran a shocking secret about Jon Snow.", "In King's Landing a grand meeting takes place. Theon makes amends and rescue plans. Sansa punishes those who wronged her family. Jaime confronts Cersei. The complete truth of Jon's lineage is revealed. The army of the dead reaches the Wall.", "In King's Landing, Daenerys, Jon Snow and Cersei have a tense meeting where they show a wight to Cersei that does not accept the proposed armistice. However, Tyrion has a private encounter with her and she changes her position. At Winterfell, Sansa brings Arya to accomplish a death penalty for murder and treason. Then Samwell has a meeting with Bran and they discuss Jon Snow's lineage. At Eastwatch, the Night King riding his dragon and the White Walker army attack the Wall.—Claudio Carvalho, Rio de Janeiro, Brazil", "The Lannister court formally receives John and Daenerys's delegation at the ancient arena where the old dragons withered. Thyrion's plea is coldly received by Cersei, until the Hound lets the undead out of the box and Jon demonstrates it can only by killed by fire or dragon-glass. An armistice to fight fight the greater common enemy is acceptable, but off the table when Jon refuses to revoke his oath to the dragon queen. Jaime gets Thyrion an audience to push their sister Cersei, daring to let the Mountain kill him, which seems to talk her over after spotting her pregnancy. Jon and Daenerys celebrate the outcome making love, but Cersei confides into Jaime she intends to reconquer the North after the rivals exhausted themselves.. Bran reveals to Sam that Jon was given in Ned's care as secret legitimate heir to the Iron throne, being born Aeon Targaryen. Theon dares his uncle Euron Greyjoy, who was boarding to flee back to the Islands, to duel and kills him, yet calls for loyalty to his missing sister. At Winterfell, schemer Petyr expected to assist at Arya's execution as traitor to Sansa, but has his own throat slit without due trail as the sister gang up accusing him constant plots and the murder of their aunt to become Lord of the Vale. Tormund Giantsbane's Nightwatch garrison shivers at the arrival of the Winter king, but worse, his zombie dragon's white fire simply melts the Wall down.—KGF Vissers", "The wight is presented to the Lannister court. Cersei demands Jon's neutrality, but she storms off when Jon upholds his oath to Daenerys. Tyrion meets with Cersei, apparently gaining her alliance. Cersei reveals to Jaime that she instead will use the Golden Company of Braavos to secure her hold on Westeros and allow the white walkers to destroy Daenerys and Jon's armies. Disgusted, Jaime rides north to warn Jon and Daenerys. At Dragonstone, Theon wins his men's respect and leads them to rescue Yara. Aboard a North-bound ship, Jon seeks out Daenerys, and they become lovers. At Winterfell, Littlefinger works to increase dissent between Arya and Sansa. Sansa, Arya, and Bran publicly accuse Littlefinger of murdering Jon and Lysa Arryn and of treason against their father. Deserted by the Lords of the Vale, Littlefinger is executed by Arya. Samwell arrives and meets with Bran. Combining Gilly's earlier information and Bran's vision, they realize Jon is Aegon Targaryen, the legitimate heir to the Iron Throne. Jon's parents, Rhaegar Targaryen and Lyanna Stark, secretly married. At Eastwatch, the Night King, astride the undead Viserion, blasts a hole through the Wall with blue dragon fire; the Army of the Dead marches through."], "genres": "N/A", "imdbID": "5775874", "rating": 9.4, "votes": 73492, "number_of_episodes": 74}