{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "3849842": "Sophie Turner", "2812026": "Nathalie Emmanuel", "0890055": "Indira Varma", "0654295": "Alfie Allen", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0000980": "Jim Broadbent", "1561982": "Pilou Asbæk", "2247629": "Gemma Whelan", "2760664": "Jacob Anderson", "0504320": "Anton Lesser", "0309693": "Mark Gatiss", "3065809": "Rosabell Laurenti Sellers", "1697771": "Ellie Kendrick", "5485781": "Hafþór Júlíus Björnsson", "0889338": "Rupert Vansittart", "0269077": "James Faulkner", "2584392": "Tom Hopper", "0184698": "Brendan Cowell", "1483416": "Richard Rycroft", "2407387": "Sara Dylan", "9166693": "Luke Wilson Hanley", "7047874": "Staz Nair", "3083406": "Carolina Castellano", "8256997": "Andrew McClay", "7407610": "Graeme Peacock"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["63"],  "plot": ["Jon and Daenerys finally meet. Cersei gains a new ally. Sansa receives an unexpected visitor. Sam is confronted for his actions.", "Jaime and Cersei welcome (later celebrate in bed) Euron Greyjoy's victory parade and appoint him admiral in reward for capturing chained Yara and the Dornish Sand Snakes, enabling Cersei to punish Ellaria, forced to watch in chains how her daughter dies from the same slow poison as her own daughter. Despite Tyrion's mediation, Jon gets a cold welcome from Daenerys, who gives chasing Cersei priority over stopping the Winter army and demands feudal homage from Jon to 'his queen' to become her warden of the North, yet Tyrion convinces her to allow the \"potential ally\" to mine Dragonstone for dragon glass. Archmaester Ebrose releases cured Jorah, Sam only gets a congratulation and no formal punishment. The Unsullied land and successfully storm Lannister home Casterly Rock, using the secret tunnel Tyrion added to the sewage system for whoring purposes, but find the garrison tiny, while they are stranded as their ships are burnt and Jaime's army lays siege knowing supplies won't last, then marches on Tyrell castle, where Jaime regrets allowing Olenna a merciful poison death as she confesses plotting Joffrey's gruesome murder. Bran's arrival at Winterfell and seer status confuse Sansa.—KGF Vissers", "Jon arrives at Dragonstone. He refuses Daenerys' demands to bend the knee, and instead asks her help fighting the Army of the Dead. On Tyrion's advice, Daenerys allows Jon to mine the island's dragonglass. Melisandre avoids Jon and departs for Volantis, telling Varys she will return to Westeros. Bran, with Meera, arrives at Winterfell and reveals his new Three-Eyed Raven identity to Sansa. In King's Landing, Euron presents Ellaria and Tyene as gifts to Cersei, who promises him marriage after the war is won. She makes him commander of her navy. Cersei administers the same poison to Tyene that killed Myrcella; Ellaria will watch her daughter die and remain imprisoned with the body. A healed Jorah leaves Oldtown to find Daenerys. Ebrose praises Samwell's skill in saving Jorah then makes him copy old texts for his disobedience. Grey Worm and the Unsullied attack Casterly Rock but discover that Jaime has led the bulk of the Lannister forces to attack Highgarden, while Euron's fleet ambushes and destroys the Unsullied's ships. The Lannister forces quickly overwhelm Olenna Tyrell's army. Jaime offers Olenna a quick and painless death by poison. After drinking it, she reveals she poisoned Joffrey."], "genres": "N/A", "imdbID": "5775840", "rating": 9.1, "votes": 53916, "number_of_episodes": 74}