{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "2812026": "Nathalie Emmanuel", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "2356940": "Hannah Murray", "1970465": "Kristofer Hivju", "0564920": "Rory McCann", "0322513": "Iain Glen", "0000980": "Jim Broadbent", "1561982": "Pilou Asbæk", "0103195": "David Bradley", "0504320": "Anton Lesser", "0233807": "Richard Dormer", "0443373": "Paul Kaye", "2760664": "Jacob Anderson", "1697771": "Ellie Kendrick", "0174005": "Ben Crompton", "5485781": "Hafþór Júlíus Björnsson", "0570570": "Tim McInnerny", "4535552": "Daniel Portman", "0889338": "Rupert Vansittart", "8165602": "Bella Ramsey", "1483416": "Richard Rycroft", "8314450": "Lucy Hayes", "3247828": "Ed Sheeran", "2129938": "Thomas Turgoose", "5037475": "Billy Postlethwaite", "8257864": "Megan Parkinson", "9132255": "Harry Grasby", "2807170": "Neil Fingleton", "1613839": "Ian Whyte", "1414452": "Paul Ward", "0607371": "Brendan Morrissey", "0237131": "Eamonn Draper", "8251159": "William Nevan Wilson", "8251160": "James Robert Wilson", "2369216": "Kate Dempsey", "6096362": "Bobby Marno", "6837220": "Seán McGillicuddy", "5608245": "Brendan McGivern", "6289523": "Gerald McMullan", "0822124": "Jim Stanes"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["Jon organizes the North's defenses. Cersei tries to even the odds. Daenerys comes home. Arya reminds the Freys \"the North remembers.\" Sam adapts to life in Oldtown. The Night King makes his way south.", "Bran and Mera arrive at Castle Black. Jon and Sansa plan the defense against the long night. Cersei forges new alliances. Samwell trains to be a maester. Arya gets her revenge. The Hound takes shelter in a familiar place. Daenerys arrives at Westeros.", "Jon duly scolds Sansa for publicly questioning him, which seems to amuse Petyr, and decides the North must try to bury all grievances to raise the greatest defense against the Night King's marching forces of Winter, so instead of confiscating their houses castles, he swears in juvenile heirs Ned Umber and even Alys Karstark, as even females must be recruited. Cersei is on the Iron Throne after Tommen's suicide, dying for vengeance on all traitors, but Jaime points out they desperately needs allies instead to stand a chance against the Targeryen threat. Euron Greyjoy offers her an alliance by marriage between 'rightful rulers', but she declines and he promises to return with an irresistible gift. In between menial Citadel library services, Sam learns Archmaester Ebrose believes him but sees no need to permit him before graduation to study a defense against Winter as it always passed, so Sam steal a dead man's key to sneak into the forbidden section, where he learns dragon glass is massively available at one site: the Targeryen castle Dragon Rock, where Daenerys just landed with Theon's Iron Fleet. Arya enjoys generous hospitality at a Lannister troops camp fire and learns the plight of war-recruited farm boys, but remains revenge-obsessed. Bran's three ravens-visions prepare him for his arrival with Meera at Castle Black.—KGF Vissers", "At the Twins, Arya, disguised as Walder Frey, poisons the remaining lords of House Frey. The White Walkers march toward the Wall. Edd receives Bran and Meera at Castle Black. At Winterfell, Sansa objects when Jon accepts the loyalties of Houses Umber and Karstark, whose previous leaders supported Ramsay. Queen Cersei demands that the North bend the knee. At the Citadel, Samwell \"borrows\" restricted library books, learning there is a large deposit of dragonglass at Dragonstone; he sends word to Jon. Sam finds Jorah, now heavily infected with greyscale, quarantined in a cell. In the Riverlands, Arya meets some friendly Lannister soldiers, and \"jokingly\" claims she will kill Cersei. The Hound begins to believe in the Lord of Light after Thoros shows him a fiery vision of the Wall and the Army of the Dead. In King's Landing, Jaime tells Cersei they crucially need allies. Euron arrives to propose marriage in exchange for his Iron Fleet and an opportunity to kill Theon and Yara. Cersei declines over his untrustworthiness; Euron promises to return with a gift that will prove his loyalty. Daenerys arrives at Dragonstone, House Targaryen's ancestral home, with her army and dragons."], "genres": "N/A", "imdbID": "5654088", "rating": 8.5, "votes": 57976, "number_of_episodes": 74}