{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "2812026": "Nathalie Emmanuel", "0384152": "Conleth Hill", "0283492": "Jerome Flynn", "0654295": "Alfie Allen", "3729225": "Gwendoline Christie", "3652842": "Isaac Hempstead Wright", "0269077": "James Faulkner", "2584392": "Tom Hopper", "1697771": "Ellie Kendrick", "0309693": "Mark Gatiss", "0184698": "Brendan Cowell", "4535552": "Daniel Portman", "2588194": "Danny Kirrane", "4806449": "Joseph Quinn", "7047874": "Staz Nair", "1650174": "Briege Roche", "9180647": "Eamonn Keenan", "4711344": "Charlie Barrett", "0621178": "Daniel Naprous", "4385308": "Douglas Robson", "11920529": "Jacek Skalmierski", "7711377": "Noah Syndergaard", "2823677": "Calvin Warrington-Heasman"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["50"],  "plot": ["Daenerys takes matters into her own hands. Arya reaches her destination. Jaime and Bronn collect the spoils from the war with the Tyrells.", "Daenerys seeks advice from Jon and Tyrion to win the war. Theon returns to Dragonstone asking his queen for help rescuing his sister. Jaime faces an unexpected encounter while transporting the Red Keep's gold. Arya returns home to Winterfell.—Krishang Kagzi", "Jon Snow gets closer to Daenerys and shows her his discovery in the dragonglass mine. Tyrion advises Daenerys and she asks Jon for his advice, and he tells her that she must be a fair queen and not attack and burn the houses of the common people. Meanwhile Arya returns to Winterfell and reunites with Sansa and Bran. Jaime's army and Bron are looting House Tyrell and their lands when they get a surprise.—Claudio Carvalho, Rio de Janeiro, Brazil", "Littlefinger hands to Bran the Valyrian steel dagger his would-be assassin used, which Bran gives to just-returned Arya. Bran tells homeward-bound, disappointed Meera he is ow Three Ravens, no longer Bran. Arya impressing sparring partner Brienne and Sansa with her fighting skills. Cersei promises the Iron Bank repayment of all Lannister's debt as a wagon train of gold from Highgarden travels to King's Landing. In a cave near castle Dragonstone, filled with dragonglass, which he is allowed to forge into weapons, Jon shows Daenerys ancient wall paintings where First Men and Children of the Forest jointly fight the undead. They learn the failed defense of Casterly Rock was a diversion while Jaime's Lannister army captures and loots Highgarden. Ignoring Tyrion, Daenerys rides Drogon as the Dothraki cavalry surprise attack decimates the Lannister army, capturing its remaining forces. Drogon is wounded by Bronn's bolt fired from Qyburn's new scorpion ballista, but lands Daenerys safely and his fire thwarts Jaime's desperate charge on horseback at a vulnerable Daenerys. Bronn tackles Jaime into a river to save him.—KGF Vissers", "Arya returns to Winterfell and is reunited with Sansa and Bran. Littlefinger presents Bran with the Valyrian steel dagger his would-be assassin used. Bran gives the dagger to Arya. Bran bids a homeward-bound Meera an unemotional farewell, explaining he is no longer Bran. Arya spars with Brienne, impressing her and amazing Sansa with her exceptional fighting skills. Cersei assures the Iron Bank full repayment of the Lannister's debt as a wagon train carrying gold from Highgarden travels to King's Landing. In a cave filled with dragonglass, Jon reveals ancient wall paintings to Daenerys depicting the First Men and the Children of the Forest joining forces against the undead. Daenerys learns that the attack on Casterly Rock was a diversion and Lannister forces have captured Highgarden. Ignoring Tyrion's protests, Daenerys rides Drogon as the Dothraki cavalry launches a surprise attack on the Lannister army, decimating it and capturing its remaining forces. Drogon is slightly wounded when Bronn fires a bolt from Qyburn's new scorpion ballista weapon, but he and Daenerys land safely. Jaime's desperate charge on horseback at a vulnerable Daenerys is thwarted by Drogon spewing fire. Bronn tackles Jaime into a river, saving him."], "genres": "N/A", "imdbID": "5775846", "rating": 9.7, "votes": 100669, "number_of_episodes": 74}