{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0384152": "Conleth Hill", "0564920": "Rory McCann", "3652842": "Isaac Hempstead Wright", "0283492": "Jerome Flynn", "4263213": "John Bradley", "2356940": "Hannah Murray", "1970465": "Kristofer Hivju", "1478079": "Joe Dempsie", "0322513": "Iain Glen", "0000980": "Jim Broadbent", "0233807": "Richard Dormer", "0443373": "Paul Kaye", "0504320": "Anton Lesser", "0269077": "James Faulkner", "2584392": "Tom Hopper", "0570570": "Tim McInnerny", "0889338": "Rupert Vansittart", "1483416": "Richard Rycroft", "0253126": "Kevin Eldon", "0278747": "Julian Firth", "0642799": "Philip O'Sullivan", "1736605": "Laurence Spellman", "7047874": "Staz Nair", "8251159": "William Nevan Wilson", "8251160": "James Robert Wilson", "5439815": "Adele Smyth-Kennedy", "13911198": "Sean Derry", "0298842": "Vladimir 'Furdo' Furdik", "10025463": "Christian Gimse", "4368864": "Juan Carlos Martínez Antuña"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["Daenerys demands loyalty from the surviving Lannister soldiers; Jon heeds Bran's warning about White Walkers on the move; Cersei vows to vanquish anyone or anything that stands in her way.", "Bronn saves Jaime from the lake and he is surprised with the power of Daenerys' dragon. Daenerys offers the prisoners to bend their knees and join her army, or to die. Randyll and his son Dickon from the House of Tarly refuse to serve Deanerys and her dragon turns them into ashes. Arya confronts Sansa at Winterfell and suspects of Littlefinger. Samwell has a deception with the Maesters and decides to leave the Cidatel with Gilly and their child. Tyrion advises Daenerys and Jon Snow to bring a Wight to King's Landing to prove that the Army of the Dead and the White Walkers do exist. Jaime tries to convince Cersei that they do not have any chance fighting Daenerys and her three dragons, but she plots a scheme to destroy Daenerys. Then Jaime has a surprising encounter. Jon and a group head to the Wall and meet prisoners of he Night's Watch that accept to join them in their journey to capture a Wight.—Claudio Carvalho, Rio de Janeiro, Brazil", "Jaime and Bronn must report the dragon's victory in King's Landing to Cersei. Daenerys spares those surviving Lannister soldiers who bend the knee, which all do after lord Randyll Tarly and his son, Dickon, refuse and against Tyrion's advice are executed on the spot by Drogon's dragon breath. Jorah is welcomed back by Daenerys at Dragonstone. Maester Wolkan alerts Jon and the Citadel about the wights approaching Eastwatch. Jon proposes prove their existence by capturing a wight beyond the Wall to convince Cersei to accept a temporary alliance, which fits Jaime's advice to negotiate. Davos smuggles and bribes past guards Tyrion inside King's Landing to secretly meet with Jaime to propose an armistice. Cersei agrees and informs Jaime, who instilled her their military position is hopeless, that she expects his child, now openly. In King's Landing, Davos finds Gendry and takes him back to Dragonstone, where he's accepted by Jon as Robert's bastard son. Frustrated as the Archmaester practically ignores his and Maester Wolkan's warnings about Winter approaching, Samwell leaves the Citadel with Gilly, Little Sam and restricted books with him. At Winterfell, Littlefinger, knowing Arya spies on him, lures her into finding the letter that Sansa had to write as a hostage in King's Landing to estrange the sisters. Jon, Jorah and Gendry take jail-liberated Clegane, Thoros, Beric, Tormund and his Free Folk from Eastwatch North beyond the Wall to capture a wight.—KGF Vissers", "Jaime and Bronn return to King's Landing. Daenerys offers the surviving Lannister soldiers the choice to bend the knee or death. Randyll Tarly and his son, Dickon, refuse her offer, and against Tyrion's advice, Daenerys has Drogon burn them to death. Jorah is reunited with Daenerys at Dragonstone. Maester Wolkan alerts Jon and the Citadel about the wights approaching Eastwatch. Jon proposes capturing a wight beyond the Wall to prove their existence and convince Cersei to accept a temporary alliance. Davos smuggles Tyrion inside King's Landing to secretly meet with Jaime to propose an armistice. Cersei accepts, and she also informs Jaime she is pregnant with their child. While in King's Landing, Davos finds Gendry and takes him back to Dragonstone. With the Citadel ignoring Maester Wolkan's warning letter, Samwell, frustrated, leaves the Citadel with Gilly and Little Sam, taking several restricted books with him. At Winterfell, Littlefinger, knowing Arya is spying on him, lures her into finding the letter that Sansa was forced to write as a hostage in King's Landing. Jon, Jorah, and Gendry take Clegane, Thoros, Beric, Tormund and a group of the Free Folk from Eastwatch North beyond the Wall to capture a wight."], "genres": "N/A", "imdbID": "5775854", "rating": 8.7, "votes": 50957, "number_of_episodes": 74}