{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "0318821": "Aidan Gillen", "0192377": "Liam Cunningham", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0396924": "Carice van Houten", "2812026": "Nathalie Emmanuel", "0890055": "Indira Varma", "0654295": "Alfie Allen", "4263213": "John Bradley", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "0322513": "Iain Glen", "0001671": "Diana Rigg", "0000980": "Jim Broadbent", "1561982": "Pilou Asbæk", "2247629": "Gemma Whelan", "0504320": "Anton Lesser", "2760664": "Jacob Anderson", "1095720": "Keisha Castle-Hughes", "3065809": "Rosabell Laurenti Sellers", "3725055": "Jessica Henwick", "5485781": "Hafþór Júlíus Björnsson", "3444954": "Ben Hawkey", "0570570": "Tim McInnerny", "0269077": "James Faulkner", "0889338": "Rupert Vansittart", "2584392": "Tom Hopper", "8165602": "Bella Ramsey", "1483416": "Richard Rycroft", "1537225": "Ben Fox", "1349213": "Mark Roper", "8257864": "Megan Parkinson", "9132255": "Harry Grasby", "2336143": "Logan Bruce", "10525131": "Dario Cannizzaro", "11327263": "Tom Leavey", "7407610": "Graeme Peacock"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["59"],  "plot": ["Daenerys receives an unexpected visitor. Jon faces resistance. Tyrion plans the conquest of Westeros. Cersei gathers her allies. Arya has a reunion with old friends. Sam risks his career and life.", "Tyrion convinces Daenerys, who gruesomely doubts Varys's motivation, to avoid a bloodbath attacking King's Landing, rather sending Theon and Yara's Iron fleet to ship the Dornish army from Sunspear and lay siege with the Tyrell troops, while Unsullied are shipped to Lannister home Casterly Rock. Jon Snow is haughtily invited to acknowledge 'his queen' Daenerys at Dragonstone, where Grey Worm and Missandei consummate their love. Cersei summons several lords, demanding fealty, while Jaime offers to elevate Randyll Tarly as Warden of the South, undoing loyalty to house Tyrell. Qyburn shows Cersei a prototype ballista to kill dragons. Cook Hot Pie tells Arya the Boltons are smashed by Jon, the new King in the North, who leaves Sansa in charge at Winterfell as he sails against all Northern lords' advice to request Daenerys' help against the Winter forces after harshly warns Littlefinger to keep off Sansa. Samwell performs a forbidden surgery on Jorah's 'greyscale' infection. Euron's fleet crushes Yara's, killing Obara and Nymeria and capturing Ellaria, Tyene and Yara, only Theon, experiencing flashbacks as Reek, jumps overboard.—KGF Vissers", "Daenerys heeds Tyrion's advice not to take King's Landing by force, which would kill thousands. Yara's fleet is sent to Sunspear to transport the Dornish army to lay siege to King's Landing alongside the Tyrell forces; the Unsullied are to take Casterly Rock. Daenerys challenges Varys' loyalty and threatens to burn him alive if he ever betrays her. Melisandre arrives and encourages Daenerys to invite Jon Snow to Dragonstone, saying he is integral to the war. Grey Worm and Missandei consummate their relationship. Cersei summons several lords, demanding their fealty, while Jaime offers to elevate Randyll Tarly as Warden of the South. Qyburn shows Cersei a prototype ballista capable of killing dragons. Arya is reunited with Hot Pie, who tells her the Boltons are dead and Jon is now King in the North. She resets course for Winterfell. Jon sets sails for Dragonstone to request Daenerys' help against the White Walkers, leaving Sansa in charge at Winterfell. He warns Littlefinger to never touch Sansa. Samwell performs a forbidden surgery on Jorah's greyscale infection. Euron's fleet attacks Yara's, killing Obara and Nymeria and capturing Ellaria, Tyene, and Yara. Theon, experiencing flashbacks as Reek, jumps overboard."], "genres": "N/A", "imdbID": "5655178", "rating": 8.8, "votes": 51243, "number_of_episodes": 74}