{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0192377": "Liam Cunningham", "2812026": "Nathalie Emmanuel", "0654295": "Alfie Allen", "1478079": "Joe Dempsie", "3652842": "Isaac Hempstead Wright", "4263213": "John Bradley", "2356940": "Hannah Murray", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "0564920": "Rory McCann", "1970465": "Kristofer Hivju", "2760664": "Jacob Anderson", "0322513": "Iain Glen", "0233807": "Richard Dormer", "0174005": "Ben Crompton", "4535552": "Daniel Portman", "8165602": "Bella Ramsey", "0889338": "Rupert Vansittart", "1483416": "Richard Rycroft", "8257864": "Megan Parkinson", "5339108": "Seamus O'Hara", "7047874": "Staz Nair", "10635476": "Bea Glancy", "3310446": "Lucy McConnell", "10635477": "Conor Maguire", "7030266": "Thomas Finnegan", "10635479": "Logan Watson", "10635478": "Finn Watson", "0614257": "Fionnuala Murphy", "10635675": "Rosa Frazer", "9230301": "Robert Brown", "2336143": "Logan Bruce", "8941741": "Spencer Collings", "4232488": "Micheal Fitzgerald", "7969435": "Jaryd Headley", "6291097": "Patrick Kelly", "8256997": "Andrew McClay", "5970265": "Jesse Morris", "4849420": "Stephen Presley", "7361455": "Mark Quigley", "10246081": "Andrew Watson"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["58"],  "plot": ["Jaime faces judgment and Winterfell prepares for the battle to come.", "Jaime is faced by his past mistakes. Tyrion's decisions are seen with doubt. The Battle of Winterfell is discussed tactically. Sansa and Danaerys discuss the future. The remaining Night's Watch are reunited. Everyone prepares emotionally with thoughts of their fate.—eduardo-carbonella", "Jaime Lannister stands before Daenerys, Jon and Sansa in the main hall of Winterfell. While deciding his fate, his prior actions speak other wise. The rest goes on with everyone catching up to what they've experienced over the past few years. But the battle is nearly here.", "Proudly, calmly braving the Stark court, Jaime reveals Cersei's jealous treason to to the Targaryen-Stark alliance, having hired the Golden Company, joins them as able general after Brienne vouches for his honor and apologizes for crippling Bran, who replies he harbors no anger and says they are no longer the same people, the fateful past shapes all. Daenerys doubts Tyrion's Hand capacities for his having believed Cersei, but Jorah intercedes on his behalf. Citing their mutual love for Jon, Daenerys tries to gain Sansa's trust, but Sansa says the North no longer bows to outsiders. Theon, Edd, Tormund and Beric arrive at Winterfell, the latter three reporting the Undead army's impending arrival. Bran volunteers he lure out the Night King, who intends to destroy the Three-Eyed Raven, Theon protect Bran with the Ironborn troops. Arya gets a dragon-glass weapon and intimately questions and seduces Gendry, wanting not to die as virgins. Jaime knights Brienne during the long, cold, fearful night of wait with drinks and stories. Sam presents Jorah with House Tarly's ancestral sword. As the Army of the Dead approaches, Jon reveals his true lineage to Daenerys, who realizes her lover's higher claim to the Iron Throne but tells no-one.—KGF Vissers", "Jaime reveals Cersei's deception to the Targaryen-Stark alliance and joins them after Brienne vouches for his honor. Jaime apologizes to Bran for crippling him; Bran replies he harbors no anger and says they are no longer the same people. Daenerys no longer trusts Tyrion's judgment for his having believed Cersei, but Jorah asks that she forgive Tyrion's mistakes. Citing their mutual love for Jon, Daenerys tries to gain Sansa's trust, but Sansa says the North vowed never to bow to anyone again. Theon, Edd, Tormund, and Beric arrive at Winterfell, with the latter three reporting the undead army's impending arrival. Bran proposes he lure out the Night King, who intends to destroy the Three-Eyed Raven. Theon and the Ironborn will protect Bran. Arya seduces Gendry, wanting to experience sex before they die. Jaime formally anoints Brienne as a knight. Jorah fails to dissuade Lyanna Mormont from fighting, and Sam presents Jorah with House Tarly's ancestral sword. As the Army of the Dead approaches, Jon reveals his true lineage to Daenerys, who recognizes his claim to the Iron Throne."], "genres": "N/A", "imdbID": "6027908", "rating": 7.9, "votes": 141777, "number_of_episodes": 74}