{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0192377": "Liam Cunningham", "2812026": "Nathalie Emmanuel", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "4263213": "John Bradley", "2356940": "Hannah Murray", "0564920": "Rory McCann", "0283492": "Jerome Flynn", "1970465": "Kristofer Hivju", "1478079": "Joe Dempsie", "2760664": "Jacob Anderson", "0322513": "Iain Glen", "1561982": "Pilou Asbæk", "0504320": "Anton Lesser", "0233807": "Richard Dormer", "0174005": "Ben Crompton", "4535552": "Daniel Portman", "5485781": "Hafþór Júlíus Björnsson", "8165602": "Bella Ramsey", "0889338": "Rupert Vansittart", "1483416": "Richard Rycroft", "7047874": "Staz Nair", "2707252": "Alice Nokes", "8442705": "Danielle Galligan", "10672466": "Emer McDaid", "6978773": "Canan Avsar", "1125275": "David Benioff", "12901855": "Nathan Laudrup Craig", "4232488": "Micheal Fitzgerald", "14437018": "Christopher Gibson", "7812128": "Tamsin Greene Barker", "11327263": "Tom Leavey", "8256997": "Andrew McClay", "4849420": "Stephen Presley", "7361455": "Mark Quigley", "5792452": "Michael Stuart", "10246081": "Andrew Watson", "1888967": "D.B. Weiss"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["78"],  "plot": ["The Battle of Winterfell is over and a new chapter for Westeros begins.", "After the funeral for the dead, there is a feast at Winterfell. Gendry is recognized as a Baratheon and asks Arya to marry him. Brienne and Jaime have a love affair. Daenerys asks Jon to keep his roots secret, but he decides to tell Sansa and Arya. Daenerys, her dragons, and her fleet are ambushed by Euron's fleet and are defeated; Missandei is taken captive. Daenerys decides to go to King's Landing to ask Cersei to surrender, but Cersei makes a tragic decision.—Claudio Carvalho, Rio de Janeiro, Brazil", "The survivors mourn fallen heroes and burn piles of dead, then celebrate their victory. Daenerys legitimizes Gendry as a Baratheon, naming him Lord of Storm's End, yet Arya declines Gendry's subsequent marriage proposal. Stark heir Bran declines becoming Lord of Winterfell. Cersei's hired killer Bronn 'spares' Jaime and Tyrion in exchange for being promised Highgarden castle. To Thormund's envy, Jaime and Brienne become lovers, yet he returns to his pregnant Cersei. Daenerys asks Jon to conceal his true parentage to protect her claim to the throne, yet Jon reveals his true parentage to Sansa and Arya, swearing them to secrecy, but Sansa tells Tyrion, who informs Varys, both pondering which pretender would rule best. Arya and the Hound head for King's Landing, bent on revenge. The Wildlings return north , taking Ghost at Jon's request. Daenerys's fleet sails for King's Landing, but at Dragonstone, Euron's navy ambushes them, killing dragon Rhaegal with ship-mounted ballistas. Daenerys considers seizing King's Landing using dragon-fire. Jon leads the Northern army. Jaime leaves to return to Cersei, despite Brienne's pleas to stay. Cersei refuses Daenerys' demand to surrender, and has captive Missandei beheaded, enraging Daenerys and Grey Worm.—KGF Vissers", "The survivors mourn, burn the dead, and then celebrate their victory. During the somber feast, Daenerys uplifts the mood by legitimizing Gendry as a Baratheon, naming him Lord of Storm's End. Arya gently declines Gendry's subsequent marriage proposal while Jaime and Brienne become lovers. To protect her claim to the throne, Daenerys asks Jon to conceal his true parentage. Bronn arrives and threatens Jaime and Tyrion but spares them in exchange for being promised Highgarden castle. Jon reveals his true parentage to Sansa and Arya, swearing them to secrecy. Wanting Jon as king, Sansa tells Tyrion, who informs Varys. Arya and the Hound head for King's Landing, separately bent on revenge. Tormund returns north with the Wildlings, taking Ghost at Jon's request. Daenerys and her fleet set sail for King's Landing, while Jon leads the Northern army. At Dragonstone, Euron's navy ambushes Daenerys' fleet, killing Rhaegal with ship-mounted ballistas. Missandei is taken hostage and Daenerys considers seizing King's Landing using dragonfire. Varys and Tyrion debate whether Jon would be a better ruler than Daenerys. Jaime leaves Winterfell to return to Cersei, despite Brienne's pleas to stay. Cersei rejects Daenerys' demand to surrender and has Missandei beheaded before an enraged Daenerys and Grey Worm."], "genres": "N/A", "imdbID": "6027914", "rating": 5.5, "votes": 176673, "number_of_episodes": 74}