{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "3586035": "Maisie Williams", "0192377": "Liam Cunningham", "0384152": "Conleth Hill", "0564920": "Rory McCann", "2760664": "Jacob Anderson", "1561982": "Pilou Asbæk", "0504320": "Anton Lesser", "5485781": "Hafþór Júlíus Björnsson", "3130076": "Laura Elphinstone", "4704928": "Marc Rissmann", "1187340": "Alexis Raben", "0937869": "Matthew Wolf", "6432607": "Bronte Carmichael", "8828227": "Tipper Seifert-Cleveland", "8984706": "Frank Blake", "7744472": "Ryan McKen", "4206849": "Owen Whitelaw", "10689621": "Rori Hawthorn", "5628404": "Oliver Devoti", "7898686": "Jim Tighe", "7733897": "Derek Dubery", "8332410": "Luke McQuillan", "10689622": "Nicky Harley", "8568944": "Hayley McQuillan", "8028664": "Adam Devereux", "10689623": "Thomas Martin", "5951351": "Brian Patrick Kennedy", "10315623": "Luna Kalo", "10689628": "Caitlin Pharro", "10694318": "Louis McCartney", "10529594": "Rosie McClelland", "8568942": "Isaac Heslip", "10689630": "Jack Morgan", "6295779": "Lorenzo Antonucci", "10417690": "Brian Black", "3884872": "Kim Chapman", "14437018": "Christopher Gibson", "8256997": "Andrew McClay", "0569292": "Patrick McGilligan", "6894073": "Michelle O'Flaherty", "4849420": "Stephen Presley", "7361455": "Mark Quigley", "2333671": "Aaron Rodgers", "10246081": "Andrew Watson"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["78"],  "plot": ["Forces have arrived at King's Landing for the final battle.", "Jon refuses to 'betray his queen' by rightfully claiming the throne Varys urges Jon would be a better ruler, but after Tyrion reveals Varys' plot, Daenerys executes Varys by dragon fire. Jaime was captured, but Tyrion releases him to try persuading Cersei to surrender the city and escape Westeros together. Drogon destroys the Iron Fleet and most of the city's defenses, allowing Daenerys's army to enter. Cersei deludes herself the Red Keep never falls, but the Westeros forces and Golden Company are quickly overwhelmed. The city signals its surrender by a bells signal Tyrion proposed, but an enraged Daenerys ignores it, leveling the city, burning all. Despite Jon's pacifying efforts, the allied army follows her lead under Grey Worm, slaughtering soldiers and civilians in their path, horrifying Tyrion and Davos as badly. Jaime kills Euron who dared him to a duel but is himself mortally wounded. The Hound convinces Arya to abandon her longtime vendetta against Cersei and save herself; then he confronts his brother the Mountain, who disregards Cersei's orders to help her escape for the fraternal battle to the death, ultimately by falling from a tower into flames. Cersei and Jaime reunite but are killed as the Red Keep collapses on them. Jon calls for a retreat as frantic civilians flee the devastated capital.—KGF Vissers", "Varys urges Jon to advance his claim to the throne but Jon refuses to betray Daenerys. After Tyrion reveals Varys' plot, Daenerys executes Varys by dragon-fire. Jaime is captured but Tyrion releases him so Jaime can persuade Cersei to surrender the city and then escape Westeros together. Jaime, Arya and the Hound each infiltrate King's Landing. Riding Drogon, Daenerys destroys the Iron Fleet and most of the city's defenses, allowing her army to enter. Cersei's forces are quickly overwhelmed and the city signals its surrender. Giving in to rage and insanity, Daenerys levels the entire city, burning soldiers and civilians. The allied army follows her lead, slaughtering anyone in their path, horrifying Tyrion and Jon. Jaime kills Euron but is mortally wounded. The Hound convinces Arya to abandon her vendetta against Cersei and save herself; then he confronts the Mountain. The brothers, battling each other, ultimately perish after falling from a tower into flames. Cersei and Jaime reunite but are killed as the Red Keep collapses on them. Jon calls for a retreat as frantic civilians flee the devastation. Arya barely escapes alive."], "genres": "N/A", "imdbID": "6027916", "rating": 5.9, "votes": 206442, "number_of_episodes": 74}