{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0192377": "Liam Cunningham", "0396924": "Carice van Houten", "2812026": "Nathalie Emmanuel", "0654295": "Alfie Allen", "3652842": "Isaac Hempstead Wright", "4263213": "John Bradley", "2356940": "Hannah Murray", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "0564920": "Rory McCann", "1970465": "Kristofer Hivju", "1478079": "Joe Dempsie", "2760664": "Jacob Anderson", "0322513": "Iain Glen", "0233807": "Richard Dormer", "0298842": "Vladimir 'Furdo' Furdik", "0174005": "Ben Crompton", "4535552": "Daniel Portman", "8165602": "Bella Ramsey", "1613839": "Ian Whyte", "8257864": "Megan Parkinson", "7047874": "Staz Nair", "2306701": "Javier Botet", "5339108": "Seamus O'Hara", "10635476": "Bea Glancy", "3310446": "Lucy McConnell", "6432607": "Bronte Carmichael", "0565897": "Eileen McCloskey", "4113139": "Robert James", "3125467": "Roma Tomelty", "10654666": "Claire Connor", "10635479": "Logan Watson", "10635478": "Finn Watson", "9230301": "Robert Brown", "8941741": "Spencer Collings", "12901855": "Nathan Laudrup Craig", "1081134": "Sophie Ellis-Bextor", "4232488": "Micheal Fitzgerald", "14437018": "Christopher Gibson", "7969435": "Jaryd Headley", "2528251": "Richard Jones", "11414072": "Brian Kearns", "6291097": "Patrick Kelly", "11327263": "Tom Leavey", "8256997": "Andrew McClay", "4849420": "Stephen Presley", "7361455": "Mark Quigley", "5636825": "Nig Richards", "15176378": "Tina Rose", "7594137": "Chris Stapleton", "5792452": "Michael Stuart", "6107984": "Vasco Temudo", "10246081": "Andrew Watson", "13538059": "Jack Watson", "8203141": "Gareth Wright"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["82"],  "plot": ["The Night King and his army have arrived at Winterfell and the great battle begins.", "The allied living meet the vast Army of the Dead outside Winterfell. Despite swords ignited by the Red Witch, the initial Dothraki charge is decimated, and the Unsullied are quickly overwhelmed, despite the dragon-fire assist. Edd is killed saving Sam. Survivors retreat into the castle. Melisandre ignites last-minute the fire trench surrounding Winterfell to delay the advancing horde. Jon and Daenerys aerially engage the Night King, all three riding dragons. The wights fill the fire moat with corpses to invade Winterfell, storming at great effort the walls, then easily overpowering line after hideout of defenders. Jon and Rhaegal knock the Night King off Viserion, and Daenerys and Drogon burn him with dragon-fire in vain, the Night King raises the slain Winterfell defenders, including the dead entombed in the crypt, which attack the sheltered non-combatants. Wights pull Daenerys from Drogon, and Jorah is fatally wounded defending her. The Night King arrives at the Godswood and kills Theon, but just as he reaches Bran, Arya from ambush fatally stabs him with her Valyrian steel dagger. The Night King and his White Walkers shatter, creatures Viserion and all wights collapse. Her purpose served, Melisandre dies of old age.—KGF Vissers", "The living meet the Army of the Dead outside Winterfell. The initial Dothraki charge is destroyed and the Unsullied are quickly overwhelmed, despite the dragonfire. Edd is killed saving Sam and survivors retreat into the castle. Melisandre ignites the fire trench surrounding Winterfell to delay the advancing horde. Jon and Daenerys aerially engage the Night King on their dragons. The wights invade Winterfell, overpowering the defenders; Lyanna Mormont is killed destroying a giant wight; Beric dies defending Arya, and Melisandre tells Arya what she must do. Jon and Rhaegal knock the Night King off Viserion, and Daenerys and Drogon burn him with dragonfire without any effect. The Night King raises the slain Winterfell soldiers and the dead entombed in the Stark family crypt, who attack those sheltered there. Wights pull Daenerys from Drogon and Jorah is fatally wounded defending her. The Night King kills Theon as he protects Bran. Arya ambushes and stabs the Night King with her Valyrian steel dagger shattering him and his White Walkers and Viserion and all wights. Her purpose served; Melisandre allows herself to die of old age."], "genres": "N/A", "imdbID": "6027912", "rating": 7.5, "votes": 232450, "number_of_episodes": 74}