{"cast": {"0227759": "Peter Dinklage", "0182666": "Nikolaj Coster-Waldau", "0372176": "Lena Headey", "3592338": "Emilia Clarke", "3229685": "Kit Harington", "3849842": "Sophie Turner", "3586035": "Maisie Williams", "0192377": "Liam Cunningham", "2812026": "Nathalie Emmanuel", "0654295": "Alfie Allen", "4263213": "John Bradley", "3652842": "Isaac Hempstead Wright", "3729225": "Gwendoline Christie", "0384152": "Conleth Hill", "0564920": "Rory McCann", "0283492": "Jerome Flynn", "1970465": "Kristofer Hivju", "1478079": "Joe Dempsie", "2760664": "Jacob Anderson", "0322513": "Iain Glen", "1561982": "Pilou Asbæk", "0504320": "Anton Lesser", "0233807": "Richard Dormer", "2247629": "Gemma Whelan", "0174005": "Ben Crompton", "5485781": "Hafþór Júlíus Björnsson", "4535552": "Daniel Portman", "0889338": "Rupert Vansittart", "8165602": "Bella Ramsey", "4704928": "Marc Rissmann", "8257864": "Megan Parkinson", "1483416": "Richard Rycroft", "9132255": "Harry Grasby", "5890145": "Lucy Aarden", "10620044": "Marina Lawrence-Mahrra", "4982706": "Josephine Gillan", "7047874": "Staz Nair", "9545537": "Felix Jamieson", "1703459": "Syd Ralph", "0565897": "Eileen McCloskey", "0876515": "Katie Tumelty", "9754427": "Louis Agbodo", "6978773": "Canan Avsar", "9230301": "Robert Brown", "2336143": "Logan Bruce", "7009175": "Kadrolsha Ona Carole", "4232488": "Micheal Fitzgerald", "14437018": "Christopher Gibson", "7969435": "Jaryd Headley", "4984276": "Dave Hill", "11414072": "Brian Kearns", "6291097": "Patrick Kelly", "8256997": "Andrew McClay", "0568390": "Rob McElhenney", "10911829": "Mark P. O'Connor", "4849420": "Stephen Presley", "7361455": "Mark Quigley", "8213104": "Adam Quigley-Nixon", "8132412": "Peter Rooney", "0771414": "Martin Starr", "10246081": "Andrew Watson"}, "geners": ["Action", "Adventure", "Drama", "Fantasy"], "runtimes": ["54"],  "plot": ["Jon and Daenerys arrive in Winterfell and are met with skepticism. Sam learns about the fate of his family. Cersei gives Euron the reward he aims for. Theon follows his heart.", "SPOILER: Jon and Daenerys have a cold reception in Winterfell. Jon meets his brother and sisters and rides the dragons with Daenerys. Then she discloses to Sam the fate of his father and brother. When Jon meets Sam, he discloses who his parents are. Euron Greyjoy meets Cersei to collect his recompense for joining to her army. Theon rescues his sister Yara and decides to go to Winterfell. Jaime arrives in Winterfell and sees Bran Stark.—Claudio Carvalho, Rio de Janeiro, Brazil", "Reaching Winterfell with their combined army and impressive dragons, Jon and Daenerys learn the Army of the Dead breached the Wall and the Night King commands the undead Viserion. The Northern Houses and their allies rally around Winterfell but distrust Daenerys, scold Jon for ceding her his crown and duly doubt Cersei's pledge to send troops. Euron returns to King's Landing with the mercenary Golden Company, smaller then hoped and without elephants, and entices Cersei to consummate their union. Cersei, through Qyburn, hires Bronn to assassinate Tyrion and Jaime if they don't fall on the field. Theon rescues chained 'queen' Yara, who sets out to retake the Iron Islands, telling Theon to return at Winterfell to Jon, who welcomes him warmly, like Arya, only Sansa remains an icy skeptic. Jon and Daenerys ride the dragons, deepening their bond. Daenerys wants to reward Sam for saving Jorah then realizes that she executed his father and brother. Sam tells Jon he is actually the Iron Throne heir, born Aegon Targaryen. Sent to help evacuate House Umber's seat Last Hearth, Tormund and Beric encounter Edd's now superfluous Night's Watch garrison but find the castle's occupants dead, and the wight of Ned Umber is left as a gruesome message. Jaime arrives at Winterfell, where Bran awaits him..—KGF Vissers", "Upon reaching Winterfell with their combined armies, Jon and Daenerys learn the Army of the Dead has breached the Wall and the Night King commands the undead Viserion. The Northern Houses and the Vale rally around Winterfell but distrust Daenerys and doubt Cersei's pledge to send troops. Euron returns to King's Landing with the Golden Company and entices Cersei to consummate their union. Cersei, through Qyburn, hires Bronn to assassinate Tyrion and Jaime. Theon rescues Yara, who then sets out to retake the Iron Islands, while Theon returns to Winterfell. There, Jon is reunited with Arya. Jon and Daenerys ride the dragons and deepen their bond. Daenerys wants to reward Sam for saving Jorah before realizing that she executed his father and brother. Sam tells Jon that he was born Aegon Targaryen and is the true heir to the Iron Throne. At House Umber, Tormund and Beric encounter Edd and other Night's Watch members. The castle's occupants dead, and the wight of Ned Umber is left as a gruesome message. Jaime arrives at Winterfell where Bran awaits him."], "genres": "N/A", "imdbID": "5924366", "rating": 7.6, "votes": 142843, "number_of_episodes": 74}