{"cast": {"0001852": "Treat Williams", "0518718": "Jeremy London", "0072737": "Tushka Bergen", "0117412": "Hugh Keays-Byrne", "0000986": "Bryan Brown", "0920442": "Tessa Wells", "0418664": "Petra Yared", "0149508": "Sarah Chadwick", "0433920": "Peter Kaa", "0119522": "Joe Bugner", "0362579": "Alan Hardy", "0152982": "Bill Charles", "0287053": "John Forsyth", "0066723": "Warwick Begg", "0160465": "Christopher Christo", "0335252": "Anaru Grant", "0850313": "Matiu Tarawa", "0168281": "Trevor Cockay", "0755569": "Warwick Sadler"}, "geners": ["Adventure", "Sci-Fi", "Fantasy"], "runtimes": ["95"],  "plot": ["As luck would have it, Alice Hastings arrives and it seems she may be Lytton's salvation. Alice is a wealthy patron who hires Lytton to find her missing husband, Casper, who disappeared while on a gold-hunting expedition in New Zealand. While Jonas is at first hesitant to accept the venture, he eventually reconsiders and accompanies Alice and his uncle on their journey. They are soon joined by McNiff, a somewhat unsavory character whose knowledge of the Maori culture and language prove him to be indispensable to their expedition. During their adventure, the group finds themselves barely escaping death after they fall into the clutches of a cannibalistic Maori gang. They continue onward and travel inside the mysterious caves of a volcanic crater. Facing death at every turn, they soon arrive at a mysterious underground beach that turns out to be - the center of the earth. Inside, they find evidence that Casper has also been to this uncharted land. Rummaging through the caves, the fearless troop discovers traces of prehistoric life forms, among them are a group of human-sized dinosaurs called the Sauroids whom abduct Alice. The expedition also discovers a tribe of prehistoric humans, who have been taught the ways of the modern human by the man they call the \"Schoolmaster\" or Casper Hastings. Strangely enough, it appears that Hastings has somehow prospered in this strange New World gaining mastery over this primitive tribe. The group devises a plan and rescues Alice from the Sauroids. Jonas is injured during the rescue operation, but his cuts are magically healed with the help of Ralna, a native that he has fallen in love with, and a magical plant called \"zho-tan\". Casper confides to Alice that this miracle plant is a magical cure-all that can make him wealthy beyond belief. Uncontrollable and greedy, Casper attempts to return to the outside world with his magical find, but ultimately meets a fateful end."], "genres": "N/A", "imdbID": "3980404", "rating": 6.2, "votes": 43, "number_of_episodes": 2}