{"cast": {"0050959": "Pedro Pascal", "8165602": "Bella Ramsey", "4045841": "Lamar Johnson", "0001491": "Melanie Lynskey", "13546659": "Keivonn Woodard", "0682386": "Jeffrey Pierce", "0315288": "John Getz", "7146898": "Juan Magana", "0107023": "Eric Breker", "14198614": "Zay Domo Artist", "6969672": "C. Stephen Campbell", "12728902": "Patrick Chan", "0342138": "Kory Grim"}, "geners": ["Action", "Adventure", "Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["46"],  "plot": ["After abandoning their truck in Kansas City, Joel and Ellie attempt to escape without drawing the attention of a vindictive rebel leader.", "After a harrowing trek across a desolate United States, Joel and Ellie find themselves navigating a dangerous Kansas City on foot. Later, rebel leader Kathleen instigates a manhunt - one that pits her violent civilian militia against the world's best hope.—HBO", "After driving through a scorched earth, Joel and Ellie are forced to stop in Kansas City since the road is obstructed by trucks and cars. Joel decides to take a detour crossing the city, but they are attacked by a gang. Joel kills the guys and Ellie saves him from an attacker using her hidden pistol. They are forced to leave the truck and the supplies and flee to hide themselves. Joel decides to move to a skyscraper to see the movement in the city. Meanwhile, the leader of the Kansas City resistance group that has defeated FEDRA, Kathleen Coghlan, is hunting down a man called Henry and his brother Sam. Now, she includes Joel and Ellie in her hunting party believing they are together.—Claudio Carvalho, Rio de Janeiro, Brazil", "Traveling through Missouri, Joel and Ellie are forced to take a detour through Kansas City, where they are ambushed. Joel kills two of the bandits, but a third overpowers him and nearly chokes him to death before Ellie saves him by shooting the man with Frank's pistol. More bandits find the bodies; their leader, Kathleen, believes Joel and Ellie might be in contact with a man named Henry and orders a manhunt. Joel counsels Ellie about the firefight and gives her the pistol back. Kathleen's second-in-command Perry thinks he has found Henry's hideout, but something is growing under the building. Kathleen orders it kept secret until they find Henry. Joel and Ellie sleep in a high-rise apartment for the night, hoping they can scout a way out of the city in daylight. They awaken to find Henry and his younger brother Sam holding them at gunpoint."], "genres": "N/A", "imdbID": "14500890", "rating": 8.3, "votes": 74930, "number_of_episodes": 17}