{"cast": {"0050959": "Pedro Pascal", "8165602": "Bella Ramsey", "0791864": "Scott Shepherd", "1684869": "Troy Baker", "4039914": "Ari Rombough", "6138402": "Sonia Maria Chirila", "1692766": "Nelson Leis", "2473593": "Jason Vaisvila", "0736736": "Benjamin Rogers", "5786913": "Erik Lindquist"}, "geners": ["Action", "Adventure", "Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["51"],  "plot": ["Ellie crosses paths with a vengeful group of survivors - and draws the attention of its leader. A weakened Joel faces a new threat.", "Ellie is taking care of Joel's wound in an abandoned house. She takes his rifle to hunt an animal to eat. When she sees a deer, she shots the animal. However, two men, David and James, from a group of survivors that is starving, see the dead animal and try to carry it to their village. But Ellie aims the men with her rifle and proposes an exchange per penicillin. She stays with David while James brings the medicine. Then she runs back to Joel and injects the penicillin into him. Meanwhile David organizes a party to hunt down Joel, who killed one man of his group in \"Kin\".—Claudio Carvalho, Rio de Janeiro, Brazil", "While hunting for food for Herself and Joel, Ellie crosses path with a preacher and a friend. Ellie makes James ( Preachers friend) go get medicine to heal an infected wound that has caused Joel pain. David (preacher) bring Ellie to a small shelter while waiting for James. They talk and David tries to convince Ellie to join their settlement. James bring make the medicine. Ellie leaves and bring the medicine to Joel. David hunts for Ellie to bring her back. Ellie tries to escape on her horse but James shot the horse. They got Ellie alive and brought her back and locked her in a cage. Ellie was trying to find a way to escape but then saw a human ear on the ground. David comes in with food and tries to serve it to Ellie but Ellie knows what it is. Joes comes looking for Ellie and followed foot prints. He went into a shed and saw headless humans. While that is happening, Ellie finds out David only got her to \"make her his\". Ellie brakes his hand. David and another are angry and they try and kill her, they fail. Ellie is trying to escape and finds burning wood. She attempts to throw it at David but missed and hit a curtain which catches of fire. The log cabin is burning and David find Ellie, gets on top of her, and attempts to rape her. Ellie beheads him and escapes. Joel find a very scared Ellie wobbling away. Joel comes up and hugs her but she somewhat fights back until she realizes it is Joel and they escape."], "genres": "N/A", "imdbID": "15747176", "rating": 9.3, "votes": 65293, "number_of_episodes": 17}