{"cast": {"0050959": "Pedro Pascal", "8165602": "Bella Ramsey", "1890981": "Gabriel Luna", "5097044": "Isabela Merced", "6180088": "Young Mazino", "3239803": "Kaitlyn Dever", "2179180": "Rutina Wesley", "0121559": "Robert John Burke", "9036980": "Spencer Lord", "6616259": "Tati Gabrielle", "2821733": "Ariela Barer", "6639989": "Danny Ramirez", "16417656": "Ezra Benedict Agbonkhese", "12068167": "Finn McCager", "4950137": "Noah Lamanna", "0001573": "Catherine O'Hara", "1372589": "William Belleau", "0053390": "Gillian Barber", "10167857": "Becky Ferguson", "3662086": "Molly Scarpine", "3953855": "Samuel Hoeksema", "8637113": "Keiran Bohay", "11133859": "Victor Lau", "4743753": "Aoife O'Donovan", "10198376": "Brittany Haas", "2518777": "Greg Liszt", "17214576": "Corey DiMario", "17214577": "Miranda Henne", "0763395": "Gustavo Santaolalla"}, "geners": ["Action", "Adventure", "Drama", "Horror", "Sci-Fi", "Thriller"], "runtimes": ["59"],  "plot": ["Five years after the events in Salt Lake city, a now 19-year-old Ellie makes a discovery while on patrol with her best friend Dina. Back in Jackson Hole, Joel seeks help to mend his relationship with Ellie.", "In the wake of the previous season's events, Joel and Ellie attempt to settle into a new routine in a more stable community. While they try to adjust to a life with fewer threats, emotional tensions simmer beneath the surface. As Ellie starts to explore relationships and her place in this new environment, a distant storm begins to gather -- one that will set the stage for a new and deeply personal journey.—adrianeurope", "5 years have passed since Joel and Ellie's fateful trip to Salt Lake City. Jackson Hole, Wyoming is now a bustling community despite the Cordyceps fungus, and with Ellie now 19 years old, her and Joel both have their own lives and duties. However, a figure from the past thirsty for vengeance arises.", "Ellie and Joel's relationship has become turbulent and often frustrating. While Joel still attempts to protect Ellie, Ellie wants to be treated as an adult and refuses to let Joel shield her from runs. While on a run, Ellie and a friend come in contact with some clickers in the upstairs of a supermarket. After dispatching the clicker, Ellie is put into a scary and dangerous situation as the tough hunter becomes the hunted while alone. Ellie comes face to face with a stalker.", "Five years on and Joel and Ellie have settled down in Jackson, Wyoming. Ellie has developed into quite the fighter and puts her skills to good use in the defense of the community. However, things are a bit strained between her and Joel as he still feels he needs to protect her and she resents this. While on patrol, Ellie makes a startling discovery.—grantss"], "genres": "N/A", "imdbID": "26469967", "rating": 7.3, "votes": 35360, "number_of_episodes": 17}