{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0668970": "Lennard Pearce", "0149998": "John Challis", "0834588": "Nick Stringer", "1047179": "Barrie Wilmore", "0328698": "Joanne Good", "0254750": "Caroline Ellis"}, "geners": ["Comedy"], "runtimes": ["30"],  "plot": ["Del and Rodney are once again hunting for bargains. And after stopping off at Boycie's car lot they spy a Mark II Cortina that's being used as a part-exchange for a Vanden Plas. Del knocks the asking price down to £25, so long as he houses Boycie's E type jag for a week - Del hopes to use the Jag to impress his bit on the side. Del ups the price tag of the Cortina to £199 and gets interest from an Australian buyer. And with cash in their pockets, a Jag to drive, and both of them single, Rodney talks Del into heading off for a night on the tiles. The Trotters' night out doesn't start too well, as they are chatted up by a pair of transvestites in a nightclub. But their luck changes in the form of Nicky and Michelle, who they manage to chat up and persuade them to write their telephone numbers on Del's cigar pack, with the promise of a date next Friday. On their way home, Rodney accidentally throws the cigar pack out of the window of the Jag, and when Del makes an emergency stop, a car smashes into the back of Boycie's pristine E-type. To top it off, the car responsible for writing-off the Jag is none other than the clapped out Cortina.—Rune Thandy", "Rodney's got problems with his latest girlfriend - and asking his friend Mickey Pearce for help seems to have backfired. Meanwhile, Del has set his sights on making money from the secondhand car market, and forges a deal with Boycie that makes him a tidy profit. Flushed with success, Del and Rodders go up west for an evening on the town - hoping to impress the ladies with the flash car they're looking after for Boycie as part of the deal."], "genres": "N/A", "imdbID": "0666549", "rating": 8.1, "votes": 830, "number_of_episodes": 64}