{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0668970": "Lennard Pearce", "0413273": "Anthony Jackson", "0041112": "Michael Attwell", "0573143": "Jim McManus", "0285189": "Jillianne Foot", "1705011": "Anne Bruzac", "0170559": "Graham Cole", "1853094": "Shirley English", "0961250": "Julie La Rousse"}, "geners": ["Comedy"], "runtimes": ["29"],  "plot": ["Trotters' Independent Trading Company has been forced off the market, with the continuing downpour keeping most of Peckham indoors. While drowning their sorrows in The Nag's Head, Alex the travel agent mentions that business is slow and he can't give holidays away at the moment. As a promotional gimmick, Del suggests offering an 80% discount on a holiday to the next customer in the shop - and who happens to walk by, but Derek Trotter. Having sold sun-hats in the rain, Rodders has managed to earn some travel cash, but he is dismayed to learn that the 80% discount only extends to a grotty hotel in Benidorm. And despite not being included in the bargain, the brothers reluctantly pay for Grandad to join them on their escape to the sun. During the whole holiday, Del and Rodney check out the local talent, while Grandad cramps their style. Especially when they bring two girls back to their apartment, only for the old man to scare them off with his dentures. Things get a bit more serious when Grandad gets himself arrested. Despite fearing that old history is returning to haunt him - in the form of an incident 'during the war' - it turns out that he was arrested for jay-walking and is released without charge. Much to Del's annoyance.—Rune Thandy", "Del's friend Alex has his own travel agency - but he's having trouble selling his holidays at the moment, and his business seriously needs a boost. Del has a brainwave to help him - but clearly has his sights on his own reward for his idea! Could Del's scheming see the Trotters jet-setting to sunny Benidorm for a surprise holiday?—stevecann2003"], "genres": "N/A", "imdbID": "0666557", "rating": 7.9, "votes": 660, "number_of_episodes": 64}