{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0581467": "Buster Merryfield", "2715663": "Jane Thompson", "0531811": "Kenneth MacDonald", "0166655": "Kim Clifford", "0905452": "Johnny Wade", "0495019": "Annie Leake", "0149998": "John Challis", "0030022": "Tony Anholt", "0516181": "Roger Lloyd Pack", "0053448": "Paul Barber", "0000980": "Jim Broadbent", "0593224": "Christopher Mitchell", "0372745": "Roy Heather", "0120986": "Mark Burdis", "1596617": "Jeff Stevenson", "0401539": "Alan Hulse", "0068464": "Rachel Bell", "0067643": "Joe Belcher", "0019963": "Johnny Allan", "0281418": "David Fleeshman", "0094015": "Philip Bond", "2412448": "Lorence Ferdinand", "0174835": "Dennis Conlon", "1690092": "Poppy Lane", "2200885": "Jon Rust"}, "geners": ["Comedy"], "runtimes": ["95"],  "plot": ["Boycie and Abdul pitch a diamond scam to Del Boy, who immediately turns them down. That is until they offer him a £15,000 cut of the estimated £150,000 sale of the stone on the UK market. Del finds himself designated as the courier between Holland and Britain. No sooner has Del enlisted a reluctant Rodders, he hears his old foil Chief Inspector Slater is eyeing Boycie and Abdul as drug dealers. Del decides to hide undetected in the back of Denzil's van. Denzil then getting in and driving them to Hull (pursued by Rodney) was not part of the plan. Thinking quickly, they hire a boat, and let Uncle Albert guide them to Amsterdam. Overcoming counterfeit cash, Albert's amnesia, it's only the arrival of Slater that scuppers them. Despite this, it's Del who has the last laugh.—Rune Thandy", "Chief Inspector Slater is back on the manor, and on the trail of an international diamond-smuggling ring which he believes is operating again locally. Just as luck would have it, Boycie and his business partner Abdul seem very keen to recruit Del for just such an operation - and are prepared to make it financially very much worth his while. Does Del risk going ahead and getting involved, taking the loot - or does he forget the money and help the persuasive Slater with his enquiries, enabling him to retire from the force in a blaze of glory?—stevecann2003", "In his riskiest deal to date, Del boy is approached by Boycie and Abdul to act as a courier of £50,000 to collect a consignment of diamonds travelling from London to Amsterdam - via Hull of all places - for which they'll pay him £15,000. He bumps into Chief Inspector Slater, who casually reveals he is on the tails of a couple of local businessmen on a diamond smuggling caper. After holding a last-minute emergency briefing with Boycie and Abdul in the back of Denzil's lorry and Slater turning up to snoop around the area, Del finds himself trapped and on a long, uncomfortable journey up the A1 to Yorkshire, courtesy of Denzil who has no idea Del's in his trailer. Fortunately, Rodney is not far behind him, the van chugging and backfiring across Humber bridge and Del is freed at last. Denzil, meanwhile, starts catching glimpses of the Trotter's van and Del crossing the street, promptly convincing himself that he's sick in the head. After realising that they can hire a boat to get themselves to Holland, thus avoiding any customs or border checks, Del enlists Albert, who arrives by train, as their skipper, to Rodney's horror, Albert having a very wet career as a sailor during which he was torpedoed and sunk multiple times. Albert eventually steers them across the water and into Holland and the diamond deal goes very smoothly, albeit a bit later than planned. Back in England, Boycie and Abdul are beginning to panic and Slater thinks he knows who the courier is, but Del is soon on his way back (almost the way he came) and Slater has wasted 18 hours waiting at Gatwick airport for his man. As the money and diamonds are exchanged between Del and Boycie, Slater bursts in and the game is up. Slater has no intention of bringing them in but instead pugs the diamonds away for himself and bidding bon voyage to them all. However, he is promptly cornered by his own uniformed colleagues at a road block. But is Del in the frame as well? And can anything be salvaged of this disastrous deal? Rodney soon finds out after Del and Albert reveal a little sleight of hand trickery performed earlier. Rodney also has something up his sleeve which is soon lost in a jaw-dropping moment of disbelief. What a plonker.—Dominic"], "genres": "N/A", "imdbID": "0666588", "rating": 9.0, "votes": 978, "number_of_episodes": 64}