{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0581467": "Buster Merryfield", "0054315": "John Bardon", "0367633": "Max Harvey", "0085997": "Vas Blackwood", "0595154": "Jeanne Mockford", "0164686": "Catherine Clarke"}, "geners": ["Comedy"], "runtimes": ["28"],  "plot": ["Del, Rodney, and Albert are mistakenly apprehended as shoplifters by an overzealous security guard at the Top Buy Supermarket. And things get worse when they're taken to the manager's office and realise that they've lost their receipt for the goods. Shortly after, Tom the security guard brings a cocky shoplifter, Lennox Gilbey, into the manager's office, where he promptly pulls out a gun and demands money from the safe. Unluckily for Lennox the safe is on a time-lock and due to the dodgy watch he's wearing, he's 15 minutes later than he planned - and the safe doesn't open until 8am the next morning. After being held hostage throughout the night, Del realises that he sold the dodgy watch to Lennox, and that he also knew him as a kid. By preying on his guilty conscience, Del persuades Lennox to reveal that the plan was hatched by Tom and the supermarket manager to get at the £60,000 stored in the safe. The three accomplices beg Del not to go to the police, and instead, he arranges for Lennox to get a job as security guard at the supermarket after Tom's retirement, and then makes sure he wins a £1,000 prize as the millionth customer in the store.—Rune Thandy", "A shopping trip to the supermarket doesn't go well for the Trotters when they end up as hostages to a gunman in a bungled robbery - meaning they have to spend the night with him, a security guard and the store manager holed up in the office, waiting for the safe lock to release the next morning. After a long, tense night, will they all be off their trolleys... or able to safely check out unscathed?—stevecann2003"], "genres": "N/A", "imdbID": "0666578", "rating": 8.5, "votes": 670, "number_of_episodes": 64}