{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0581467": "Buster Merryfield", "0149998": "John Challis", "0390347": "Sue Holderness", "0531811": "Kenneth MacDonald", "0388877": "Erika Hoffman", "0176810": "Nula Conwell"}, "geners": ["Comedy"], "runtimes": ["30"],  "plot": ["It's closing time at The Nag's Head, and Mike the landlord is having problems clearing everyone out, particularly a young pregnant foreign girl who doesn't seem to speak Peckham English. Del and Rodney offer to help, and despite Del Boy's dodgy French, they work out that Anna is from Germany, and she's been chucked out on the street and was considering getting her child adopted. They leave Rodney to take Anna to a hotel, but he ends up bringing her back to the flat, where she explains that, Spencer, the son of the family she was working for as an au pair got her pregnant and then denied it all. After fuming about Rodney bringing another 'waif and stray' home, Del Boy considers what can be done with Anna's unwanted baby - and the first person he thinks of is Boycie. For year's Marlene and Boycie have been trying for a child, with no success, and now for a mere three grand, Del is offering them the chance to have their very own baby boy. The stress is clearly getting to Anna, and she begins to go into labour. Later on Del, Boycie and Marlene all gather round in the lounge waiting for Anna and Rodney return from hospital. All is well until Rodney lets Del Boy know that the Anna's baby is a girl... and that Spencer's parents were actually West Indian.—Rune Thandy", "Anna, a young German woman, is drinking alone at the Nag's Head. She seems to be in trouble, and needs somewhere to stay - Rodney takes pity on her and invites her back to the Trotter household. She tells them all the sad story of how she came to be there - and Del, characteristically, sees the chance for yet another dodgy money-making scheme - even if it is slightly more morally unsound than usual...—stevecann2003"], "genres": "N/A", "imdbID": "0666548", "rating": 8.1, "votes": 609, "number_of_episodes": 64}