{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0581467": "Buster Merryfield", "0516181": "Roger Lloyd Pack", "0531811": "Kenneth MacDonald", "0184860": "Gerry Cowper", "0171716": "Mark Colleano", "1645943": "Fred Tomlinson", "1448683": "Joan Baxter", "2713911": "Derek Price", "0054929": "Ken Barker"}, "geners": ["Comedy"], "runtimes": ["30"],  "plot": ["Trigger's young niece, Lisa, is staying with him for a while, and the scruffy young girl that Del and Rodney remember has now become a stunning 25 year-old woman. Both Trotter brothers think they are in with a chance, and immediately begin competing for Lisa's affections. Despite almost coming to blows, Del and Rodney manage to invite Lisa round to the flat for tea, and she seems more than happy to accept. In preparation for their date with Lisa, Del goes out to get some more 'Smash' and Rodney spends half-an-hour on the sunbed. Just before Del leaves for the shops, he notices Rodney has dozed off and whacks up the heat on the bed. Much to Rodney's annoyance, he spends most of the evening nursing his bright red face, which has burnt under the ultra-violet rays, whilst Del and Lisa seem to be getting on really well. To get his revenge, Rodders picks up on the fact that Lisa mentions she was going hang-gliding, and as a surprise for his 46th birthday, he arranges for Del to have a go. After offering to give her a left back home to Winchester, Del and Rodney head off to meet Lisa's friends for a spot of hang-gliding. Not wanting to loose face, Del reluctantly agrees to try it out, and after launching himself into the air, he disappears for over 12 hours.—Rune Thandy", "Del and Rodney are surprised to meet Trigger's niece Lisa at the Nag's Head, whom they hadn't seen for years. She's now all grown up, and a rather attractive young woman. They are both smitten by her charms, and invite her back to the flat - with their own separate plans to try and seduce her. Lisa mentions her friend's hang-gliding club - and Rodney sees a perfect opportunity to get his revenge on Del for leaving him to bake earlier on his dodgy home-solarium.—stevecann2003"], "genres": "N/A", "imdbID": "0666572", "rating": 8.8, "votes": 696, "number_of_episodes": 64}