{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0581467": "Buster Merryfield", "0053448": "Paul Barber", "0149998": "John Challis", "0372745": "Roy Heather", "0390347": "Sue Holderness", "0510317": "Denis Lill", "0516181": "Roger Lloyd Pack", "0531811": "Kenneth MacDonald", "0615203": "Patrick Murray", "0668854": "Tessa Peake-Jones", "0834974": "Gwyneth Strong", "0940219": "Steven Woodcock", "0893243": "Wanda Ventham", "0017528": "Steve Alder", "0048390": "Del Baker", "0060862": "Brigid Erin Bates", "2723428": "Daniel Le Coutre", "0003741": "Robin Driscoll", "0263189": "Roy Evans", "2723353": "Dawn Funnell", "0317081": "Lee Gibson", "0365594": "Gail Harrison", "0384164": "Daniel Hill", "0461063": "Rosalind Knight", "0656231": "Katharine Page", "0939766": "Jake Wood", "0082689": "Michael Bilton", "0136250": "Fanny Carby", "1740319": "Russell Brook", "1537265": "Lee Richards", "2314477": "Dave Richmond", "2274343": "Tina Simmons"}, "geners": ["Comedy"], "runtimes": ["80"],  "plot": ["The Nag's Head regulars head to the seaside town of Margate for an eventful day trip.", "The Trotters join other Nag's Head regulars on a day trip to Margate. However, possibly due to one of the Albanian radios Del has imported and is fitted in the coach there is a fire and an explosion and, due to a train strike, the party are forced to stay overnight. As it is a Bank Holiday accommodation is scarce and the Trotters find themselves in a creepy old guest house run by scary Mrs. Cresswell. Del and Rodney go to a club where they see magician the Great Ramondo and his assistant, Raquel, a former girl-friend of Del. Returning to the guest house they find themselves locked out and return to Raquel's flat, where Del, who still has feelings for her, makes a fool of himself by assuming that Ramondo, who is actually gay, is sexually harassing her and hits him, throwing his suit-case out of a window. On return to London Rodney makes a similar fool of himself by assuming that Cassandra is having an affair with her boss, whilst Del finds out that the suit-case he threw out of the window hit Boycie and Trigger.—don @ minifie-1", "It's Bank Holiday weekend, and the Trotters (plus the regulars of the Nag's Head) hire a coach for their bi-annual Jolly Boys' daytrip to the seaside town of Margate. Cassandra isn't too happy to spend her first night away from Rodney after a year of marriage, but comes round to the idea. Everyone has a good time in Margate, but events take a couple of unexpected twists as it appears the Jolly Boys may be staying beside the seaside a little bit longer than expected...—stevecann2003"], "genres": "N/A", "imdbID": "0666576", "rating": 9.6, "votes": 1602, "number_of_episodes": 64}