{"cast": {"0419248": "David Jason", "0528525": "Nicholas Lyndhurst", "0581467": "Buster Merryfield", "0668854": "Tessa Peake-Jones", "0834974": "Gwyneth Strong", "0149998": "John Challis", "0516181": "Roger Lloyd Pack", "0531811": "Kenneth MacDonald", "0390347": "Sue Holderness", "0053448": "Paul Barber", "0615203": "Patrick Murray", "0510317": "Denis Lill", "0372745": "Roy Heather", "0262125": "Treva Etienne", "0828432": "Grant Stevens", "0139175": "Antoni Corone", "0467921": "Tom Kouchalakos", "0721026": "Raphael Rey Gomez", "0179772": "Dave Corey", "0025181": "Jay Amor", "0845079": "Mario Ernesto Sánchez", "0260348": "Roberto Escobar", "0696567": "Roger Pretto", "0129455": "Alfredo Álvarez Calderón", "0033790": "John Archie", "0298332": "Rob Fuller", "0214379": "Dee Dee Deering", "0318832": "Jeff Gillen", "2720411": "Renee Sweeney", "0460754": "Will Knickerbocker", "0086781": "D.L. Blakely", "1357135": "Damian Chuck", "2722737": "Joshua Rosen", "0204739": "Jackie Davis", "0856262": "Janice Tesh", "0002956": "Barry Gibb", "0054315": "John Bardon", "0779621": "Nick Scott"}, "geners": ["Comedy"], "runtimes": ["75"],  "plot": ["The Trotters arrive in Miami, where they are spotted by Mafia Don Vincenzo Occhetti and his sons, the don just happening to be Del's exact double. The Occhettis welcome the brothers but they have a plan. Occhetti is to stand trial for several crimes. If Del is found dead and it is assumed that he is the Mafioso, the don will be in a position to start a new life. Several unsuccessful attempts to kill Del follow, as does an argument between Rodney and Occhetti, whom Rodney believes to be his brother. When Del and Rodney tumble to what is happening they go on the run but are saved by Marlene and Boycie, who are on holiday in Miami. They also supply evidence of the Occhettis' drug-dealing. Back home in Peckham Del finds the crates of wine stacked up in his flat but the television news tells him that, thanks to his efforts, Occhetti has been imprisoned.—don @ minifie-1", "Del and Rodney touch down in Miami, and hire a camper van. Very soon they run into trouble - it just so happens that Del is a dead ringer for notorious mafia boss Don Vincenzo Occhetti, and is spotted by his sons in a bar. Occhetti is due to stand trial where he is destined to go down for several life sentences and, with Del's uncanny resemblance, his sons see a way out for their father. When the Trotters leave the bar, they discover their camper van has been broken into and all their possessions stolen. But this is only the start of their problems - help is soon at hand when Occhetti's sons step in as apparent good samaritans...—stevecann2003"], "genres": "N/A", "imdbID": "0666562", "rating": 8.2, "votes": 839, "number_of_episodes": 64}