{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "1631222": "Henry Lloyd-Hughes", "2113191": "Emily Head", "0915948": "Robin Weaver", "3038224": "Dominic Applewhite", "0164953": "Prue Clarke", "1829595": "Greg Davies", "1471130": "James Cameron Stewart", "1276507": "Alex Macqueen", "2351086": "Deo Simcox", "0829134": "Belinda Stewart-Wilson", "0872040": "Martin Trenaman", "3031021": "Justine Cain", "2767765": "Libby Hayter", "2699231": "Ben Wood"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["The four bunk off School and get drunk. Simon tells Carli D'amato he loves her by writing it on her drive way in big letters. It ends badly when Simon and Will's parents find out what they've been doing all day.", "Despite Neil believing the karma not right after Will inadvertently hits a disabled woman in the head with a Frisbee, Will, Simon, Jay and Neil go ahead with their plan of skipping school for the day. Plan is too strong a word as they have no idea what they will do beyond not going to school and drinking beer. Will and Simon - more so the latter - take charge of dodging parents and providing an alibi to the school, while an incognito Will takes charge of buying the alcohol. As the guys sit around drinking and deciding what to do with the day, talk centers particularly on the questionable sexual orientation of Neil's father, and based on Simon's belief that he truly is in love with Carli, what he should do to advance the relationship regardless of the fact that Carli already has a boyfriend. Carli's reaction to an act of bravado makes Simon believe she may have similar feelings for him. But a babysitting \"date\" that Simon has with Carli to look after her four year old brother, Chris - with Will along as the actual babysitter while Simon can be alone with Carli - is the beginning of the downfall of the day.—Huggo", "The boys decide to play truant for the day and, having made their excuses, sit around drinking. Simon confesses his adoration of the unattainable pupil Carli but she already has a boy-friend. The others hatch a plan to get Simon into Carli's good books by arranging for him to baby-sit her little brother but, needless to say, the 'plan' does not go according to plan.—don @ minifie-1"], "genres": "N/A", "imdbID": "1228323", "rating": 8.5, "votes": 1585, "number_of_episodes": 18}