{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "0872040": "Martin Trenaman", "0890189": "Ash Varrez", "3004690": "John Seaward", "0820608": "Amanda St. John", "2113191": "Emily Head", "3030331": "Jo Maycock", "1829595": "Greg Davies", "1631222": "Henry Lloyd-Hughes", "3038143": "Emily Atack", "3038666": "Ollie Holme", "12139544": "Transformer", "3031021": "Justine Cain"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["As the only person to have volunteered for the job, Will is elected Chairman of the Organization Party for the end of term Christmas bash and ropes the other three boys into being his assistants. Simon, needless to say, is keen to use the opportunity to declare his public love for Carli D'Amato, which proves to be anything but a good idea.—don @ minifie-1", "Will, the only candidate, is elected Chair of the school's Christmas Prom Committee - the school's first ever Christmas Prom - and he wants to look the part by hiring a suit. Mr. Cooper, with his old fashioned mentality, helps Will and boys in this respect by sending them to his tailor. Chairman Will rules the Committee by dictatorship, but delegates key responsibilities to his friends. Jay wants to be DJ. And they're thrilled to be in charge of handing out the drink vouchers as they can get the girls of their dreams drunk. A crimp in the plans may be the fact of Mr. Gilbert being one of the chaperons, although Neil, Jay and Simon are excited about Miss Timms, the only female teacher under thirty at the school, being the other. Beyond the prom organization, Will still has Charlotte Hinchcliffe on his mind - despite the constant threats from Donovan to stay away from her - and the speculation if she only agreed to sleep with him on a dare or bet. Simon is hoping to take Carli to the prom, still despite the fact of her dating Tom (which Simon has blocked out of his reality). Simon has a plan all worked out with Jay to sweep Carli off her feet. Will feels his cachet will either skyrocket or come crashing to the ground based on how the evening goes.—Huggo"], "genres": "N/A", "imdbID": "1234984", "rating": 8.0, "votes": 1262, "number_of_episodes": 18}