{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "0629298": "Phil Nice", "0582179": "Oriane Messina", "0915948": "Robin Weaver", "3038224": "Dominic Applewhite", "0872040": "Martin Trenaman", "1631222": "Henry Lloyd-Hughes", "0829134": "Belinda Stewart-Wilson", "3037959": "Orlando Brooke", "3038269": "Tom Shaw", "5011028": "Sam Barnard", "2878117": "Adrian James"}, "geners": ["Comedy"], "runtimes": ["22"],  "plot": ["Simon passes his driving test at the first attempt, less on account of his skills than the fact that Tracey, the saucy examiner, finds him cute. As promised, he agrees to take his three friends to Thorpe Park, where he can get in free as he knows the man who clears up the sick. Once on the road, Will, Jay and Neil realize that Simon is a rubbish driver.—don @ minifie-1", "One of the things that Will has learned in his first term at a coed school is that girls prefer boys who drive and own cars. As the oldest in his social circle, Simon is the one who must lead the charge of the four into the driving world, if only his driving skills were up to the challenge. Miraculously, he passes his driving test (with a little unexpected assistance from his less than scrupulous driving examiner), after which the four plan on taking a road trip in the new car Simon's parents have promised him. Their destination is Thorpe Park - an amusement park - as Neil has just informed them he has a job there. They will take advantage of Neil's employee freebies while picking up girls. Their plans hit one obstacle after another stemming primarily from different priorities among the four based on incidents of the day. But nothing will stop Will from his goal of the four of them being in the four front seats while riding the Nemesis Inferno roller coaster. By the end of the day, Will's \"girls and cars\" lesson needs some minor edits for their specific situation in life.—Huggo"], "genres": "N/A", "imdbID": "1236074", "rating": 8.1, "votes": 1405, "number_of_episodes": 18}