{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "1631222": "Henry Lloyd-Hughes", "1840377": "Anabel Barnston", "3004690": "John Seaward", "1829595": "Greg Davies", "3038704": "Richie Hart", "2113191": "Emily Head", "0829134": "Belinda Stewart-Wilson", "1276507": "Alex Macqueen", "0915948": "Robin Weaver", "0111685": "Andrew Brooke", "0267003": "Tim Faraday", "3038666": "Ollie Holme", "2196406": "Nigel Boyle", "3038143": "Emily Atack", "0050426": "Martin Ball", "2767765": "Libby Hayter", "2699231": "Ben Wood"}, "geners": ["Comedy"], "runtimes": ["22"],  "plot": ["When his father walks out on his mother and himself, bespectacled, nerdy Will McKenzie is forced to leave his private school and enroll at the local comprehensive, where his accent and appearance make him an easy target for the school psycho. Seeking to make friends with 'normal' boys he pals up with Jay, Neil and Simon, but none of them are exactly winners, as is evidenced when they try to buy alcohol in a pub.—don @ minifie-1", "After his father and mother split, straight laced and slightly nerdish sixth former Will McKenzie has to start his twelfth year at public school - Rudge Park Comprehensive - instead of private school since his mother can no longer afford the private school tuition. Although Will was bullied at private school, his life at Rudge Park seems to be even worse when he gets into the bad books of Mr. Gilbert, the head of the sixth form, and he seems destined to be labeled as one of the freaks of the student body. Will will do anything to get out of being one of the freaks and insinuates himself into social group only marginally above the freaks. This group includes big talking and sex-obsessed Jay Cartwright, dimwitted Neil Sutherland, and Simon Cooper, whose primary focus in life is his crush on his childhood friend, Carli D'Amato. The first social function Will attends with them is the traditional sixth form pub night at the Black Horse Pub, this tradition despite all the students being underage. To prove himself, Will tries to take charge by trying to buy beer at the pub for his new mates. Beyond ID issues, they face venue problems and the wrath of the school bully, Mark Donovan. But Will's long term saving grace with his new mates may be their lust for Will's beautiful mother, Polly McKenzie.—Huggo"], "genres": "N/A", "imdbID": "1228324", "rating": 7.7, "votes": 1572, "number_of_episodes": 18}