{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "2113191": "Emily Head", "1599949": "Lily Lovett", "0056041": "Kacey Clarke", "1561546": "Jody Halse", "2064986": "Robert McCafferty", "2680253": "Daniel Lawrence Taylor", "3019055": "Jonny Sweet", "3067994": "Seok-Ha Hwang", "3004690": "John Seaward"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["Will decides the boys should reinvent themselves as trendy clubbers and they drive to London in Simon's car, though to gain entry to the best club in town Simon must swap his trainers for a tramp's filthy old shoes. Neil cuts his penis weeing into a can and when Jay inspects the damage they are ejected as perverts. Can things get any worse for the lads? The wheel-clamping of Simon's car might provide the answer.—don @ minifie-1", "Will feels that he and his groups of friends have not only fallen into a rut, but a rut that turns off girls. So he proposes they do something different this weekend that would be exciting to girls: go clubbing in London. The prospect scares Simon, who refuses to drive to the big city. Neil, newly licensed and with a car (both facts which he only now tells his friends despite having had both for a while), offers to drive. Jay, who brags that he goes into London regularly to shag girls, is in. And Simon finally agrees when Carli says that she will go (inferring that she'll be at the specified club, but that this is not a date with Simon, which is what he still believes). Will is even more buoyed when Rachel, giving him what he believes are signals that she's interested in him, also says she'll be there with Carli. The boys' first snag is misinterpreting Neil's offer. They hit another snag with the transportation issue most specifically in London. And another problem arises in actually getting into the club specifically because of Simon, who will do anything to get in and be with Carli. Once inside, will their self-reinvention have the intended effects?—Huggo"], "genres": "N/A", "imdbID": "1398708", "rating": 8.0, "votes": 1204, "number_of_episodes": 18}