{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "1829595": "Greg Davies", "3412273": "Charlie Wernham", "2961239": "Scott McNess", "3038143": "Emily Atack", "0166420": "Cavan Clerkin", "2411784": "David Fynn", "1145387": "Adam G. Goodwin", "0769442": "David Schaal", "0829134": "Belinda Stewart-Wilson", "1276507": "Alex Macqueen", "3410250": "Holly Peplow"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["Following a disappointing Valentine's Day, a mix-up in the work experience programme means that Neil gets to work in a newspaper office whilst Will is stuck in a garage, where he gets stripped and thrown in a pond as an initiation ceremony. Unwisely he inadvertently invites a work colleague to the school disco, where Simon gets a pleasant surprise from a female admirer.A run-in with a younger boy, however, means that ultimately the boys end up facing their customary public humiliation.—don @ minifie-1", "It's Valentine's Day. Discounting the several Valentine's Jay wrote to himself pretending that they're from horny girls and the one Will got from a family member, the only Valentine's received by one of the foursome was to Simon from Hannah Fields, a girl in the year behind his. Simon wants to keep the fact of receiving this Valentine a secret from his crush, Carli. Regardless of not receiving one from her, Will has a non-date date later that week with Charlotte to hang out while she works at an under 18's club. Conversely, Will considers this to be a true date. Valentine's Day also marks the date that the work experience assignments are handed out. Despite being an obvious mix-up, Mr. Gilbert refuses to change Will's assignment to work in a garage with Neil's assignment to work at a local newspaper. Will gets off on the wrong foot with his garage colleagues. Later that week at the under 18's club, the foursome get into one predicament after another, including Will with one of his garage mates who's there to see if Will's boasting about his \"girlfriend\" Charlotte are true, Simon with Hannah, and all with twelve year old tough guy Danny Moore who has it in for Simon. Will's attempt to solve all their problems of the evening have an unexpected result.—Huggo"], "genres": "N/A", "imdbID": "1398706", "rating": 8.0, "votes": 1221, "number_of_episodes": 18}