{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "2113191": "Emily Head", "1508314": "Waen Shepherd", "1631222": "Henry Lloyd-Hughes", "1829595": "Greg Davies", "3004690": "John Seaward", "2479184": "Jayne Wisener", "1518750": "Kali Peacock", "3038704": "Richie Hart", "1034417": "Jean Reeve", "1599949": "Lily Lovett"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["On a field trip to the Dorset coast Jay fails to locate the mythical housewife who deflowers schoolboys, Neil becomes a (paedophile) teacher's pet and Will and Simon fall out over pretty new girl Lauren. To cut their losses the boys take a boat around the bay but Simon falls in and ends up nude in front of the whole coach party with only a sock to cover his modesty.—don @ minifie-1", "It's the start of Will's second term at Rudge Park Comprehensive. His sociology class, taught by Mr. Kennedy, is on its annual multi-day field trip to the English seaside town of Swanage, where, as Jay states, a local woman always takes one student under her sexual wing. Although not in that class, Neil, acting as Mr. Kennedy's assistant, decides to tag along. The coach ride promises to be a boring affair until Will, solely out of circumstance, has to sit next to the pretty Irish and seemingly innocent transfer student, Lauren Harris. Over the course of the field trip, Jay tries to find his local sexual guide. Neil hangs out with Mr. Kennedy in ways the others deem inappropriate. And Will tries to get to know Lauren better, while Lauren seems to want to get to know Simon better, he who doesn't mind despite still lusting after Carli. Lauren's advances ultimately place Simon in a quandary as Carli also seems to want to hang out with him as the field trip progresses. But by the end of the trip, the four guys need to have a close encounter with each other out of survival.—Huggo"], "genres": "N/A", "imdbID": "1398705", "rating": 8.6, "votes": 1401, "number_of_episodes": 18}