{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "2169092": "Vladimir Consigny", "0829134": "Belinda Stewart-Wilson", "0915948": "Robin Weaver", "0872040": "Martin Trenaman", "0932219": "Victoria Willing", "3435195": "Star Jones", "0364847": "Jessica Harris", "2877285": "Isabella Laughland", "2113191": "Emily Head", "3038143": "Emily Atack", "1631222": "Henry Lloyd-Hughes", "3038704": "Richie Hart", "3004690": "John Seaward"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["It's Will's seventeenth birthday and he is planning a dinner party but it clashes with a more popular bash so that his only guests are Neil, Jay, Simon and Simon's exchange student Patrice. Out of boredom they gate-crash the other party but only one of them is asked to stay and then bedded by the hostess as a sex object. The other four are sent packing. Needless to say none of those four are French.—don @ minifie-1", "Simon, Jay and Neil are debating on whether to crash Louise Graham's party, she who is becoming more and more popular, or go to Will's seventeenth birthday dinner, to which he invited them a month in advance. They feel they have no choice but to go to Will's dinner. Will insists that each bring a girl so that it is a proper, sophisticated dinner party, but that request might be a tall order since all the popular girls will be at Louise's party. Another last minute invitee to Will's dinner is Patrice, an exotically handsome, chain-smoking, Arab hating French exchange student staying with the Coopers. Simon convinces Will to ask Charlotte, despite the debacle that was their last meeting at the under 18's club. Charlotte doesn't really answer leaving Will wondering if she'll show up. Simon vows to ask Carli. But by the time Will's party rolls around, it is devoid of any estrogen except for the stripper Jay and Neil hired but have no money to pay. As such, the guys decide their best option to pick up girls is to go to Louise's party, despite not being formally invited to it. There, Will does whatever he can to make the most of what is turning out to be a horrible birthday.—Huggo"], "genres": "N/A", "imdbID": "1398707", "rating": 8.1, "votes": 1211, "number_of_episodes": 18}