{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "1829595": "Greg Davies", "0915948": "Robin Weaver", "0817228": "Colin Spaull", "2397300": "Catherine Steadman", "1297018": "Marie Sutherland", "0872040": "Martin Trenaman", "3038224": "Dominic Applewhite", "0203935": "Rita Davies", "0949396": "Christopher Young"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["Will is asked to co-ordinate the school's Duke of Edinburgh Award Scheme and recruits the other boys to assist, even though Neil and Jay have no idea who the Duke is. Their first task is as volunteers in an old folks' home, where Daisy, Will's pretty ex-baby-sitter, is a care assistant, though his date with her goes wrong after a cruel prank played on him by Jay. And it is Jay's customarily sex-mad behaviour that gets the boys tossed off - an operative phrase - the scheme for good.—don @ minifie-1", "Mr. Gilbert, who has no interest in the program, appoints Will as the school's liaison to the Duke of Edinburgh's (DoE) Awards, which the school has just signed onto. Will is excited as he believes winning a DoE will look good on his resume. He talks Simon and Neil - the latter who believes he will meet Prince Philip in the process - into participating in the program, although Jay has no interest whatsoever. Much to Simon and Neil's chagrin, Will, as part of the program, signs them up to do volunteer work at a seniors' home. The reason?: Will's former babysitter, a pretty twenty-something woman named Daisy, also volunteers there, she who Will fancies. Will does whatever he can to get into her good graces. Meanwhile, Simon's parents are having marital problems, and Simon has to act as a \"friend\" to each individually, which unfortunately for him means hearing about, among other things, their sex life. Simon has to balance his parents' needs with his volunteer work. When Simon isn't available for the work at the seniors' home, Will gets Jay to fill in, he who will only do it for a fee. As Will does get closer to Daisy, issues with Will's pubic hair and with Jay's need to relieve his sexual energy may put a crimp on both Will's sexual and DoE quests.—Huggo"], "genres": "N/A", "imdbID": "1398709", "rating": 8.1, "votes": 1157, "number_of_episodes": 18}