{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "2113191": "Emily Head", "1599949": "Lily Lovett", "3173628": "Lizzie Stables", "0915948": "Robin Weaver", "3038704": "Richie Hart", "0769442": "David Schaal", "1276507": "Alex Macqueen", "0829134": "Belinda Stewart-Wilson", "1829595": "Greg Davies", "1111475": "Neal Barry", "3038666": "Ollie Holme", "3004690": "John Seaward", "2699231": "Ben Wood"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["The end of term exams loom. Simon, to the detriment of his own subjects, is excited when Carli comes to his house to revise, revealing that she is single again and rewarding him with kisses. Jay, for once, swaps lust for romance when he is smitten by Chloe, a sweet young girl from another school. Neil forgets his P.E. kit but gets through in his vest and pants and Will has an accident with his bowels after too many energy drinks but still gets his grades. However, Chloe drops Jay for being \"too sensitive\", Carli goes back to her ex-boyfriend and the boys end up with each other, useless lovers but good friends.—don @ minifie-1", "It's the end of term exam time, when many are thinking about studying. Will is pretending to do so, but really is not doing much of anything in avoiding studying. And when he finally gets to studying, he's reading the words in his textbooks, but they mean nothing to his brain. Simon has a study date with Carli at his house. He focuses on the date aspect more than the studying aspect. His focus on pursuing Carli becomes even more intense when he just learns what is supposed to be common knowledge directly from her that she and Tom have split. As such, he even helps her with courses that he isn't taking while forgoing studying for his own courses just to be with her. Neil is wondering how best to study for his courses, such as physical education. And Jay is skipping studying altogether as he has just started seeing an actual girl named Chloe, although Chloe does not want things to progress beyond kissing yet. For the first time in his life, Jay is honest to his mates about the nature of his relationship with a girl. After the exam period is over, which yields mixed results for the four (Will's based in part on his excessive consumption of energy drinks to stay awake to study), the guys head to the pub, with Simon and Jay hoping to advance their burgeoning new relationships with Carli and Chloe respectively, and Will facing his recent embarrassment head on.—Huggo"], "genres": "N/A", "imdbID": "1398710", "rating": 8.6, "votes": 1208, "number_of_episodes": 18}