{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "0769442": "David Schaal", "2113191": "Emily Head", "1631222": "Henry Lloyd-Hughes", "0872040": "Martin Trenaman", "1482510": "Hannah Tointon", "0829134": "Belinda Stewart-Wilson", "0392984": "Ben Homewood", "2509609": "Ben Bailey Smith", "7213868": "Failsafe"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["Simon takes Tara, a girl in the class below him, to a gig at a pub where to impress her, he has told her that he can get any drugs - courtesy of Jay. Jay's first attempt to score ends up with him buying tea-bags though eventually he does obtain some puff. None of the boys have smoked it before though and Will suffers severe side effects and takes to the stage to request an ambulance.—don @ minifie-1", "Simon forgets about Carli for a moment when he meets Tara, a lower sixth former who Simon has noticed for the first time since, in Tara's words, she's just dyed her hair and grown tits. Despite thinking Simon the epitome of straight-laced suburban, Tara invites him to a gig where the band Fail-Safe will be performing. Simon, never having been to a gig, agrees to go with her. Believing that's what you do at gigs and to impress Tara, he volunteers to bring the marijuana, despite never having done drugs. Based on earlier bragging about having drug dealer contacts, Jay is tasked with getting the marijuana, which ends up being a little more difficult than he imagines. At the gig, Neil is content with mixing his father's sleeping pills with Ribena and red wine, while Jay and Simon cautiously try smoking the joint, as does a more adventurous Tara, who had also never smoked before. And conservative Will, eventually buckling under the pressure, decides to eat a wad. The effects of the drugs on the five are somewhat predictable to thinking people, but unfortunately none of the five was thinking at the time.—Huggo"], "genres": "N/A", "imdbID": "1725588", "rating": 8.3, "votes": 1187, "number_of_episodes": 18}