{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "1829595": "Greg Davies", "1276507": "Alex Macqueen", "3004690": "John Seaward", "0056041": "Kacey Clarke", "1482510": "Hannah Tointon", "4089190": "Abbey Mordue", "1502296": "James Gillan", "1477786": "Nicholas Asbury", "0939774": "Janine Wood", "1599744": "Chizzy Akudolu", "0269698": "Stephanie Fayerman", "1614665": "Johnny Palmiero", "2113191": "Emily Head"}, "geners": ["Comedy"], "runtimes": ["24"],  "plot": ["It's Neil's eighteenth birthday and his dad is throwing him a party to which he can invite ten friends - not that he has that many. Simon, seriously dating Tara, arranges a double date for Will with her extremely tall and rapacious friend Kerry. Despite Will's efforts, she is not easy to shake off and, at Neil's dreary party, he dumps her, unaware that her father has just died, which leads to his vilification. Neil, however, takes advantage of the situation to have a happy birthday.—don @ minifie-1", "It's Neil eighteenth birthday. From his absent mother, Neil receives a motorbike, which Jay promptly ruins. From his father, Neil receives a birthday party - period. In addition to the family members in attendance, Neil is allowed invite ten friends - if he only had ten friends. In addition to Will, Simon and Jay, Neil wants Simon to invite his new girlfriend Tara, about who he can't stop talking. Simon and Tara's relationship may hit a bump in the road after he meets her parents. Unbeknown to Will, Simon and Will's upcoming plans to go see a movie at the shopping center's cinema will include Tara and Tara's friend Kerry, which the women consider a double date. Even though Will has yet to even meet Kerry, Neil wants Will to invite her to the party as well. After meeting Kerry, Will has mixed emotions. He doesn't fancy her at all as in addition to thinking that she's boring, she's also taller than he is and bigger than he is. But Simon has told him that Kerry willingly gives blow jobs, which Will wouldn't mind getting. As Will struggles about what to do with the Kerry situation, Kerry, who ends up attending the party, believes that she and Will are boyfriend/girlfriend. Simon forgets to tell Will a vital piece of information about Kerry until after he's made his decision about what to do. Meanwhile, Neil and Jay run into an unexpected person at the shopping center, which ultimately gets them into a bit of trouble.—Huggo"], "genres": "N/A", "imdbID": "1728929", "rating": 8.0, "votes": 1122, "number_of_episodes": 18}