{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "2113191": "Emily Head", "1829595": "Greg Davies", "3038143": "Emily Atack", "0915948": "Robin Weaver", "0872040": "Martin Trenaman", "3038224": "Dominic Applewhite", "1508314": "Waen Shepherd", "0916305": "Steven Webb", "0642109": "Caroline O'Neill", "2326615": "Chloe Hesar", "3004690": "John Seaward"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["Jay is annoyed when Carli asks Simon and not him to be a model in her charity fashion show, the proceeds going towards a kidney machine to help the unaccountably popular wheelchair-bound Alistair Scott. Against his principles Will takes the money at the door, when not fighting Alistair, but is thrilled when Charlotte returns and asks him to take part with her on the catwalk. Simon ends up modelling skimpy bathing trunks and, in his hurry to put them on, literally lets it all hang out. Unlike the onlookers, Carli is not amused.—don @ minifie-1", "It's the start of Will's second year at Rudge Park Comprehensive. One new thing at the school is that Jay can now drive and is allowed to drive his mother's car. Although the Cartwright's car is nicer than Simon's, Jay's driving is equally as bad as Simon's but in a different way. One thing that has not changed in Will's mind is that all the popular kids at the school admire themselves, as witnessed by the charity fashion show they are putting on in support of Alastair Scott, a student who has been absent from school for the past year while he was on dialysis and waited for a kidney donor, which has now been found. Although Will supports the charity, he doesn't support the fashion show. Regardless he is forced by Mr. Gilbert to work as the money collector at the door, where he still vows to hold his protest. Will's view of the event changes after he meets Alastair and after he learns of a special guest model. Neil volunteers to be one of the dressers, believing he will be dressing the girls. Jay, with newly pierced left ear, believes he will definitely be asked to model. He hasn't, much to his disbelief, although Simon has, since Carli is one of the organizers. Simon's biggest concern is that he doesn't have a boner thinking about Carli while walking the catwalk, but that changes when Carli asks him to do a more revealing assignment as a last minute substitute, that assignment which ends up being more revealing than anyone would have thought.—Huggo"], "genres": "N/A", "imdbID": "1674015", "rating": 8.4, "votes": 1211, "number_of_episodes": 18}