{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "0915948": "Robin Weaver", "0872040": "Martin Trenaman", "3038224": "Dominic Applewhite", "1482510": "Hannah Tointon", "1966892": "Charlie Covell", "3710443": "Ambrosine Lara Davies", "3184553": "Lewis Linford", "4151431": "Jack Brear", "2588194": "Danny Kirrane"}, "geners": ["Comedy"], "runtimes": ["25"],  "plot": ["Anxious to be alone so they can have sex Tara suggests to Simon they visit her sister Sophie at Warwick University but the other boys insist on coming too. Sophie is not impressed. Whilst Simon,thanks to bad advice from Jay,is having trouble with his manhood in the bedroom the others get involved with Sophie's beery flat-mates and their drunken dares. After Neil has wet the bed and Jay made an indecent proposal to a cold-stricken Dutch girl,all four boys are thrown out and Simon is still a virgin.—don @ minifie-1", "Tara, a virgin, wants to have sex with Simon, who is also a virgin. Wanting it not to be tawdry, Tara plans on where they should do the deed that is somewhat private from both sets of their parents but still comfortable: at Tara's sister Sophie's place, she who is at college in Warwick. Simon receives advice from his mates on how to proceed and what to do during the actual act. To be on hand just in case Simon doesn't know what to do, Jay and Neil tag along to Warwick, with Will also wanting to go not to feel left out. The five-some is much to Tara's chagrin. But while Tara and Simon have their quiet time together, the guys plan to hang out with Sophie, her two flatmates, Heike and Lewis, and their friends Joe and Daniel, all who attend Warwick. Will gets a look at what life at college will be like, this view which is totally different than what he had expected or hoped. Jay, based on information from Lewis, Joe and Daniel, dreams about getting some with a slightly under the weather Heike. Neil has an accident based on his over-consumption of orangeade. And as Tara and Simon proceed with their plan, its joy or lack thereof is affected by Simon taking specifically Jay's advice on sex.—Huggo"], "genres": "N/A", "imdbID": "1728564", "rating": 8.6, "votes": 1186, "number_of_episodes": 18}