{"cast": {"3020713": "Simon Bird", "0118617": "James Buckley", "3002919": "Blake Harrison", "3022504": "Joe Thomas", "2113191": "Emily Head", "1829595": "Greg Davies", "0915948": "Robin Weaver", "0872040": "Martin Trenaman", "3038224": "Dominic Applewhite", "2351086": "Deo Simcox", "4152276": "Rebecca Semark", "1599949": "Lily Lovett", "3450429": "Neil Hodge"}, "geners": ["Comedy"], "runtimes": ["26"],  "plot": ["Whilst Neil worries that he has got the girl from the cheese counter at ASDA pregnant, Simon is upset that his family must move to Swansea for his father's work. Will suggests a farewell camping trip for the four boys, though he is less than happy when the others use his possessions to light the camp-fire and Simon is not pleased when Neil and Jay let his car run into a lake. After a game in which each of them texts somebody on another's phone, Neil discovers that he is not a father after all and the boys bond in their own odd way.—don @ minifie-1", "Neil's life takes a major turn when he discovers that a one-nighter - his first ever full blown sexual encounter with intercourse - has resulted in the woman becoming pregnant. Simon believes his life is even worse than Neil's when his father tells him that because of his job, the family is moving to Swansea, Wales in two weeks time. Thinking he only has two weeks to declare his love to Carli before losing the opportunity forever, Simon, while drunk, makes a grand gesture to Carli which turns wrong. To get Simon and Neil out of their funk, Will proposes that the four mates, as one last grand hurrah, go on a camping trip to a secluded lakeside site, where they can get pissed together. As Will makes the preparations for the weekend, the other three, upon arriving at the intended destination, decide to take control away from Will. As the day progresses into night, the four realize that they're not much on camping in the great outdoors, especially as one problem arises after another. But a cell phone game initiated by Jay has some illuminating results.—Huggo"], "genres": "N/A", "imdbID": "1728927", "rating": 8.5, "votes": 1163, "number_of_episodes": 18}