{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0654640": "Alonso Oyarzun", "0167435": "Nicki Clyne"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["The Galactica and the other remaining ships - with about 50,000 people aboard them all - are being pursued by the Cylons. They are forced to jump into hyper space every 33 minutes. Somehow, the Cylons know where they are going and appear exactly 33 minutes after the Galactica arrives. The crew hasn't slept for over 130 hours now and everyone is exhausted. They rejoice when they finally make a jump and the Cylons fail to appear at the 33 minute mark. They are also prone to make mistakes and realize they've left behind a ship, the Olympic Carrier, with 1300 passengers aboard. When the ship rejoins the fleet a few hours later, the Cylons again arrive 33 minutes later leading Adama to conclude that there are Cylon spies on board. President Roslin now faces a major decision. The identity of the the Cylon aboard the Galactica is revealed.—garykmcd", "Battlestar Galactica and its rag-tag fleet are fleeing the Cylons and should be largely free of them. However, every 33 minutes the Cylons appear, necessitating a Hyper Space Jump. This has been going on for days - the crew hasn't slept for 130 hours. There seems no end in sight.—grantss", "Following the destruction of the Colonies, the refugee fleet led by Galactica has been relentlessly chased by the Cylons who pop up every 33 minutes to attack again, and have been doing so for five days straight. 33 minutes gives them barely long enough to calculate a jump and distribute the coordinates to each ship. The perpetual attacks and jumps to escape prevent anyone from sleeping for very long, even if they aren't involved in keeping the fleet moving. The equipment is also stressed to the point that, finally, a passenger ship called the 'Olympic Carrier' is left behind, rebooting their jump computer when the jump is executed. When the Olympic Carrier suddenly jumps in to rejoin the fleet some time later, it seems certain that the ship must have been infiltrated.—ThoperSought"], "genres": "N/A", "imdbID": "0519761", "rating": 8.5, "votes": 3605, "number_of_episodes": 74}