{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0927045": "Connor Widdows", "0368745": "Richard Hatch", "0654640": "Alonso Oyarzun", "0167435": "Nicki Clyne", "0234235": "Adrien Dorval", "0783498": "Ron Selmour", "0071922": "Matthew Bennett", "0821609": "Brent Stait", "1807701": "Graham Young", "1348197": "Curtis Ricks", "1145557": "Colby Johannson", "2005973": "Ken Jones"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Deciding to use the thousand prisoners on a prison transport ship to mine the ice on the planet they've found, Galactica's plans are upset when a political prisoner onboard leads an uprising, taking hostages. He questions the legitimacy of Roslin's government and demands free elections to be held in the fleet.", "Water is found on a moon, but now there's the question of how to retrieve it. Chief Tyrol thinks the work's going to be hard. The moon is very barren and the liquid water is too salt. Only the ice is good enough, but it needs to be melted on site. Tyrol expects he needs at least a thousand men to do the work in proper time. President Roslin decides to ask prisoners on the prison ship Astral Queen to do the hard labor and receive points earning their freedom. But none of the prisoners are willing to cooperate, their representative Tom Zarek, a well known terrorist, tells. He has plan of his owns, frees the prisoners with the help of a guard and takes Lee, Dualla, Cally and Billy hostage. Zarek demands elections to replace president Roslin. Meanwhile on Caprica, Helo and the Cylon Boomer have arrived in an empty city, looking for a hospital to retrieve anti-radiation medication.—Arnoud Tiele (imdb@tiele.nl)", "Having located a planet to replenish their lost supply of water, the President suggests that the 1300 prisoners aboard the prison ship be tasked with mining the ice and thereby earn credits toward their release. Lt. Lee 'Apollo' Adama is tasked with getting them to agree to do the work but finds that a legendary freedom fighter, Tom Zarek - who for most of the crew aboard the Galactica is seen as a terrorist - has convinced the other prisoners to demand their rights and refuse to do all work. He refuses to recognize the legitimacy of Laura Roslin's government and demands that the 50,000 survivors have an election. The inmates take Apollo and others prisoner and as a result, Commander Adama plans a raid to rescue them. Negotiations continue however as Apollo tries to find a negotiated settlement before it all turns into a bloodbath.—garykmcd", "With water discovered the problem now is harvesting it and getting it back to the fleet. It will take a large labour force and no ships have the manpower to spare. Except one. The Astral Queen is transporting a large group of felons, enough to do the job. It is decided to offer the prisoners \"points\" for working to harvest the water with the points translating to time off from, even completion of, their sentences. Now to convince the prisoners.—grantss", "Chief Tyrol concludes that the Galáctica need one thousand men to explore the ice on the planet and pump it to the spacecraft. Commander Adama proposes to use the prisoners on board of \"Astral Queen\" due to the dangerousness of the mission. However, President Roslin is against slave work and asks that the prisoners should volunteer receiving reduction in their sentences. When Captain Apollo makes the offer to the political activist Tom Zarek (leader of the prisoners) there is an uprising, and the group is taken as prisoners. Zarek proposes immediate free elections, questioning the legitimacy of President Roslin.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519763", "rating": 7.6, "votes": 2671, "number_of_episodes": 74}