{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0301874": "Lorena Gale", "0654640": "Alonso Oyarzun", "0167435": "Nicki Clyne", "0793156": "Jim Shield", "1406239": "Warren Christie", "0356501": "Jen Halley", "1489668": "Leah Cairns"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Infuriated that Roslin usurped his command by ordering Starbuck to steal the captured Raider, Adama decides that his only option is to storm Colonial One with marines and terminate her presidency. Starbuck reaches Caprica and finds the Arrow of Apollo in a museum, but she has to go through a copy of Number Six to get it.", "Commander Adama is not amused when he finds out president Roslin convinced Starbuck to retrieve the Arrow of Apollo. He orders an attack on Colonial One to end her reign. To retrieve the Raptor away team crashed on the surface of Kobol, he sends Boomer and Racetrack. They're supposed to nuke the Cylon Basestar in a Raptor with a Cylon transponder. While Starbuck is approaching Caprica, Boomer mentions to Helo they're at the temple of Delphi. Somehow she seems to know the importance of the arrow of Apollo. She tells Helo their relationship is important and that she actually has feelings for him. To Dr. Baltar on the surface of Kobol it becomes clear why his Number Six wanted him there. She has some explaining to do.—Arnoud Tiele (imdb@tiele.nl)", "When he learns that the President asked Starbuck to take the Cylon raider and go to Caprica, he orders her arrest. Colonel Tigh and Apollo lead the raid on the Colonial One to take her into custody and it becomes apparent that she's not going to give up her post willingly. Adama also asks Boomer to lead a one ship attack on the Cylon base ship but she cannot believe what she finds when she gets there. On Kobol, Dr. Baltar, Chief Tyrol and several others have survived the crash. Number Six has something very specific she wants to show Baltar. Starbuck meanwhile has little trouble getting to Cylon-occupied Caprica and easily gets her hands on the Arrow of Apollo. She'll have to get past Number Six if she wants to leave. The alternate Boomer has important news for Helo.—garykmcd", "When Commander Adama finds out that Starbuck was convinced by President Roslin to jump back to Caprica to retrieve Apollo's Arrow, he orders his men to arrest Roslin. They invade Colonial One and Captain Apollo does not obey the order and is also arrested for mutiny. Commander Adama also sends Boomer and Racetrack in a raptor with a Cylon transponder to drop a nuke on the Cylon starbase. However the bomb does not disengage, forcing Boomer to land in the starbase to release it manually. While on the deck, she discovers a secret about her origin. In Caprica, Boomer tells Helo that she is pregnant while in Kobol, Number Six exposes to Dr. Baltar the plans of God.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519775", "rating": 8.8, "votes": 2482, "number_of_episodes": 74}