{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0894690": "Kate Vernon", "0071922": "Matthew Bennett", "4112405": "Axel Green"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["After the interrogated Cylon gave Roslin the idea that Adama might be a Cylon, Roslin becomes suspicious of him. Unexpectedly, Colonel Tigh's estranged wife Ellen turns up alive in the fleet, apparently miraculously, raising the possibility that she might be a Cylon.", "Dr. Baltar has finished his Cylon detector and president Laura Roslin tries to convince commander Adama he should be the first to be tested. Since the Conroy copy told her Adama is a Cylon, she is getting more and more suspicious and even sends Billy to ask Dualla about his behavior. When suddenly a Cylon raider pops up behaving strangely, Adama is missing, raising more eyebrows. He returns however with Ellen Tigh, the presumed dead wife of colonel Tigh, who suddenly appeared. She claims she lost consciousness during the Cylon attack and was cared for on the Rising Star. Is she a Cylon? Back on Caprica, Helo notices a change in behavior of the centurions. Sharon tells him they're after her.—Arnoud Tiele (imdb@tiele.nl)", "Now that Loeben has planted the idea that Commander Adama is a Cylon, President Roslin worries that their infiltration may start at the very top. Dr. Baltar's Cylon detection process is now working - even if he isn't necessarily being honest about the results - and asks Adama to go first. He has been acting quite strange lately, making un-logged calls to other ships and even leaving the Galactica on a shuttle without filing a flight plan. He has a surprise however when he returns to the ship with Colonel Tigh's wife Ellen, who has been unconscious on another ship. He's brought her back reluctantly however, knowing the effect she will have on her husband. Meanwhile, on Cylon-occupied Caprica, Boomer has clearly opted to escaped with Helo confirming Number Six's belief that she is now more human than Cylon.—garykmcd", "When Dr. Baltar finishes his Cylon detector, President Roslin then suspects that Commander Adama may be a Cylon, she suggests the commander be the first tested. Further, she asks Billy to get information about Adama from Dualla. She finds that Adama has sent classified messages and has flown in a Raptor in secret missions. When a Cylon raider suddenly approaches Galactica with erratic flight and Adama vanishes, President Roslin increases her suspicion. However, Adama returns with Colonel Tigh's missing unfaithful wife Ellen Tigh, who was unconscious on board of the Rising Star, raising the suspicion that she could be a Cylon. Meanwhile in occupied Caprica, Boomer is in love with Helo and escapes to save his life.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519790", "rating": 7.5, "votes": 2369, "number_of_episodes": 74}