{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0301874": "Lorena Gale", "0722413": "Donnelly Rhodes", "0654640": "Alonso Oyarzun", "0647453": "Bodie Olmos", "0818182": "Stephen Spender", "1056475": "Jamie Bell", "1406239": "Warren Christie", "0167435": "Nicki Clyne", "1384760": "Jeff Dimitriou", "0356501": "Jen Halley", "0793156": "Jim Shield"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Galactica stumbles upon Kobol, the long-lost home world of humanity that the 13 Tribes came from, which legend says holds the only clues to the location of Earth. Roslin convinces Starbuck to steal the captured Cylon raider and return to Cylon-occupied Caprica with it to retrieve a religious artifact that will unlock the secrets on Kobol.", "While searching for supplies Boomer and Crashdown once again make an important discovery. It's a planet with a nitrogen-oxygen atmosphere. It seems some sort of calamity wiped out the population 2000 years ago. Still there are ruins left and the planet might be habitable. The dying President Roslin has visions however and she and priest Elosha determine that the planet is Kobol, the birthplace of mankind. The scriptures tell Kobol will lead the way to Earth. Meanwhile Kara spent the night with Dr. Baltar, leaving Lee very agitated. Galactica-Boomer has the feeling one day she might hurt somebody and is getting more and more suicidal tendencies, while Boomer on Caprica is about to be shot by Helo.—Arnoud Tiele (imdb@tiele.nl)", "While on a search for supplies, Boomer and Crashdown come across an idyllic planet that may be inhabitable. President Roslin thinks they've found the legendary planet Kobol, home to humankind and the point of origin for the 13 tribes. According to the scriptures, Kobol will also point the way to Earth. If it is Kobol, they will require the Arrow of Apollo to open the Temple of Athena to find the way. When they send a survey team to explore their find, the Cylon's are already there. The President asks Starbuck to return to Caprica to retrieve the Arrow. Boomer is not faring well and is still contemplating suicide, convinced that she is dangerous and will end up hurting someone. On Cylon-occupied Caprica meanwhile, Helo is trying to come to grips with what he's learned about the alternate Boomer.—garykmcd", "Starbuck has one night stand with Dr. Baltar, creating tension with Apollo. Meanwhile, Boomer and Crashdown find a habitable planet with ancient ruins and people conclude it is Kobol. President Roslin has visions with the pictures of the surface of Kobol and Elosha gives a religious interpretation to her visions based on the scriptures. Commander Adama sends three raptors to research the planet, but they are surprised by a Cylon starbase and the raiders destroy raptor number three, the number one crashes on Kobol and the number two jumps back to Galactica. Adama plots a scheme with Starbuck to lure the Cylons using the raider they have but President Roslin convinces her to jump back to Caprica to retrieve the mystic Apollo's Arrow to help her to lead the survivors to Earth. Meanwhile Boomer tries to commit suicide in Galactica while her copy is shot by Helo in Caprica.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519774", "rating": 8.3, "votes": 2308, "number_of_episodes": 74}