{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "1022429": "Sam Witwer", "0722413": "Donnelly Rhodes", "0853805": "Jill Teed", "0952778": "Dominic Zamprogna", "0654640": "Alonso Oyarzun", "0167435": "Nicki Clyne", "0647453": "Bodie Olmos", "0071922": "Matthew Bennett", "1775193": "Christina Schild", "1152963": "Charles Singh", "0535254": "Shaw Madson", "1631188": "Nimet Kanji", "0346607": "Biski Gugushe", "0152113": "Morris Chapdelaine", "0912714": "Ally Warren"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["A humanoid Cylon straps himself with explosives and commits a suicide bombing in a crowded hallway on Galactica. Roslin and Adama are forced to publicly reveal that the Cylons now have models that look like humans, and a wave of paranoia spreads over the fleet as everyone starts being suspected of being a Cylon.", "While Tyrol and Sharon have a secret meeting, a copy of the Cylon Doral blows himself up, killing three humans. Since security was hindered by them not knowing Cylons can look like humans, Roslin and Adama see no other solution than to make the news public. Sergeant Hadrian is given full authority to investigate why Doral had access to a weapons locker and starts a tribunal. She quickly finds a possible suspect when crew members tell different stories about the whereabouts of Tyrol during the bombing. Meanwhile on Caprica, Helo has a decision to make. Going after the disappeared Sharon or fleeing. It's a decision that can cost him his life.—Arnoud Tiele (imdb@tiele.nl)", "When a humanoid Cylon suicide bomber - the Doral variety - sets off his bomb on Galactica killing several people and injuring many more, Commander Adama and the President decide they have to go public with the news that Cylons now look like humans. Adama appoints Sergeant Hadrian to investigate and an independent tribunal. The evidence begins to point to Chief Tyrol but he was having a romantic tryst with Boomer at the time. Paranoia spreads throughout the fleet and the tribunal soon turns into a witch hunt. Back on Cylon-held Galactica, Helo has to decide if he will go look for the now missing Boomer or set off on his own.—garykmcd", "Chief Tyrol and Boomer have an love encounter covered by Tyrol's team and Sharon leaves one hatch open, giving access to the Galactica's arsenal. A copy of the Cylon Doral finds a breach in the security system of Galactica and blows up the bombs tied to his body, killing three humans and leaving thirteen wounded persons. Commander Adama decides to make public the information that Cylons now resemble humans with the support of President Roslin, bringing mistrust, paranoid and panic to the survivors. Sergeant Hadrian is assigned to investigate the case and bring the suspects to an independent court. She finds inconsistencies in the testimony of Chief Tyrol and his crew about where he was during the bombing. Meanwhile on Caprica, Helo seeks out the other version of Boomer, playing like a puppet to the Cylons.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519778", "rating": 7.6, "votes": 2438, "number_of_episodes": 74}