{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0167435": "Nicki Clyne"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["President Roslin arrives on Galactica as Boomer's Cylon side asserts itself, forcing her to sabotage Galactica's water supply against her will. A series of explosions leads to the loss of 60% of the water reserves and Commander Adama is compelled to introduce rationing and begin a search of nearby planetary systems for any H20 deposits.—Shiro", "Lt. Sharon \"Boomer\" Valerii awakens soaking wet in the locker room and finds plastic explosives and a detonator in her sports bag. She discretely returns the detonator to the small arms locker but finds that six other are missing. Soon after, major explosions rock the ship, destroying over two-thirds of its water supply. She's terrified that she will be suspect and turns to chief Galen Tyrol for help. Commander Adama orders the fleet to ration water and they begin the search for a planet where they may be able to replenish their supplies. Back on Caprica, Lt. Karl 'Helo' Agathon - who gave up his seat on an escape flight to Gaius Baltar - is doing his best to survive. He is pleased when Boomer has apparently returned to rescue him but they are soon on the run when her ship is overrun by the Cylons.—garykmcd", "Boomer awakes in Galactica completely wet and when she seeks a towel in her bag, she finds a bomb. She disarms the detonator and when she brings them back to the arsenal, she finds that six other detonators are missing. While the trembling Boomer is telling Chief Galen Tyrol about her findings, the portside tanks of Galactica explode. With the loss of 60% of the water provision, Commander Adama rations the supply and sends the Raptors to search water in the nearby planets. Meanwhile in the destroyed Caprica, Lieutenant Helo is rescued by another version of Boomer.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519792", "rating": 7.7, "votes": 2767, "number_of_episodes": 74}