{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0719678": "Callum Keith Rennie", "0071922": "Matthew Bennett", "1775193": "Christina Schild", "0107023": "Eric Breker", "0346607": "Biski Gugushe"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["A humanoid Cylon is captured in the fleet, a copy of the Leoben model, who claims that he has planted a nuclear bomb in the Fleet before he was captured. Starbuck is tasked with interrogating him, which soon becomes a battle of wills as Starbuck has her marines to torture the Cylon to try to break him.", "A Cylon has been captured aboard the Gemenon Traveler. It's a copy of Leoben Conroy, who Adama found hiding in the Ragnar weapons depot. Adama orders Starbuck to interrogate him, but warns about his deceptiveness. Leoben tells her he planted a nuclear device on one of the ships in the fleet, set to go off nine hours later. Starbuck thinks of an unorthodox way to get answers out of the machine. Meanwhile Galactica-Boomer is getting more and more the feeling that she is a Cylon. She asks Gaius Baltar to be in the first batch to be tested by his Cylon detector. Back on Caprica Sharon has a meeting with the two other humanoid Cylons. She tells she and Helo had sex. They want them to set up quarters in a hut and if he refuses that, Sharon should kill him. She has different plans however.—Arnoud Tiele (imdb@tiele.nl)", "A Cylon is found aboard one of the ships - of the Leoben variety - and while Commander Adama's inclination is to destroy it, the President first orders an interrogation. Adama appoints Starbuck as the interrogator and the Cylon tells her he's planted a nuclear bomb aboard one of the ships. He refuses to tell her much more and she resorts to torturing him to find out where it is. President Roslin has been having strange dreams about Leoben and when they meet, he tells her something she did not want to hear. Meanwhile, Boomer's strange attraction to the Cylon ship Stasrbuck brought back leads her to Dr. Baltar's lab where she wants to be tested to see if she's a Cylon. On Cylon-occupied Caprica, Number Six's dislike of Boomer is obvious and orders Boomer to kill Helo if he resists their plan to have them live in a cabin they have set up for the. Boomer has a plan of her own however—garykmcd", "The Gemenon Traveler informs Galactica that a copy of Leoben Conoy has been captured. Commander Adama assigns Starbuck to interrogate the prisoner and advises her that this model cannot be trusted. Leoben claims that has planted a nuclear warhead in one spacecraft and Starbuck tortures him trying to discover where the bomb is planted. Meanwhile Boomer asks Dr. Baltar to be tested in his Cylon detector.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519769", "rating": 8.0, "votes": 2400, "number_of_episodes": 74}