{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0301874": "Lorena Gale", "0167435": "Nicki Clyne", "1750308": "Cailin Stadnyk", "0647453": "Bodie Olmos", "1382781": "Luciana Carro", "0155389": "Terry Chen", "1775193": "Christina Schild", "0346607": "Biski Gugushe", "1544128": "Paul Cummings", "0837992": "Camille Sullivan"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["The fleet is running out of tylium fuel and will soon not have enough to keep running from the Cylons, when they find an asteroid with several years worth of tylium ore...unfortunately, the Cylons have already built a mining base on it.", "After 36 days of running from the Cylons, there's a fuel problem. Tylium reserves are down to five percent, only enough for two more jumps. Then Crashdown and Boomer find a huge deposit on an asteroid. There's just one big problem. Cylons have a refinery on the asteroid and the place is crawling with raiders. Adama orders an attack. Meanwhile president Roslin is getting more hallucinations due to the chamalla. She seeks advice from priest Elosha. She recognizes Roslin's story of snakes at a press conference. It reminds her of the prophecy of oracle Pythia in the Holy Scrolls. Back on Caprica Helo is getting more and more the feeling there's something going on, especially since he sees a group of centurions approaching their hiding place, lead by someone who he saw die.—Arnoud Tiele (imdb@tiele.nl)", "The fleet finds itself in a precarious situation as it begins to run low on fuel. They are in desperate need of Tylium and should they not find any, will have to make one last jump to a solar system that may have habitable planets. Boomer and Crashdown find an asteroid that could provide them with enough fuel for years but they also find that the Cylons already have a heavily fortified mining facility there. With Starbuck still not yet fit for duty, it's left to Apollo to lead the raid that will determine whether the survivors have a future. Dr. Baltar comes to certain conclusions about his own role in the attack. President Roslin meanwhile consults Elosha about her dreams and learns of an ancient prophecy that seems to parallel what has been happening to them. On Cylon-held Caprica, Helo and Boomer are found by Number 6 and a squad of Centurions.—garykmcd", "When the Tylium reserve of the fleet is running out and enough for two more jumps only, Boomer and Crashdown find a deposit enough for a couple of years in an asteroid. However, the Cylons are exploring and processing the fuel in a well protected refinery with a base with many raiders. Commander Adama decides to attack the base and asks the unconventional Starbuck to analyze their strategy with eyes wide open and based on Dr. Baltar's guess. President Roslin, who is delusional and suffering hallucinations with the treatment with chamalla, agrees with the plan. Meanwhile in Caprica, when Helo sees Number Six alive after dying on his hands, he questions Boomer what might have happened.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519789", "rating": 8.4, "votes": 2406, "number_of_episodes": 74}