{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0722413": "Donnelly Rhodes", "0654640": "Alonso Oyarzun", "0647453": "Bodie Olmos"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Starbuck has been shot down over a barren moon, and must be rescued before she runs out of oxygen. Adama become obsessed with trying to save her even when all hope seems lost, putting the fleet at risk. Meanwhile, Starbuck finds the Cylon Raider she shot down, and tries to learn how to fly it so she can escape.", "Starbuck is shot down after the battle with the eight Cylon raiders. Hotdog thinks she was still maneuvering and this gives commander Adama the idea that she might still be alive. He launches a full scale rescue mission. Starbuck has crash landed on a moon. She tries to attract the attention of rescue parties by moving to higher ground. The search isn't going well however and Starbuck's oxygen supply is running out. The mission is hindered by low visibility, high rates of fuel use and on top of that the vipers are beginning to malfunction due to the atmosphere. But Adama seems obsessed with the rescue. He orders more and more attempts, even if that will endanger the security of the fleet at a Cylon attack. Meanwhile on Caprica, Helo's shelter is attacked by a Centurion. He and the Cylon Boomer are intentionally separated.—Arnoud Tiele (imdb@tiele.nl)", "Starbuck survives ejecting from her fighter but finds herself on a barren and rugged moon with only 46 hours of oxygen. The weather conditions aren't conducive to a search and Commander Adama will go to any length to find her. Gaius Baltar, at Number 6's suggestion, tries to convince President Roslin that it's foolhardy to put everyone at risk but doesn't manage to convince her. When the President hears that the Commander has redeployed the fighters on their defensive perimeter, she changes her mind. On the moon, Starbuck finds the downed Cylon Raider she knocked out. Her hopes are to use it to fly off the moon but isn't quite prepared for what she finds on board. Back on Cylon-held Caprica, Helo and the second Boomer are living in the bomb shelter they've found but encounter Cylon Centurions.—garykmcd", "Starbuck is hit by a Cylon raider and falls in an inhospitable moon with about 46 hours of oxygen supply. Meanwhile, Commander William Adama and Captain Lee 'Apollo' Adama lead a rescue mission, using all the possible resources under the protest of President Laura Roslin that orders to call off the mission. Meanwhile in Caprica, Helo is attacked in the shelter while preparing the breakfast for Boomer and him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519793", "rating": 8.2, "votes": 2656, "number_of_episodes": 74}