{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0368745": "Richard Hatch", "0894690": "Kate Vernon", "0936288": "Robert Wisden", "0443286": "David Kaye", "0951912": "Alex Zahara", "0302466": "Patrick Gallagher", "0829121": "Malcolm Stewart", "0167435": "Nicki Clyne", "1750308": "Cailin Stadnyk", "1775193": "Christina Schild", "0346607": "Biski Gugushe", "0038778": "James Ashcroft", "0406896": "Patricia Idlette", "0061438": "Mario Battista"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["President Roslin has rebuilt a new Quorum of Twelve, the legislative branch of the government, but terrorist leader/political dissident Tom Zarek is elected as a member, and immediately motions that the Quorum vote to appoint a new Vice President, and runs for the office.", "With Colonial Day approaching, it is time for a new Quorom of Twelve. Twelve representatives from the twelve colonies will decide on important matters. There's one problem however. Terrorist Tom Zarek is chosen as representative for Sagittaron and he immediately wants to discuss the issue of a vice-president. So far there's only one candidate, Tom Zarek, as nominated by Virgon and Gemenon. Meanwhile Starbuck and Apollo are in charge of security, some kind of attack on president Roslin is suspected. Back on Caprica Helo and Boomer have arrived at the city Delphi. Helo comes to the conclusion Cylons can look like humans. In an attempt to capture a raider, he discovers another truth.—Arnoud Tiele (imdb@tiele.nl)", "The twelve representatives of the survivors of their colonies gather in the luxury liner Cloud 9 for a meeting to discuss political issues. Sagittarion selects Tom Zerek to represent their interests and the former terrorist raises the need of a Vice-President in case Roslin has any problem. His proposal is accepted and he becomes the only candidate. President Roslin gives her best effort trying to find an opponent and promising that Tom Zarek would never be her Vice-President. Meanwhile the abusive Captain Apollo, who is in charge of security with Starbuck, turns off the speech of Zarek, creating confusion with his followers, and accidentally they find a man with a weapon. In occupied Caprica, Helo discovers the truth about the evolution of the Cylons to the human form.—Claudio Carvalho, Rio de Janeiro, Brazil", "President Roslin organizes a meeting of the 12 colonies legislative assembly where Dr. Baltar attends as the representative for Caprica with Starbuck attending in charge of his security detail. Also there is Tom Zarek who, in the eyes of many, is a terrorist. At the outset, Zarek calls for nominations for Vice President and is soon nominated by one of the representatives. Roslin doesn't want him as her VP and asks Wallace Gray to run against him. He proves to be a poor choice and the President takes action. Starbuck and Apollo arrest a man with guns and believe they have foiled a plot to assassinate Roslin. On Cylon-occupied Caprica, Helo concludes, after having seen a second Number Six, that the Cylons may have been cloning human beings as a way of infiltrating them before the attack.—garykmcd"], "genres": "N/A", "imdbID": "0519765", "rating": 7.6, "votes": 2251, "number_of_episodes": 74}