{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "1022429": "Sam Witwer", "0301874": "Lorena Gale", "0722413": "Donnelly Rhodes", "0853805": "Jill Teed", "0576425": "Tobias Mehler", "1145557": "Colby Johannson", "0576825": "Bill Meilen", "0647453": "Bodie Olmos", "1382781": "Luciana Carro", "0155389": "Terry Chen"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["There's a party on Galactica's flight deck as Flat-Top just had his thousandth landing. Something goes terribly wrong however when a drone accidentally goes off and explodes in a group of pilots. 13 are dead. During the ceremony Kara Thrace starts thinking about her dead fiancée Zak Adama. And those memories even get clearer when Adama orders her to start training new pilots. She seems very uncomfortable in doing so. The favor she did for Zak by letting him pass basic flight seems to bother her more and more. Angrily she stops training pilots after just one day. Meanwhile on Cylon-occupied Caprica Helo and Cylon-Sharon find a bomb shelter in a restaurant. It seems like a good place to stay for a while. There's food, water and anti-radiation medication in abundance.—Arnoud Tiele (imdb@tiele.nl)", "After thirteen pilots are killed in a bizarre accident, Commander Adama asks Lt. Kara \"Starbuck\" Thrace to quickly train new pilots. She is reluctant to do so however, questioning her own judgment as an instructor and still feeling guilt over the death of her fiancé, Adama's son Zak. In flashbacks, Starbuck's relationship with Zak Adama is fully revealed. She is particularly hard on the new trainees, none of whom have ever flown a fighter before. They prove themselves worthy however when the fleet is suddenly attacked by the Cylons. Starbuck's fate is unknown however when her fighter is damaged and she is forced to eject above an unknown planet. On Cylon-occupied Caprica, Helo and the second Boomer find a source of supplies.—garykmcd", "A freak accident on the Galactica Flight Deck leads to the death of 13 pilots. 'Starbuck' is charged with training new pilots, but must first put to bed the guilt she still holds over the death of her fiancée, Zak Adama. Meanwhile, back on Caprica, 'Helo' and 'Boomer' find the source of the military signal.—Shiro"], "genres": "N/A", "imdbID": "0519762", "rating": 7.7, "votes": 2587, "number_of_episodes": 74}