{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0565973": "Kandyse McClure", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0722413": "Donnelly Rhodes", "0167435": "Nicki Clyne", "1775193": "Christina Schild", "0346607": "Biski Gugushe"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["After Baltar has an argument with the vision of Number Six he sees in his head, a physical copy of Cylon model Number Six shows up in Galactica's CIC claiming to be a woman named Shelley Godfrey who has evidence that proves that Baltar has betrayed humanity...except that she's trying to frame him for an act of pre-attack sabotage.", "Dr. Gaius Baltar mocks the faith of his fantasy Number Six. He calls her ideas superstitious drivel and metaphysical nonsense. Number Six leaves him and moments later he is disturbed by Dualla. She tells commander Adama wants to see him. With him is Number Six, but this time she is real and has some rather disturbing evidence. It will prove Baltar let the Cylons into the Caprica defense mainframe and planted a bomb. Meanwhile Tyrol tries to figure out how the Cylon raider works. He really could use help from Starbuck, but she seems to be still suffering from the crash. Back on Caprica Helo and Sharon are once again on the run for centurions. Helo brings up her relationship with Tyrol on Galactica.—Arnoud Tiele (imdb@tiele.nl)", "Dr. Gaius Baltar finds himself on the hot seat when a copy of the Cylon Number Six arrives on board the Galactica as Shelley Godfrey. She is accusing him of having sold out out the human race to the Cylons by giving them access to the defense mainframe before the attack. Commander Adama shuts down Baltar's Cylon-detection project and revokes his security clearance while they investigate. The evidence appears overwhelming and Baltar soon finds himself in the brig. The Cylons clearly have a plan however. On Cylon-occupied Caprica a reunited Helo and Boomer are on the run and Helo reveals his feelings for her.—garykmcd", "When Dr. Gaius Baltar is called to the bridge of Galactica, he discovers that Cylon Number Six is visible for Commander Adama and the crew. Further, she claims to be Shelley Godfrey, who worked in Caprica security system, and that has evidences that Dr. Baltas is a traitor that allowed the Cylons to invade the human's defense mainframe and planted a bomb to destroy the system. Dr. Baltar temporarily loses his privileges and Lieutenant Gaeta is assigned to authenticate the proofs. Chief Tyrol asks Starbuck to help him to activate the Cylon raider. Meanwhile, in the Cylon-occupied Caprica, Helo and Boomer are in love with each other.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "0519786", "rating": 7.7, "votes": 2401, "number_of_episodes": 74}