{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0873998": "Michael Trucco", "0941796": "Rick Worthy", "0301874": "Lorena Gale", "0368745": "Richard Hatch", "1735157": "Tamara Lashley"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Starbuck finds herself wounded in a hospital on Caprica where she is suspicious about her doctor. President Roslin makes an appeal to the fleet to follow her to Kobol.", "On Caprica Anders' resistance group plans an assault on a Cylon fueling station. The Cylons have detected them however and Starbuck loses consciousness after getting shot. She awakes in a hospital. A doctor, Simon, tells her it's a resistance hospital and that Anders has died in the attack. Starbuck doesn't trust it; no one else appears to be in the hospital and Simon expresses a scary concern about her ability to bear children. On Galactica commander Adama orders the entire fleet to be searched for the escaped president Roslin. Roslin decides it's time to play the religious card. She makes an appeal to the fleet to honor the Gods and follow her at the appointed hour to Kobol, where they will meet Gods' servant with the Arrow of Apollo.—Arnoud Tiele (imdb@tiele.nl)", "Commander Adama has recovered sufficiently to resume command and orders that all ships be put into quarantine while they search for President Roslin, his son Lee and the others. Roslin for her part needs to galvanize her support and issues a message to the fleet saying that she is leader who is foretold in the scriptures of Pythias who is to lead them to the promised land. She asks all who believe in the prophecy to follow her to Kobol where they will learn the way to Earth. On Cylon-held Caprica, Starbuck wakes up in a hospital where she is recovering from the wounds she received in the firefight. She is being treated by a doctor named Simon who informs her that Anders has been killed. She's alone in the facility and is more than just a little suspicious about what is going on. When she catches a glimpse of Simon speaking to Number Six, she knows she is in enemy hands. As she tries to escape, she also finds another member of Anders group and uncovers a secret that is almost too horrible for her to contemplate.—garykmcd", "Starbuck is wounded while on occupied Caprica, and she wakes up to find herself in the care of a doctor. Her suspicions are aroused when she never sees anyone else and when the doctor encourages her to have a baby.—Jenn"], "genres": "N/A", "imdbID": "0519788", "rating": 7.7, "votes": 2104, "number_of_episodes": 74}