{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "0415066": "Christopher Jacot", "1423766": "Sean J. Dory", "0856351": "Christian Tessier", "0873998": "Michael Trucco"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["This is an episode about loss. Kat and Starbuck confront each other about their piloting skills and each vow to kill Scar (a Cylon spaceship) before the other.", "The fleet has discovered an asteroid field with a large ore deposit, enough to construct at least two new squadrons of vipers. But the Cylons know about it and behind every rock there could be a raider. Since the destruction of the Resurrection ship they changed their tactics from mass to sneak attacks. Several pilots are already dead and especially raider Scar is feared. Meanwhile Starbuck hasn't been herself lately. She drinks a lot, thinks much about Anders and is getting irritated by Kat. She continually challenges her, beats her record in training and calls her the next Tigh. Both claim they will hunt down Scar. 200 cubits and the precious Top Gun trophy, currently in Starbuck's possession, are at stake.—Arnoud Tiele (imdb@tiele.nl)", "With the fleet having jumped under the protection of the Pegasus, the Galactica has stayed behind to defend their mining ship which has found a rich stream of ore, enough to build two new squadrons of Vipers. The bad news is that they are playing a game of cat and mouse with Cylon raiders who, since the destruction of the Resurrection ship, have adopted hit and run tactics rather than the full on attacks they had become used to. The pilots are all concerned about one Cylon raider in particular that they have nicknamed Scar. Starbuck is not faring well and seems to be in constant conflict with Kat who challenges her at every turn. Apollo pairs them up for a patrol.—garykmcd"], "genres": "N/A", "imdbID": "0519784", "rating": 7.3, "votes": 2215, "number_of_episodes": 74}