{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "1022429": "Sam Witwer", "0894690": "Kate Vernon", "0654640": "Alonso Oyarzun", "0636244": "Kerry Norton", "1528483": "Chris Shields", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "0356501": "Jen Halley", "0648153": "Ty Olsson", "0851898": "Michael Tayles", "0952778": "Dominic Zamprogna", "0189162": "Garvin Cross", "0520562": "Brad Loree", "0829608": "Lori Stewart"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["A Cylon virus is interfering with Galactica's power supply, while Cylon centurions are heading for crucial systems. Somehow they must be stopped.", "Finding the fleet by networking the computers was dangerous, but it looked like the mission was successful. Then lights start falling out. Gaeta finds out the Cylon virus still made it into Galactica's systems. On top of that reports of Cylons in the starboard flight pod arrive. almost indestructible Centurions have boarded the ship. They must be stopped before they gain access to crucial systems. Back on Caprica Helo and Starbuck visit Starbucks apartment. They take some rest and, while listening to the music of her father, discuss her past life. On Kobol Dr. Baltar gets a vision about commander Adama killing his 'baby'. Number Six tells him about mankind's nature. Tyrol and Cally try to make it back in time to the away party with the serisone for Socinus.—Arnoud Tiele (imdb@tiele.nl)", "Having networked the ship's computers to gain time, the Galactica now finds its computers are infected with a Cylon virus that is shutting down critical systems. They also have Cylon Centurions on board. Colonel Tigh knows their tactics and those areas of the ship that they will first seek to control. As the Centurions wreak havoc, Apollo and a small group are all that stands between the Cylons and their taking control of the ship. On Caprica meanwhile, Helo learns a side of Starbuck that he - and most likely everyone else - did not know existed. On Kobol, one of the crash survivors is in dire need of medication that three of the others have retrieved from their crashed ship. They encounter Cylons on their return journey however.—garykmcd", "The fleet has been reunited with the Galactica. However, in the process of finding the fleet, a cylon virus has penetrated the computers onboard the Galactica and it has also been boarded by centurions. Lee is let out of the brig and takes a team to stop the centurions. On Kobol, Chief returns from a mission with medical supplies for a dying Socinus, but will he make it?—Dan"], "genres": "N/A", "imdbID": "0519791", "rating": 7.9, "votes": 2181, "number_of_episodes": 74}