{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0894690": "Kate Vernon", "0396461": "Mark Houghton", "0107023": "Eric Breker", "0623699": "David Neale", "0001127": "Dana Delany", "0584202": "Michael Ryan", "0002343": "Adrian G. Griffiths", "1264633": "Erica Carroll", "0881503": "James Upton", "1518532": "Georgia Hacche"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["A terrorist attacks and holds several key people hostage and threatens to murder them unless she is given the Cylon prisoner.", "Rumors of a Cylon being kept on Galactica are getting more persistent and Billy advises Admiral Adama and President Roslin to just simply tell the truth. Billy has also something else to do. He proposes to Dee, but to his astonishment she refuses. Later he meets her in the Cloud Nine Lounge and finds out there's something going on between her and Lee. Lee spots a strange acting woman in the crowd, with a device on her chest. His suspicions are right. The woman and her three accomplices take the entire bar hostage. The woman is Sesha Abinell. She lost her husband during a Cylon attack and has been spreading rumors about a Cylon conspiracy on Galactica. Sesha gives Admiral Adama two hours to deliver Boomer to her.—Arnoud Tiele (imdb@tiele.nl)", "Several members of the Galactica crew are in the lounge on Cloud 9 when terrorists take everyone prisoner. Ellen Tigh, Billie Keikeya, Apollo and Dee are among the group. Dee and Apollo are there together and Billie begins to understand why she turned down his proposal of marriage. The terrorists are led by Sesha Abinell, whose husband was killed in a Cylon attack and believes that Cylons have infiltrated the fleet. There have been rumors that there is a Cylon aboard the Galactica and Abinell demands that Sharon be turned over to them or all of their prisoners will be executed. President Roslin is dead set against negotiating with terrorists and Admiral Adama sends Starbuck in with a squad of Marines, but the raid goes badly. In the end, he gives them Sharon, but it's not quite what the terrorists were expecting.—garykmcd", "Apollo and Dualla are having a romantic evening on Cloud 9 when the lounge is stormed by three terrorists and the guests taken hostage. Also present are Ellen Tigh and Billy, the President's aide. The terrorists have one demand: release the Cylon, Sharon, to them.—grantss", "The relationship between Apollo and Dee becomes known to Billy when he catches them together on a date in a bar. While here, a terrorist attacks and holds the people hostage and threatens to murder them unless Adama hands over the Cylon prisoner.—Jenn"], "genres": "N/A", "imdbID": "0519783", "rating": 7.0, "votes": 2071, "number_of_episodes": 74}