{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "1353748": "Paul Campbell", "0565973": "Kandyse McClure", "0368745": "Richard Hatch", "0065320": "Graham Beckel", "0006419": "Claudette Mink", "0722413": "Donnelly Rhodes", "0004886": "Bill Duke", "1489668": "Leah Cairns", "1674589": "Amy Lalonde", "2173573": "Haley Guiel", "0542821": "John Mann", "0038778": "James Ashcroft", "0542668": "Brad Mann", "1591767": "Gustavo Febres"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Apollo investigates the murder of one of the crew and falls for a young prostitute, whom he vows to save from the rogue ship dealing with the Black Market. As well as confronting the bad guys, Apollo has to confront some past mistakes.", "There's a shortage of supplies on the fleet, the black market is thriving. President Roslin orders that these criminals, asking outrageous prices, must be stopped. Adama agrees and colonel Fisk says Pegasus is ready to help, but he doesn't seem to be sincere. Not long after he is murdered in the presence of someone he seems to know. Apollo, meanwhile, is still struggling with his near-death experience. He seeks comfort with the prostitute Shevon, who reminds him of a woman from his past. Her daughter Paya is in need of rare antibiotics. Apollo is asked to investigate the murder of Fisk. He soon finds out Fisk was heavily involved in black market operations.—Arnoud Tiele (imdb@tiele.nl)", "The President, now recovered from her cancer, is worried about the level of supplies available to the fleet. There is a thriving black market and she seeks Admiral Adama's support to bring it to an end. When Colonel Fisk is murdered, Adama is certain the black marketeers are sending them a message and orders Apollo to launch an investigation. He does find evidence that Fisk what heavily involved in the black market and believes he was perhaps getting too greedy. Apollo still hasn't recovered fully from his near-death experience during the attack on the Cylon Resurrection ship. He's been spending some time with an attractive prostitute, Shevaun, on Cloud 9 and the black marketeers soon have a very clear message for him. The President meanwhile suggests to Gaius Baltar that he resign the Vice Presidency. He proves to be less than cooperative.—garykmcd", "Apollo and many of the other members of the crew are using the Black Market to obtain goods and services. Apollo falls for a young prostitute and vows to save her and her child while investigating the murder of one of the crew. This leads him to a rogue ship where he has to confront the bad guy as well as confronting his own desires and past mistakes.—Jenn"], "genres": "N/A", "imdbID": "0519764", "rating": 6.4, "votes": 2308, "number_of_episodes": 74}