{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "1022429": "Sam Witwer", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "0368745": "Richard Hatch", "0636244": "Kerry Norton", "0262957": "Kurt Evans", "1528483": "Chris Shields", "0356501": "Jen Halley", "1489668": "Leah Cairns", "0406896": "Patricia Idlette", "0829121": "Malcolm Stewart", "2461649": "Troy Everett"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Tigh has problems with the responsibility of being a leader, president Roslin loses control without chamalla. The Kobol team discovers a Cylon battery.", "With commander Adama still in bad shape and president Roslin in the brig colonel Saul Tigh assumes command. But he's having a hard time with the responsibility; the press and the Quorum of Twelve demand to see the president and on top of that, he's getting sloppy with his regular duties. He wonders why Lee Adama's planning a rescue mission, until he tells him it's for the team on Kobol. On Kobol Crashdown's having trouble with his leadership. The team finds out the Cylons are building an anti-aircraft battery, which'll crush any rescue attempt. He orders an attack which seems suicidal. Meanwhile, president Roslin has problems, as well; she's deprived of chamalla, and the effects are severe. Only barely able to function, she gets a visit from Ellen Tigh.—Arnoud Tiele (imdb@tiele.nl)", "Colonel Tigh is finding the strain of command to be too much for him. He is drinking heavily and has become forgetful. His wife Ellen is proving to be a bad influence - much as Commander Adama had earlier predicted - egging him on to be tough and take control. When the Quorum of Twelve arrive on Galactica insisting to see the President his initial reaction is to refuse them outright. Ellen, who has just seen the President who has grown incoherent due to her lack of medication, suggests that he let them. It doesn't work out as planned and in an attempt to get full control, Tigh declares martial law. Lee Adama meanwhile is now allowed to take on his normal functions during the day and spend his nights in the brig. He's planning a rescue mission for the survivors on Kobol.—garykmcd", "Doc. Cottle is trying to save Adamas life whilst Tigh has some problems being in command of the fleet. On Kobol, a mission is being prepared to destroy a Cylon battery and escape the centurions. Things go wrong when non-combat personnel decide to sit out. Lee leads the rescue mission to Kobol but will it be too late for the Chief?—Dan"], "genres": "N/A", "imdbID": "0519771", "rating": 7.9, "votes": 2121, "number_of_episodes": 74}