{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "0071922": "Matthew Bennett", "0005128": "Lucy Lawless", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "0365798": "Patrick Harrison", "1724301": "Kevan Kase", "0875114": "Yee Jee Tso", "1348197": "Curtis Ricks", "0006820": "Aleks Paunovic", "0648153": "Ty Olsson", "1489668": "Leah Cairns", "0346885": "Jeremy Guilbaut"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Journalist D'Anna Biers is making an item on the Gideon incident, when she's asked by Adama and Roslin to film daily life on Galactica.", "D'Anna Biers, a nosy journalist from the Fleet News Service, is preparing an item on the Gideon incident, complaining that no marines or officers were charged for shooting the civilians. Suddenly she's asked by commander Adama and president Roslin to follow daily life on Galactica. She's given full access and is not required to create a positive story. D'Anna agrees with the offer. While some of the crew like Lee Adama dislike what she's doing, Dr. Baltar tries desperately to draw her attention. Biers is more interested in the Gideon story, especially after Tigh is getting a death threat. Meanwhile the air group is still having a shortage of pilots, forcing them to be on duty for 15 hours continuously. Louanne Katraine, one of the pilots, seems to be unable to cope with the stress.—Arnoud Tiele (imdb@tiele.nl)", "In the aftermath of Colonel Tigh's violent raid on the Goliath after he declared martial law, the media has continued to clamor for a more in-depth examination of the raid that resulted in civilian deaths. As a result, President Roslin and Commander Adama invite journalist D'Anna Biers to go aboard the Galactica, giving her free access and carte blanche to report on what she finds as she sees fit. Biers clearly has a chip on her shoulder and a pronounced anti-military bias. An attempt at interviewing Colonel Tigh goes awry, with him stomping out of the interview room. When Biers delivers the final product, everyone is pleased because she has obviously come around, praising the military for putting their life on the line every day. Biers has a deep, dark secret however.—garykmcd", "Commander Adama and President Roslin allow a journalist, D'Anna Biers, access to the Galactica. She has been savaging criticizing the military after the Gideon incident where civilians were killed by Galactica's Marines. Maybe if she sees what Galactica's personnel have to go through on a daily basis she'll have a different perspective.—grantss", "After releasing a video which shows the Gideon massacre, a journalist from the fleet called D'anna Biers is given full access to Battlestar Galactica by Commander Adama and President Laura Roslin, in order to show the human, true face of the Galactica crew. But are these D'anna's real intentions?—Anonymous"], "genres": "N/A", "imdbID": "0519768", "rating": 7.7, "votes": 2194, "number_of_episodes": 74}