{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0272173": "Colm Feore", "0722413": "Donnelly Rhodes", "0674646": "Paul Perri", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "1489668": "Leah Cairns", "1248979": "David Richmond-Peck", "0226597": "Holly Elissa", "1274038": "Jennifer Kitchen"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["President Roslin, who is about to die, believes Sharon's baby is dangerous and orders it must die. Meanwhile, a terrorist group inside the fleet starts to ask for a peace negotiation with the cylons.", "President Roslin is in the final stage of her cancer and about to die. On her death bed she has memories of Caprica. Just before the Cylon attack she opposed president Adar on striking down a violent protest of teachers. As one of her last decisions she orders the death of Boomer's baby. She sees it as a danger to the fleet. Dr. Baltar tries to think of a way to prevent the abortion. Number Six reminds him he will be president soon. Meanwhile a firing test with vipers goes awry. Cally finds out the rounds of ammunition were tampered with. Apollo and Starbuck arrest Asha Janik. She tells she is part of a group that wants to negotiate with the Cylons about peace. Apollo finds out an attack is planned on a tylium refinery vessel.—Arnoud Tiele (imdb@tiele.nl)", "A dying Laura Roslin is concerned about Cylon Sharon's baby who Dr. Cottle has determined is showing genetic abnormalities. She orders that the fetus be destroyed and Admiral Adama agrees with her. Needless to say, Sharon will fight against it. Roslin is in the Galactica's infirmary and has a flash of memory: she sees Dr. Gaius Baltar talking with a Number Six in Caprica City. Chief Tyrol meanwhile finds that some of the ammunition aboard the Vipers has been sabotaged. The Admiral soon learns that there is a peace movement among the civilian population. They fear that explosives may have been placed on other ships that manufacture war materials for the Galactica and the Pegasus. Baltar is surprised to find that the Number Six he saved from the Pegasus brig, Gina, is now a member of the peace movement. She urges him to surrender to the Cylons when he replaces Roslin as President. Baltar refuses but also makes an important scientific discovery.—garykmcd"], "genres": "N/A", "imdbID": "0519767", "rating": 7.4, "votes": 2027, "number_of_episodes": 74}