{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "1022429": "Sam Witwer", "0894690": "Kate Vernon", "0654640": "Alonso Oyarzun", "0636244": "Kerry Norton", "0262957": "Kurt Evans", "1528483": "Chris Shields", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "0356501": "Jen Halley", "1406239": "Warren Christie", "0648153": "Ty Olsson", "0871706": "Nicholas Treeshin", "0851898": "Michael Tayles", "1489668": "Leah Cairns", "0006820": "Aleks Paunovic"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["As the premiere for the second season unfolds, Adama lay dying leaving Tigh in command. Lee and Roslin have been sent to the brig. An emergency jump goes wrong leaving the Galactica alone in space without the fleet.", "Adama is dying after Boomer's attack, but Dr. Cottle is on another ship, the Rising Star. The arrival of a Cylon Basestar however forces the fleet to make an emergency jump. Suddenly Galactica is alone. The fleet had old coordinates and jumped elsewhere. The only way to find out where they went is to jump back to the Basestar. Gaeta thinks of a dangerous plan. Back on Caprica Starbuck doesn't seem to like Boomer. Helo has a lot of trouble preventing her from killing the bearer of his child. Boomer is forced to flee. On Kobol things are getting precarious. The Cylons are getting close and the away team has to run, forgetting a medical kit with serisone the seriously injured Socinus needs.—Arnoud Tiele (imdb@tiele.nl)", "Colonel Tigh finds himself in command not only of the Glactica but of the entire fleet as Commander Adama lies severely injured in the infirmary and President Roslin is in the brig. With the unexpected arrival of the Cylons, Tigh orders the fleet to jump to its next location only to have the Galactica arrive alone, apparently having forgotten to provide updated jump information to rest of the fleet that finds itself in a different location. The only solution is to go back to where they jumped from and calculate where the fleet is most likely to be - an undertaking that is time consuming and dangerous, given the presence of the Cylons. There is a way to shorten the time they will need, but it involves doing something that the Commander would never approve. On Kobol, some of the survivors have to return to the crash site to retrieve a medical kit. On Cylon-occupied Caprica, Starbuck is ready to kill Boomer now that she realizes she is a Cylon. Only Helo stands between the two of them, forcing Boomer to take action.—garykmcd"], "genres": "N/A", "imdbID": "0519785", "rating": 8.2, "votes": 2220, "number_of_episodes": 74}