{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0000405": "Michelle Forbes", "0065320": "Graham Beckel", "1382781": "Luciana Carro", "0301925": "Vincent Gale", "0697864": "P.J. Prinsloo", "0238694": "Brad Dryborough", "0217757": "Derek Delost", "0233304": "Mike Dopud"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Galactica and Pegasus are preparing for the assault on the Cylon Resurrection ship. While Starbuck discusses Adama's plan to kill Cain with Apollo, Colonel Fisk stops Pegasus' crew members beating up Helo and Tyrol. He dispatches his marines on Galactica to execute Cain's plan to kill Adama. Apollo seems to dislike his father's plan and hears him out before he sets off in the blackbird to destroy the FTL-drive of the Resurrection ship. It goes wrong for him. Meanwhile Dr. Baltar is trying to take care of the Number Six on Pegasus. He seems to have feelings for her, much to the dismay of the Number Six in his head.—Arnoud Tiele (imdb@tiele.nl)", "The fleet launches their plan to attack the Cylon Resurrection ship. Starbuck and Apollo also accept to undertake the special mission ordered by Adama. Admiral Cain has her own plans to terminate Adama's command. The Resurrection ship is used to regenerate Cylons that have been killed and without it, they would remain dead. The attack goes well, but Appolo is forced to eject from the Blackbird. Gaius Baltar develops emotions for the Number Six he has been questioning in the Pegasus brig. Chief Tyrol and Helo get a special visit from two of the Pegasus crew but Colonel Jack Fisk intervenes.—garykmcd", "Galactica and Pegasus prepare the attack against the Resurrection Ship, led by Starbuck, now a Captain. But Starbuck has their own trouble: she might be forced to kill Admiral Cain, while Cain is also planning to murder Commander Adama. Meanwhile, Gaius Baltar starts getting obsessed with the Number Six replica that is kept in Pegasus.—Anonymous"], "genres": "N/A", "imdbID": "0519782", "rating": 8.9, "votes": 2416, "number_of_episodes": 74}