{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0368745": "Richard Hatch", "0873998": "Michael Trucco", "0719678": "Callum Keith Rennie", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "0071922": "Matthew Bennett", "0788907": "Rekha Sharma", "0001777": "Dean Stockwell", "0235888": "Alisen Richmond-Peck", "1569714": "Erica Cerra", "0718759": "Winston Rekert", "0443286": "David Kaye", "0261633": "Amy Esterle"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["68"],  "plot": ["The group on Caprica is under fire by the Cylons, but suddenly they stop. With only one ship's votes to be counted, Roslin is way behind in the elections.", "The identity of a new Cylon is revealed when the Cylons leave the Colonies and announce they want to live in peace with humans. Meanwhile, Laura Roslin is afraid of Baltar's increasing popularity since he proposed to settle down in the new, but hostile, planet which has been discovered by the Fleet.—Anonymous", "The group on Caprica is under heavy fire by the Cylons, but suddenly they stop. A while later the attackers seem to have completely disappeared. Starbuck and the others set off for the Galactica, but unknowingly bring a Cylon on board. It's a copy of Cavil, the religious counselor of Tyrol. He has a message and tells the Cylons now think the attack on the colonies was wrong and they will leave mankind alone. Meanwhile the presidential election has completely shifted in favor of Dr. Baltar. Only one ship's votes are left to be counted and president Roslin is way behind. Then a miracle happens.—Arnoud Tiele (imdb@tiele.nl)", "The election has polarized around the issue of whether they should stay and colonize New Caprica. Baltar speaks of hope and a bright future while Roslin warns of the dangers of future Cylon attacks. Election day arrives and Gaius Baltar's lead in public opinion surveys seems to be translating into votes. Some on the Galactica are out to ensure that President Roslin in re-elected however. On Caprica, Starbuck and Anders face fierce resistance from the Cylons but their attack mysteriously stops mid-battle and they seem to just leave. They make it back to the fleet but one among them proves to be a new humanoid Cylon not previously seen. He tells them that the Cylons have abandoned the war against humans and now seek peace. The story shifts one year into the future. Most of the humans have now settled on New Caprica with only a skeleton crew on board the Galactica and the Pegasus. Then the Cylon fleet arrives.—garykmcd", "Starbuck and her team have managed to escape from Caprica with the resistance fighters. It appears the Cylons have simply given up. Meanwhile the Presidential race is hotting up and that President Roslin will lose. However, her campaign manager has a plan.—grantss"], "genres": "N/A", "imdbID": "0519777", "rating": 8.7, "votes": 2272, "number_of_episodes": 74}