{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0368745": "Richard Hatch", "0873998": "Michael Trucco", "0788907": "Rekha Sharma", "0001777": "Dean Stockwell", "0235888": "Alisen Richmond-Peck", "1489668": "Leah Cairns", "0443286": "David Kaye", "0492687": "Colin Lawrence"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["While Dr. Baltar is behind in the polls for the election and tries desperately to turn things around, Starbuck is planning a mission to rescue Anders from Caprica.", "The elections are coming, and the candidates Laura Roslin and Gaius Baltar prepare themselves. Meanwhile, Starbuck leads an expedition to reach Caprica using the Cylon technology and rescue Anders and the other resistance members, and the chief Tyrol is tormented with a recurring dream.—Anonymous", "The presidential elections are coming and it's looking good for president Roslin. Dr. Baltar is way behind in the polls and he and his campaign leader Tom Zarek try to think of a way to turn things around. Meanwhile Starbuck is finally able to plan a rescue mission for Anders and his people on Caprica. With the help of Cylon technology and Boomer, Caprica can be reached by raptors in only ten jumps. On the first jump something goes immediately wrong. Racetrack's raptor jumps to the wrong coordinates. She discovers a habitable planet, hidden in a nebula. Chief Tyrol seems to be in a lot of psychological distress. He beats up Cally and has every night the same scary dream. He asks advise from a rather unconventional religious counselor.—Arnoud Tiele (imdb@tiele.nl)", "Starbuck mounts a mission to rescue Sam Anders and the other resistance fighters on Caprica. They locate Anders and his people but come under attack from the Cylons. One ship in Starbuck's fleet miscalculated the jump coordinates and did not participate in the rescue. By chance however, they come across a habitable planet. Back at the fleet, the election is under way with President Roslin and Vice President Baltar facing one another in televised debates. Roslin still leads in the polls but when the discovery of this new planet becomes known, Baltar seizes on it arguing that they should re-settle there. As a result, he is gaining momentum. Chief Tyrol meanwhile is having his own problems. He is having a recurring dream and when awakened by Cally, he savagely beats her. He asks for and receives counseling from Brother John Cavil.—garykmcd"], "genres": "N/A", "imdbID": "0519776", "rating": 8.0, "votes": 2004, "number_of_episodes": 74}