{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0671886": "Tahmoh Penikett", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0301874": "Lorena Gale", "0368745": "Richard Hatch", "0001664": "James Remar", "0406896": "Patricia Idlette", "0829121": "Malcolm Stewart", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "1534707": "Benjamin Ayres", "0789295": "Linnea Sharples", "1775193": "Christina Schild", "0346607": "Biski Gugushe", "1152963": "Charles Singh"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Starbuck, Helo and Boomer bring back the Arrow of Apollo, but Boomer doesn't seem welcome. Commander Adama wants to keep the fleet divided and appoints a new CAG.", "24 ships have left the fleet to join president Roslin. In orbit of Kobol, they await the arrival of the Arrow of Apollo. Starbuck, Helo and Boomer arrive quickly, but the introduction of Boomer isn't as peacefully as Helo hoped. He is only barely able to prevent Lee from shooting her and Roslin orders to throw her out of the airlock. Then Boomer mentions she knows the location of the Tomb of Athena, the place on Kobol where the location of Earth is kept. Back on Galactica commander Adama is adamant in keeping the fleet divided, denouncing Roslin's followers as religious fanatics and terrorists. He appoints George Birch as new commander of the air group. Colonel Tigh thinks it's a bad choice.—Arnoud Tiele (imdb@tiele.nl)", "Everyone on Galactica is taken aback when 24 ships, nearly one-third of the fleet, follow President Roslin to Kobol. Commander Adama is prepared to let them go, arguing that the remaining ships must hold fast and they are now the fleet. There is a great sense of loss however. The shortage of personnel and the loss of some of the ships will make it very difficult for them to continue however. On Kobol meanwhile, Starbuck arrives with the Arrow of Apollo but it's the new Boomer's presence that causes the most consternation. Lee is prepared to kill her on sight and Roslin orders her tossed out of the airlock until Boomer tells them she knows the way to the Tomb of Athena.—garykmcd", "Lee and Kara are reunited but trouble stirs when another copy of Sharon crosses Lee's path, will Helo shoot Lee to protect Sharon? They land on Kobol and start their long trek to find the Tomb of Athena. Adama replaces his CAG with Lt. \"Catman\" Birch whose first job messes up.—dan"], "genres": "N/A", "imdbID": "0519772", "rating": 8.0, "votes": 2100, "number_of_episodes": 74}