{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0722413": "Donnelly Rhodes", "0368745": "Richard Hatch", "0001664": "James Remar", "1489668": "Leah Cairns"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["While Commander Adama tries to join Roslin's team on Kobol, Dr. Baltar's Number Six tells him he's crazy.", "Commander Adama is searching for the location of the Tomb of Athena so that he can reconcile with president Roslin. Along with Tyrol and Billy he takes a Raptor to Kobol. On Kobol Roslin's team is on their way to the tomb, facing a difficult journey. They are approaching a rock formation of which Boomer thinks is the Gates of Hera. Tom Zarek and his companion Meier still are planning to kill Lee Adama. Meier approaches Boomer to do the job. Meanwhile on Galactica, Number Six tells Dr. Baltar in the brig that a child will be born there. Baltar realizes how ridiculous the situation really is and calls his baby mythical. Suddenly Number Six tells him that he doesn't have a Cylon chip in his brain and that he actually is imagining her. Baltar runs to Dr. Cottle for tests.—Arnoud Tiele (imdb@tiele.nl)", "Commander Adama has a change of heart and decides they need to find President Roslin and the breakaway group to reunite the fleet. On Kobol, Roslin, Apollo, Helo, Boomer and others set off to find the tomb. The journey is difficult and the route is anything but obvious. Tom Zarek is part of the group and he and one of his men, Meir, have their own plans for the group, especially Apollo. The golden arrow shows them the way, as prophesied. Back on Galactica, Baltar tells Number Six that she is no longer important to him and doesn't believe all of the talk about his baby being born there. She tells him something that rocks him to his very foundation.—garykmcd", "The rival human forces - Commander Adama's and President Roslin's - are heading for a showdown as they both land on Kobol. Roslin and co seem to have stolen a march on Adama and are within sight of what they think is the Tomb of Athena. Meanwhile on Galactica Dr Baltar gets some startling news from Number 6.—grantss", "Commander Adama, Billy and the Chief join Laura Roslin, Apollo, Starbuck, Helo, the copy of Sharon and Tom Zarek in Kobol where they're looking for the Tomb of Athena. While Zarek and his buddies try to persuade Sharon to kill the Adamas, Gaius Baltar in Galactica tries to discover if his visions of Number Six mean he's really mad.—Anonymous"], "genres": "N/A", "imdbID": "0519773", "rating": 8.3, "votes": 2154, "number_of_episodes": 74}