{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "1353748": "Paul Campbell", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0873998": "Michael Trucco", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "0301874": "Lorena Gale", "0368745": "Richard Hatch", "1528483": "Chris Shields", "0647453": "Bodie Olmos", "1489668": "Leah Cairns", "0952778": "Dominic Zamprogna", "1735157": "Tamara Lashley", "0346885": "Jeremy Guilbaut", "1976541": "Heather Doerksen", "1348197": "Curtis Ricks"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Tigh's decision to impose martial law is protested in the fleet as well as on Galactica. On Caprica, Helo and Starbuck meet other humans.", "Colonel Tigh is losing control. Martial law and the jailing of president Roslin aren't going down too well in the fleet. The tylium refinery vessel and other ships don't deliver to Galactica anymore. Galactica's crew has problems with him also. Tigh accuses Tyrol of being a Cylon, much to the dismay of Cally, and his decision to keep Lee Adama in the brig while off duty isn't popular either. Lee plots a mutiny to help Roslin escape. Tighs wife convinces him to take drastic measures when the ships refuse to resume delivery. Things go horribly wrong. Back on Caprica Helo and Starbuck are being shot at by a group of humans. Both think they are dealing with the human variety of Cylons.—Arnoud Tiele (imdb@tiele.nl)", "Colonel Tigh's attempt to get greater control over the fleet by imposing martial law is backfiring on him. The tylium fuel processing ship is refusing to resupply the Galactica, as are other ships with everything from medical supplies to coffee now in short supply. He orders squads of Marines to raid the ships in question, but with disastrous results. The crash survivors on Kobol find that the Cylons have built an surface-to-air missile battery which they seek to destroy before their rescuers arrive. Not everyone will survive the assault. Once back on the Galactica, Chief Tyrol finds himself in the brig with Boomer, accused by Colonel Tigh of being a Cylon. At least one crew member knows what needs to be done to Cylon traitors. On Cylon-held Caprica meanwhile, Starbuck and Helo encounter a group of human resistance fighters.—garykmcd", "Martial Law is slowly dividing the fleet. A mission leads to disaster when civilians accidently get killed. Helo and Starbuck meet the resistance on Caprica lead by Samuel T. Anders. Lee schemes to free President Roslin. Tigh does not shoot down Lee because it is his friends only Son. Baltar uses Sharon's love for Tyrol to interrogate her.—Dan"], "genres": "N/A", "imdbID": "0519780", "rating": 8.0, "votes": 2094, "number_of_episodes": 74}