{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0368745": "Richard Hatch", "0722413": "Donnelly Rhodes", "0001334": "John Heard", "0856351": "Christian Tessier", "0902807": "Stefanie von Pfetten", "0808902": "Kavan Smith", "0745336": "Amber Rothwell", "0406896": "Patricia Idlette", "0788907": "Rekha Sharma", "0238694": "Brad Dryborough", "0669041": "Aaron Pearl", "1775193": "Christina Schild", "1605039": "Tammy Hui", "1056475": "Jamie Bell", "0808995": "Kimani Ray Smith", "0750343": "Kurt Max Runte"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Two of Pegasus' raptors go missing after a suspicious distress call. President Roslin must make a decision on abortion that could hurt her political career.", "Lee Adama is asked to take a look on Pegasus, where commander Garner and Starbuck don't seem to be getting along. On Pegasus two raptors went missing after following a mysterious distress call. Their oxygen is running out. Apollo and Starbuck think it might be a Cylon trap, but Garner seems determined to jump Pegasus to rescue them. Meanwhile President Roslin is preparing for the elections. Her only opponent so far is Tom Zarek. Little does she know he is talking with Dr. Baltar to support his candidacy. Then a young woman requests asylum on Galactica. She wants an abortion, but her Gemenon parents don't allow it. Roslin faces a tough decision. She wants to recognize the freedom of women, but agreeing with abortion will lose the support of the important religious leaders of Gemenon.—Arnoud Tiele (imdb@tiele.nl)", "With the upcoming elections soon to be upon them, President Roslin begins to prepare for what seems will be a fairly easy win. She has widespread support in both the civilian and military population and her only opponent is likely to be Tom Zarek who is, in the eyes of many, a terrorist. Problems arise when a 14 year old from Gemenon arrives on Galactica requesting an abortion. The strict religionists from Gemenon are against abortion and although it has been legal in the 12 Colonies for many years, President Roslin's decision in the case will have a direct impact on her election chances. Tom Zarek also has his own plans and they don't include seeking office himself as he has another candidate in mind. Meanwhile, Admiral Adama sends Apollo, now promoted to Major, to the Pegasus to investigate conditions on the ship. It seems that Starbuck and Commander Garner, the former chief engineering officer now in command of the ship, aren't exactly getting along. Problems begin when two scout ships vanish while on patrol, likely having jumped in response to a distress call. Apollo recommends against jumping after them as the Cylons have been know to use false distress signals to lure ships into a trap but Garner decides to go ahead anyways, with disastrous results.—garykmcd", "Pegasus' scout Raptors disappear and a mysterious distress call is sent. Admiral Adama appoints the chief engineer of Pegasus, Barry Garner, to command the ship, despite some misgivings. Garner and Starbuck's clash resumes, with Lee caught in the middle. Lee gets his first taste of command during a Cylon ambush. Roslin issues a new proclamation on the issue of abortion within the fleet.", "Starbuck and Apollo come into conflict with one another about their differences of opinion and work ethic. Starbuck takes a lecturing from the commander of Pegasus about fighter pilots disappearing on a mission.—Jenn"], "genres": "N/A", "imdbID": "0519787", "rating": 7.6, "votes": 2017, "number_of_episodes": 74}