{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0000405": "Michelle Forbes", "0722413": "Donnelly Rhodes", "0065320": "Graham Beckel", "0701561": "John Pyper-Ferguson", "0817819": "Sebastian Spence", "1382781": "Luciana Carro", "0301925": "Vincent Gale", "0697864": "P.J. Prinsloo", "0238694": "Brad Dryborough", "0647453": "Bodie Olmos"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["Adama and Cain find common ground when Starbuck returns with footage of the Cylon ship. Roslin negotiates a temporary truce, while Starbuck plans an attack.", "Galactica's and Pegasus' vipers are at a deadlock, waiting for the first one to fire. Then Starbuck comes back from spying on the Cylon vessel. President Roslin negotiates a temporary truce between commander Adama and admiral Cain. The joint forces will attack the Cylon fleet with the unusual ship and Helo and Tyrol's execution will be postponed. Roslin advises Adama to kill Cain. She fears the future of the civilian fleet. Tigh tries to find out what happened to the civilian ships that apparently once traveled with Pegasus. Cain seems impressed with Starbuck and promotes her to CAG for Pegasus. She wants an unconventional plan for the attack on the mysterious Cylon vessel. She asks Dr. Baltar to interrogate the Cylon about it.—Arnoud Tiele (imdb@tiele.nl)", "Commander Adama and Admiral Cain agree to stand down and meet on Colonial One where President Roslin arranges a truce of sorts between them. The President has advice for Adama that he may not be able to follow. Starbuck has taken the Galactica's new stealth fighter to the Cylon staging area to get photos of the mysterious ship no one has yet encountered, Together, the Pegasus and the Galactica set off to fight the Cylon fleet. Admiral Cain admires Starbuck's guts in undertaking her secret mission and promotes her to Captain, making her CAG of the Pegasus air wing. Gaius Baltar meanwhile is still questioning the Number Six Admiral Cain has in the Pegasus brig and is tasked with getting information on the ship in Starbuck's photos.—garykmcd"], "genres": "N/A", "imdbID": "0519781", "rating": 8.8, "votes": 2331, "number_of_episodes": 74}