{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0005128": "Lucy Lawless", "0873998": "Michael Trucco", "0719678": "Callum Keith Rennie", "0001777": "Dean Stockwell", "0238694": "Brad Dryborough", "0669826": "Eileen Pedde", "0235888": "Alisen Richmond-Peck", "1052369": "Diego Diablo Del Mar", "0006820": "Aleks Paunovic", "0750353": "Tygh Runyan"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["The Cylons descend upon the re-supply mission as the Chief races to decipher the markings in the temple believed to hold The Eye of Jupiter, a sacred icon that is believed to contain a map to Earth.", "Admiral Adama is playing a deadly serious game of chicken with the Cylons. Nuclear missiles are armed and Adama seems ready to destroy the planet if the Cylons don't relent. The Cylons are concerned about Number 3's independence and refusal to follow an order from the group. It becomes clear that D'Anna Biers isn't much interested in the Eye of Jupiter but wants to see the Final 5. She gets her wish but they are clearly not what she was expecting. On the algae planet, Apollo orders Dee to mount a rescue mission for Starbuck whose Raptor was shot down. Inside the temple, Tyrol continues his efforts to find the Eye of Jupiter. Athena is determined to get her baby back and knows one way to get aboard the Cylon Basestar.—garykmcd", "The standoff with the Cylons continues but it is clear that the personnel on the algae planet are highly vulnerable to Cylon attack. Shot-down Starbuck is isolated and rescuing her will put more lives at risk. The Chief and his team must find the Eye of Jupiter before the Cylons do or at least destroy it.—grantss"], "genres": "N/A", "imdbID": "0909050", "rating": 8.2, "votes": 1937, "number_of_episodes": 74}