{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0005128": "Lucy Lawless", "0941796": "Rick Worthy", "0719678": "Callum Keith Rennie", "0071922": "Matthew Bennett", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "1489668": "Leah Cairns", "2264355": "Madeleine Parker", "0817819": "Sebastian Spence", "2422305": "Emilie Ullerup", "0461101": "Tiffany Lyndall-Knight", "0371787": "Rachel Hayward", "0001777": "Dean Stockwell"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Baltar learns from Caprica Six of their ability to project themselves and imagine different surroundings which leads him to wonder if he too is a Cylon. He has told the Cylons what he knows about the location of Earth and they dispatch a Basestar to investigate. In the end, the survey ship is infected with a virus killing everyone aboard. Aboard the Galactica, Lt. Gaeta has been reviewing Baltar's work in deciphering the map they recovered on Kobol. He too thinks he knows what it all means. Of greater concern however is the wedge between those who stayed with the fleet and those who were on the ground fighting the Cylons. Starbuck and Colonel Tigh in particular are quite vocal in complaining about those who stayed behind and it's left to Admiral Adama to lay down the law.—garykmcd", "The Galactica encounters a Cylon Basestar devastated by a deadly virus. Lingering feelings of rage lead Saul Tigh and Kara Thrace to cause problems aboard Galactica between the survivors from New Caprica and those who stayed with the fleet during the Occupation. Baltar tries to convince the Cylons of his value to them in an attempt to stay alive.—Anonymous"], "genres": "N/A", "imdbID": "0811219", "rating": 7.8, "votes": 1970, "number_of_episodes": 74}