{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0005128": "Lucy Lawless", "0941796": "Rick Worthy", "0719678": "Callum Keith Rennie", "0722413": "Donnelly Rhodes", "0071922": "Matthew Bennett", "0647453": "Bodie Olmos", "1489668": "Leah Cairns", "0669826": "Eileen Pedde", "0461101": "Tiffany Lyndall-Knight"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["When a group of ill Cylons from the infected Basestar is brought to Galactica, Lee discovers a way to solve the Cylon problem forever - by destroying the whole Cylon race. Meanwhile, D'anna's acts to discover if Baltar is reliable will forge an unusual relationship.—Anonymous", "The Galactica discovers the abandoned Cylon Basestar and learns that the Cylons have been infected by a virus they acquired from a beacon floating in space. The team returns to Galactica with some of the surviving but very ill Cylons. Dr. Cottle determines that humans are immune to the virus but Athena has to stay in quarantine. Cottle also determines that the virus is a fairly simple form of encephalitis for which he can easily create a vaccine. Apollo argues in favor of using the virus to destroy the Cylon race once and for all while Helo argues that to do so is a crime against humanity. In questioning one of the Cylons, they also learn that Baltar is alive and has given the Cylons his navigation charts. Meanwhile, Gaius Baltar's deception is discovered and the Cylons are prepared to dispose of him, but not before they get as much information as possible from him about the virus.—garykmcd", "Apollo and a landing party board a derelict Cylon battlestar to find almost all the Cylons aboard dead. Five humanoid Cylons are still alive, barely, and it is discovered that they are suffering from a deadly virus. Mankind now has the means to entirely wipe out the Cylons but not everyone wants to see it used.—grantss"], "genres": "N/A", "imdbID": "0870871", "rating": 7.6, "votes": 1947, "number_of_episodes": 74}