{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0005128": "Lucy Lawless", "0873998": "Michael Trucco", "0719678": "Callum Keith Rennie", "0894690": "Kate Vernon", "0071922": "Matthew Bennett", "0788907": "Rekha Sharma", "0001777": "Dean Stockwell", "1382781": "Luciana Carro", "0856351": "Christian Tessier", "0238694": "Brad Dryborough", "1489668": "Leah Cairns", "2264355": "Madeleine Parker", "0952778": "Dominic Zamprogna", "1468333": "Ryan McDonell", "0493171": "Byron Lawson", "0492687": "Colin Lawrence"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["The Cylons have now been in control of New Caprica for over four months. Gaius Baltar is under their collective thumbs and essentially follows their orders. There is a resistance who set off bombs and do their best to disrupt Cylon activity. Col. Tigh is in prison and despite extensive torture, including the loss of an eye, has told them nothing. His wife Ellen will do anything to secure his release and is soon in a sexual relationship with one of the Cylons, John Cavil. There are mixed feelings among the survivors. Some feel the random acts of violence against their captors serves no useful purpose while others feel it is their duty to resist. Kara Thrace, Starbuck, is being kept prisoner in an apartment of sorts by Leoben Conoy. She too resists but every time she kills him, he is simply re-generated and reappears insisting he will continue to do so until he tells her she loves him. Back on Galactica, Admiral Adama takes his son Lee, Commander of the Battlestar Pegasus, to task for going soft.—garykmcd", "Following on from the events of the final episode of Season 2, New Caprica is now under Cylon control. Colonel Tigh is leading a small resistance band but has been captured and tortured. Baltar continues as President, though now a puppet one. Starbuck is a prisoner in a gilded cage. Galactica, Pegasus and the fleet are safe and are waiting for an opportune time to return to New Caprica.—grantss", "Tigh, Tyrol and Anders lead the Resistance on New Caprica to increasingly deadly attacks against the Cylons. Kara finds herself trapped in a new life with Leoben Conoy, and Duck makes a fateful decision. Meanwhile on Galactica, Adama struggles with the question of whether to return to New Caprica to mount a rescue attempt.—Anonymous"], "genres": "N/A", "imdbID": "0793695", "rating": 8.2, "votes": 2350, "number_of_episodes": 74}