{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0873998": "Michael Trucco", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "1382781": "Luciana Carro", "0647453": "Bodie Olmos", "0856351": "Christian Tessier", "0952778": "Dominic Zamprogna", "0860065": "Don Thompson", "5860526": "Debora Bastos", "1489668": "Leah Cairns", "1342807": "Paul Lazenby", "0006820": "Aleks Paunovic"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["70"],  "plot": ["A look at the events that took place during the year-long gap from the storyline in the Season Two finale. The story reveals the reasons for the rift between Kara (\"Starbuck\") and Lee (\"Apollo\").", "The Galactica is having a boxing tournament of sorts. As Admiral Adama explains it to President Roslin, the purpose is to let the crew step into the ring and release their frustrations against an opponent of their choice, regardless of rank. As the crew watch or participate the fight, they recall past incidents between them. Adama calls out Chief Tyrol, who he let go live on New Caprica when he really needed him on the ship. He has a message for the crew on duty and obligations. Starbuck and Apollo have a long history together and have never fully comes to terms with their feelings for one another. During the initial establishment of the colony on New Caprica they made love after a drunken wild party and Apollo was ready for them to make a life together. Starbuck refused to accept their need for one another and married Sam Anders the very next day.—garykmcd", "The Galactica is holding a boxing contest in which anyone can enter and contestants get to choose their opponent. Rivalries and animosities are revealed as people square up in the ring. In particular, we get to see what caused the sour relationship between Apollo and Starbuck.—grantss", "To help the crew of BSG let off a little steam, boxing matches are arranged. Helo and Apollo square off, seemingly venting their frustrations over a difference on opinion on wiping out the Cylon race by perpetuating a virus that only the Cylons are susceptible to. Starback (Kara Thrace) and her husband, Samuel Anders, are experiencing problems of their own since Starbuck was held captive on New Caprica with a Cylon captor. Anders expresses his desire to have Kara back. Starback and Apollo decide to go into the ring to slug it out - but is it resentment, or pent up feelings for each other that they yearn to let out?—jojobear124"], "genres": "N/A", "imdbID": "0903208", "rating": 7.4, "votes": 2501, "number_of_episodes": 74}