{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0873998": "Michael Trucco", "0432228": "Alessandro Juliani", "0368745": "Richard Hatch", "0817819": "Sebastian Spence", "0647453": "Bodie Olmos", "0730455": "Ryan Robbins", "0870535": "Keegan Connor Tracy", "0233304": "Mike Dopud", "0648153": "Ty Olsson", "1489668": "Leah Cairns", "0356501": "Jen Halley", "0238694": "Brad Dryborough", "0492687": "Colin Lawrence", "3028264": "Alexandra Thomas", "0217757": "Derek Delost", "0301925": "Vincent Gale", "1091956": "Colin Corrigan", "0500551": "Michael Leisen", "1968493": "Lara Gilchrist", "0570512": "Andrew McIlroy", "0561562": "Judith Maxie", "1114898": "Iris Paluly", "0635939": "Marilyn Norry", "0998268": "Craig Veroni", "0814552": "Veena Sood", "1736171": "Akotene Chanoine"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["The Fleet refuses to cooperate with Cylon engineers and Adama decides to put an end to it. He sends the Quorum a message stating that unless they wish to join Zarek in the cell, they get their people in line. However, Gaeta has already freed Zarek with the help of other would-be-revolutionists. They allow Zarek to leave Galactica on a raptor. He lands on Colonial One and enters a gathering of the Quorum. Meanwhile, Anders gets ambushed and captured. At the CIC, Gaeta cleverly manipulates everyone else until the time is at hand for the revolution to begin.—Toni Tapola, Finland", "With Vice President Zarek in the brig, Admiral Adama proceeds with the Cylon engine upgrades on the fleet's vessels over the objections of the Quorum of Twelve. In this tense situation, Lt. Felix Gaeta leads a mutiny and many on the Galactica are with him, both civilian and military. He arranges for Zarek's escape and surreptitious transfer to Colonial One. While the mutineers arm themselves, Gaeta uses his position on the bridge to keep the Admiral and XO in dark as to what is happening below decks. When they finally catch on it's too late. With the mutineers in command of the ship, Adama's main concern is to ensure that those who have remained loyal, especially President Roslin, find a way to safety aboard the Cylon Basestar.—garykmcd"], "genres": "N/A", "imdbID": "0993914", "rating": 9.0, "votes": 2146, "number_of_episodes": 74}