{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0873998": "Michael Trucco", "0432228": "Alessandro Juliani", "0368745": "Richard Hatch", "0719678": "Callum Keith Rennie", "0791968": "Mark Sheppard", "0788907": "Rekha Sharma", "0817819": "Sebastian Spence", "0647453": "Bodie Olmos", "0233304": "Mike Dopud", "0648153": "Ty Olsson", "1489668": "Leah Cairns", "0356501": "Jen Halley", "3028264": "Alexandra Thomas", "0217757": "Derek Delost", "1091956": "Colin Corrigan", "0570512": "Andrew McIlroy", "0561562": "Judith Maxie", "1114898": "Iris Paluly", "0635939": "Marilyn Norry", "0814552": "Veena Sood", "0391738": "Adrian Holmes", "1787399": "Maria Gallo"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Roslin is on board a raptor en route to the Rebel Cylon Base Star, but Gaeta has ordered to engage and destroy it. The marines have used a stun grenade on Adama and Tigh. Roslin manages to get a wireless transmission out for everyone to hear and learn what Gaeta has done. She and the others barely make it to the Base Star, where she convinces Tory and the other Cylons to use the Fleet as a cover in order to prevent Gaeta from attacking it. She also believes that Adama will be able to save the rest of the Final Four. Temporarily safe, the Rebel Cylons start voting on whether they should just jump away and count their losses. Adama is brought before Gaeta and Tigh is thrown to the brig with Caprica Six, Anders, Athena, Helo and their child Hera. Zarek comes aboard Galactica on Colonial One with the Quorum. At Gaeta's insisting, Zarek agrees to put Adama on trial for treason, with Romo Lampkin assigned as his defence lawyer. There's just one problem: The Quorum refuses to recognize Zarek's authority. However, Zarek is hell-bent on following his \"The truth is told by those left standing\" maxim. Only Tyrol, who's alone, and Lee, whose with Starbuck, are Galactica's last hope.—Toni Tapola, Finland", "Now safely aboard the rebel Cylon Basestar, President Roslin reasserts her authority and finds a way to broadcast a message to the fleet. The Cylons also agree to move their ship in among the other ships making it impossible for the Galactica to fire on them. Zarek wants to have Adama face a court martial and forces Romo Lampkin to act as defense attorney. When the Quorum of Twelve disagrees with him, he has a solution to that as well. There is some resistance aboard the Galactica including Apollo, Anders, and Starbuck. They manage to free Adama and as their numbers begin to grow, he leads them to retake the CIC. Chief Tyrol meanwhile works his way to the engine to disabled the FTL drive. He finds something else however.—garykmcd"], "genres": "N/A", "imdbID": "0993915", "rating": 9.1, "votes": 2311, "number_of_episodes": 74}