{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0873998": "Michael Trucco", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0368745": "Richard Hatch", "0719678": "Callum Keith Rennie", "0722413": "Donnelly Rhodes", "0788907": "Rekha Sharma", "0647453": "Bodie Olmos", "0461101": "Tiffany Lyndall-Knight", "0238694": "Brad Dryborough", "1489668": "Leah Cairns", "0492687": "Colin Lawrence", "0356501": "Jen Halley", "1091956": "Colin Corrigan", "2086765": "Donna Soares", "0570512": "Andrew McIlroy", "0561562": "Judith Maxie", "1114898": "Iris Paluly", "0635939": "Marilyn Norry", "0998268": "Craig Veroni", "0420255": "Lee Jeffery", "3028264": "Alexandra Thomas", "2368801": "Leo Chiang"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["A shaky alliance between the Colonial Fleet and Cylon rebels is put to the test when the two groups combine efforts to take out a Cylon \"Resurrection Hub\". Meanwhile, Athena loses control when Hera becomes unnaturally drawn to Natalie.", "The Demetrius and the Basestar return to the colonial fleet - not without some challenges - and the Cylons seek an alliance with the Colonial fleet. Natalie 6 offers to lead them to the Cylon resurrection hub which, if destroyed, would end the possibility of Cylon resurrection. She also tells them the Final 5 are already in the Colonial fleet. When the Quorum of Twelve learns of the deal with the Cylons, they consider a vote of no confidence in the President. The President meanwhile again has her dream of chasing Hera in the Kobol Opera House. She learns that her chief of staff, Tory Foster, has become one of Gaius Baltar's followers. She wants to know who is spreading rumors about her sharing her visions with the Cylons. When Starbuck tells the President what the Hybrid told her, the President takes Baltar with her to speak to the Hybrid. On the Galactica, Athena has a fatal encounter with Natalie. Lt. Gaeta, who was shot by Sam Anders during the attempted mutiny on the Demetrius, has his leg amputated below the knee and spends his time in the infirmary, singing—garykmcd"], "genres": "N/A", "imdbID": "0993929", "rating": 8.5, "votes": 1888, "number_of_episodes": 74}