{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0432228": "Alessandro Juliani", "0368745": "Richard Hatch", "0722413": "Donnelly Rhodes", "0647453": "Bodie Olmos", "0870535": "Keegan Connor Tracy", "0636244": "Kerry Norton", "0238694": "Brad Dryborough", "1775193": "Christina Schild", "0346607": "Biski Gugushe", "1968493": "Lara Gilchrist", "2986703": "Finn R. Devitt", "2086765": "Donna Soares", "0570512": "Andrew McIlroy", "0561562": "Judith Maxie", "0635939": "Marilyn Norry", "0814552": "Veena Sood", "0860065": "Don Thompson"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["52"],  "plot": ["Adama considers Saul and Tyrol's suggestion that the Fleet should integrate Cylon jump technology since it will triple the distance they will be able to cover before they run out of fuel. But the Cylon's condition is that they will be allowed to join the Fleet, for safety against Cavil, who's still out there. Ultimately, the decision is up to President Roslin, but Zarek calls the Quorum and gets them to carry the motion that no Cylon be allowed aboard any Colonial vessel unless permitted by the ship's captain. Tyrol learns from Dr. Cottle that Cally had their child tested and the results indicated that Tyrol is not the father - therefore the child is fully human. Roslin starts her climb up from the depths of despair she had fallen to soon after the Fleet found Earth.—Toni Tapola, Finland", "With President Roslin still out of commission and refusing to exercise her Presidential authority, Vice President Zarek has taken over. A serious clash is brewing between him and Admiral Adama when the latter orders an engine upgrade on all fleet vessels using Cylon technology. No one has any problems with the technology as it will make them able to travel far greater distances. The problems is that they will have to let Cylons board their vessels for the upgrade. Zarek and the Quorum of Twelve decide that each ship has the final say over whether Cylons can board, forcing the Admiral to take action. Col. Tigh and Caprica 6 get their first look at their baby via an ultrasound. Lt. Gaeta is not pleased with the way the Cylons are, in his view, receiving special treatment and starts making his views known. Galen Tyrol takes his little boy to the infirmary when he develops a fever. His illness is treatable but Dr. Cottle has some shocking news for Tyrol.—garykmcd"], "genres": "N/A", "imdbID": "0993913", "rating": 7.7, "votes": 1710, "number_of_episodes": 74}