{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0873998": "Michael Trucco", "0167435": "Nicki Clyne", "0432228": "Alessandro Juliani", "0368745": "Richard Hatch", "0722413": "Donnelly Rhodes", "0071922": "Matthew Bennett", "0788907": "Rekha Sharma", "0001777": "Dean Stockwell", "0356501": "Jen Halley", "1775193": "Christina Schild", "0346607": "Biski Gugushe", "2986703": "Finn R. Devitt", "2086765": "Donna Soares", "0570512": "Andrew McIlroy", "0561562": "Judith Maxie", "1114898": "Iris Paluly", "1468333": "Ryan McDonell", "0635939": "Marilyn Norry", "2086012": "Leela Savasta", "2368801": "Leo Chiang"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["The aftermath of a coup among the Cylons leads to further violence, Lee finds himself facing off against Roslin during his first meeting with the Quorum of Twelve as the new representative of Caprica, and Cally discovers the horrible truth about her husband Galen Tyrol. Meanwhile, Starbuck aimlessly searches for Earth with Anders and other Galactica officers.—Kevlar01", "The media is onto the absence of the Demetrius and the President is finding it difficult to fend off their enquiries. Tom Zarek thinks there's more to it that is publicly known and provides Caprica's new representative on the Quorum of Twelve, Lee Adama, with information on a sensitive subject he could use against President Roslin. The Demetrius meanwhile has been gone for just over three weeks and has yet to have any success in locating Earth. Several of the officers on board are starting to lose confidence in what Starbuck is doing. The battle for control among the Cylons continues and turns into an all-out war. When Cally finds a note for Tyrol to meet in a weapons locker, she follows him and overhears that he is a Cylon. She can see only one way out for herself and her child.—garykmcd"], "genres": "N/A", "imdbID": "0993925", "rating": 7.9, "votes": 1815, "number_of_episodes": 74}