{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0873998": "Michael Trucco", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "0788907": "Rekha Sharma", "0001777": "Dean Stockwell", "1894655": "John Hodgman", "0636244": "Kerry Norton", "0491394": "Darcy Laurie"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Eighteen months ago: Saul poisons Ellen, who then finds herself downloaded into a new body aboard a Cylon Base Star, with a single Centaurion keeping watch over her. After the initial shock, she has a revelation as she remembers things she had forgotten. Present Day: Dr. Cottle is operating on Anders, who has a bullet lodged in his brain. Anders starts to remember things he had forgotten. Eighteen months ago: Cavil comes to see Ellen, who calls him John, because that's his \"real\" name. Cavil says he hates that name. John was the first Cylon model *Ellen* created. She also created seven others. So, there are actually only *eight* Cylon models and the \"Final Five\" are actually copies of humans who lived 2,000 years earlier and, together, created Resurrection, which allowed them and the Cylons to download. Number Seven, Daniel, was a favorite of Ellen. Jealous, John sabotaged the process of using Resurrection on Daniel, making him unique. John and Ellen start a months-long philosophical and ethical argument on Cylon - human interaction. John says he started the genocide of humankind because his \"forebears on the Centaurion side of the family were the slaves of humanity.\" And he wants justice for that. Present Day: Anders tells Starbuck that he has seen \"everything\" and needs Kara to get \"the others\" - Galen, Tory, Saul and Ellen to his bedside. Anders says he remembers everything and knows why they have come all the way to Earth... Adama reinstates Tyrol as a Chief of Engineering. Tyrol starts inspecting the damage Galactica has taken during their journey. But he is not prepared for what he finds and Adama is not prepared for what Tyrol suggests as a repair method.—Toni Tapola, Finland", "Now back in command of the Galactica, Admiral Adama seeks to re-assert his overall authority. Gaeta and Zarek are under arrest and there can be only one sentence. Chief Tyrol shows the Admiral what he's found in the engine room. Sam Anders is in serious condition having been shot in the head during the re-capture of the ship. He has a sudden burst of clarity however telling Tyrol, Tory and Saul about their time on Earth before its destruction. In a flashback to when Saul poisoned his wife Ellen on New Caprica, it is revealed that she was reborn on a Cylon ship where she once again meets John Cavil and later, Boomer Valerii. She created Cavil and he hates her for it. She in turns resents what happened to another of the Final Five's creations, Daniel. Cavil wants her to recreate the regeneration technology and will cut it out of her brain, if necessary. Boomer has another solution however.—garykmcd"], "genres": "N/A", "imdbID": "0993916", "rating": 8.4, "votes": 1831, "number_of_episodes": 74}