{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0873998": "Michael Trucco", "0894690": "Kate Vernon", "0722413": "Donnelly Rhodes", "0788907": "Rekha Sharma", "0188220": "Roark Critchlow", "0647453": "Bodie Olmos", "0870535": "Keegan Connor Tracy", "0192959": "G. Patrick Currie", "0238694": "Brad Dryborough", "1968493": "Lara Gilchrist", "1757551": "Rebecca Davis", "0597740": "Merwin Mondesir", "0319320": "Tammy Gillis", "1112955": "Patrick Gilmore", "0396685": "Marci T. House", "0566970": "Bear McCreary"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Ellen and Boomer travel to the Galactica. Saul is entranced at the sight of his wife while Adama puts Boomer in the brig. Ellen is not so pleased when she learns that Caprica Six is pregnant by Saul. Her interference and jealousy leads Six to have a miscarriage. Sam Anders survived the operation but now seems to be brain dead. Ellen is disappointed that the Final Five cannot be completely reunited. By majority vote, the Five agree that they will go off on their own, leaving the Colonial Fleet behind. Adama has agreed to have the cracks in the Galactica's hull repaired using a Cylon living resin.—garykmcd", "Chief Tyrol has started repairs on Galactica using Cylon quasi-living resin. Caprica Six gets into a fight with humans. Tigh and Caprica Six have Dr. Cottle inspect their unborn baby in ultrasound and it's just fine. At the same time, a raptor that's been missing over a year approaches the Fleet. It is brought aboard Galactica, where Roslin, Adama, Starbuck, Lee and others present are shocked to see Ellen come out, escorted by an Eight. Tyrol is able to identify the Eight as Boomer. Adama orders her taken to the brig. Then Tigh arrives and Ellen shares a passionate kiss with him. Ellen tells Adama, Roslin, Tigh and Lee that Cavil wants her and the Final Four to rebuild Resurrection. She also asks to see the others who survived the genocide of humans on the now desolate Earth. Tigh tells her he remembers only flashes of the ancient past. Lee breaks the news that Anders is not responding. Ellen and Saul get some private quality time, but for a moment he sees Caprica Six instead of Ellen. Baltar returns to his followers, who are taking care of themselves after the mutiny. What they also seem to have, is a new leader figure... Saul finally manages to tell Ellen that he's involved with Caprica Six. Soon Ellen gets the chance to have a reunion she asked for, around Anders' bed. A Six and an Eight are present and suggest that the Final Four join the Cylons on the Base Star. Tory says it is the way to ensure the survival of the 13th Tribe. Ellen disagrees. In her mind, Hera is the hope for a new, \"blended future\". Then Tory breaks to Ellen the news that Caprica Six is pregnant...—Toni Tapola, Finland"], "genres": "N/A", "imdbID": "0993917", "rating": 7.4, "votes": 1679, "number_of_episodes": 74}