{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0873998": "Michael Trucco", "0894690": "Kate Vernon", "0788907": "Rekha Sharma", "0870535": "Keegan Connor Tracy", "1489668": "Leah Cairns", "0492687": "Colin Lawrence", "0860065": "Don Thompson", "2086012": "Leela Savasta", "1968493": "Lara Gilchrist", "2086765": "Donna Soares", "0570512": "Andrew McIlroy", "0561562": "Judith Maxie", "1114898": "Iris Paluly", "0635939": "Marilyn Norry", "1976541": "Heather Doerksen", "0755499": "Laara Sadiq", "0042438": "Karen Austin", "1721225": "Steve Lawlor", "0425220": "Hector Johnson", "0420255": "Lee Jeffery", "0167435": "Nicki Clyne", "0371690": "Rob Hayter"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Gaius Baltar causes intense unrest within the fleet when he begins to openly promote belief in the Cylon god. Colonel Tigh, Galen Tyrol, and Tory Foster argue over how far they should go to ensure their secret is not revealed.", "Funeral services are held for Cally Tyrol but the Chief feels guilty about what happened to his wife. He's slipping on the job as well and makes a serious mistake that could have resulted in death for the crew of a Raptor. Harsh words with Admiral Adama in Joe's Bar results in him being demoted from Chief to Specialist and designated for reassignment. Col. Tigh visits Caprica Six in the brig to advise that her request the see the child Hera has been denied. He's shocked at what he sees however. Meanwhile, Gaius Baltar and his acolytes are attacked and beaten in their quarters by the Sons of Ares, a vigilante group. As a result, he goes on the offensive and desecrates a temple in revenge. President Roslin promises him she will pursue his attackers but also seeks the Quorum of Twelve's support in passing new legislation to reign him in.—garykmcd"], "genres": "N/A", "imdbID": "0993926", "rating": 7.4, "votes": 1737, "number_of_episodes": 74}