{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0873998": "Michael Trucco", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0005128": "Lucy Lawless", "0719678": "Callum Keith Rennie", "0788907": "Rekha Sharma", "0647453": "Bodie Olmos", "0870535": "Keegan Connor Tracy", "0238694": "Brad Dryborough", "0301925": "Vincent Gale", "0860065": "Don Thompson", "3028264": "Alexandra Thomas", "1968493": "Lara Gilchrist", "1976541": "Heather Doerksen", "2986703": "Finn R. Devitt", "1060641": "Sonja Bennett", "2448543": "Barry Nerling", "1468333": "Ryan McDonell", "1173158": "Jeff Sanca"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["D'Anna demands that the four Cylons in the fleet be sent to the basestar. Only Tory goes, while the remaining three are suddenly drawn to Kara's Viper by the music. The route to Earth is finally found.", "Having accomplished its mission, the rebel Cylon Basestar joins the Colonial fleet. D'Anna Biers distrusts their former enemies and makes it quite clear that she will execute President Roslin and all of the other hostages from the Colonial fleet unless the four of the Final 5 in the fleet are allowed to leave and go to the Basestar. Acting President Lee Adama realizes that if he lets the four go to the rebel ship, nothing will prevent D'Anna from simply jumping away and leaving them behind. A tense stand-off ensues with both sides threatening to destroy the other with their nukes. Tory Foster goes to the Basestar on the pretense of taking Roslin her medication. Saul Tigh finally tells the Admiral the truth and soon the other two are known. Starbuck meanwhile notices an anomaly in the navigation system of the pristine Viper she brought back to the ship. She believes it is a signal from Earth.—garykmcd"], "genres": "N/A", "imdbID": "0993911", "rating": 9.1, "votes": 2274, "number_of_episodes": 74}