{"cast": {"0001579": "Edward James Olmos", "0001521": "Mary McDonnell", "0755267": "Katee Sackhoff", "0051397": "Jamie Bamber", "0130536": "James Callis", "1065454": "Tricia Helfer", "0661825": "Grace Park", "0389581": "Michael Hogan", "0234928": "Aaron Douglas", "0671886": "Tahmoh Penikett", "0873998": "Michael Trucco", "0432228": "Alessandro Juliani", "0565973": "Kandyse McClure", "0788907": "Rekha Sharma", "0730455": "Ryan Robbins", "0870535": "Keegan Connor Tracy", "1489668": "Leah Cairns", "0356501": "Jen Halley", "1091956": "Colin Corrigan", "2558540": "Shaun Omaid", "2086012": "Leela Savasta", "2678244": "Lukas Pummell", "1968493": "Lara Gilchrist", "1976541": "Heather Doerksen"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["During a seemingly hopeless battle, Kara Thrace appears in a pristine Viper, claiming that she has been to Earth and can lead the Fleet there -- but the terminal Laura Roslin believes otherwise. Meanwhile, four of the so-called Final Five are forced to tackle the repercussions of their newfound nature, while Gaius Baltar discovers he has a commune of nubile female cultists who believe him to be an agent of the \"one true God.\"—Amezzeray", "The Colonial fleet and the Cylons engage in a costly battle within the Ionian Nebula, Gaius becomes the figurehead of a religious sect hiding on Galactica, and Starbuck's resurrection shocks and terrifies the fleet. Meanwhile, Colonel Tigh, Galen Tyrol, Sam Anders, and Tory Foster struggle with the revelation that the are Cylons.—Kevlar01", "The Galactica engages the Cylon fleet that has suddenly appeared and are losing the battle. After scanning Sam Anders however, they immediately stop the attack and the ships jump into hyperspace. Everyone aboard the Galactica is dumbstruck at the return of Starbuck. She thinks she's been away for only a few hours but in fact it's been over two months. Her Viper is new and doesn't have a mark on it. The President orders her detained until they can figure out just what is going on. She repeats her claim that she has been to Earth and can show them the way to get there. Every time the fleet jumps into hyperspace however, she senses that they are going the wrong way. She decides to confront President Roslin. Gaius Baltar meanwhile has been led off to a part of the ship where his followers have created a safe haven - and a place of worship with him as the central deity with healing powers.—garykmcd"], "genres": "N/A", "imdbID": "0993910", "rating": 8.3, "votes": 2078, "number_of_episodes": 74}