{"cast": {"0396558": "Nicholas Hoult", "1478079": "Joe Dempsie", "2354239": "Mike Bailey", "2356940": "Hannah Murray", "1535380": "April Pearson", "2354663": "Larissa Wilson", "2353862": "Dev Patel", "2356535": "Mitch Hewer", "1147611": "Naomi Allisstone", "0313331": "Alan George", "2533979": "Danielle Jadelyn", "0598636": "Heidi Monsen", "0240375": "Duncan Duff", "1544060": "Wendy Brierley", "2257207": "Daniel Kaluuya", "1353029": "Siwan Morris", "0928894": "Robert Wilfort", "0918572": "Arabella Weir", "0245705": "Danny Dyer", "0607403": "Neil Morrissey", "0910373": "Stephen Walters", "1546113": "Julia Florimo", "2459009": "River George", "3173569": "Kevin Hudson"}, "geners": ["Drama"], "runtimes": ["45"],  "plot": ["If the world wasn't strange enough, this episode perceives the world through the eyes of Cassie. A world in which you receive messages through your food. A world in which the guy you are interested in only has eyes for your best friend, who only has eyes for his best friend. And a world in which the only person you can talk to is your taxi driver. Welcome to the calm in storm of the surreal.—Headblade", "Cassie can trick everyone. In her magical world the eccentric skinny girl still manages to fool everyone that she's beating her eating disorder. Her parents Marcus and Margeritte are well and truly duped. But Sid isn't. Good old geeky Sid, who inadvertently steps out of Tony's shadow to win a place in Cassie's heart by being the only person who notices and cares what happens to her. The only person, that is, except Allan, the taxi driver who takes her to the clinic, is the only adult she trusts, and the only person who actually sees her eat. Meanwhile, Michelle has her own food issue when Mum returns from holiday to discover that their house has been the scene of one almighty food and booze fight. But with new husband Malcolm in tow, will she even notice?—Anonymous"], "genres": "N/A", "imdbID": "0946638", "rating": 8.5, "votes": 1768, "number_of_episodes": 61}