{"cast": {"3272505": "Ollie Barbieri", "3077071": "Kathryn Prescott", "2877001": "Klariza Clayton", "3077073": "Megan Prescott", "3297698": "Luca Pasqualino", "2546012": "Kaya Scodelario", "2990671": "Lisa Backwell", "1925239": "Jack O'Connell", "3299423": "Lily Loveless", "2742529": "Merv Lukeba", "0646986": "Roland Oliver", "0080423": "Jiggy Bhore", "1635912": "Seth Adams", "0725998": "Paul Ridley", "0184588": "Juliet Cowan", "3361168": "The Slasher", "3361136": "Chris Lynd", "3353952": "Toby Welch", "3354052": "Matthew Cann", "3129894": "Joel Rowbottom", "3361108": "Charlie Goodwin", "3360828": "Sevven Smith"}, "geners": ["Drama"], "runtimes": ["45"],  "plot": ["JJ visits his psychiatrist after feeling 'lost and confused' about his life and friends. He is given lots of medical drugs to calm his Aspergers. He finds that Emily goes to the same clinic as him and they spend some time together; Emily calms JJ down,admits to him that she is a lesbian, and offers advice to help him sort out his numerous issues. JJ and Emily then visit Freddie and walk in on him having sex with Katie. During the confrontation, JJ accidentally informs Katie that Emily is a lesbian. Later, JJ visits Effy and asks her to stop interfering in his friendship with Freddie and Cook. JJ then visits Cook and discovers that he is also having casual sex with Pandora. Later, the group goes to a You Love Her Coz She's Dead gig, where Cook is beaten up after getting into a fight with some ravers. Before the chaos Effy and Naomi have a heart-to heart-outside, where Effy reveals that she knows about her and Emily. Naomi is hit by a wave of relief when Effy states that she does not mind if she is gay or not. Cook has taken JJ's Stun pills; they calm him and also make him tell the truth. Cook reveals that Effy loves Freddie back, but she cannot admit it and does not want a serious relationship. He bizarrely even admits to being genuinely hurt by this as he loves Effy too before admitting to having sex with Pandora, which Thomas overhears. JJ invites an upset Emily back to his house for the night, so she does not have to go home and face Katie. The next morning they sleep together; Emily tells JJ it is a \"one-time charity event.\"—Anonymous"], "genres": "N/A", "imdbID": "1368368", "rating": 8.7, "votes": 972, "number_of_episodes": 61}