{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "1821025": "Anahi Bustillos", "0421116": "Brent Jennings", "0668316": "Elizabeth Payne", "0455374": "Wayne King", "1821017": "Hunter Brochu", "1279783": "Lily Jackson", "0656005": "Saida Pagan", "1600158": "David Trice", "1261233": "Nicole Pano"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison's dream couldn't be more confusing, mimicking the story line of \"Little Red Riding Hood\": a snarling wolf chases her through a Phoenix airport where she has no choice but to jump from a jetway.", "Allison dreams of herself walking in an airport wearing a red hooded cape and being chased by a wolf. While working on case files at the DA's office, Allison overhears a crime victim describe the man who killed her boyfriend to a sketch artist. As the woman speaks however, Allison realizes she 's scared and giving a fictitious description. Allison gets the sketch artist to draw a picture of the real assailant and confronts the woman about what needs to do. The meaning of her dream becomes obvious to her. At home meanwhile, Joe and Allison are concerned when Bridgette's teacher tells them she doesn't socialize with the other children. They're pleased when she reports that she made a new friend, a boy her age named Bobby. Until they learn more about the boy and what happened to him five years ago.—garykmcd", "When Allison overhears a murder witness giving a false report to a police sketch artist, she tries to persuade D.A. Devalos that they are looking for the wrong man. A recurring nightmare that she is being chased through the airport by a vicious wolf holds the key that can save Allison when she comes face to face with the real murderer. Meanwhile, six-year-old Bridgette has a new playmate, which means Allison may not be the only DuBois family member who sees dead people.", "Allison's dream couldn't be more confusing, mimicking the storyline of \"Little Red Riding Hood\": a snarling wolf chases her through a Phoenix airport where she has no choice but to jump from a jetway. She wakes up believing her dream was just an ordinary dream until she begins to see these messages coming to her in her sleep, having a connection with a young fiancée's witnessed to a murder (that of her engaged boyfriend) and she proceeds to give an inaccurate description to a police sketch artist, worrying her boyfriend's killer will come after her. Meanwhile, Bridgette Dubois, Allison and Joe's middle daughter, has been afraid of returning to school; to find out their daughter is a bit of a social outcast upsets both of them. However, things turn out okay when she makes a new friend Bobby, a young boy the same age as Bridgette, only to realize he is a lost soul who was once a victim in horrific schoolyard tragedy. Joe is more upset by the fact his daughter has inherited Allison's gift of seeing dead people, which in turn hurts Allison. Allison explains to Bridgette and her new friend Bobby that Bobby needs to let go, and will always be able to watch out for Bridgette. Towards the end, Allison discovers their witness actually had a history with her late boyfriend's murderer, Detective Wolfe, a dirty cop who is willingly to bend the rules and work on the wrong side of the law. Allison thinks she has their killer once the crime matches up with the pieces of evidence she has been receiving in her dreams.", "A wolf chasing her as she's \"little red riding hood\" is plaguing Allison's dreams. It all starts to make sense as she overhears a woman giving an inaccurate description to a sketch artist. Meanwhile, Bridget's teacher informs Allison and Joe that Bridget is not making many friends at school.—Anonymous"], "genres": "N/A", "imdbID": "0645628", "rating": 7.8, "votes": 382, "number_of_episodes": 130}