{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0397124": "Arliss Howard", "0333318": "April Grace", "0553269": "Margo Martindale", "0939703": "Frank Wood", "1812582": "Tina DiJoseph", "1204778": "Matt Barr", "0808606": "Jamil Walker Smith", "0637598": "Bruce Nozick", "0611894": "Randy Mulkey", "0828494": "Joe Stevens", "1554009": "Terry Woodberry", "0668123": "John Paxton", "0704962": "Scott Rabinowitz", "0449402": "Ken Kerman", "1835517": "Jamie Litton", "0739376": "Dan Romero", "0130459": "Lorenzo Callender", "1123694": "Frank Alvarez", "0752802": "Remy Ryan", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "1869946": "Christian Hutcherson", "0696303": "Lawrence Pressman", "0838093": "Heather Sullivan"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["45"],  "plot": ["Wife, mother, and psychic Allison DuBois (Arquette) can communicate with the dead and is convinced she can use her gift to help solve crimes. She's put to the test when she gets a call from the Texas Rangers.", "When Allison Dubois sorts crime scene photos of a shooting, she is convinced that she actually knows what has happened. She's a prospective law student working as an intern in the office District Attorney Manuel Devalos. She's convinced her dreams are visions - and she sees dead people standing around her bed. Her engineer husband Joe suggests that she send the various scenarios to the relevant law enforcement agencies to see if anything comes of it. Joe is confident that nothing will - until Allison gets a call from Captain Kenneth Push of the Texas Rangers. Push is skeptical to say the least but she manages to convince him by identifying a crime scene and her knowledge of Push's medical condition.—garykmcd", "Wife, mother, and suburban housewife working part-time for the D.A.'s office, Manuel Devalos, Allison Dubois is a medium and self-professed psychic who has the ability to foresee and witness past and current events in her dreams and mediate as a messenger between the living and the spirits of the dead. Her first case is put to the test when she tries to convince her rocket scientist husband, Joe Dubois, about her dreams being extremely specific and realistic: one in particular about a middle-aged man suspected of murdering his wife; during this, she also has visions about a case she's currently working on with the D.A., where a little girl goes missing from a parking lot. On the case of investigating the home invasion, she, with the aid of a coworker, visits a woman named Catherine (a psychic with the same level of ability as Allison) to find information on a little girl's whereabouts. Catherine tests Allison's acceptance of her special abilities, and she claims although she has been in connection with the dead since she was six years old, she is not denying who she is. However, Allison, doing everything she can to get past her husband's skepticism and other doubters in the justice system about her dreams and connections she has with the dead, is put to the ultimate test when she gets a call from the Texas Rangers to investigate a pedophiliac murder involving two minors and the suspect's dead sister who witnessed the event.", "Hoping to prove to Allison that her dreams are stress induced, her scientist husband, Joe, sends descriptions of Allison's visions to a number of law enforcement agencies, expecting nothing to come of it. To his surprise, one of Allison's dreams bears an eerie similarity to a Texas homicide case involving a 17-year-old murder suspect. The case pits Allison against Capt. Kenneth Push, a cynical Texas Ranger who is suspicious of her psychic abilities. By the end of the investigation, Capt. Push has a new respect for Allison and she makes a life-altering decision of her own."], "genres": "N/A", "imdbID": "0645630", "rating": 8.0, "votes": 534, "number_of_episodes": 130}