{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0224703": "Reed Diamond", "0342190": "Camryn Grimes", "1813016": "Kendahl King", "0210855": "Vincent Duvall-DePasquale", "0454064": "Rachel Kimsey", "1914981": "Arne Starr"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison believes a supposed Good Samaritan raped and murdered a red-haired college student. Meanwhile, Allison may be pregnant and Ariel may be a math genius.", "Allison has a psychic dream about a man who seems to be threatening her daughter Ariel: someone who introduces himself as a Golem, a devil, a monster. Later dreams show that Ariel is standing in for a red-haired college-aged student named Sherona. And the Golem? Allison meets the man from her dream, but her boss, the district attorney, introduces him as a Good Samaritan: a man who reports a burglary he witnessed and makes himself available to appear in court. Allison knows he's evil and believes he's raped and murdered this Sherona, whom she's never met. Meanwhile, Allison may be pregnant. She's ambivalent about the possibility, but her husband Joe is happy and secretly hopes for a boy. He's even happier when Ariel seems to be a math genius, which would mean she is taking after him.—J. Spurlin", "When a good Samaritan shows up at the D.A.'s office to offer information on a recent burglary, Allison is convinced that he is a heinous serial killer of young women who has been haunting her dreams. In her effort to produce evidence against him, Allison tracks down a victim named Sharona who still appears very much alive. Meanwhile, Joe wonders if Allison's obsession with the suspected killer is due to the possibility that she is pregnant again.", "Allison dreams that a man who describes himself as the incarnation of evil has plans to kidnap her children. Soon after however, she is introduced to him by DA Devalos to that man, Jared Swanstrom, as a Good Samaritan who assisted the police in thwarting a burglary. When she shakes his hand, she gets a sense of deep foreboding and deep-seated evil. As her visions continue, she becomes convinced that he is responsible for the rape and murder of an attractive young redhead, among many others. When the DA can only find positive things in Swanstrom's background, she decides to launch her own investigation. Life at home becomes interesting for the Dubois' when Allison thinks she might be pregnant. Joe is thrilled by the idea but Allison isn't so sure. As well, Ariel, who hates math, may in fact have above average abilities in the subject. There's another explanation however.—garykmcd"], "genres": "N/A", "imdbID": "0645617", "rating": 7.7, "votes": 350, "number_of_episodes": 130}