{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0640970": "Conor O'Farrell", "0005272": "Thomas Ian Nicholas", "0806217": "Joey Slotnick", "1020036": "Alexandra Breckenridge", "0458136": "Scott Klace", "0687037": "Begonya Plaza", "0858493": "Ariana Thomas", "3329754": "Jeffrey Housepian", "0834927": "Kurt Strommer", "1668558": "Gus Lynch", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "0785193": "Jack Serino"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Allison knows there's more than mere suicide to the story of a girl who jumps off a cliff. Meanwhile, she predicts her husband's co-worker will have a fatal heart attack.", "Allison knows there's more than mere suicide to the story of a girl who jumps off a cliff. The girl's boyfriend is the son of a powerful lawyer, who is as bellicose with the district attorney as the son is cooperative. When the son's car proves to have been on the scene during the girl's death, Allison proves her mettle as an assistant to the DA by finding clues to this difficult mystery. Meanwhile, she predicts that her husband Joe's longtime co-worker is going to have a fatal heart attack. Should she tell her husband or not? If so, should Joe tell his co-worker?—J. Spurlin", "After Allison dreams of a young red-headed woman who throws herself off a cliff she manages to locate the body. To her surprise, the dead girl's boyfriend Greg turns out to be the son of Larry Watt, the lawyer Allison had sparred with in court the month before. Her dreams continue however and reveal what happened leading up to her decision to jump. Forensic evidence proves beyond any doubt that Greg's car was at the scene of the suicide but Allison is certain that Greg wasn't there. She's partly right but faces a few twists and turns before coming to the correct conclusion. Meanwhile, Allison has an ominous vision when she shakes hands with one of Joe's co-workers, Brett Carter. Joe dismisses her concerns but then realizes that she may be right.—garykmcd", "After Allison dreams about a young woman who commits suicide by jumping off a cliff, clues from the dream lead her to discover the body of a girl in a ravine. The crime is complicated when the dead girl's boyfriend, Gregg, turns out to be the son of defense attorney Larry Watt who had previously threatened to expose Allison's gift in court. While physical evidence implicates the senior Watt in the girl's death, Allison is convinced that the victim is trying to reveal the truth to her. Meanwhile, Joe is concerned about a colleague's health after Allison has a premonition.", "Allison investigates the supposed suicide of a girl who was dating DA Larry Watt's son Greg. When the girl's body is found in a ravine, new evidence is presented that implicates the defense attorney. Meanwhile, Joe is concerned about one of his colleagues after Allison has a premonition of the colleague having a heart attack.—Anonymous"], "genres": "N/A", "imdbID": "0645624", "rating": 7.6, "votes": 342, "number_of_episodes": 130}