{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0640970": "Conor O'Farrell", "0921746": "John Wesley", "0002604": "Robert Blanche", "0553269": "Margo Martindale", "0707152": "Lily Rains", "1577070": "Catherine Wadkins", "1301137": "Annabelle Milne", "0703419": "Maria Quiban", "1575921": "Obie Sims", "1828124": "Barbra Bolle", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "1753447": "Tracy Ann Doss", "1708210": "Tiger Mendez", "0825090": "Yvette Nelson", "2053706": "Alfred Soyyar", "0908204": "Seth T. Walker"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["When visiting another psychic, Allison is told that there is a dark cloud over her marriage and this has a snowball effect on Alison both at work and at and home.", "DA Devalos is prosecuting a local hood for the murder of a respected policeman. Allison has been dreaming about the policeman and knows where the murder weapon can be found. The defense attorney, Larry Watt, calls her as a witness, however, and both she now and Devalos are afraid she may have to reveal her abilities on the stand. Allison decides to take on Watt head on. Meanwhile, Allison is happy to learn from a fellow psychic that Joe's upcoming biopsy results will be negative. She has a vision of Joe caressing an attractive young woman. When Joe starts working late almost every evening with a consultant named Kelly, she imagined the worse.—garykmcd", "When Joe undergoes a medical procedure, Allison is very concerned and frustrated that her \"gift\" can't shed light on her husband's health. She consults Catherine, the psychic who befriended her in the pilot episode. Catherine reassures her about Joe's health, but warns Allison that she will face a crisis involving a third person. When Allison has a vision of Joe with a mystery woman, she becomes suspicious that he is having an affair. Meanwhile, Allison is conflicted about whether or not to lie about her \"gift\" on the stand in the murder trial of a wife killer whose victim she helped police find -- until Catherine comes to her aid, offering a unique solution.", "Allison has an extremely explicit dream where she makes love with husband Joe only to find herself winding up in a dead police officer's open casket, with Joe mysteriously out of sight. The dead officer has been told to give her a message about Joe: \"Australia.\" Allison wakes up to find the message's truth: Joe is sent for a biopsy for a mole on his back that used to be round, but is now black and shaped like the continent of Australia. She returns to Catherine, a psychic just like Allison, to heed her advice on her husband's health. To Allison's surprise his health is just fine; it's their marriage they need to look out for, and this scares Allison to point where she believes Joe's late evening work extensions are actually just to buy time so he can rendezvous with a secret admirer. She also battles with her conscience when Devalos asks her a favour to testify in the murder of the police officer she has been seeing in her dreams, but to remain discreet about her special abilities she has tying into her profession. She has the same debate with Joe, who insists Allison should agree with Devalos, believing exposing her gift will complicate their work and family life. She comes face to face with rival opponent Larry Watt, an attorney who comes close to destroying Allison in court. In the end everything behind Joe's secret admirer and their marriage being in trouble is revealed to be a misinterpretation by both Allison and Catherine."], "genres": "N/A", "imdbID": "0645621", "rating": 8.1, "votes": 380, "number_of_episodes": 130}