{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0340260": "Zach Grenier", "0480118": "Elizabeth Lackey", "0005120": "Wallace Langham", "0544067": "Michael Mantell", "0951471": "Grace Zabriskie", "0848237": "Victor Talmadge", "1812582": "Tina DiJoseph", "1813016": "Kendahl King", "1775160": "Samuel Monterroza", "0921975": "Caryn West", "1170394": "Jonathan Chase", "0264586": "Romeo Fabian", "1144504": "Nick Price", "1344970": "Nathan Price", "0312364": "Andy Geller", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "0908204": "Seth T. Walker"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["43"],  "plot": ["Allison's recurring dream of two young boys who are racing a train leads her to Professor Leonard Cardwell whose area of expertise is communication with the afterlife.", "Allison hasn't slept in days, always having the same recurring dream. She sees two young boys running along a dirt path racing to get across a railroad track in advance of an oncoming train. One makes it across the tracks in time but the other trips and falls. Her lack of sleep makes it impossible for her to function at the office and she seeks the advice of Professor Leonard Cardwell, someone she's met through a mutual friend and who studies psychic phenomena. When she tells him of her dream, he concludes she is a charlatan as the story of the two boys is his own, which he had told in a book he had published some years before. Her level of detail eventually convinces him that she's the real deal. When Allison sees a book in a bookstore with the same story, her dreams begin to make sense. At the office meanwhile, DA Develos seems to have an open and shut case when a 14 year-old boy confesses to murdering a pillar of the community. It's all too easy however.—garykmcd", "Allison's recurring dream of two young boys who are racing a train - only to become separated when one gets across the track and the other doesn't - leads her to Professor Leonard Cardwell whose area of expertise is communication with the afterlife. Meanwhile, D.A. Devalos enlists Allison's help with a 14-year-old confessed murderer who's confessed to a councilman's murder.—Anonymous"], "genres": "N/A", "imdbID": "0645634", "rating": 7.9, "votes": 350, "number_of_episodes": 130}