{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0190931": "David Cubitt", "0659048": "Kay Panabaker", "0431451": "Robert Joy", "0791968": "Mark Sheppard", "0421116": "Brent Jennings", "0586994": "Andy Milder", "0031679": "Cas Anvar", "0330477": "Nealla Gordon", "0562035": "Lenora May", "0599019": "Sumalee Montano", "0936895": "Roz Witt", "0364112": "Michele Harrell", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "0951838": "Lynnanne Zager"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Allison encounters a psychopathic doctor who raped and murdered numerous teenage girls years ago. After learning that an evil soul has been possessing people, she sets forth to stop it before a new victim is found.", "Allison has a dream about a teenage girl brutally murdered by her doctor, with a third person also being present at the murder. When Allison finds out about the identity of this mysterious man, she decides to meet a doctor who had been convicted of a very similar crime more than a decade before and is now under psychiatric supervision. Allison meets the girl whom she saw in her dreams in a place she would not have expected.—lil", "After Allison dreams about a doctor who rapes and then dissects a patient, she learns that just such a crime was committed nearly 15 years ago. The doctor in question, Kenneth Holloway, told of hearing voices and was committed to a mental institution. The doctor Allison dreamed about is definitely Holloway but the victim she saw is a different girl entirely named Elisha. There was another man present in her dream however. Allison has the sketch artist do a portrait of that man and Det. Lee Scanlon soon finds him: Dr. Charles \"The Butcher\" Walker of Witchita wanted for several murders but caught and lynched in 1902. Meanwhile, Ariel's math teacher requests a parent-teacher conference to tells Joe he thinks she cheated on a recent test. Allison sets hims straight.—garykmcd", "Allison encounters a psychopathic doctor who raped and murdered numerous teenage girls years ago. After learning that an evil soul (Mark Sheppard) has been possessing people, she sets forth to stop it before a new victim is found. Meanwhile, Ariel's math teacher accuses her of cheating and Joe steps up to her defense."], "genres": "N/A", "imdbID": "0645629", "rating": 7.9, "votes": 327, "number_of_episodes": 130}