{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0190931": "David Cubitt", "0593734": "Silas Weir Mitchell", "0120141": "Donna Bullock", "0804471": "Jon Sklaroff", "1813016": "Kendahl King", "1073603": "Paul Schackman", "0888556": "Sam Vance", "0558126": "Neal Matarazzo", "0444749": "Brandon Keener", "0135211": "Phe Caplan", "1715133": "Pia Artesona", "0908204": "Seth T. Walker", "1168761": "Dotan Baer"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["Allison is partnered with Detective Lee Scanlon on a case involving the strange murders of newlywed couples. Joe tries to plan a surprise party for Allison.", "Allison's dreams of a young man shooting his wife become all too real when the next day she finds herself at the scene of the crime. Also there is Det. Lee Scanlon, a police officer with a less than stellar reputation who has a personal interest in this type of killing and for good reason: his sister and her husband were also killed in what was ruled a murder suicide. He doesn't buy it however. He is sarcastic and dismissive when told about Allison's special abilities but she soon sets him straight. At home meanwhile, Joe pretends to be planning a birthday party hoping to surprise Allison with a special birthday gift. But can he fool someone who is always one step ahead of everyone?—garykmcd", "Allison has a dream of a husband and wife committing a murder/suicide. D.A. Devalos introduces her to a friend of his, Detective Lee Scanlon, who's sister and brother in-law's deaths were also ruled a murder/suicide, and sees a connection. After learning about Allison's methods of investigation, Scanlon decides he doesn't want her help.", "Allison has an eerie dream in which a marriage counselor encourages a young couple to commit a murder-suicide. These dreams begin to make sense when Allison and the D.A. realize they are on a case involving a serial killer who targets young newlyweds; in each scenario the husband is given the option to shoot his wife or else they will both be killed. With more and more support from her recently skeptical husband Joe and employer Devalos, Allison begins working with Detective Lee Scanlon, who is extremely outraged the Phoenix D.A.'s office is allowing somebody like Allison to collaborate her abilities on cases; not only does this drive Devalos and Allison's patience, but also Allison is shocked to find out one set of newlywed victims was Lee's sister and his brother-in-law. Meanwhile, Allison has dreams appearing to her in crime scene shots, which becomes strikingly relevant when Detective Lee Scanlon realizes the couples all used the same wedding photographer. In end, the wedding photographer turned out to be the serial killer. The episode concludes with Detective Lee Scanlon gaining more respect for what Allison does.", "When Allison dreams of a husband and wife's murder/suicide, she blames the dream on an episode of Maury Povich until D.A. Devalos introduces her to his friend, Detective Lee Scanlon. For two years, Scanlon has been trying to track down the person he believes murdered his sister and her husband whose deaths were ruled a murder/suicide. Devalos thinks that Alison may be able to help Scanlon, but once he learns about her gift, Scanlon reacts with anger and skepticism. When Allison's theories start to pan out, Scanlon begins to realize that her powers may in fact be real - and they may be able to stop the killer before he murders again."], "genres": "N/A", "imdbID": "0645613", "rating": 8.1, "votes": 381, "number_of_episodes": 130}