{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0397124": "Arliss Howard", "0190931": "David Cubitt", "0716277": "Phil Reeves", "1813016": "Kendahl King", "0558126": "Neal Matarazzo", "0639625": "John O'Brien", "1214507": "Reggie Jordan", "0376531": "Lyn Alicia Henderson", "0656005": "Saida Pagan", "0388847": "Christopher Hoffman", "0611894": "Randy Mulkey", "0573563": "Kelly McNair", "1925959": "Sarah Utterback", "1940459": "Zoë Simpson Dean", "0004273": "Joel Kramer", "2162584": "Madison Carabello", "1821033": "Miranda Carabello"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["After seeing Capt. Kenneth Push in a vision at a murder scene, Allison calls upon his assistance to find a serial killer. However, the only way Capt. Push can help is by literally putting his life on the line.", "Allison has difficulties balancing her work and private life. In her work, Captain Push tries to help her to find a serial killer, who leaves a Biblical citation at the scene of murder. The two are trying to find the link between the victims, while Allison's family life and Captain Push's health are at risk.—lil", "A serial killer is on the loose in Phoenix and Allison has been working long hours screening the many calls the D.A. and the police have been receiving. So far the victims have all been young women with red hair but when Allison visits the most recent crime scene, she has a vision of Capt. Kenneth Push of the Texas Rangers visiting a crime scene very similar to their own. Push is soon in Phoenix with a report that they had a string of killings very similar to these in his own area several years before. The murders inexplicably stopped but those crimes have all of the earmarks of the latest murders. Push is rushed to the hospital in the middle of the night and may have died at one point since his spirit visited Allison before he was revived. During his visit, he tells Allison that he knows who the killer is. At home meanwhile, Allison's long hours on the case is wearing thin with Joe who takes to sleeping alone on the couch.—garykmcd"], "genres": "N/A", "imdbID": "0645639", "rating": 8.1, "votes": 318, "number_of_episodes": 130}