{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0581810": "John Mese", "0480118": "Elizabeth Lackey", "0741891": "Romy Rosemont", "0005120": "Wallace Langham", "1490300": "Aisha Hinds", "0921746": "John Wesley", "0336489": "Bruce Gray", "0015951": "Alan Woolf", "0440191": "Sofia Karstens", "1813016": "Kendahl King", "0588484": "Howard S. Miller", "1556548": "Rebecca Metz", "0320234": "Bruno Gunn", "0248847": "John Eddins", "0154934": "Derk Cheetwood", "1828107": "Anna Maganini", "1828097": "Andrew Heald", "1510088": "B.W. Gonzalez", "0294322": "Reed Frerichs", "0646786": "Bruno Oliver", "2162584": "Madison Carabello", "1251390": "Heidemarie Fuentes", "2713558": "Chris Krauser", "2776210": "Kema Nikia"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["41"],  "plot": ["Phoenix District Attorney Manuel Devalos hires Allison at the DA's office. She is asked to help in a jury selection to help convict a killer.", "After some time has passed, Allison finally gets a call from DA Devalos who needs help with jury selection. His most recent jury advisor struck out on a major case when the judge declared a mistrial after the jury could not agree on a verdict. He admits that he doesn't understand what or how Allison does it but he wants her to look through the jury questionnaires on a case he has coming up. Allison is already familiar with the case of Ivan Kinetko - she dreamed about him - who is charged with killing women and then having sex with their corpses. Devalos invites her to court and gets the sentence he wanted - death by lethal injection. Allison continues dreaming however and she now fears that the wrong man may have convicted.—garykmcd", "Allison has sickening dreams revolving around a serial killer who practices necrophilia with his deceased victims. Meanwhile, Allison and Joe are invited to dine with friends where Allison foresees events as they really occurred as the wife of the other couple tells a story, testing Joe's patience when she tries to get him to believe in her special gifts. Back on the serial killer case, as Allison is in the process of gaining everyone's trust, she aids Devalos in an attempt to place the predator behind bars. With Allison's help, Devalos is able to select a jury that decides to give the serial killer the death penalty. By the end of the episode, Allison makes a shocking discovery when the man they've been searching for all along, the same man who confesses to the murders, is not the man who has been appearing in her dreams. It turns out the man Allison was seeing in her dreams as the serial killer was just a man on the cover of a menu at the restaurant Allison, Joe, and their friends had gone to earlier that week.", "Allison finally gets a call from her old boss, D.A. Devalos, who needs her help in selecting a jury who will return the death penalty for a twisted murderer/rapist. Initially, she is certain of her power to do good, but Allison suffers a crisis of confidence when she suspects she's put the wrong man on death row."], "genres": "N/A", "imdbID": "0645632", "rating": 7.6, "votes": 413, "number_of_episodes": 130}