{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0640970": "Conor O'Farrell", "0342881": "Harry Groener", "1887429": "Hayes MacArthur", "0660650": "Dempsey Pappion", "0682597": "Eric Pierpoint", "1812582": "Tina DiJoseph", "0223561": "Hari Dhillon", "0088225": "Troy Blendell", "1711124": "Jacory Gums", "0115297": "Jeanette Brox", "0777529": "Brian Schwary", "1813016": "Kendahl King", "0510469": "Sarah Lilly", "0015951": "Alan Woolf", "0242893": "Peggy Dunne", "1135961": "Reena Dutt", "0657903": "Jorge-Luis Pallo", "1720191": "Mary Strong", "0148401": "Troy A. Cephers", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "2415330": "Anselmo Martini", "0583245": "Kurt Meyer", "2183298": "Vitta Quinn", "2044276": "Kathleen Rippert"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Allison's vision of a murder could potentially derail Devalos' reelection campaign, and when Devalos keeps getting upstaged in court, it's up to Allison to find out the truth.", "District Attorney Manuel Devalos is up against his old nemesis Larry Watt who is defending a well-known college athlete against a charge that he drugged, raped and killed a college student. Devalos is certain the accused is guilty but Watt seems to be pulling information out of thin air and the Mayor has let it be known that while he wants Devalos on the ticket for the forthcoming election, there's no place for someone who is constantly being upstaged. Allison is puzzled by a woman seated directly behind the defense table and learns that Watt may have found his own psychic. At his own work meanwhile, Joe begins to wonder what a new microchip will be used for.—garykmcd", "A recurring dream of the DA's office staff being slaughtered makes Allison very jumpy at work, which doesn't help when Watt brings in a rival psychic to help defend his client. Meanwhile, for Joe, taking Bridgette to work with him turns out to be not all fun and crayons."], "genres": "N/A", "imdbID": "0645618", "rating": 7.7, "votes": 304, "number_of_episodes": 130}