{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0916050": "Chloe Webb", "0906031": "Natasha Gregson Wagner", "0027402": "Sam Anderson", "1785339": "Rami Malek", "0850335": "Barbara Tarbuck", "0174860": "Tim Conlon", "0960863": "Carson Elrod", "0301045": "Steven M. Gagnon", "0493881": "Loren Lazerine", "0842211": "Warren Sweeney", "1925959": "Sarah Utterback", "0882130": "Bonnie Urseth", "0018373": "Derick Alexander", "0493003": "Ronald William Lawrence", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "2045381": "Oriana Oppice", "1762924": "Athena Stamos", "1904329": "Holly Traister"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["43"],  "plot": ["Allison has dreams of a woman in a psychiatric facility who is claiming to be her.", "Allison has a recurring dream where she seems to relive the life of Beverley Waller, a woman who was committed to an insane asylum in 1959. The woman she sees in her dream claims to be Allison Dubois living in 2005. The woman is there not only for being delusional but for having killed her baby girl. As she learns more, it becomes obvious that Beverley has a secret and is protecting someone. Meanwhile, Allison has been working on a case with District Attorney Devalos where a young man who slaughtered his parents claims to have multiple personalities and therefore is not responsible for their death. All Allison can see of the case is a series of numbers which she thinks is a bank account, but isn't sure.—garykmcd", "Allison gets stuck in a dream loop, where she is a mental patient undergoing barbaric experimental treatment. When she investigates she finds that, in 1959, there was a patient called Beverley who claimed she was really Allison DuBois living in 2005. Allison has to work out why she is dreaming about Beverley and what it has to do with the murderer with schizophrenia she and the DA are prosecuting."], "genres": "N/A", "imdbID": "0645637", "rating": 8.4, "votes": 378, "number_of_episodes": 130}