{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0000208": "Molly Ringwald", "0050737": "Edoardo Ballerini", "0644750": "Randy Oglesby", "0946002": "Jamison Yang", "0333412": "Wayne Grace", "0745774": "Tahmus Rounds", "1967660": "Vernard 'Bone' Hampton", "0302740": "Frank Gallegos", "1696851": "Rachel Vacca", "2244913": "Michael Klock", "2162584": "Madison Carabello", "2554109": "Dan Walters"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Allison has visions of a faceless man breaking into the home of a woman. Joe feels pressure at work.", "Allison dreams about a red-headed woman who is visited by a ghost-like man in the night. She also attends a parole hearing for Sam Elkin who was convicted of murdering his girlfriend 5 years ago. He has always proclaimed his innocence but at this first parole hearing, he admits he is responsible. DA Devalos questions his sincerity but Allison realizes the similarity between Elkin and the man she saw in her dreams. When Allison finally tracks down the redhead, Kathleen Walsh, she learns that she is blind and has been repeatedly complaining to the police that she senses the presence of someone in her apartment. Allison thinks she's right and Kathleen bravely agrees to act as bait to trap the man. Joe meanwhile is under a lot of pressure at work. He's worried about a new hot-shot engineer, Edrick, but Allison's sense of the man is somewhat different.—garykmcd", "Allison repeatedly dreams about a woman who is being watched by a stranger in her bedroom who \"steals a kiss\" from her. Allison discovers a connection between the dream and an innocent man who is in jail for a murder someone else committed. Molly Ringwald guest stars in this episode as the victim, Kathleen Walsh.", "Alison's dreams about a woman being visiting in the night by what seems like a phantom lover become inter-twined with a report by a woman who hears noises in her apartment at night, and is frightened when she awakes to find a man kissing her. Meanwhile Alison accompanies her boss to a parole hearing during which she gets the impression one of the convicts was falsely convicted -- plus he has a link to the apartment in which the woman being stalked at night lives.—Ron Kerrigan <mvg@whidbey.com>"], "genres": "N/A", "imdbID": "0789527", "rating": 8.2, "votes": 328, "number_of_episodes": 130}