{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0037118": "Richmond Arquette", "0628120": "Jaime Ray Newman", "0183784": "Roma Chugani", "0111701": "Haynes Brooke", "1442257": "Channing Nichols", "0700072": "Willard E. Pugh", "0437632": "M.J. Kang", "1048319": "Jennifer Shon", "1495613": "Naja Hill", "1365359": "Meagan Moore", "0728136": "Stacie Rippy", "1654523": "Jensen Atwood", "1821033": "Miranda Carabello", "2112949": "McKenna Palmer"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Allison slips and has trouble remembering; a possibility is revealed as to how Allison sees what she sees. A man who has lost his memory may have been a prostitute murderer in the past.", "Allison hits her head and goes to the doctor to get an MRI. During the MRI examination of another patient, she sees a vision of him murdering several prostitutes. When she begins to investigate about one of the supposed victims, she finds herself in an awkward situation. In the meantime, Allison's MRI results let Joe create a theory of Allison's visionary power and he tries to persuade their daughters to each get MRIs to (dis)prove the theory.—lil", "After falling at home and bumping her head, Allison agrees to undergo an MRI to make sure she's okay. The MRI reveals that she's fine but that there is clearly a minor anomaly in her brain that is often associated with seeing things that aren't there or having hallucinations. Joe decides he wants to have all girls tested to see if they may have inherited their moms peculiar trait. While at the imaging center however, Allison meets David Saunders and has a waking dream where Saunders picks up prostitutes and kills them. She decides to investigate the disappearance of Jade, one of the girls she saw in her dream. She manages to track the woman down, alive and with a very interesting story tell.—garykmcd"], "genres": "N/A", "imdbID": "0645612", "rating": 7.8, "votes": 285, "number_of_episodes": 130}