{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0835722": "James Patrick Stuart", "0520234": "Kamala Lopez", "0949292": "Bellamy Young", "0921746": "John Wesley", "0387431": "Jan Hoag", "0818055": "Octavia Spencer", "0001074": "Ronny Cox", "0130210": "James T. Callahan", "0264714": "Elena Fabri", "1168106": "Emiliano Torres", "0363625": "John Harnagel", "1169405": "John Rubens", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "0910563": "Monnae Michaell"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["43"],  "plot": ["Joe serves his jury duty on a case against a man accused of murdering his rich wife. Allison starts having visions about the man but D.A. Devalos orders her not to work on the case because of a conflict of interests.", "Despite thinking he will not be picked, Joe has to go on jury duty on a case against Stephen Garner who is accused of murdering his rich wife. Allison starts having visions about the man but D.A. Devalos orders her not to work on the case because of a conflict of interests.—Anonymous", "Allison is having dreams about a man on trial for criminal negligence related to the death of his wife who, he claims, fell off their boat and presumably drowned while he was sound asleep. She can't do much about it however as husband Joe is serving on the jury and DA Devalos has assured the judge that she has not been working on the case. Devalos knows that his case is weak and the accused even has is father-in-law defending him and in full agreement with his story about what happened. Allison knows he is in fact somehow responsible for his wife's death and keeps dreaming and seeing a deer around some of the key participants in the case. Joe realizes there is more to the story than has been presented in court but the evidence gives the jury little to work on and face having to acquit him.—garykmcd"], "genres": "N/A", "imdbID": "0645623", "rating": 7.7, "votes": 285, "number_of_episodes": 130}