{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0000117": "Neve Campbell", "0000594": "Jason Priestley", "0343325": "Arye Gross", "0559977": "Dakin Matthews", "0048379": "David Aaron Baker", "1812582": "Tina DiJoseph", "1652316": "Katie Kreisler", "0520234": "Kamala Lopez", "0534140": "Katie MacNichol", "0125117": "Ron Butler", "1821033": "Miranda Carabello", "2641061": "Paula Fullerton", "2169212": "Chanda Hartman", "0574197": "Aaron McPherson", "1257922": "Dagmar Midcap", "2141246": "Rian Bishop", "2554989": "Michael Patrick Breen"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["44"],  "plot": ["Allison is involved in a murder trial, but things go terribly wrong when another body is found, Joe begins seeing a therapist, and a young woman asks Allison for confidences.", "Allison is constantly dreaming about Nathalie Paxton who was decapitated. Her husband Walter is currently on trial for her murder, all of which jibes with her dreams. Under pressure to make a deal with Paxton to make sure they get a conviction, DA Devalos is talked out of it by Allison who is convinced of his guilt. Paxton maintains his innocence, a fact that is reinforced when another woman is decapitated and her head replaced with that of Nathalie Paxton. Allison then dreams that the next victim is a young woman she has recently befriended, Debra. Joe has been trouble re-adjusting since the hostage taking and goes to see a therapist.—garykmcd", "Allison is confused when her dreams of a man murdering his wife keep occurring, even after she helped Devalos convince the jury of the suspected killer's guilt. Through her troubles she manages to make a new friend named Debra. Meanwhile, Joe is frustrated by the therapy sessions that his job enrolled him in, and can't express his feelings to Allison because the recent hostage situation he was in is still greatly affecting him."], "genres": "N/A", "imdbID": "1017797", "rating": 7.7, "votes": 267, "number_of_episodes": 130}