{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0000117": "Neve Campbell", "0343325": "Arye Gross", "0336489": "Bruce Gray", "0065418": "Gerry Becker", "0698763": "John Prosky", "1812582": "Tina DiJoseph", "0005177": "Howie Mandel", "0087293": "Lydia Blanco Garza", "1821033": "Miranda Carabello", "1974293": "Dre Slaman", "2646418": "James Chiariello", "1446934": "Katie Cleary", "1894916": "Aubrie Lemon", "2490653": "Ursula Mayes", "2393446": "Anya Monzikova", "0000594": "Jason Priestley"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["43"],  "plot": ["Devalos deals with the aftermath of the case, Joe is approached by a lawyer, and Allison makes the decision to confide in Debra.", "Allison is confused when her dreams of a man murdering his wife keep occurring, even after she helped Devalos convince the jury of the suspected killer's guilt. Through her troubles she manages to make a new friend named Debra. Meanwhile, Joe is frustrated by the therapy sessions that his job enrolled him in, and can't express his feelings to Allison because the recent hostage situation he was in is still greatly affecting him.—Anon", "The investigation of the murder of Walter Paxton's wife seems to indicate that a serial killer is on the loose. While helping with the case, Allison discovers that her new friend Debra may be the next victim and tries to protect her, only to find out that her new friend isn't who she thought she was. Meanwhile, Joe debates being part of a lawsuit against his longtime employer, Aerodytech.", "The investigation of the murder of Walter Paxton's wife continues, as it is now determined that a serial killer is on the loose. While helping Devalos and Scanlon with the case, Allison discovers that her new friend Debra is the next victim. Allison goes to great lengths to protect Debra, but it shocked to find that her new friend isn't who she thought she was. Meanwhile, Joe debates being part of a lawsuit against Aerodytech, the company he's been loyal to for years.—Anon", "Allison continues to dream about the Re-capitator as DA Devalos has to deal with the aftermath of the trial. She is befriended by P.D. McCall who, unbeknownst to her, is actually a national reporter trying to dig up dirt in the local DA's office. When Allison dreams that McCall is the next victim, she tells her of her psychic abilities and how she has assisted the DA in the past. Joe meanwhile has to decide whether to take a lawyer's offer to sue his employers in the aftermath of the hostage-taking incident. He is reluctant to do so but his boss' insistence that he sign a liability waiver before returning to work has him seriously considering the lawyer's option.—garykmcd"], "genres": "N/A", "imdbID": "1001943", "rating": 7.8, "votes": 265, "number_of_episodes": 130}