{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0001378": "Anjelica Huston", "0000834": "Kathy Baker", "0280355": "Paul Fitzgerald", "0789470": "Grant Shaud", "0698763": "John Prosky", "1812582": "Tina DiJoseph", "0251098": "Gretchen Egolf", "0336489": "Bruce Gray", "1409642": "Natalia Baron", "1181783": "Bret Loehr", "1821033": "Miranda Carabello", "1534037": "John Sloman", "2825382": "Steve Owsley", "0291620": "Emily Wing", "2950707": "Robert Maxhimer", "0182824": "John Cothran", "2169681": "January Welsh"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["41"],  "plot": ["Joe's mother Marjorie comes to visit, and a murder case reunites Allison, Devalos, and Detective Lee Scanlon.", "Soon after Ariel dreams of a woman who sets herself on fire, the mother of one of her classmates is killed in a house fire that the police believe was arson. Manuel Devalos asks Allison to assist him when the police question the woman's husband, Graham Stacey. Det. Lee Scanlon is the investigating officer. Private investigator Cynthia Keener asks Allison to look over some old cases. She has a dream about a young prostitute who is picked up by a dentist and who has now been missing for 9 months. Joe's mother agrees to lend them some money to help them out and she also comes for a visit. The ghost of Joe's father also stops in. Det. Scanlon is on the outs with his fellow police officers when he shows up for work when everyone else has the blue flu.—garykmcd", "When her mother-in-law Marjorie Dubois comes to visit, Allison learns the real reason why and struggles with her plea to not discuss it with Joe, the one person with whom she has no secrets. Meanwhile, Ameritips investigator Cynthia Keener hopes to nudge Allison's gifts to her open cases. Later, an arson-related murder brings Allison, Devalos and Scanlon back together in an unexpected manner."], "genres": "N/A", "imdbID": "1190031", "rating": 7.8, "votes": 247, "number_of_episodes": 130}