{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0900723": "Phong Atwood Vo", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0114578": "Roger Aaron Brown", "1851040": "James Immekus", "2926847": "Jacob Fishel", "1101083": "Sean Wing", "0807351": "Arjay Smith", "0004668": "Kevin Cooney", "0191600": "Barry Cullison", "0411857": "Gregory Itzin", "2330912": "Bryan T. Donovan", "2826362": "Laura Eichhorn", "2083743": "Lak Rana", "2554989": "Michael Patrick Breen", "2939878": "Christopher Jude", "2244284": "Lock Lee"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["As Manuel Devalos makes a run to reclaim his District Attorney seat, Allison has disturbing visions about his old friend and political ally Senator Jed Garrity's past.", "Devalos makes a bid to reclaim his old job. But Allison's dreams contain clues that his old friend and staunchest political ally, Senator Jed Garrity, is secretly embroiled in dark dealings that could harm her former boss's run at the D.A. office—memc@amazon.com", "Allison begins to have dreams about State Senator Jed Garrity, a friend and mentor of Manuel Devalos who is encouraging him to run again for DA. In her dream, the Senator is having dinner with a vagrant who is subsequently found dismembered. Garrity and the dead man knew each other from the their service in the Vietnam War but it is clear that he is hiding something when he claims not to have seen the dead man for many years which Allison knows to be false. Meanwhile, with their debts mounting, the Dubois' are receiving daily phone calls from their credit card company and Bridgette dreams that a call center employee will have his house broken into.—garykmcd", "Allison does her best to support Devalos' bid to reclaim the D.A.'s office, as her visions place his strongest political supporter and longtime friend Senator Jed Garrity in the center of a horrific conspiracy. Meanwhile, Bridgette has a dream about a persistent creditor, calling from a world away."], "genres": "N/A", "imdbID": "1134333", "rating": 7.4, "votes": 227, "number_of_episodes": 130}