{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0651159": "John Ortiz", "0959242": "José Zúñiga", "0522479": "Deirdre Lovejoy", "0276691": "Efrain Figueroa", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "2436652": "German Santiago", "0173011": "Vivis Colombetti", "1591332": "Chris Bresky", "2052977": "Toni Torres", "0008650": "Don Abernathy", "2939724": "Massi Furlan", "2878069": "Anthony Ledesma", "2210588": "Jamie McCall", "0818885": "Chris Spinelli"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison dreams of a future where an unfamiliar man is comforting her after the loss of her entire family.", "Allison is terrified by dreams of the future which suggest her family is going to be murdered by an assassin of the Mexican drug cartels, and begins working with a DEA agent after the murder of an undercover officer, which had been part of those dreams. But she also learns that she may be experiencing her last dreams, due to a brain tumor which threatens to cut short the investigation.—scgary66", "Allison dreams of a future where an unfamiliar man is comforting her after the loss of her entire family. She later meets the same unfamiliar man in her waking life while investigating a case and thus fears her awful dream will soon come true. After headaches and other symptoms, Allison is diagnosed with a brain tumor. She postpones her surgery to continue dreaming, getting information leading to the arrest her family's \"killer\" before they are killed. The surgery delay results in a stroke, which despite the successful surgery, leaves her comatose. The season ends with doubts about her survival.", "Allison is in a panic when she dreams that she is visited by a man on the one year anniversary of her entire family being killed. She's soon on a case where she meets DEA agent Daniel Munos, the man she dreamed about. The Mexican drug cartel wars are spilling over into the US and this particular group is targeting the families of their opponents. In fact, Daniel's wife was killed by them some weeks before. Allison desperately wants Joe and the girls to leave town, but he flatly refuses to do so. As Allison's dreams continue, she gets a clearer picture of exactly what is happening and who is responsible. When she collapses at work, she is rushed to the hospital where she learns some rather startling news.—garykmcd"], "genres": "N/A", "imdbID": "1434494", "rating": 8.6, "votes": 304, "number_of_episodes": 130}