{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0064015": "Allyce Beasley", "0574460": "Shane McRae", "0245650": "Cameron Dye", "0308606": "Willie Garson", "1812582": "Tina DiJoseph", "0544913": "Ron Marasco", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "0210915": "Starletta DuPois", "0807418": "Bee-Be Smith", "1192354": "Catherine O'Connor", "0305450": "Ted Garcia", "0909668": "Jack Walsh", "1492218": "Ali Boudiaf", "3124044": "Evie Hammer", "1833934": "Tina Mayer"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison dreams about and then meets a quirky bank teller, Mrs. Boddicker who apparently predicted her bank's recent robbery. Meanwhile, Joe's new job in San Diego puts a strain on the family and Allison must learn to cope in his absence.", "Allison has a dream in which a bank teller correctly predicts a robbery, which the teller attributes to a dream of her own. But when the robbery actually happens, Allison begins to wonder why their dreams don't always agree. Meanwhile, trusting Ariel with his car proves stressful as Joe begins commuting to San Diego.—scgary66", "Allison dreams of a bank teller, Ruth Boddicker, who claims to have herself dreamed about an upcoming bank robbery. When the robbery occurs, it becomes public that she had told he manager earlier that day that it was about to happen. When she subsequently phones the police to say she has dreamed about the location of the body of one of the bank robbers, it seems that there are two psychics in Phoenix available to help the police with their enquiries. As Allison's dreams continues however, it seems there is another explanation. Joe has his first week commuting to San Diego and agrees that 16 year-old Ariel can use his car while he's away. Unfortunately, 11 year-old Bridgette also decides to take a turn behind the wheel. Det. Lee Scanlon has difficulty dealing with impending fatherhood and is forced to deal with hos own childhood demons.—garykmcd"], "genres": "N/A", "imdbID": "1365283", "rating": 7.8, "votes": 223, "number_of_episodes": 130}