{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0001630": "Tracy Pollan", "0236495": "Shawn Doyle", "1812582": "Tina DiJoseph", "0171052": "Holliston Coleman", "0565611": "Johnathan McClain", "0058692": "Paul Bartholomew", "2097035": "Annamarie Kenoyer", "3467214": "Jennifer Schwary", "2162584": "Madison Carabello", "1821033": "Miranda Carabello", "2195002": "Brooke Mackenzie", "1133651": "Ben Feldman", "0150326": "Erin Chambers", "0572125": "Rod McLachlan", "0001556": "David Morse", "1133846": "Jennifer Carta", "3155077": "Stephanie Drapeau", "3622222": "Alex Rose Wiesel"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison is recruited by a Fortune 500 company to predict business trends. However, she continues to dream about a case she was working on in the DA's office.", "The morning after Allison dreams she and Joe and the girls are living in fancy house - where she goes into a forbidden room and sees a body of a young woman slashed and blood-soaked - she gets a call from Caitlyn Lynch of the Lydecker Corporation asking to meet her. Lydecker wants to offer her a job that is right up her alley - all she has to do is give them exclusively her thoughts or feelings for various products. She's genuinely torn at leaving the DA's office but the money she's offered is such that she has no choice but to give it a try. Her first task is to look through Lydecker employee files and pass on any feelings she may sense from them. She does identify one file that gives her a strange feeling - that of the son of Mr.Lydecker, the company's owner. Despite changing jobs, she's still dreaming about the dead girl and passing information to Det. Scanlon and DA Devalos, something Mr. Lydecker tells her in no uncertain terms is unacceptable. What she she does dream is that a police detective may be involved in the murder along with another familiar face.—garykmcd"], "genres": "N/A", "imdbID": "1365279", "rating": 8.1, "votes": 242, "number_of_episodes": 130}