{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0521974": "Todd Louiso", "0924154": "Shea Whigham", "2201055": "Hayley McFarland", "2646861": "Emily Swallow", "0542492": "Rizwan Manji", "1838568": "Robert Christopher Riley", "0697650": "Faith Prince", "2097035": "Annamarie Kenoyer", "1821033": "Miranda Carabello", "0743404": "Franc Ross", "3227993": "Nija Okoro", "3671616": "Adam Monley", "2995584": "Lindsay Atwood", "3671468": "Luis Augusto Figueroa", "0969328": "Pilar Holland", "2377762": "Lourdes Nadres", "3640029": "Eric Naroyan"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["41"],  "plot": ["When Allison's car is wrecked, the SUV she rents turns out to have some unusual features, including a satellite radio that allows her to hear other people's conversations.", "After an accident at Ariel's school where another student drives into Allison's parked station wagon, she has to rent a car until it's repaired. Det. Lee Scanlon asks for her help in deciphering the meaning of blast marks they've found in the desert near a power plant. In a vision, she sees someone apparently testing an explosive device but has little else to offer. She's enjoying her fancy SUV with all of its gadgets but is taken aback when through the car's sound system, she can hear conversations in the vehicles around her. One of those involves a man who is obviously being abducted at gunpoint, but she loses them in traffic. When she dreams that night that a man will walk into a bank wearing a bomb-laden vest, it all starts to come together. The crime is not as simple as it first seems however. At school meanwhile, Ariel realizes that the facts don't support the story about the car accident and the consequences it may have for the student involved.—garykmcd", "When Allison's car is wrecked, the SUV she rents turns out to have some unusual features, including a satellite radio that allows her to hear other people's conversations.—CBS Publicity"], "genres": "N/A", "imdbID": "1510475", "rating": 7.8, "votes": 228, "number_of_episodes": 130}