{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "1354503": "Abby Brammell", "0927382": "Christopher Wiehl", "0034733": "Yancey Arias", "0022161": "Daniella Alonso", "1146051": "Khary Payton", "1812582": "Tina DiJoseph", "1821033": "Miranda Carabello", "0937756": "Gary Wolf", "0320931": "François Giroday", "1948581": "Harley Graham", "1966321": "Kofi Natei"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison becomes obsessed with rescuing the 11-month-old son of Dana and Scott Carlow, and ultimately becomes so fixated on the child that she kidnaps him.", "Allison becomes obsessed with rescuing the 11-month-old son of Dana and Scott Carlow, and ultimately becomes so fixated on the child that she kidnaps him. Meanwhile, Bridgette starts to study the clarinet, until Marie turns out to be a prodigy.", "When Allison investigates an infant's kidnapping, Joe worries when she becomes too attached to the little boy. Also, Bridgette and Joe are amazed when Marie plays the clarinet perfectly without one lesson while Bridgette struggles to learn to play.—CBS Publicity", "Allison has babies on her mind, including her own when she dreams that her girls are infants again. She and detective Scanlon are soon investigating the apparent kidnapping of a baby boy by a family's domestic, Elizabeth Torres. Her dreams lead her to find the little boy but Allison isn't at all comfortable with the mother's reaction and begins to suspect that something is amiss. Allison becomes so attached to the child that she actually kidnaps him to protect him and ends up under arrest. Meanwhile, Bridgette is struggling with her clarinet lessons and is quite put out when Marie picks up the instrument and is playing a tune like a pro.—garykmcd"], "genres": "N/A", "imdbID": "1508123", "rating": 7.2, "votes": 233, "number_of_episodes": 130}