{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0566489": "Will McCormack", "0366509": "Roxanne Hart", "1371941": "Olivia Sandoval", "0941796": "Rick Worthy", "0764430": "Carlos Sanz", "0335275": "Beth Grant", "2162584": "Madison Carabello", "2266718": "Erin Raftery", "3842084": "Leslie Gunning"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["41"],  "plot": ["As the anniversary of Devalos' daughter's death come to pass, Devalos is haunted by memories of the traumatic event.", "The anniversary of his daughter's death re-opens old wounds for Devalos, but Allison's dreams and other clues could lead to the girl's true reasons for her actions. Also, Bridgette meets an interesting character while working at the library.—CBS Publicity", "As the anniversary of Devalos' daughter's death come to pass, Devalos is haunted by memories of the traumatic event. This is exacerbated by the presence of a mysterious letter that appears in Devalos' mailbox. Meanwhile, Allison has dreams of Devalos' earlier days as a defense attorney and the morally ambiguous measures he once took against a client.", "On the anniversary of his daughter Arianna's suicide, DA Devalos receives an anonymous Happy Anniversary card with her obituary enclosed. Allison thinks she may have seen, or possibly dreamed of, the man who put the card in the Devalos' mailbox. It turns out to be William Gerwin, someone Devalos unsuccessfully defended when he was accused of rape. Now out on parole, Gerwin denies having anything to do with the card but Allison's dreams reveal otherwise. They also reveal some potentially unethical conduct on Devalos' part. Bridgette meanwhile has to pay a year's worth of library fines and ends up working at the library to make up her debt. There she meets a Nigerian prince who, despite her father's advice to the contrary, she believes to be genuine. She also helps someone send an e-mail, a message that is directly related to the Devalos case.—garykmcd"], "genres": "N/A", "imdbID": "1583633", "rating": 8.0, "votes": 233, "number_of_episodes": 130}