{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0004912": "Oded Fehr", "0420646": "Eddie Jemison", "1466049": "Graham Shiels", "0000588": "Martha Plimpton", "0569226": "Bruce McGill", "1821033": "Miranda Carabello", "0051930": "Vivian Bang", "0316723": "Reedy Gibbs", "0067472": "Pamela Bel Anu", "0438188": "Ameenah Kaplan", "2292253": "Evis Xheneti"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["43"],  "plot": ["A cancer-stricken friend of Allison's dies suddenly, leading her to suspect the woman's illness did not kill her, and that a hospital's doctor is to blame.", "A cancer-stricken friend of Allison's dies suddenly, leading her to suspect the woman's illness did not kill her and that a hospital staffer is to blame. And, Joe takes cues from a story Bridgette wrote when it eerily echoes his latest job interview.—- courtesy of CBS Press", "Allison dreams about the doctor who, unbeknown to her, saved her life when she has an adverse reaction to a new medication while in a coma in the hospital. She sees him there while visiting her cancer-stricken friend Rosemary and thanks him for what he did but soon she's dreaming about him and other events at the hospital. After Rosemary dies she dreams of a nurse acting suspiciously in her room and begins to wonder if her sick friend died of natural causes. Joe meanwhile has a job interview and meets a fellow candidate for the position, Willem, who has been out of work for some time. When daughter Brigitte starts dreaming about an astronaut with the same name, it doesn't take an aeronautical engineer to figure what is going on.—garykmcd", "A cancer-stricken friend of Allison's dies suddenly, leading her to suspect the woman's illness did not kill her, and that a hospital's doctor is to blame. Elsewhere, Joe takes cues from a story Bridgette wrote when it eerily echoes his latest job interview."], "genres": "N/A", "imdbID": "1510471", "rating": 7.5, "votes": 218, "number_of_episodes": 130}