{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "1032567": "Pablo Schreiber", "1422176": "Jess Weixler", "0601376": "Joel David Moore", "1773268": "Alexie Gilmore", "0308208": "Spencer Garrett", "2411031": "Brian Avers", "1821033": "Miranda Carabello", "1125932": "Alejandro Furth", "0305450": "Ted Garcia", "1285405": "Megan Henderson", "1508902": "Jaimi Paige", "3228976": "Thomas Hoffman", "0813157": "Michael Sollenberger"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["The police hunt a serial murderer, dubbed the \"penny jar killer\" because dead bodies are left at the scene of fresh kidnappings.", "The police hunt a serial killer targeting innocent women, but when the prime suspect dies, his ghost contacts Allison to clear his name, contact his girlfriend and maybe help the investigation. Also, Joe's boss asks him to critique his new novel.—CBS Publicity", "The police are on the trail of a serial killer and Allison's suspicions result in the death of a suspect. She sees Jeremy Kiernan loitering near a house she dreamed about but when the police approach him he runs off, right into the path of an oncoming car. The police put his running off to the fact that he had a marijuana joint on him and panicked. Allison however now has to deal with his ghost who wants her to let his girlfriend, Mandy Sutton, know how much he loved her and that he was going to ask her to marry him. As her dreams continue however, the situation becomes ever more complicated. Meanwhile, Joe's socially inept boss asks him for a big favor - to read his novel and give him his opinion of it. Joe's not quite sure what to make of it but it it's also performance review time and he can't help but wonder if the two events are connected.—garykmcd", "The police hunt a serial murderer, dubbed the \"penny jar killer\" because dead bodies are left at the scene of fresh kidnappings. When the primary suspect dies, his ghost contacts Allison to clear his name and communicate with his girlfriend. Allison reluctantly complies hoping the ghost will help her with the case. Meanwhile, Joe's boss asks him to critique his debut novel's 900+ page manuscript."], "genres": "N/A", "imdbID": "1570178", "rating": 7.7, "votes": 216, "number_of_episodes": 130}