{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "1910255": "Dylan Minnette", "0415070": "Carlos Jacott", "0802831": "Tony Sirico", "0404924": "Michael Hyatt", "0910145": "Tracey Walter", "1821033": "Miranda Carabello", "0085494": "Royana Black", "1528456": "Tom Schmid", "1042946": "Michael Patrick McGill", "2933233": "Aurelius DiBarsanti", "0475836": "Emily Kuroda"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["60"],  "plot": ["A missing homeless man is featured in the dreams of Allison and Bridgette that results in the two switching bodies, sending Allison to school and Bridgette to the office.", "Allison is approached by Gary Durant who wants something done about the harassment directed at his elderly father. Someone has been posting videotapes of the old man, now a street person, performing humiliating acts for a few dollars. Both Allison and Bridgette dream about him but are soon having their own 'Freaky Friday' of sorts when they wake up to find that they are inhabiting the other's body. As a result they have an interesting few days where Allison goes to school and Bridgette goes to the office. Their dreams reveal more of the mystery about Durant's father but when the old man is killed, Allison believes there is another solution to the murder.—garykmcd", "A missing homeless man is featured in the dreams of Allison and Bridgette that results in the two switching bodies, sending Allison to school and Bridgette to the office. When the homeless man is murdered, Allison and Bridgette soon realize they were swapped for a reason and must put the pieces of the case together to swap back.", "When they have the same dream about a missing homeless man who is the subject of Allison's most recent case, Bridgette and Allison swap personalities, causing mayhem at home, at school and with the investigation.—CBS Publicity"], "genres": "N/A", "imdbID": "1683232", "rating": 7.9, "votes": 274, "number_of_episodes": 130}