{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0000274": "David Arquette", "0095516": "Lesley Boone", "0846834": "Jayne Taini", "0649386": "Ron Orbach", "0716817": "Lee Reherman", "0001278": "John Glover", "2162584": "Madison Carabello", "0571578": "Matt McKenzie", "2459333": "Ruby Lewis", "4098926": "Philippe Badreau", "2587676": "Jeremy Clark", "3109384": "Fatimah Hassan", "2286882": "Lissa Lauria"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["A dream causes Allison to become suspicious of her brother's recent success. Meanwhile, Devalos' campaign manager takes an interest in Bridgette's abilities.", "Allison dreams about her brother Michael being down and out and talked out of jumping off a bridge by an unknown individual. When she contacts him the next day however, he's more than fine and is actually on his way to Phoenix to see her. Well dressed and looking great, he's been working quite successfully for a year as a pharmaceutical sales rep. He claims to owe his turnaround to a book written by the now deceased Carson Churchill. As her dreams continue however, Allison realizes that Michael has actually made a pact with Chrchill's spirit, one that is resulting in several deaths. Manuel Devalos' run for mayor isn't going very well with one of his opponents is scoring points with negative ads. Manuel's campaign manager, Justine Goderich, wants to use Allison to get some dirt on his opponent but when the DA flatly refuses, she turns to the next best thing.—garykmcd", "Allison's dream arouses suspicion regarding her brother Michael (David Arquette replaced Ryan Hurst who played Michael in seasons 1-3 due to unavailability), who tries to kill himself, but when she calls him the next day, she finds out he's traveling to Phoenix for business. Bridgette's abilities pique the interest of Devalos's campaign manager who has a shady past, which leads to Devalos firing her."], "genres": "N/A", "imdbID": "1683234", "rating": 7.4, "votes": 203, "number_of_episodes": 130}