{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0639928": "Brían F. O'Byrne", "0397788": "Brian Howe", "1250791": "Sterling K. Brown", "0048755": "Max Baker", "2796384": "Abbie Cobb", "0000624": "Laura San Giacomo", "0683379": "Mitch Pileggi", "2162584": "Madison Carabello", "0552232": "Ed Francis Martin", "0081031": "Melissa Bickerton", "2088348": "Tom Hornof", "0217086": "Yolanda Lloyd Delgado", "3914078": "Tyler Champagne", "3796087": "Yanellie Ireland"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["When a convicted sex offender moves into Allison's area, her neighbors are up in arms, but Allison's visions leave her questioning his guilt. Also, a potential career opportunity for Joe puts his and Allison's professional goals at odds.", "Allison and Joe are concerned when they learn that a convicted rapist, Clark Kerwin, moves into the neighborhood. They aren't the only ones concerned as their neighbors begin to organize to take action. Someone doesn't wait however and throws a rock through his living room window. Allison's dreams however begin to show that Kerwin, a onetime teacher who was accused of raping one of his students, may have been falsely convicted. When a neighborhood teenager is killed and the evidence points to Kerwin, Allison isn't convinced he's responsible. Joe meanwhile gets an interesting offer from his boss: get an executive MBA on his own time and he will get a senior management position in the firm. Allison still plans on going to law school but they may not be able to afford tuition for both of them.—garykmcd", "Allison's visions about a convicted sex offender named Clark who moves into her neighborhood have her questioning his guilt. When neighbors try to get Clark out of the neighborhood, a 16-year-old girl is found dead. When the evidence seems to point to Clark, he takes his own life believing he will be charged with the murder. Allison uncovers the truth and finds out who really did it."], "genres": "N/A", "imdbID": "1683247", "rating": 7.6, "votes": 214, "number_of_episodes": 130}