{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0000892": "Jason Beghe", "0366509": "Roxanne Hart", "0190550": "Suzanne Cryer", "1812582": "Tina DiJoseph", "2373827": "Rob Mayes", "0326988": "Carlos Gómez", "1534182": "Samantha Droke", "1177880": "Benjamin Byron Davis", "2548854": "Greg Felden", "1960207": "Bernardo De Paula", "3485972": "Nicholas Logan", "4103005": "Ross Philips", "0786537": "Bill Seward", "0820638": "Gina St. John", "1341051": "Merrell Molly"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["A series of mysterious fire-related deaths may be tied to Allison's dreams of a blaze in which a girl is trapped in a burning building.", "Allison dreams of a teenage girl caught in a room with a fire raging around her. In her second dream she sees the girl being saved by a fireman and so relaxes a bit. In her third dream however, she sees the same fireman receiving a large amount of money to kill someone, who just happens to be DA Manuel Devalos' principal witness against a major drug dealer. When the witness dies in a hotel fire, Allison thinks the fireman may have killed the girl as well. She isn't quite ready when she learns the relationship between the two. Yet another dream explains it all. Devalos thinks of running for Mayor of Phoenix but is worried that his opponent will go to any lengths to win. With the possibility of Manny leaving and with a younger generation starting to work as Assistant DA's, Allison makes a major decision about her future.—garykmcd", "A series of mysterious fire-related deaths may be tied to Allison's dreams of a blaze in which a girl is trapped in a burning building. Allison must also think about where her professional career is headed as Devalos starts thinking seriously about running for mayor against a family friend.", "Allison's dreams of a woman trapped in a blaze could provide crucial leads to a series of mysterious fire-related deaths. Also, as Devalos contemplates running for mayor, Allison ponders her own professional future.—NBC Publicity"], "genres": "N/A", "imdbID": "1683246", "rating": 7.2, "votes": 185, "number_of_episodes": 130}