{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0001344": "Gregg Henry", "0322182": "Matthew Glave", "0889198": "Marc Vann", "1812582": "Tina DiJoseph", "0003986": "Stan Egi", "0278877": "Don Fischer", "1821033": "Miranda Carabello", "2081916": "Katherine Sigismund", "3117202": "Teri Reeves", "0044489": "Candice Azzara", "0308368": "Mary Garripoli"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["When Allison gets a skin graft on her hand after a burn, she is puzzled when the same hand acts with a mind of its own, gesturing uncontrollably. Also, Bridgette keeps her real role on the soccer team a secret from her parents.", "After Allison has a skin graft on her left hand after a kitchen accident, it begins to act rather oddly. Her hand will grab onto people or objects, including the television remote control where is will constantly change channels. At the same time she is having dreams about a young woman, a doctor, who is assaulted and put into the trunk of a car. She eventually concludes that the skin graft she has received came from the dead woman but how to prove that her hospital colleague is responsible for the young woman's murder is the puzzle Allison has to solve. Bridgette meanwhile seems to have become a soccer star all of a sudden. She hasn't told her parents about her sudden success - they think she is the team's equipment manager - and for good reason since she is actually receiving ghostly coaching.—garykmcd", "Allison burns her hand in the kitchen requiring a skin graft. After surgery, she finds that the hand has a mind of its own, which ties her into a case involving a missing woman named Monica who had uncovered an illegal tissue donor operation. Meanwhile, Bridgette isn't telling her parents the whole truth about her involvement on the school soccer team."], "genres": "N/A", "imdbID": "1750816", "rating": 7.3, "votes": 203, "number_of_episodes": 130}