{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0000834": "Kathy Baker", "1654778": "Raúl Esparza", "0336489": "Bruce Gray", "0338768": "H. Richard Greene", "0035079": "Matthew Arkin", "1821033": "Miranda Carabello", "0376909": "Aaron Hendry", "3977627": "Hunter Seagroves", "1085953": "Logan Lipton", "1456412": "Thomas Blake Jr.", "1028401": "James Budig", "3677206": "Michelle Diaz", "0993671": "Lisa Ross", "4041492": "Leon 'Lee' Fuller", "2377762": "Lourdes Nadres", "3907661": "Haref Topete"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison dreams of a murder about a man who is struck by a train. When a man is killed just like in her dream, Allison is convinced it's a homicide.", "The police are investigating the death of a man who fell, or was pushed, in front of a commuter train. There were no witnesses and the only thing other commuters remember was a street person who reeked of urine but no one can really remember what he looked like. At the scene, Allison has a vision of the body with a fast food name tag on his lapel but as Det. Lee Scanlon points out the man is wearing a suit and looks a bit too old to be someone who worked in a burger joint. He's eventually identified as Adam Talmadge but they find little else. When Allison dreams of a woman being pushed in front of a train by the same homeless man, they search for a connection between them. Joe meanwhile has to travel to Minnesota when Allison dreams that his mother is severely ill. His mother refuses to accept the fact she will die based on the fact that Allison had told her some years before that she would be at Bridgette's college graduation.—garykmcd", "Allison dreams of a murder about a man who is struck by a train. When a man is killed just like in her dream, Allison is convinced it's a homicide. Meanwhile, Joe has difficulty handling his mother's cancer diagnosis. Allison urges Joe to visit his mother in the hospital where he discovers she's dying but has no will. She believes she will recover because of something Allison told her in the past, but Joe tells her that Allison lied to give her hope, and she creates a will before she dies.", "After a man is struck by a train, Allison's dream foreshadowing a similar murder assures her that it was a homicide. Meanwhile, Joe has a hard time dealing with his mother's diagnosis.—NBC Publicity"], "genres": "N/A", "imdbID": "1683233", "rating": 7.5, "votes": 192, "number_of_episodes": 130}