{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0006663": "Enrique Murciano", "0058372": "Roger Bart", "1812582": "Tina DiJoseph", "1199888": "Sasha Pieterse", "0759229": "Gabriel Salvador", "0460990": "Lily Knight", "1658427": "Charlie Koznick", "0809894": "Scott Alan Smith", "0889846": "Jacob Vargas", "2162584": "Madison Carabello", "0091227": "J. Paul Boehmer", "2084644": "Geno Monteiro", "0651075": "Arianna Ortiz", "0820638": "Gina St. John", "1763179": "Kaiyana Rain", "3483528": "Jeffrey T Ferguson", "0516804": "Tammy Locke", "1704368": "CC Perkinson", "1222064": "George F. Watson"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["43"],  "plot": ["When Allison becomes a lawyer and Joe starts a new job, the Dubois family is forever changed.", "On his way home home from a business trip to Hawaii, Joe calls Allison to let her know what time he's arriving. He never makes it however. Flash-forward to seven years in the future, Allison is a successful Assistant District Attorney working as second chair prosecuting a major drug dealer, Luis Amenabar. She's raised the girls on her own and has done a good job. Ariel is now married and will soon have a baby; Bridgette is going to college; and Marie is now a teenager. It all begins to change when she dreams that Joe survived the plane crash and has suffered memory loss. He's tied into Amenabar somehow and she sets out to find him. Not everything is as it first seems however.—garykmcd", "In the series finale, Allison has to delve through her dreams one final time after Joe dies in an airplane crash. She's actually woken up by the phone ringing, Joe should be arriving earlier than planned, he tells her. Then, turbulences occur, and Allison witnesses the plane's going down, and Joe's death over the phone, with a dramatic final 'I love you Allison, with all my heart' as the plane plunges. Seven years later and at last a successful lawyer, and the DA's first assistant, Allison must confront a drug smuggler who seemingly orders the death of the new DA during his prosecution, forcing Mayor Manuel Devalos to keep Allison from destroying her own career when her dreams and the criminal suggest that Joe has been alive all along. But Allison's dream is in fact false, or to be precise, all the flashforward 7 years into the future is actually a dream of what can happen, given to Allison by Joe himself. She wakes up in the present, when the dream within a dream finally awakens her, by the voice of Joe, instead of the phone ringing. We are left to believe that the final call from Joe was part of the whole dream, too, though nothing is completely ascertained in that regard. Allison turns around in her bed, imagining she'll find Joe by her side, but only to find Joe's ghost talking to her. He tells her that he in fact did die in the plane crash. He tells her that he wanted to make her dream of how things could be without him, but that even in the dream, she wanted so bad that he'd still be alive, that she in fact 'took back the control' over the dream, and invented the case about the drug smuggler, and the beach in Mexico, and Joe surviving the crash. He tells her to accept his absence, that she has to let go. Then he moves back, and disappears, leaving Allison crying and pleading. We then jump 41 years into the future, in the year 2052, where an elderly Allison is living in a retirement home and is listening to her great granddaughter leave her a message on her answering machine. Minutes later, Allison passes away. She is then shown to be reuniting with Joe in the way she looked 41 years prior."], "genres": "N/A", "imdbID": "1683236", "rating": 6.7, "votes": 469, "number_of_episodes": 130}