{"cast": {"0000099": "Patricia Arquette", "0762153": "Miguel Sandoval", "0190931": "David Cubitt", "1100839": "Sofia Vassilieva", "1833884": "Maria Lark", "0916617": "Jake Weber", "0721332": "Judy Reyes", "0812133": "Rena Sofer", "0916406": "Mark Webber", "1821033": "Miranda Carabello", "0282847": "Jesse James Youngblood", "0565647": "Zahn McClarnon", "3083465": "Stevens Gaston", "4558598": "Gene G. Miller", "2377762": "Lourdes Nadres"}, "geners": ["Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["Allison suddenly is unable to understand spoken English when she wakes up after having a dream involving a Navajo Indian being burned to death by a man in a flameproof suit.", "Allison wakes up unable to understand a word anyone says. She can speak and be understood by everyone but when they speak, all she hears is gibberish. That is until she overhears a woman, Jane Livingston, speaking on a cellphone. Allison can understand her perfectly but Jane isn't speaking English but Navajo. She and Jane soon form a friendship with Jane acting as her interpreter. Her knowledge of the the Navajo community also comes in handy as Allison has had two dreams where Navajo men were killed by someone searching for something. Her dreams don't reveal all however. As for Joe Dubois, Allison's latest bout of weirdness is one too many and he finds it very difficult to be the understanding husband.—garykmcd", "Allison suddenly is unable to understand spoken English when she wakes up after having a dream involving a Navajo Indian being burned to death by a man in a flameproof suit. This results in her developing a friendship with a linguist named Jane (Judy Reyes) who translates for her. The situation tries Joe's patience as he thinks about how many strange situations he's had to put up with during their marriage.", "Suddenly unable to understand the spoken word, Allison's marriage shows signs of strain and she develops an unexpected friendship with a linguist. Unable to communicate with his wife, Joe reaches the limits of his patience being married to a woman who is a slave to her visions.—CBS Publicity"], "genres": "N/A", "imdbID": "1683245", "rating": 7.4, "votes": 204, "number_of_episodes": 130}