{"cast": {"1416900": "Shantel VanSanten", "0604430": "Diogo Morgado", "1238555": "JD Pardo", "1525807": "Joel Courtney", "4151820": "Jon Fletcher", "3733763": "Sofia Black-D'Elia", "2325865": "Craig Frank", "2993012": "Anna Diop", "5504736": "Madison Dellamea", "1460812": "Lane Garrison", "4885949": "Lexi Atkins", "0805789": "Victor Slezak", "3004211": "Katy Rowe", "1450145": "David House", "1254942": "Lora Martinez-Cunningham", "3378757": "David Chavez", "0012079": "Seth Adkins", "3956986": "Roseanne Vau", "1787679": "Eli Goodman", "0816105": "Boots Southerland", "2217487": "Johnny Long", "0803390": "Mark Sivertsen", "4125106": "Nathaniel Augustson", "6622742": "Matthew Menalo", "6393613": "Ethan Dennis", "5877528": "Michael E. Stogner", "5376552": "Martin Edward Andazola", "2733659": "Steve Blacksmith", "3487012": "Waylon Brady", "6801011": "Darlene Kellum", "6028645": "Justin D. Moore", "4107230": "Zeb Sanders", "6526402": "Frank Sandoval", "6718908": "Julian Wondolowski"}, "geners": ["Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["42"],  "plot": ["A mysterious object plummets to Earth, sending out a shock wave that causes five strangers to perish, only to miraculously come back to life moments later. The group includes Vera, a struggling radio-astronomer searching for her missing son; Erin, a young mother desperate to protect her seven-year-old daughter from an abusive ex-husband; Peter, a troubled high school student; Raul, a federal agent looking to escape his dangerous and violent undercover assignment; and Joshua, a charismatic second-generation televangelist. Most mysterious of all is the figure known only as The Man, who offers Vera the one thing she wants most in life - if she will help him with one morally complicated task which puts her on a collision course with Rose, a nurse who has been in a coma for seven years. Drawn together by fate and biblical prophecy, the Messengers soon learn they have supernatural gifts that might be the only hope for preventing the impending Rapture.", "A strange object that appears to be a meteor falls out of the sky, setting off a blast wave that affects several people: a nearby scientist, a young mother, a teenager, a preacher, and an undercover agent. Leaving them what appears to be dead, they all wake up later with special powers and all have the urge to go to Houston, Texas."], "genres": "N/A", "imdbID": "4216658", "rating": 7.3, "votes": 509, "number_of_episodes": 13}