{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0429114": "Richard T. Jones", "0226813": "Garret Dillahunt", "1721113": "Kristina Apgar", "0050737": "Edoardo Ballerini", "0517792": "Karina Logue", "0747420": "Andre Royo", "1838070": "Jonathan Sadowski", "0566157": "Matt McColm", "0161670": "Luis Chávez", "0004977": "Brian Austin Green", "1106793": "Bruno Amato", "1552879": "Joshua Wolf Coleman", "1570766": "Allen Evangelista", "2009056": "Akie Kotabe", "1111902": "Tony Wilde", "2831563": "Cynthia Marie Hruschka"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["Derek catches Cameron in a lie that puts them inside Vick's head, Sarah continues to track the Turk, and Cromartie comes closer to finding John.", "Derek finds the brain chip from Vick the Terminator that Cameron had kept. John builds an interface for it and they discover a computerized traffic system is important to Skynet in which Sarah decides it must be sabotaged to prevent Skynet from being created. Meanwhile, Cromartie is checking through school records in search of John.—Anonymous", "When Derek Reese finds a Terminator's central computer chip in Cameron's room, he is ever more convinced that she cannot be trusted. Her defense is that she kept the chip so they can retrieve the video images of any encounters that Vick the terminator it may have had and the information retrieved does suggest to them that a fiber-optic traffic control system proposed for the city of Los Angeles may have a connection to the future SkyNet. When Derek and Sarah's attempt to infect the system with a computer virus fails, Cameron has an alternative for them to consider. Posing as an FBI agent, Cromartie is visiting all high schools in LA with newly enrolled students between the ages of 15 and 17. Cameron has to be quick to ensure John isn't identified.—garykmcd"], "genres": "N/A", "imdbID": "1055796", "rating": 7.6, "votes": 1089, "number_of_episodes": 31}