{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0429114": "Richard T. Jones", "0226813": "Garret Dillahunt", "0907427": "Sonya Walger", "0385639": "Brendan Hines", "1721113": "Kristina Apgar", "0411980": "Mark Ivanir", "0394248": "Neil Hopkins", "0566157": "Matt McColm", "0004977": "Brian Austin Green", "0935921": "Dean Winters", "0161670": "Luis Chávez", "2375336": "Josue Aguirre", "0148401": "Troy A. Cephers", "2421016": "Ray Chavez", "2168883": "John De Vito", "1280361": "Ally Maki", "0936797": "Jacob Witkin", "3629235": "Emmanuel Ondrick", "0290116": "Claudia Santangelo", "3204134": "Troy Butcher", "0473578": "Mark Kubr", "3214949": "Sam Puefua"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["41"],  "plot": ["Sarah is troubled to learn that Andy Goode has rebuilt his computer the Turk II and entered it into a chess competition with a military contract as the winning prize. A Resistance fighter from the future takes matters into his own hands.", "Sarah reevaluates the capabilities of her friend Andy Goode's computer, the Turk II, after he enters it in a major chess competition. During the competition, Sarah meets a stranger with a history similar to hers, and who is being pursued by another terminator. At school, John meets a new friend in shop class and becomes curious about the attractive and mysterious Cheri, who is possibly being abused at home. Cameron continues to try to fit in at school, but struggles to act \"normal\" in her session with the grief counselor. Agent Ellison finds remnants from a past terminator confrontation, leading him closer to both Sarah and the terminator Cromartie. Meanwhile, Cromartie has assumed the identity of the late George Laszlo. Posing as an FBI agent, he continues looking for Sarah and John, and has a conversation with Charley Dixon.—Anonymous", "Sarah meets Andy Goode and he tells her that he has rebuilt a new version of his computer, the Turk II, and he will participate of a chess tournament where the winner will sign a contract with the government for military purpose. Meanwhile Cromartie lures Charley Dixon, pretending to be an FBI agent and trying to get information about Sarah Connor. When Andy loses the competition and is found dead by Sarah, she fights against a stranger she assumes is the criminal. The man is arrested but later Sarah finds that he is a member of the resistance and her brother-in-law sent by John from the future. Sarah, John and Cameron face a dangerous terminator while trying to rescue Derek Reese—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1055793", "rating": 7.8, "votes": 1151, "number_of_episodes": 31}