{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0429114": "Richard T. Jones", "0219748": "Catherine Dent", "0089141": "Brian Bloom", "0880820": "Andy Umberger", "0949810": "Lee Thompson Young", "0226813": "Garret Dillahunt", "0071726": "Douglas Bennett", "0218749": "Michael Dempsey", "0126023": "Greg Eagles", "0010486": "Mark Adair-Rios", "1861893": "Hector Atreyu Ruiz", "0793927": "Linda Shing", "1587209": "Sean Smith", "0814536": "Taira Soo", "3214949": "Sam Puefua", "2740321": "Ilya Jonathan Zaydenberg"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["When they learn of a huge shipment of Coltan arriving at the Port of Los Angeles, Sarah, John and Cameron believe that Cromartie has returned but upon investigation discover an entirely new Terminator with a mission of it's own.", "While John continues to have more difficulty coming to terms with a student who committed suicide and felt he was powerless to prevent it, he becomes separated from Sarah and Cameron while they're searching for some stolen cargo when he's accidentally trapped in the back of an armored truck loaded with enough metal to build 500 endoskeletons. But instead, John finds another Terminator with an unknown mission. Meanwhile, the murder of a plastic surgeon that Agent Ellison is investigating leads him to a surprising suspect, while Cromartie, the terminator who followed Sarah, John, and Cameron into the future, continues to rebuild his bio image into another person.—Anonymous", "John has difficulty coming to terms with the death of the student who committed suicide. Sarah, John and Cameron stake out the Port of Los Angeles where they know a shipment of Coltan, a key ingredient used by Skynet to construct the metal alloy used in Terminators. Expecting to find Cromartie, the Terminator who has transported into the future with them, they find another Terminator on an unknown mission. FBI Agent Ellison investigates the death of a plastic surgeon who may have worked on Cromartie.—garykmcd", "Cameron shows Sarah and John a picture of the skull of the Terminator Cromartie in the present days (2007) possibly with intact chip; further that a shipment of the alloy Coltan, which is used for constructing the skeleton of the machines, is being transported to the Port of Los Angeles due to an accident in the original destination harbor. She concludes that Cromartie is behind these events, and Sarah decides to move from Los Angeles. However, John, who is having problems dealing with the death of his suicidal schoolmate Jordan Cowan, tells her that they should fight while Cromartie is vulnerable. They keep the depot in the harbor under their surveillance and witness an armed group robbing the metal. When John decides to plant a cell phone in the truck to track it, he is trapped in the truck with the criminals that drive to a distant military facility. Meanwhile Cromartie forces a plastic surgeon to operate his face using the identity of the aspirant actor George Laszlo, killing him after the surgery. Agent James Ellison follows his hunch but his superiors do not accept the basis of his investigation.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1055792", "rating": 7.4, "votes": 1200, "number_of_episodes": 31}