{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0429114": "Richard T. Jones", "0385639": "Brendan Hines", "1883803": "Jesse Garcia", "0324134": "Adam Godley", "0606862": "Phil Morris", "0924502": "Bernard White", "0940128": "Charlayne Woodard", "1721113": "Kristina Apgar", "0219748": "Catherine Dent", "0003779": "Alessandra Torresani", "2779018": "Floriana Lima", "2818390": "David Ortiz", "2835196": "Sabrina Páez", "1377241": "Keith Pillow", "1506981": "Bashir Salahuddin", "1587188": "Tiya Sircar", "0887226": "Cameron Van Hoy", "1989533": "Aldo Gonzalez", "1904326": "Mario Orozco"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["John and Cameron start their new school, Sarah befriends a man who may be important to Sky Net and then struggles with what she must do. Meanwhile, Cromartie has tracked down a scientist to assist him in his regeneration.", "Sarah visits Myles Dyson's widow, and Sarah ends up meeting Andy Goode along the way who ends up being an inventor of a chess playing computer named \"The Turk.\" Meanwhile, John and Cameron try their best to fit in on their first day at the new high school, with John trying to catch up on the eight years of history lost and Cameron trying to mimic the human emotions of her fellow students. Elsewhere, Agent Ellison tries to piece together the mysterious mass killing of four unidentified men, while Cromartie the Terminator tracks down a scientist to assist him in his regeneration.—Anonymous", "As they settle into their new lives, Sarah, John and Cameron face new challenges. Sarah needs to identify the inventor of SkyNet and stop him if at all possible. She contacts Miles Dyson's widow who refers her to Andy Goode, who had worked at Cyberdyne 10 years ago as a intern. Sarah learns that he never finished his computer science degree and is now working as a cell phone salesman. She also learns that he is developing a computer chess system based on artificial intelligence. For Cameron and 15 year-old John, the challenge is to settle into and be accepted at a new school. John tries to stop a student from committing suicide but Cameron prevents him from doing so. Sarah's doctor confirms that she is cancer free.—garykmcd", "While John and Cameron adapt themselves in the new high-school, Sarah visits Terissa Dyson at Myles' grave with pictures of the possible inventor of SkyNet. Sarah identifies the former intern of Cyberdyne Andy Goode. Sarah discovers that Andy is working as a cell phone salesman and she visits him in the store where he works. She accepts his invitation for dinner and finds that he has not concluded his computer science bachelorship, but he has been developing a powerful computer at home to play chess. Cameron has difficulties to understand the human emotions and John is affected by the attitude of a suicidal teenager. Meanwhile the Terminator seeks out a scientist and helps him in his research to regenerate his skin. Agent James Ellison arrives out of the blue in the investigation of a killing and but the agent responsible for the case restrains him.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "1055791", "rating": 7.5, "votes": 1287, "number_of_episodes": 31}