{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "0744331": "Theo Rossi", "0170968": "Chad L. Coleman", "0254760": "Chris Ellis", "1089338": "Stephany Jacobsen", "0523180": "Yuri Lowenthal", "3010213": "Krishna Cole", "1909099": "Erin Fleming", "1813729": "Bill Tangradi"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Jesse recalls more of her fateful future mission aboard the Jimmy Carter. Back in the present, her plan to turn John against Cameron backfires when John discovers that Jesse - not Cameron - killed Riley.", "In 2027, Jesse's submarine mission takes a fatal turn that has unforeseen consequences for John, Sarah and Derek in the present when the 'box' is opened an a new and deadly, liquid metal T-1001 Terminator escapes and is loose aboard the sub. Back in the present, as Sarah prepares to move, she deals with Cameron who may become a liability to them, while John begins to doubt that Cameron was the one who murdered Riley, and he finally learns about Jesse's existence and struggles with a life-or-death situation of whether or not to kill Jesse. Elsewhere at Zeira Corp, John Henry becomes more humanly concerned that Catherine Weaver is up to something involving the 'termination' of her top employees, including Ellison.—matt-282", "Sarah and the rest are preparing to leave but she is wondering if Cameron should come along. John meanwhile has figured out Jesse's scheme and confronts her over Riley's death. Derek has a point of view as well. In flashbacks, Jesse's submarine mission becomes hostile when it becomes apparent that they have taken on board a new form of liquid metal Terminator. Jesse refuses to return to their home base at Serrano Point with the machine aboard and takes command of the boat. The new Terminator has an important message for John Connor.—garykmcd"], "genres": "N/A", "imdbID": "1329930", "rating": 8.2, "votes": 994, "number_of_episodes": 31}