{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "1276549": "Shirley Manson", "0429114": "Richard T. Jones", "0005044": "Jonathan Jackson", "0606487": "Dean Norris", "2598945": "William Brent", "0745194": "Will Rothhaar", "0082507": "Beau Billingslea", "0453304": "Patrick Kilpatrick", "1149087": "Rene Heger", "2244360": "David Cheaney", "0194886": "Johnny D'Agostino", "1550452": "Bobbi Sue Luther", "0707040": "Alexandra Raines Lewinson", "0817951": "Garland Spencer", "2416860": "Matthew Herington", "0726234": "Ron Riekki", "2598382": "Kevin Sar", "3850682": "Kyle Shaw"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["52"],  "plot": ["John and Derek sign on for military school to protect a key future Resistance hero from termination. Back at home, Sarah and Cameron protect a young boy who shares the same name as the intended target.", "John and Derek go undercover at a military academy to eye and protect a certain Martin Bedell, a cadet who will be John's chief soldier during the future war, from another Triple-8 Terminator who arrives from the past to assassinate Bedell. Derek flashes back to his days in the resistance and quarreling with his brother, Kyle, as well as Bedell, over their military tactics to fight. Meanwhile, Sarah and Cameron try to protect another Martin Bedell, a young boy, whom the Terminator briefly mistakenly targets. Elsewhere, Ellison learns a little more about the sinister Catherine Weaver as she beings grooming him for the job at her corporation.—Anonymous", "Knowing that a cyborg has been sent from the future to kill Martin Bedell, John and Kyle go undercover at a military academy to protect him. Kyle remembers his former life as a member of the underground and in particular, Bedell's very important contribution to the fight against Skynet. Meanwhile, knowing that two other Sarah Connors were killed in the Terminators search for her, she rescues a young boy also named Martin Bedell, to keep him safe. In doing so, she also learns a little bit about herself.—garykmcd"], "genres": "N/A", "imdbID": "1245066", "rating": 7.7, "votes": 984, "number_of_episodes": 31}