{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "0005311": "Busy Philipps", "0744331": "Theo Rossi", "2624176": "Mackenzie Brooke Smith", "0170968": "Chad L. Coleman", "3040388": "Drew Rausch", "0254760": "Chris Ellis", "1089338": "Stephany Jacobsen", "0523180": "Yuri Lowenthal", "0674664": "Gregg Perrie", "1909099": "Erin Fleming", "3010213": "Krishna Cole"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["As the Connors prepare to move, they find out that Riley is dead, and Sarah begins to doubt Cameron's motives. Jesse flashes back to a submarine mission in the future, and John Henry plays hide and seek with Catherine Weaver's daughter.", "Jesse flashes back to the year 2027 of her time in the underground Resistance she was chosen for a life-altering mission aboard a submarine, the USS Jimmy Carter, to travel to her native Australia, but was diverted to a remote oil platform location to pick up a mysterious black box. Back in the present, Sarah and John plan to move out when they learn about Riley's murder and mistakenly think that Cameron killed her, despite Cameron's denials. John and Sarah debate whether or not to bring Cameron with them as the rift between all of them (started by Riley and Jesse in the first place) begins to widen even more with no one, not even Derek, suspecting Jesse of manipulating everything so John can destroy Cameron. Elsewhere at Zeira Corp., Weaver and Ellison search for Savannah after she tries to play a game of hide-and-seek with John Henry.—matt-282", "With everything that has happened, Sarah decides that they have to move. Cameron denies having anything to do with Riley's death, but John isn't sure whether to believe her. Sarah knows what must be done however. Having killed Riley, Jesse recalls a mission from her past. Aboard the submarine U.S.S. Jimmy Carter in 2027, the boat comes under attack. She also realizes the boat is 300 miles off course and is told John Connor has ordered a special mission. At her mother's office, Catherine Weaver's daughter Savannah has an encounter with John Henry who agrees to play hide and seek.—garykmcd"], "genres": "N/A", "imdbID": "1329929", "rating": 7.7, "votes": 914, "number_of_episodes": 31}