{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "0249006": "Shane Edelman", "0825749": "Eric Steinberg", "1102244": "Eddie Shin", "0002126": "Dorian Harewood", "0334462": "Javier Grajeda", "1089338": "Stephany Jacobsen", "3209778": "TJ Kayama", "2021156": "Savannah Jayde", "1138880": "Dylan Cash", "0674664": "Gregg Perrie", "0330356": "Karen-Eileen Gordon", "3704994": "Eros Mendoza"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Sarah's quest to find the meaning behind the \"three dots\" leads to a technology firm seeking an advanced microchip. Dr. Sherman is killed while working with Catherine Weaver's A.I. computer, and Jesse comes clean about her mission.", "Sarah and Cameron investigate a Japanese computer company, named Dakara, which may have a connection to the construction of Skynet. Meanwhile, Derek learns that Jesse is a spy sent back to investigate John, and that Riley is Jesse's partner in trying to come between John and his mother to keep them apart. Elsewhere, Ellison begins to realize that Catherine's supercomputer, code-named Babylon, is growing stronger and may be the threat that he is facing all along.—matt-282", "Sarah continues to pursue the meaning of the three dots and focuses on a high tech company, Dakara, which requires an infusion of quick cash to acquire a new Japanese computer chip. She is so sure there is a connection to the future that she's prepared to to spend all of their money. Unfortunately, they get scammed. Ellison is introduced to Babylon, the artificial intelligence computer Catherine Weaver is developing, as he tries to get information on Dr. Boyd Sherman's death. Jesse tells Derek the true purpose of her trip back in time.—garykmcd"], "genres": "N/A", "imdbID": "1245332", "rating": 7.4, "votes": 868, "number_of_episodes": 31}