{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "1312073": "Billy Lush", "1200429": "Oren Dayan", "0823693": "Todd Stashwick", "0585175": "David Michie", "1207676": "Mary Alexandra Stiefvater", "0604510": "Branden Morgan", "0598657": "Tim Monsion", "1453351": "Lou George", "0810083": "Symba", "1591105": "Justin Alston", "1141654": "Jody Jaress", "2141223": "Eric Callero", "1389923": "Elise Ivy", "0489594": "Ray Laska", "0217086": "Yolanda Lloyd Delgado", "2091239": "Melinda Bennett", "1974694": "Marcus Collins", "2125780": "Nick Drago", "1120316": "Joe Hursley", "2021156": "Savannah Jayde", "1719631": "Danny Socorro Martinez", "1371681": "Ginger Pauley", "3407666": "Will Rodriguez", "3479224": "Nathan Sikes", "2222094": "Nathan Smythe", "1914981": "Arne Starr", "0842372": "Becca Sweitzer"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["Cameron learns that a terminator was accidentally sent back to 1920s Los Angeles, and she tries to find out what happened to him. Meanwhile, John has a run-in with a group of punks while taking Riley home from a party.", "Cameron goes to the Los Angeles County library of records for information to repair her damaged brain system when she spots a T-888 Terminator in an old photograph dating back to 1920 and teams up with the paraplegic librarian to uncover the mystery to why this Terminator was sent back, what its mission was, and where he is now. Meanwhile, John sneaks out of the house also to meet with Riley to attend a house party in the San Fernando Valley neighborhood where he does not bond well with her circle of wild friends, and continues to have disturbing flashbacks to the time he killed Sarkeasian.—matt-282", "While conducting research at the public library, Cameron spots a cyborg, called Byron Stark, in an old 1920 photograph taken during an infamous New Year's eve fire in a Prohibition speakeasy. She learns that Stark robbed banks, bought large parcels of land around Los Angeles and built housing developments. He was also killing those associated with his business rival. Cameron determines Stark may have been sent to the wrong date in time. Meanwhile, John goes to a party thrown by one of Riley's friends but things don't well when he starts to have flashbacks and he gets into a fight.—garykmcd"], "genres": "N/A", "imdbID": "1245333", "rating": 7.9, "votes": 1028, "number_of_episodes": 31}