{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "1276549": "Shirley Manson", "0429114": "Richard T. Jones", "0002126": "Dorian Harewood", "0249006": "Shane Edelman", "2624176": "Mackenzie Brooke Smith", "0725701": "Derek Riddell", "1089338": "Stephany Jacobsen", "1890280": "Christopher DeMaci", "0151728": "Jennifer Chang", "1674688": "Kit Pongetti", "1159215": "Preston James Hillier", "2178422": "Jake Soldera", "0043543": "Aixa Maldonado", "1082863": "Michael David Cheng", "1449815": "Christine Fazzino", "0604507": "Bonnie Morgan", "0172082": "James Urbaniak"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["A woman from Derek's past surprises him and elsewhere, Sarah, John and Cameron wonder what a T-1001 would need with a doctor.", "Sarah, John, and Cameron investigate Dr. Sherman, a therapist who may have a connection to Skynet's construction, while Catherine Weaver, revealed to be a T-1001 liquid metal Terminator impersonating the real late Catherine Weaver, also pays a visit to Dr. Sherman for his help to control her daughter Savannah, living in constant fear of her \"mother\". Meanwhile, a mysterious woman from Derek's past, named Jesse, suddenly shows up having time-traveled back after going AWOL. Also, another mysterious female terminator arrives in the present to target another individual.—Anonymous", "Sarah, John and Cameron focus in on Dr. Sherman, even though they're not sure how he fits into Skynet's plans or even if he is friend or foe. They pose as a family needing counseling and bug his office. John for one likes the sessions with Sherman but Sarah isn't so sure. Catherine Weaver and her daughter Savannah are also seeing Sherman. When the artificial intelligence program under development at Weaver's company apparently malfunctions, it is Sherman who figures out just what it is doing. Derek Reese gets a surprise visitor from his past when an old love, Jesse, suddenly appears. She has come from the future to escape the horrors of never ending war but all is not what seems.—garykmcd"], "genres": "N/A", "imdbID": "1245337", "rating": 7.5, "votes": 901, "number_of_episodes": 31}