{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "0907427": "Sonya Walger", "0776584": "Paul Schulze", "0606487": "Dean Norris", "0382975": "Tommy Redmond Hicks", "0911933": "Zack Ward", "0933281": "Debra Wilson", "0005311": "Busy Philipps", "0935921": "Dean Winters", "1679115": "Obren Milanovic", "0875832": "Cory Tucker", "2162841": "Vinni Ali'i Mesa", "0194886": "Johnny D'Agostino", "0452979": "David Kilde"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Sarah, Derek and Cameron try to prevent a nuclear meltdown, Charley has to fill in Michelle when James shows up at their home, and John meets someone new.", "After having settled down in a new residence, Sarah and Cameron go undercover to a power plant as new employees to investigate the dying words of another fatally wounded resistance fighter, who arrives and dies mentioning the power plant which leads to Carl Greenway who's in charge of putting a potentially new reactor on-line in two days. Meanwhile, Agent Ellison and Charley tell a disbelieving Michelle about what's going on with Sarah Connor. Elsewhere, John ditches school and strikes a bond with a shady student named Riley.—matt-282", "A visitor from the future warns Sarah and the others that something fateful will occur at a nearby nuclear plant in 48 hours. Sarah and Cameron get jobs at the plant and learn that it is to go on line in two days provided an engineer, Carl Greenway, gives the green light. Their dilemma is whether they need to stop the plant going on line or make sure that it does. John returns to school and strikes up a friendship with an attractive classmate, named Riley. When John takes her home, Sarah is none too pleased. Meanwhile, Agent Ellison visits Charlie Dixon and his wife and tells them they need to leave for their own safety.—garykmcd"], "genres": "N/A", "imdbID": "1245067", "rating": 7.4, "votes": 999, "number_of_episodes": 31}