{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "0005311": "Busy Philipps", "1343254": "Leah Pipes", "0937744": "Fay Wolf", "0035395": "Jillian Armenante", "0008813": "Andrew Ableson", "0888559": "Scott Vance", "0850234": "Glenn Taranto", "1870243": "Cornell Womack", "1120316": "Joe Hursley", "1089338": "Stephany Jacobsen", "0757460": "Amro Salama", "2176183": "Charlene Lovings", "0230897": "Jullian Dulce Vida", "0322300": "James Gleason", "0446466": "Jeanette O'Connor", "1719631": "Danny Socorro Martinez", "2193611": "Ronnie Connell", "0174221": "Ray Conchado", "3315049": "Mitch L. Guy"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["While Sarah and Cameron search for the person who robbed the house, Cromartie returns to hunt down Cameron and John. Meanwhile, a new cyborg arrives and creates trouble for Ellison.", "When their house is broken into and all their money and fake ID's stolen, Sarah, Cameron, and Derek go in search of them before they land in the wrong hands. Derek continues to sneak away to spend time with his lost love Jesse. Meanwhile, John continues to becomes more alienated and disillusioned with the current situation which stems from his killing of Sarkisian, and continues to seek company with Riley. Also, Ellison finds himself arrested for a murder charge in which a look-alike Terminator attempts to duplicate him, and Catherine flexes more of her power to clear him. Elsewhere, the Terminator Cromartie is back on the trail to find John when a discarded photo of Cameron surfaces which leads him to the young runaway, Jody, who briefly knew Cameron during her memory-lapse episode.—matt-282", "After the Connors house is broken into and robbed, Sarah, Cameron and Reese set off to find their diamonds and their IDs. They get a lead through a diamond fence but it takes several tries to get their property back. Cromartie gets a lead on John Connor's whereabouts through the halfway house where Cameron spent the night. Cromartie starts to go house to house in the neighborhood. James Ellison is arrested for murder when his doppleganger Terminator arrives from the future and kills a man for his clothes.—garykmcd"], "genres": "N/A", "imdbID": "1245338", "rating": 7.6, "votes": 894, "number_of_episodes": 31}