{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "1628079": "Leven Rambin", "0429114": "Richard T. Jones", "0502001": "Dinah Lenney", "0404924": "Michael Hyatt", "0515225": "Barry Livingston", "1017853": "William Stanford Davis", "0068709": "Ned Bellamy", "1089338": "Stephany Jacobsen", "2786793": "Eric Shackelford", "2017671": "Lance Strumpf"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["43"],  "plot": ["Sarah turns to a UFO convention for answers about the \"three dots,\" more details about Riley's mission are revealed, and Ellison begins working with Catherine Weaver's AI prototype, \"John Henry.\"", "Sarah attends a UFO convention hoping to get information on the three dots. She is pointed in the direction of Abraham, a blogger who has written about them. Only problem is no one quite knows who or where he is. At home, John is re-decorating his room with Riley's help, always under the watchful eye of Cameron. Through flashbacks, we learn more about the connection between Riley and Jesse. Now that Catherine Wheeler's AI computer has taken humanoid form in what was Cromartie, she wants Ellison to teach it ethics.—garykmcd", "Still obsessing about the mysterious three-dot symbol, Sarah travels to a UFO convention for answers about what the three dots mean and she has a run-in with a shady trans-gender woman, named Ellen Park, who claims to know a little about some government work she did involving alien technology. But Sarah's search only leads to more questions then answers as she struggles to know who really is behind everything and who is the mysterious assassin out to kill Park. Meanwhile, Riley's background is revealed as her growing up in post-Nuclear Fire L.A. and her mission of how she time traveled back with Jesse to keep John away from Cameron. Cameron begins to express suspicion about Riley, but naturally John doesn't want to listen. Elsewhere, Ellison meets Catherine Weaver's new A.I. prototype which is the reprogrammed Cromarte which Ellison, although doubtful, feels that he has a chance to make the former Terminator express feelings and reason.—Anonymous"], "genres": "N/A", "imdbID": "1245335", "rating": 7.0, "votes": 888, "number_of_episodes": 31}