{"cast": {"0372176": "Lena Headey", "0215281": "Thomas Dekker", "1132359": "Summer Glau", "0004977": "Brian Austin Green", "0226813": "Garret Dillahunt", "1276549": "Shirley Manson", "0429114": "Richard T. Jones", "0147738": "Larry Cedar", "2624176": "Mackenzie Brooke Smith", "0718920": "Jill Remez", "0682386": "Jeffrey Pierce", "2047955": "Austin Highsmith Garces"}, "geners": ["Action", "Drama", "Fantasy", "Sci-Fi", "Thriller"], "runtimes": ["44"],  "plot": ["Sarah, John and Cameron save Catherine Weaver's daughter Savannah from being killed by a machine, but Derek is killed in the process. Ellison is then forced to broker a meeting between Sarah and Catherine to return the child.", "After finding a clue to one of the dead assassins after them, Sarah, John, Cameron, and Derek locate another T-888 who attempts to kill Savannah Weaver whom they are forced to abduct, at the cost of Derek's life. As the paths of Sarah and Catherine's finally begin to cross, Sarah learns about Ellison's work at Zeira Corp and about the identity of 'John Henry'. While Catherine sends out Ellison to find Savannah, she becomes more determined to keep the existence of John Henry and her work a secret, but also finally learns about the existence of Sarah Connor as well as John. When Sarah requests a meeting with Catherine (with nobody still aware of her being the elusive T-1001), a persistent FBI agent becomes determined to find the abductor of Savannah.—matt-282", "In the aftermath of the attack on Charlie's house, John finds that one of the attackers has a photograph of little Savannah Weaver. He remembers seeing and talking to her at Dr. Sherman's office and decides to pursue the connection. When John, Sarah, Derek and Cameron go to the Weaver house, they arrive just in time as a Terminator is also there, presumably to kill Savannah. They rescue her, but one of them is killed. The attempt on Savannah was witnessed remotely by John Henry and Ellison makes contact with Sarah to ensure the young girl's safe return. The quid pro quo is that once the girl is returned safely, he will arrange for Sarah and Catherine Weaver to meet. It doesn't quite go as planned however.—garykmcd"], "genres": "N/A", "imdbID": "1329932", "rating": 8.5, "votes": 1103, "number_of_episodes": 31}