{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "1350207": "Constance Dollé", "0208402": "Laetitia de Fombelle", "2372335": "Alice Butaud", "5412859": "Brune Martin", "2326159": "Bertrand Constant", "2147139": "Matila Malliarakis", "0088040": "Alain Blazquez", "5423478": "Valérie Bredoire", "5096451": "Alexandre Charlet", "3473483": "Martin De Myttenaere", "4608591": "Simon Ehrlacher", "5423635": "Yves Mandray", "3657567": "Guillaume Marquet", "2606407": "Monique Roussel", "4981468": "Vincent Trouilleux", "0893715": "Laurent Vercelletto", "7200907": "Pascal Bianco-Levrin de Bouzid"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["53"],  "plot": ["Tensions are high between the living and the dead, as a newer, creepier wave of the returned descends upon them. With the townspeople in fear and the stakes higher than ever, everyone will have to choose sides.", "Thirty-five years ago, the old dam burst, killing many in the village below. Madame Costa tells Victor's mother not to worry: the dead will someday get their revenge. In the present day Laure, Julie and Victor try to leave the village but find they are traveling in a loop traveling over the same road over and over again. They find Toni who is about to jump off the dam. Adele is frantic after her daughter is taken by Simon and Lucy. Many people have taken refuge with Pierre at the Helping Hand. Camille and Lena have reconciled but the horde of reanimated people Lena saw in the woods descend upon them. They offer to return Adele's daughter if the returned at the hostel join them. Victor, Madame Costa and Camille all agree but there is another who must agree to leave.—garykmcd", "Julie and Laure sleep in the car and in the morning, they see marks of hand on the windows. Victor says that a horde of returned wanted him. They also see Toni trying to commit suicide, jumping off in the dam, but Julie rescues him. Suddenly they see the horde of returned coming to them and they flee. Victor gives a pistol to Toni, who recognized him from thirty-five years ago when the old dam burst, and he commits suicide. Julie and Laure bring him to Helping Hand trying to give medical attention and save his life. Simon and Lucy take Chloe from Adele with them. The population seeks shelter in the Halping Hand since the dead are coming. Thomas and his men also come to the shelter. The horde puts the sanctuary under siege and Lucy tells Thomas that they are there to bring the other undead with them, and proposes to exchange Chloe by Madame Costa, Victor, Camille and Adele.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2553670", "rating": 8.0, "votes": 552, "number_of_episodes": 16}