{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "0290420": "Carole Franck", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "0208402": "Laetitia de Fombelle", "3657567": "Guillaume Marquet", "2326159": "Bertrand Constant", "2147139": "Matila Malliarakis", "4608591": "Simon Ehrlacher", "5412859": "Brune Martin", "0428811": "Mélanie Baxter-Jones", "1998285": "François Briault", "1117696": "Gilles Chabrier", "4981468": "Vincent Trouilleux", "5199322": "Aksel Ustun", "5413785": "Alma Arnal", "4973690": "Julien Bourdel"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["50"],  "plot": ["Life in town is becoming gradually more disturbing. Determined to come out of hiding, Camille invents a new identity, Lena is horrified by a mysterious physical affliction, and Julie finds herself paralyzed by fear as an old trauma resurfaces.—Anonymous", "While even town physician Julie starts loosing her calm, 'foster son' Victor finally speaks to her and deals with the nosy neighbor conclusively. The badly organized police lets presumably extremely dangerous Simon go and attend a youth hostel. Camille's return ever further upsets the whole family, now especially her elder sister. The artificial lake is now being emptied for an apparently overdue checkup.—KGF Vissers", "Seven years ago, Julie was on her way home from a costume party - dressed as Catwoman - when she was attacked in the same tunnel as Lucy. When she hears of what's happened her panic attacks return. A nosy neighbor who threatens to call the police about Victor doesn't help. As for Camille, her father believes the best solution for all of them would be if they relocate, something that upsets Lena. Camille has a better idea: posing as Lena's cousin, Alice. Thomas is upset when learns that Simon has been released but told not to leave the city. Adele Werther is coming to terms with her former fiancé's sudden return. Toni the bar manager is still confused and not sure what to do about the unexpected return of his dead brother Serge. Engineers at the dam are monitoring the 2 meter drop in water levels but there are other eerie occurrences in town.—garykmcd", "Julie goes to the funeral of Mr. Costa and feels uncomfortable when she recalls the man that stabbed her in the underpass. She returns home and is threatened by Miss Payet, who says that she will call the police since she believes Julie is keeping Victor illegally at home. When Julie goes to her work, Payet is visited by Victor. When Julie returns, she does not find Victor. Meanwhile, Jérôme proposes Claire to move to another town since it would be better for Camille, but when Lena hears the news, she freaks out. Claire goes with Camille to buy clothes and when they meet an acquaintance, Camille says that she is Alice, Lena's cousin. The police release Simon since they do not have evidence to keep him in jail. He contacts Adele that shows him their daughter Chloe. When Lena meets Adele to find Simon, she begins to learn that Simon is not a ghost and other people can see him too. The police continue to search for who attacked Lucy.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2550120", "rating": 7.9, "votes": 563, "number_of_episodes": 16}