{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "0208402": "Laetitia de Fombelle", "5412859": "Brune Martin", "2147139": "Matila Malliarakis", "2326159": "Bertrand Constant", "6332634": "Rémy Adriaens", "0061709": "Anne Baudoux", "0088040": "Alain Blazquez", "1708296": "Jean-Emmanuel Pagni", "5415316": "Carmen Rey", "2606407": "Monique Roussel", "4981468": "Vincent Trouilleux"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["48"],  "plot": ["One year ago, Thomas returned home to find that Adele had tried to commit suicide by slitting her wrists. In the present day, water levels at the dam keep falling revealing more of the old village that once existed there. Madame Costa tells Camille she died from starvation all those years ago after the old dam broke and everyone and went without food for three weeks. She also takes her to task for lying to the Koretskys about their dead child. Camille learns there is a cost of those lies. Serge and Toni are making their way through the forest but soon find that are just going in circles. When they finally reach the dam, they try to swim across the lake . Lena returns home to her parents great joy. At the Helping Hand, Pierre shows Claire his secret underground bunker and shares his belief that the end is near. The returned all seem to be developing a rash.—garykmcd", "One year ago, Thomas arrived home with Chloe and found Adele in the bathroom after trying to commit suicide. Nowadays, Victor runs from Julie to play with Chloe, jumping with her on her trampoline. While Julie and Adele are having a conversation, Chloe sees her mother covered in blood and faints. Serge and Toni are fleeing from the police through the woods, but they realize that they are running in circles. When they reach the dam, Serge convinces Toni to swim to cross the lake. Madame Costa talks to Camille and discloses that she died of starvation when her house was flooded by the dam. She also calls the attention of Camille for lying to the Koretskys about their dead child. Soon Camille finds they committed suicide, hanging themselves in the storeroom. Pierre shows Claire his bunker at Helping Hand full of food since he believes the end of the world will happen soon. Simon is betrayed by Father Jean-François and arrested by Thomas. In his cell, he sees some kind of problem with his skin. Lena returns home and celebrates with her father and Camille. Laure decides to leave town with Jule and Victor, but while she drives, she realizes that they are going nowhere and returning to the dam.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2553666", "rating": 7.8, "votes": 492, "number_of_episodes": 16}