{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "0290420": "Carole Franck", "0456268": "Jérôme Kircher", "0208402": "Laetitia de Fombelle", "0869478": "Guillaume Toucas", "2147139": "Matila Malliarakis", "5412859": "Brune Martin", "3657567": "Guillaume Marquet", "2326159": "Bertrand Constant", "4608591": "Simon Ehrlacher", "4981468": "Vincent Trouilleux", "5413932": "Alexandre Baubat", "5413785": "Alma Arnal", "5412496": "Marine Decarre", "1117696": "Gilles Chabrier", "1998285": "François Briault", "5199322": "Aksel Ustun", "0012495": "Franck Adrien", "0428811": "Mélanie Baxter-Jones", "0088040": "Alain Blazquez", "4973690": "Julien Bourdel", "0256423": "Nadine Emin"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["52"],  "plot": ["Adele struggling with herself about Simon and think that she saw his ghost. Meanwhile Camille goes out to find her friends. Victor is still silent and says nothing", "Adele attempts to come to terms with Simon's 'return' as things get emotionally complicated. Camille tries to restart her old life but discovers the situation at home has changed and is introduced to Pierre, an odd and charismatic figure who predicted The Return.—Anonymous", "Simon has returned, 10 years after he died leaving his pregnant girlfriend standing at the altar. Now he's back just as Adele is about to marry Thomas. Simon reacts violently when he's refused service as a restaurant. Camille and the rest of her family are having a hard time adjusting to the new reality. Caille's twin sister Lena, now 4 years older, is having a particularly hard time with it all. Pierre tells Camille that she is not the first to return but all she wants is to live a normal life. Julie checks at the police station to see if any little boys fitting Victor's description have been reported missing. The police investigate the attack on Lucy Clarsen who is still alive despite being stabbed 17 times. The attack very much resembles one that occurred 7 years ago.—garykmcd", "Ten years ago, the bass player Simon is in love with The Lake Pub waitress Adele. He proposes to marry her but, on the eve, he learns that she is pregnant. On the next morning, he dies and leaves Adele waiting for him at the altar. In the present days, Adele talks to the priest about Simon's contact, and he says that Simon is a ghost, and she should talk to him to help to resolve her life. Elena does not accept Camille and tells tough things to her. Camille flees home to see her former old flame in the pub. Julie goes to the precinct to see the report of missing children. She notes that nobody is looking for Victor and she decides to keep the boy that remains silent. The police investigate the attack of the waitress Lucy, who was stabbed and bitten several times. The crime is copycat of murders that happened seven years ago, and they arrest Simon believing he may the killer.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2550130", "rating": 7.9, "votes": 612, "number_of_episodes": 16}