{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "0208402": "Laetitia de Fombelle", "2372335": "Alice Butaud", "2147139": "Matila Malliarakis", "5412859": "Brune Martin", "3657567": "Guillaume Marquet", "2326159": "Bertrand Constant", "4608591": "Simon Ehrlacher", "0734004": "Pierre Rochefort", "3473483": "Martin De Myttenaere", "3120620": "Victor Chambon", "0848279": "Fabrice Talon", "5726510": "Sabine Destailleurs", "1998285": "François Briault", "1117696": "Gilles Chabrier", "5199322": "Aksel Ustun", "5413785": "Alma Arnal", "4973690": "Julien Bourdel"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["52"],  "plot": ["Lena's health is turning for the worse and she's convinced it has something to do with Alice. While Adele and Simon begin to rekindle their romance, Julie decides something must be done with Victor, who may be implicated in a shocking death.—Anonymous", "The gendarme (police commander) starts to work out the horrible links between Simon, the suspect's then - and his own fiancée now Adèle's past and present, but can't stop further killings. A female cop discovers Julie is illegally 'fostering' Victor, promises to keep it quiet a while, but soon delivers him to the parish shelter.—KGF Vissers", "Thirty-five years ago, Victor was was shot and killed while hiding in a closet during a home invasion. In the present day, Julie's nosy neighbor is found in her apartment stabbed to death. Camille's mother agrees that they should relocate.Simon and Adele restart their relationship and Thomas sees it all via CCTV cameras he has located throughout his house. The scar on Lena's back has grown and opened and Lena believes it's somehow related to Camille's return. Julie's one-time friend sees Victor in Julie's apartment and takes him to Pierre's place. Victor has a major revelation. Lucy's relationship with Jerome, Camille's father, is revealed. The power station is flooded and the city loses all electrical power for a few minutes.—garykmcd", "Thirty-five years ago, the boy Victor was murdered by burglars that broke into his house. On the present days, Julie and the maid of her next-door neighbor find the body of Miss Payet on the floor. The police arrive and officer Laure sees Victor at Julie's apartment. Meanwhile, Lena needs to be hospitalized since her scar on the back is growing and affecting her health. She believes Camille is responsible and blames her. She flees from the hospital, goes to the pub and exposes Alice, but people believe she is insane. Simon is hidden in Adele's attic, and she introduces Chloé to her father. They rekindle their love, not aware that Thomas is watching everything since he has several hidden cameras at home.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2550118", "rating": 8.1, "votes": 560, "number_of_episodes": 16}