{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "0208402": "Laetitia de Fombelle", "5412859": "Brune Martin", "3657567": "Guillaume Marquet", "2326159": "Bertrand Constant", "2147139": "Matila Malliarakis", "0213943": "Pascal Decolland", "2606407": "Monique Roussel", "0869478": "Guillaume Toucas", "0767935": "Roland Savoye", "0605695": "Pascal Morisset", "0720869": "Michel Revest", "0734004": "Pierre Rochefort", "4608591": "Simon Ehrlacher", "1998285": "François Briault", "5199322": "Aksel Ustun", "5412359": "Anaïs Philippe", "4981468": "Vincent Trouilleux", "0848279": "Fabrice Talon", "5413785": "Alma Arnal", "0428811": "Mélanie Baxter-Jones", "4973690": "Julien Bourdel", "1117696": "Gilles Chabrier"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["55"],  "plot": ["As the returned come out into the open they find they are unable to resume normal lives. Camille and Simon both find themselves abruptly rejected and Victor embarks on a search for his murderer. Incapacitated, Lena is found by an elusive figure.—Anonymous", "It's revealed that 7 years ago, it was Toni the barman who rescued Julie after she was pounced on by the knife wielding and flesh eating attacker. In the present, Lena wakens to find herself at Serge and Toni's farmhouse. Victor has left the hostel with one of the homeless residents who claims to be one of the returned, Mr. Costa's wife, who died not long before Victor and his parents were killed. Victor returns to the Helping Hand and confronts Pierre. Adele is coming to grips with the news that Simon had actually committed suicide on their planned wedding day. Simon is now hiding out at Camille's house and plans to leave that evening with Adele and their daughter. She refuses, leading to a confrontation with Thomas. SCUBA divers in the man made lake created by the dam find a large number of dead animals. It appears that they only recently drowned, perhaps in the last 12 hours. Camille finds that Frederic doesn't want to be with her.—garykmcd", "Ten years ago, Toni saved Julie from his brother Serge that was eating her flesh on the belly in the underpass and buried him alive. Lena wakes up in the bedroom of the farmhouse where Toni and Serge live. Victor leaves the Helping Hand Shelter with a homeless woman that claims to be Mrs. Costa. Later he returns and tells Pierre that he is one of the burglars that killed his parents and him. Adele learns that Simon committed suicide before marrying her and she is disappointed and angry. Claire lodges Simon at home and he intends to leave town with Adele and Chloe; however, she refuses the invitation.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2550122", "rating": 7.8, "votes": 505, "number_of_episodes": 16}