{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "1350207": "Constance Dollé", "5412859": "Brune Martin", "3657567": "Guillaume Marquet", "2326159": "Bertrand Constant", "2147139": "Matila Malliarakis", "4608591": "Simon Ehrlacher", "0213943": "Pascal Decolland", "0734004": "Pierre Rochefort", "1998285": "François Briault", "1117696": "Gilles Chabrier", "4981468": "Vincent Trouilleux", "0491241": "Jean-Pierre Laurent", "0012495": "Franck Adrien", "0088040": "Alain Blazquez", "5415316": "Carmen Rey", "5366769": "Isabelle Oed", "0869478": "Guillaume Toucas", "0061709": "Anne Baudoux", "1708296": "Jean-Emmanuel Pagni", "5413785": "Alma Arnal", "4973690": "Julien Bourdel", "5199322": "Aksel Ustun"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["56"],  "plot": ["A massive electrical outage shuts down the town's power, creating a sense of unease, as people are drawn together in unexpected ways. Camille and Lucy find new roles within the community, Julie seeks refuge with an old friend and Lena grows closer to her mysterious rescuer.—Anonymous", "One year ago, Lucy arrived in the village and got a job at the Lake Pub. She also began working as a prostitute and has a strange encounter with Camille's father, Jerome. In the present day Lucy regains consciousness in the hospital even though the doctors can't explain how she recovered from her wounds. The dam's electrical station has been flooded and there seems to be little hope of reestablishing it as a power generating facility. The town is without power and most businesses are closed. A disbelieving Frederic goes to Camille's grave and opens her coffin only to find it filled with water. Thomas begins to realize that several of the dead have returned. Pierre and Claire tell the therapy group about Camille's return and one of the other parents is anything but welcoming. Serge tells Lena to leave after they see Toni shoot a policeman. In the woods, Lena comes across something strange.—garykmcd", "One year ago, Lucy arrived by bus in the town and Toni gives a job of waitress and a place to stay at the Lake Pub. Soon she has sex with Jerome in the space where she lives in the pub. Now a miracle happens, and Lucy recovers consciousness in the hospital surprising her doctor. Meanwhile there is a power outage due to a problem in the electrical power plant that is flooded. Frederic goes with a friend to open Camille's coffin but there is only water inside and no corpse. However, they are surprised by the watchman and arrested by the police. Lena and Serge have sex at the farm. Pierre brings the therapy group to the house of Claire and discloses that Camille has returned, and she is questioned about their kids. Simon is in the freezer of the morgue, but during the night, he awakes and leaves the place. Thomas goes to Claire's house to see Alice, since he suspects that the dead are returning to the town.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2550128", "rating": 7.8, "votes": 502, "number_of_episodes": 16}