{"cast": {"0175931": "Anne Consigny", "0682692": "Frédéric Pierrot", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0346363": "Samir Guesmi", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0803332": "Jean-François Sivadier", "2162346": "Alix Poisson", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0320759": "Ana Girardot", "0290420": "Carole Franck", "1350207": "Constance Dollé", "0208402": "Laetitia de Fombelle", "0529745": "Claude Lévèque", "2147139": "Matila Malliarakis", "5412859": "Brune Martin", "0428811": "Mélanie Baxter-Jones", "4608591": "Simon Ehrlacher", "0256423": "Nadine Emin", "5413905": "Laurent Norkiewicz", "4981468": "Vincent Trouilleux", "0012495": "Franck Adrien", "0088040": "Alain Blazquez", "2652904": "Yves Sandeau", "1690165": "Francine Lorin-Blazquez", "0893715": "Laurent Vercelletto", "1117696": "Gilles Chabrier", "4973690": "Julien Bourdel", "5413785": "Alma Arnal", "1998285": "François Briault", "2326159": "Bertrand Constant", "0456268": "Jérôme Kircher", "5366769": "Isabelle Oed", "5415316": "Carmen Rey", "5199322": "Aksel Ustun"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["56"],  "plot": ["Camille, a teenager who was killed in a bus crash, returns home 4 years later.", "In a small French town, parents are still coming to grips with the loss of 36 teenagers killed in a bus crash 4 years ago. Many have managed to find closure and a group of parents has been working on building a memorial in honor of their lost loved ones. Parents Pierre and Claire are in total shock however when their daughter Camille returns home, apologizing for coming in so late and saying she is famished. Others have returned including Simon who seeks out his girlfriend Adele and a young boy named Victor, all with no memory of what may have happened to them or any idea of the years that have elapsed. Not everyone in the community is able to deal with their return.—garykmcd", "Four years after a school bus on a mandatory trip to the lake trying to avoid a boy in the road fell fatally into a deep Alpine ravine, Camille is the first of the victims returning home, healthy and unaware of the drama and physically unchanged. Her impossible appearance shocks people, from her separated parents, still in group therapy, and unsuspecting stepfather, to and old man who commits suicide on the electric barrage after setting fire to his home. The local doctor Julie is unaware the boy who suddenly turns up at her home is the boy in the road, who lived there with the apartment's previous occupant. (French speaking region) .(Flemish speaking region)—KGF Vissers", "When a bus with thirty-eight students on a trip passing on a winding road falls off the mountain, all the passengers die. Four years later, the student Camille returns home amnesic, scaring her mother Claire. She calls the father of Camille, Jérôme, and her present husband, Pierre, that are in a meeting of the support group of the parents of the victims, to come home. Later Camille's sister Lena is also surprised by the return of her dead sister. Meanwhile, Dr. Julie is summoned by Mr. Costa that is not feeling well; when she leaves, he sets fire to his house and commits suicide, jumping off into a dam. A mysterious boy follows Julie home. A young man called Simon looks for his former girlfriend Adele, who is married with child. Then he goes to the cemetery, sees his grave and learns that he is dead. The waitress Lucy from The Lake Pub goes home after her shift and while crossing a tunnel, she is stabbed by a hooded stranger to death.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "2550114", "rating": 8.0, "votes": 832, "number_of_episodes": 16}