{"cast": {"0175931": "Anne Consigny", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0682692": "Frédéric Pierrot", "0524217": "Laurent Lucas", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0320759": "Ana Girardot", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0803332": "Jean-François Sivadier", "1044641": "Michaël Abiteboul", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "5412859": "Brune Martin", "0208402": "Laetitia de Fombelle", "5166668": "Armande Boulanger", "3312875": "Ernst Umhauer", "3657567": "Guillaume Marquet", "0135084": "Laurent Capelluto", "4283672": "Pauline Parigot", "2147139": "Matila Malliarakis", "4461361": "Thomas Doret", "2169092": "Vladimir Consigny", "1577101": "Nicolas Wanczycki", "0714534": "Aurélien Recoing", "2606407": "Monique Roussel", "0529745": "Claude Lévèque", "3718145": "Mélodie Richard", "5292597": "Robin Barde", "1232469": "Julien Gauthier", "1364145": "Pierre Nisse", "0651974": "Henri-Edouard Osinski", "1108374": "Olivier Augrond", "2294200": "Béatrice de la Boulaye", "4090212": "Jake J. Meniani", "7666548": "Roméo Grobon", "7666642": "Nina de Tonquedec", "7666643": "Lyse Guignery", "7666644": "Lucas Crepy", "7666645": "Tom Hoareau", "7666646": "Charly Donzel Gargand", "7666647": "Martin Brunet", "7666648": "Gustave Dô Múu", "3543541": "Fabien Jegoudez", "7552766": "Vincent Bonet", "5448826": "Alain Cogne", "2372335": "Alice Butaud", "3473483": "Martin De Myttenaere", "4715058": "Lucie Rébéré"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["65"],  "plot": ["After the shooting the Seguret family try to leave town, but Camille cannot stay with her family and must join The Returned. Alcide takes Simon and Adele's baby to Lucy, but it is too late The Horde has dispersed.", "Thirty-six years ago, Lucy arrived at The Lake Pub saying that she is looking for someone and asked for a job to Milan, but he says that she is unnecessary. Alcide abducts the baby and delivers to Lucy, but she says that it is too late since the Returned have dispersed. The military believe Adele has kidnapped the baby, Jerome brings his family and Chloe to his car to leave the town and Camille asks him to stay since she has bruises in her body. Berg and Etienne meet Victor, who tells them that Julie is in danger. Audrey notes that her mother died and has a surprising action. When Julie sees, she calls Pierre's men. Jerome is fleeing through a secondary road and is intercepted by Frederik. He shoots and kills Camille, and Claire shoots him too. Adele and Simon are unsuccessfully looking for Nathan. They walk through the woods until they reach a cave where Lucy might be. The commandant talks to Father Jean-François, who confirms that the dead are returning but without any intention to harm the living. Further, he suggests the commandant to let them go. Meanwhile, the soldiers capture a horde of Returned. Jerome and his family summon the Returned and Virgil revives Camille; however, she has to follow him now. Pierre loses his leadership since people do not thrust him anymore. The commandant lets the prisoners go and remove the blockage from the roads. Lucy recovers her leadership after Alcide delivers the baby to her. Berg, Etienne and Victor arrive at the Helping Hand looking for Julie and the boy finds her in the basement. All the Returned join together and follow Lucy. Only Julie and Victor flee, but Lucy meets them and asks him to go with her for the safety of Julie. Pierre meets Milan at The Lake Pub and commits suicide. Adele and Simon reach the other side of the cave and Julie asks Lucy to stay with Victor.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4499444", "rating": 7.6, "votes": 343, "number_of_episodes": 16}