{"cast": {"0175931": "Anne Consigny", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0682692": "Frédéric Pierrot", "0524217": "Laurent Lucas", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0320759": "Ana Girardot", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0803332": "Jean-François Sivadier", "1044641": "Michaël Abiteboul", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "5412859": "Brune Martin", "0208402": "Laetitia de Fombelle", "5166668": "Armande Boulanger", "3312875": "Ernst Umhauer", "3657567": "Guillaume Marquet", "0135084": "Laurent Capelluto", "2372335": "Alice Butaud", "4283672": "Pauline Parigot", "4461361": "Thomas Doret", "2147139": "Matila Malliarakis", "2169092": "Vladimir Consigny", "1577101": "Nicolas Wanczycki", "1900143": "Grégoire Monsaingeon", "3718145": "Mélodie Richard", "0098998": "Hugues Boucher", "4981468": "Vincent Trouilleux", "0383204": "Pierre Hiessler", "0651974": "Henri-Edouard Osinski", "3473483": "Martin De Myttenaere", "0012495": "Franck Adrien", "2873722": "Fabrice Abraham"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["53"],  "plot": ["Jerome and Berg encounter Audrey, who has escaped from the Domain. Simon warns Adele to hide their baby from The Returned. Sensing Julie is in danger, Victor decides to leave the Domain - accompanied by Madame Costa.", "Thirty-five years ago, three months after the burst of the dam, Mrs. Costa meets Louis at home, and he is drawing her dog Titus and Mrs. Costa laying down on the floor. People are scared with Louis since he has drawn the burst of the dam before the event happened. Soon Mrs. Costas learns the meaning of his drawing. Nowadays, Louis has a nightmare with Julie and asks Mrs. Costas to go with him to look for her. They go to her house and Louis says that they shall wait for her since she will return home. Meanwhile, Julie visits Mr. Lewanski at the hospital and the gentle nurse Ophélie explains that he has been in a coma for six months due to a head injury and had no visitor. She also gives shelter to Lucy in a wing that is shut off. Adele, Justin, Chloe and the baby Nathan looks for shelter with Father Jean-François that protects them from the police. The Father baptizes Nathan. Julie and Morgane are looking for the baby. Lena learns that Camille is seeing Virgil. Audrey arrives at Jerome's house and meets him with Berg that is helping with his investigation. She asks Jerome to inform her mother Sabrine and tells them the whereabouts of Claire, Lena and Camille. Jerome goes to the Helping Hand and informs Sabrine where Audrey is, but she betrays her daughter and tells Pierre and his men where Audrey is. Yan is wounded but Pierre does not take him to the hospital. Esteban, who is mute and weird, leaves Claire's house and joins the others. Toni and Serge receive the visit of several women that Serge killed in the tunnel. Lucy tells the scared Alcide that she wants to retrieve the baby and Simon and says that they did not kill the police officers.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4499424", "rating": 7.3, "votes": 234, "number_of_episodes": 16}