{"cast": {"0175931": "Anne Consigny", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0682692": "Frédéric Pierrot", "0524217": "Laurent Lucas", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0320759": "Ana Girardot", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0803332": "Jean-François Sivadier", "1044641": "Michaël Abiteboul", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "5412859": "Brune Martin", "0208402": "Laetitia de Fombelle", "5166668": "Armande Boulanger", "3312875": "Ernst Umhauer", "3657567": "Guillaume Marquet", "2372335": "Alice Butaud", "4283672": "Pauline Parigot", "2147139": "Matila Malliarakis", "3718145": "Mélodie Richard", "1577101": "Nicolas Wanczycki", "2169092": "Vladimir Consigny", "0734004": "Pierre Rochefort", "0346363": "Samir Guesmi", "1900143": "Grégoire Monsaingeon", "1711668": "Franck Mignat", "0098998": "Hugues Boucher", "4981468": "Vincent Trouilleux", "0383204": "Pierre Hiessler", "0012495": "Franck Adrien", "5292597": "Robin Barde", "4517453": "Clémentine Verdier", "0651974": "Henri-Edouard Osinski", "1108374": "Olivier Augrond", "1232469": "Julien Gauthier"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["53"],  "plot": ["Sandrine hands Audrey over to Pierre's men, who keep her in the cellar. Hiding in the church, Adele and Simon come to terms with each other. Julie has found Victor's father, who is now an old man in a coma and holds a dark secret.", "Ten years ago, Esther leaves The Lake Pub and when she is ready to cross the tunnel, Louis stops her and asks her not to cross the tunnel. Suddenly, Serge attacks and kills her. Nowadays, Toni tells Serge that he knew Esther from the pub, and they should take her home to her parents. When they find her building, it seems to be empty, and she returns through the tunnel where she died. Toni demands that Serge asks her to forgive him. Jerome and Berg are crossing the woods looking for Jerome's family and they see another hole. Then they see one Returned and follow him. Virgil meets Camille at her room, and Claire finds him and tries to defend her daughter. The soldiers find the decomposed corpse of Thomas in the woods. Julie sees Mr. Lewanski and when she talks about his son Louis, he has a heart attack. When he recovers, she learns that Louis was an adopted son. Adele decides to go to the police with Nathan to show that he is fine, and leaves Chloe and Simon at home. Lucy and her two friends arrive at Adele's apartment and try to convince Simon to return with them, but he refuses. Frederic and Lucho find Mrs. Costa and Louis at Julie's apartment, and Lucho shoots her. Then he commits suicide jumping off the window. Sandrine is with Yan at the Helping Hand, and sees that Pierre is torturing Audrey. Jerome and Berg follow the man and see he meets with Virgil and other Returned. Adele asks to see Thomas' body at the morgue, and he tells her that Simon killed him. The divers find Milan at the bottom of the lake and take him to the hospital. Lena leaves the house to look for her father; she finds him near the house and brings him home. When they decide to leave the house, they are under siege of the Returned.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4499426", "rating": 7.3, "votes": 229, "number_of_episodes": 16}