{"cast": {"0175931": "Anne Consigny", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0682692": "Frédéric Pierrot", "0524217": "Laurent Lucas", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0320759": "Ana Girardot", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0803332": "Jean-François Sivadier", "1044641": "Michaël Abiteboul", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "5412859": "Brune Martin", "0208402": "Laetitia de Fombelle", "5166668": "Armande Boulanger", "3312875": "Ernst Umhauer", "3657567": "Guillaume Marquet", "0135084": "Laurent Capelluto", "2372335": "Alice Butaud", "4461361": "Thomas Doret", "2169092": "Vladimir Consigny", "2147139": "Matila Malliarakis", "1577101": "Nicolas Wanczycki", "0734004": "Pierre Rochefort", "0714534": "Aurélien Recoing", "4981468": "Vincent Trouilleux", "0012495": "Franck Adrien", "0383204": "Pierre Hiessler", "3473483": "Martin De Myttenaere", "1108374": "Olivier Augrond", "0848279": "Fabrice Talon", "2873722": "Fabrice Abraham", "1232469": "Julien Gauthier", "0869478": "Guillaume Toucas", "7631521": "Antonin Herpe", "7631522": "Loris Schaub", "0098998": "Hugues Boucher", "7617140": "Amandine Blanquart", "1905802": "Aurélien Osinski", "7552766": "Vincent Bonet"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["55"],  "plot": ["An uneasy Julie decides to leave the Domaine, Camille's growing relationship with Virgil upsets her mother, while Adele bonds with her new-born baby. Berg thinks that he may have found the reason for the flood.", "Thirty-five years ago, Lucy is in love with Morgane. They leave home during a stormy night and see the old dam collapsing. Then they see the flooded town with Madame Costa, Victor's mother and her two children and Milan, who calls her. On the present days, Morgane returns with others dead people. At the morgue, the army brings twenty-one police officers, all of them shot dead and tied to the trees six months ago. However, one police officer is missing. Berg finds a huge and deep hole, and the soldiers are unsuccessfully trying to reach its bottom. Jerome visits the Helping Hand to look for Lena and sees Sandrine and Yan, who are in denial that Audrey has returned. Lena is at Serge's house and Milan demands that Serge takes her to the clearing and execute her. Serge asks Lena to leave the place, but she wants to know where Camille is and does not listen to him. Camille is aggressive with Claire and Esteban wants to see his parents, despite the warning that they committed suicide. Lucy is now with Morgane and asks Simon to bring the baby to them. Adele comes back home with her baby and after a period of ignoring him, her motherhood instinct prevails. Chloe calls the baby Nathan and sings the song that Simon used to sing to her, and Adele feels that she is seeing Simon. Julie is in conflict with Victor's mother and decides to leave the house. Claire finds that Esteban has left her house and Camille goes after him. She goes with Virgil to Esteban's house, and they find him. Pierre is keeping Toni prisoner expecting him to say where the returned are hidden.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4499410", "rating": 7.3, "votes": 255, "number_of_episodes": 16}