{"cast": {"0175931": "Anne Consigny", "1202905": "Clotilde Hesme", "2072818": "Céline Sallette", "0682692": "Frédéric Pierrot", "0524217": "Laurent Lucas", "1687610": "Grégory Gadebois", "0332267": "Guillaume Gouix", "1391094": "Pierre Perrier", "0320759": "Ana Girardot", "4820190": "Yara Pilartz", "3814101": "Jenna Thiam", "5378629": "Swann Nambotin", "0803332": "Jean-François Sivadier", "1044641": "Michaël Abiteboul", "1350207": "Constance Dollé", "0456268": "Jérôme Kircher", "5412859": "Brune Martin", "5166668": "Armande Boulanger", "3312875": "Ernst Umhauer", "2169092": "Vladimir Consigny", "3657567": "Guillaume Marquet", "0135084": "Laurent Capelluto", "2372335": "Alice Butaud", "0208402": "Laetitia de Fombelle", "4283672": "Pauline Parigot", "2147139": "Matila Malliarakis", "1577101": "Nicolas Wanczycki", "0734004": "Pierre Rochefort", "0346363": "Samir Guesmi", "0714534": "Aurélien Recoing", "7666546": "Geoffrey de Sainte Laurette", "1900143": "Grégoire Monsaingeon", "7666547": "Thomas Rortais", "4090212": "Jake J. Meniani", "2294200": "Béatrice de la Boulaye", "1364145": "Pierre Nisse", "5292597": "Robin Barde", "4517453": "Clémentine Verdier", "0651974": "Henri-Edouard Osinski", "1232469": "Julien Gauthier", "5952549": "Jules Debuyst", "7631521": "Antonin Herpe", "7631522": "Loris Schaub", "7666548": "Roméo Grobon", "7666642": "Nina de Tonquedec", "7666643": "Lyse Guignery", "7666644": "Lucas Crepy", "7666645": "Tom Hoareau", "7666646": "Charly Donzel Gargand", "7666647": "Martin Brunet"}, "geners": ["Drama", "Fantasy", "Horror", "Mystery"], "runtimes": ["58"],  "plot": ["In the Domain, Jerome is reunited with Claire, Camille and Lena but The Returned won't let them leave. The army lower the water level and plan to re-integrate the Domain with the rest of town, which would force The Returned into exile.", "Thirty-five years ago, and ten months after the burst of the dam, Milan gathers a group of grieving residents of the sect \"The Circle\" in a clearing in the woods and a man named Etienne kills them all. Milan kills Etienne. Pierre kills Milan but is afraid to commit suicide and flees. Louis watches everything. Nowadays, Pierre and Frederik are discussing about Victor's abilities, but he is called to see Sandrine in the basement. She asks him to release Audrey, but he refuses. Lucy asks Virgil to bring Camille with them, but she refuses to leave her family. Then the horde of Returned leaves the place and Jerome, Claire, Lena and Camille stumble upon the soldiers that are exploring that area. Julie brings the Returned through the woods; when a helicopter passes by, they disperse, and Berg brings Etienne home. Etienne is the designer of the dam and father of Berg, who recalls the day that Victor arrived and told them that the dam would collapse in the future with many casualties. Adele wants Nathan back, but the doctor and the soldiers do not deliver him to her. Meanwhile, Simon and Chloe are looking for the baby. Mr. Lewanski dies, and Mrs. Costa is brought dead to the hospital, but she revives and tells Julie that Victor was at the Helping Hand the last time she saw him. Jerome and his family are arrested in the same room where Adele is, and soon Chloe arrives and says that Simon is waiting for them outside. The commandant in charge of the investigation is intrigued by Milan and Camille, who were declared dead years ago. Julie goes to the Helping Hand looking for Victor and Pierre and Frederik arrest her in the basement with Audrey and Sandrine. However, Adele stays on the street to look for Nathan and asks Jerome to take care of Chloe.—Claudio Carvalho, Rio de Janeiro, Brazil"], "genres": "N/A", "imdbID": "4499438", "rating": 7.4, "votes": 227, "number_of_episodes": 16}