{"cast": {"0850102": "Amanda Tapping", "0242903": "Robin Dunne", "2422305": "Emilie Ullerup", "0382216": "Christopher Heyerdahl", "0730455": "Ryan Robbins", "0808902": "Kavan Smith", "0565973": "Kandyse McClure", "2102545": "Cainan Wiebe", "0793946": "Peter Shinkoda", "0132310": "Chuck Campbell", "0698345": "Brad Proctor", "2661003": "Darien Provost", "0687924": "Nicholas Podbrey", "1027678": "Michael Adamthwaite", "1105846": "Malik McCall", "1284045": "Diana Pavlovská", "2874797": "Aidan Pringle", "2008609": "Mihola Terzic", "0730510": "Lauren K. Robek", "1683815": "Dana McLoughlin", "0423637": "Dan Joffre", "0790264": "Dan Shea", "2973393": "Amanda May", "2618223": "Ian A. Wallace", "1949795": "Ivan De Leon", "0367762": "Ellie Harvie", "1535333": "Sheri Rabold", "0659698": "Panou", "1269863": "Yaroslav Poverlo"}, "geners": ["Action", "Drama", "Fantasy", "Mystery", "Sci-Fi"], "runtimes": ["47"],  "plot": ["When called to the scene of a horrendous crime Will sees that the police are not being told the whole truth. His insights into the case attract the interest of Dr. Helen Magnus who introduces him to her sanctuary for 'abnormals,' creatures that have remained hidden from most of the world only appearing occasionally as characters in stories and myths.—ladee_sarah", "Dr. Will Zimmerman is a police profiler. When he is called to the scene of a shooting where two policemen died, he immediately knows something is wrong. The family of four who lived in the apartment claim the cops were killed by a gunman but Will is certain there is a fifth person who lives there, probably a teenager. The policeman in charge of the case isn't too interested in what Will has to say since they already have a suspect in mind. Will is eventually approached by Dr. Helen Magnus who runs a sanctuary for creatures that most people would call monsters. She even knows of an incident from Will's youth and invites him to visit her facilities. Meanwhile, a violent stranger is also trying to find his way into Magnus' sanctuary.—garykmcd"], "genres": "N/A", "imdbID": "1179688", "rating": 7.3, "votes": 561, "number_of_episodes": 59}