{"cast": {"0614165": "Cillian Murphy", "2167957": "Paul Anderson", "3771184": "Joe Cole", "0497970": "Packy Lee", "0000554": "Sam Neill", "5568680": "Alfie Evans-Meese", "0325221": "Iddo Goldberg", "2570706": "Sophie Rundle", "1139484": "Lorraine Horgan", "0567031": "Helen McCrory", "0068430": "Neil Bell", "0827067": "Jonty Stephens", "0686029": "Tony Pitts", "0638762": "Andy Nyman", "0669667": "Ian Peck", "0219329": "Ned Dennehy", "1834115": "Annabelle Wallis", "0187224": "Charlie Creed-Miles", "2116654": "David Dawson", "4216326": "Lee Bolton", "3364235": "Neil Broome", "4542634": "Eric Campbell", "5367269": "Paul Chadwick", "4785715": "Charlie Cook", "0366838": "Jack Hartley", "4786144": "Kevin Knox", "10329964": "Nigel Lowe", "3622876": "Kevin Metcalfe", "4596931": "Jamie Moore", "3451817": "Heather Newland", "5874123": "Jeffrey Postlethwaite", "5860972": "Matthew Postlethwaite", "5649210": "Bianca Rudman", "6066682": "Pete Szoradi", "0871425": "Nigel Travis", "4716838": "Patricia Winker"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Thomas Shelby starts a feud with a gypsy family and finally meets with Inspector Campbell to talk about the stolen guns.", "Thomas continues dating Grace, barmaid at the Garrison pub, unaware that she has been planted by Campbell to spy on his activities. At a country fair outside the city Thomas gets into a fight with the Lees, a violent family of travellers, who later send him a bullet with his name on, giving him another adversary to rank alongside Billy Kimber. Campbell sends a message to Thomas via Aunt Polly and they meet on neutral ground at a hotel. Thomas proposes to Campbell that if he leaves him alone he will return the guns. If he is arrested the guns will be sent to the IRA in Ireland. If not the weapons will be given to Campbell to make him appear a hero. Campbell is unhappy but reluctantly agrees. Ada falls pregnant by Freddie Thorne and Thomas sends a message to Freddie demanding he leaves Birmingham. Freddie, however, decides to stay and face him.—don @ minifie-1", "After Campbell's protestant cohort brutally searches the Catholic church, Thomas's Aunt Polly blames him to confront an enemy too large, as with Kimber, but is duly laughed away. After buying a race horse, turning out poisoned, from the rival Lee gypsy family ends in a bloody fight, prevailing Thomas offers Campbell a deal: the arms Churchill wants at all cost for a virtual free rein in 'common' crime. Sister Ada is rescued from a raid on Communists by lover Freddie Thorne, Thomas's craziest comrade in arms, who makes a run for it, turns out the father of her baby and returns to wed her. Thomas proposes national gambling baron Kimber a deal at the Lees' expense.—KGF Vissers"], "genres": "N/A", "imdbID": "2471502", "rating": 8.2, "votes": 12640, "number_of_episodes": 36}