{"cast": {"0150999": "Lobo Chan", "0614165": "Cillian Murphy", "0954981": "Benjamin Zephaniah", "5568680": "Alfie Evans-Meese", "3771184": "Joe Cole", "2167957": "Paul Anderson", "0000554": "Sam Neill", "0325221": "Iddo Goldberg", "0068430": "Neil Bell", "4735652": "Samuel Edward-Cook", "0567031": "Helen McCrory", "2570706": "Sophie Rundle", "0219329": "Ned Dennehy", "0669667": "Ian Peck", "0686029": "Tony Pitts", "1834115": "Annabelle Wallis", "0638762": "Andy Nyman", "4216326": "Lee Bolton", "5087860": "James Jaysen Bryhan", "4542634": "Eric Campbell", "5367269": "Paul Chadwick", "5736211": "Alison Harris", "0366838": "Jack Hartley", "4510796": "Allan Hopwood", "3622876": "Kevin Metcalfe", "5118698": "Stephen Mosley", "3390692": "Calum O'Toole", "4016944": "Nick Owenford", "5874123": "Jeffrey Postlethwaite", "5860972": "Matthew Postlethwaite", "3820627": "Robert Rae-Lewis", "5649210": "Bianca Rudman", "5043434": "David Swift", "6066682": "Pete Szoradi", "3947138": "Liam Tulley", "5624308": "Harrison Vaughan", "4713607": "Ernest Vernon", "1246133": "Margaret Wheldon", "4716838": "Patricia Winker"}, "geners": ["Crime", "Drama"], "runtimes": ["58"],  "plot": ["Thomas Shelby plans to fix a horse race; some guns turn up stolen.", "In Birmingham just after the Great War trenches veteran Thomas Shelby leads his gang, the Peaky Blinders, so named as they carry lethal razors in their peaked caps, who make money from illegal betting and the black market. Thomas, by mistake, appropriates a consignment of guns which have been stolen from the local arms factory and hard-nosed Inspector Campbell arrives from Ireland, charged by war minister Winston Churchill to recover it. Thomas's aunt Polly urges him to return it but he sees the opportunity to use it to his advantage. Thomas also quarrels with his elder brother Arthur as Thomas has devised the 'powder trick', a means of fixing horse races and Arthur is nervous as Thomas has not involved Billy Kimber, who runs the race-courses and their rackets. Thomas's sister Ada is in love with Freddie Thorne, who saved her brother's life in the war, and is now a Marxist, encouraging workers to strike over a pay cut. As far as Campbell is concerned Freddie is as much the enemy - in the wake of the Russian revolution - as the Peaky Blinders, as he looks for the missing guns.—don @ minifie-1", "In 1919 the Peaky Blinders, an Irish-roots crime gang in Birmingham, led by Thomas \"Tommy\" Shelby, a decorated the Great War veteran sergeant major, control the horse race gambling and black market, but 'accidentally' appropriate a consignment of guns from the local arms factory destined for Lybia. War minister Winston Churchill sends Belfast Constabulary-veteran Inspector Chester Campbell to Birmingham to retrieve the guns. Tommy's aunt Polly urges Tommy to return the guns, which he promises, but he feels that he can use them to his advantage. His traditionalist brother Arthur does not agree with inventive Tommy about fixing horse races, believing it will cause trouble with Billy Kimber, who runs the races, as well as the Chinese coolie colony. Inspector Campbell and his men (alos protestants form Belfast) capture and torture Arthur inquiring about the gun robbery. Campbell propositions Arthur and the gang to work with him to find the guns. Tommy's sister Ada is involved with communist labor union leader Freddie Thorne, also a veteran. Barmaid Grace Burgess starts working at the Garrison, a bar owned by the Peaky Blinders, but was planted in Birmingham by Campbell as spy. Tommy's friend Danny has a PTSD episode and kills an Italian business owner. To avoid a war with the Italians, Tommy agrees to execute Danny, with the Italians witnessing, but the shot is staged and Danny goes to London on a special assignment.—KGF Vissers"], "genres": "N/A", "imdbID": "2471500", "rating": 8.0, "votes": 15007, "number_of_episodes": 36}