{"cast": {"2570706": "Sophie Rundle", "0325221": "Iddo Goldberg", "0403461": "John-Paul Hurley", "0614165": "Cillian Murphy", "0954981": "Benjamin Zephaniah", "0871425": "Nigel Travis", "3622876": "Kevin Metcalfe", "0567031": "Helen McCrory", "3771184": "Joe Cole", "2167957": "Paul Anderson", "5568680": "Alfie Evans-Meese", "0497970": "Packy Lee", "0103415": "Therese Bradley", "0000554": "Sam Neill", "0686029": "Tony Pitts", "0187224": "Charlie Creed-Miles", "2116654": "David Dawson", "1834115": "Annabelle Wallis", "3761798": "Natasha O'Keeffe", "0669667": "Ian Peck", "2929682": "Aimee-Ffion Edwards", "1640971": "Sam Lee", "5723554": "Colin Alltree", "6652882": "Alan Bentley", "4216326": "Lee Bolton", "4015906": "Russ Booth", "4542634": "Eric Campbell", "5367269": "Paul Chadwick", "7477896": "Isabelle Estelle Corbusier", "0219329": "Ned Dennehy", "0366838": "Jack Hartley", "5874123": "Jeffrey Postlethwaite", "5860972": "Matthew Postlethwaite", "6066682": "Pete Szoradi", "3947138": "Liam Tulley", "4716838": "Patricia Winker"}, "geners": ["Crime", "Drama"], "runtimes": ["59"],  "plot": ["Thomas attempts to make a deal with Campbell; The Peaky's war with the Lees intensifies.", "Thomas now has a legitimate betting licence and, although he is suspicious that she is not what she seems to be, employs Grace as his secretary. Younger brother John announces that, to give his children a mother, he is to marry again but Thomas disapproves of his choice of bride, prostitute Lizzie. Although the Lees attack and rob the Shelby house Thomas proposes a truce so that they can ally against Kimber. As part of the deal John marries the Lees' daughter Esme and Thomas sends word to Ada to attend the wedding. She is heavily pregnant and goes into labour at the Shelbys' house. Freddie is summoned but he is arrested by Campbell.—don @ minifie-1", "Tommy legitimates his business by obtaining a betting license. Although he does not quite trust her and is suspicious of her, Tommy hires Grace as his secretary. John tells the assembled family he wants to marry Lizzie, a local prostitute, whom Tommy proves hasn't given up her former profession as she agrees to take him as client. After the Lees rob the Shelbys' gambling den as revenge for the Peaky Blinders having protected Billy Kimber's bookies at the races, Tommy calls a truce with them as an ally against Billy Kimber and marries initially reluctant John to the Lees' foxy daughter Esme to secure the agreement. Ada goes into labor soon after the wedding. Freddie is arrested by Campbell when he comes to see the new baby.—KGF Vissers"], "genres": "N/A", "imdbID": "2461634", "rating": 8.5, "votes": 11596, "number_of_episodes": 36}