{"cast": {"0150999": "Lobo Chan", "0000554": "Sam Neill", "0614165": "Cillian Murphy", "2167957": "Paul Anderson", "0219329": "Ned Dennehy", "3771184": "Joe Cole", "2929682": "Aimee-Ffion Edwards", "0567031": "Helen McCrory", "5325480": "Kunjue Li", "1834115": "Annabelle Wallis", "0686029": "Tony Pitts", "0669667": "Ian Peck", "3622876": "Kevin Metcalfe", "2570706": "Sophie Rundle", "0325221": "Iddo Goldberg", "1186830": "Perry Fitzpatrick", "0638762": "Andy Nyman", "5568680": "Alfie Evans-Meese", "4735652": "Samuel Edward-Cook", "0068430": "Neil Bell", "0954981": "Benjamin Zephaniah", "0187224": "Charlie Creed-Miles", "5723554": "Colin Alltree", "5660709": "Pamela Ashton", "6652882": "Alan Bentley", "4216326": "Lee Bolton", "4542634": "Eric Campbell", "5367269": "Paul Chadwick", "7477896": "Isabelle Estelle Corbusier", "0366838": "Jack Hartley", "6388152": "Tim Kinneally", "5874123": "Jeffrey Postlethwaite", "5860972": "Matthew Postlethwaite"}, "geners": ["Crime", "Drama"], "runtimes": ["55"],  "plot": ["Tommy and the Peaky Blinders prepare for a big operation, that quickly becomes way trickier than they thought.", "Campbell confirms to Churchill's Minister that Grace may be commended for her part in finding the missing guns. Polly warns Grace that she knows Grace's secret and will never forgive her, so leave fast forever. The Peaky Blinders, led by Danny, spring Freddie from jail, wielding the held-back machine gun. IIgnoring that, Campbell ordered his men to stand by in other quarters while Tommy gathers the Peaky Blinders and the Lees to overtake Kimber's men at the tracks, but tipped-off Kimber catches the Shelbys off guard and outnumbered at home. Freddie helps the Peaky Blinders by bringing out a machine gun from the stolen weapons, while Ada jumps in between the standoff with the pram demanding peace. Kimber opens fire, killing Danny and injuring Tommy, who shoots Kimber dead. Tommy meets Grace who admits her police identity, insisting she really loves him and will go to London for a few days, having an idea of how they can be together. While Tommy writes a letter and flips a coin to decide if he will go with Grace, Campbell confronts Grace at the railway station pointing his pistol at her.—KGF Vissers"], "genres": "N/A", "imdbID": "2461638", "rating": 9.1, "votes": 13532, "number_of_episodes": 36}