{"cast": {"0614165": "Cillian Murphy", "0567031": "Helen McCrory", "2570706": "Sophie Rundle", "0325221": "Iddo Goldberg", "1834115": "Annabelle Wallis", "2167957": "Paul Anderson", "3771184": "Joe Cole", "0497970": "Packy Lee", "0390319": "Nick Holder", "0281107": "Tommy Flanagan", "5568680": "Alfie Evans-Meese", "2534167": "Tom Vaughan-Lawlor", "0000554": "Sam Neill", "0686029": "Tony Pitts", "1833012": "Keith Dunphy", "0068430": "Neil Bell", "2929682": "Aimee-Ffion Edwards", "5723554": "Colin Alltree", "2194892": "William Atkinson", "6652882": "Alan Bentley", "4216326": "Lee Bolton", "4542634": "Eric Campbell", "5367269": "Paul Chadwick", "7477896": "Isabelle Estelle Corbusier", "0219329": "Ned Dennehy", "7739785": "Martin Hammond", "0366838": "Jack Hartley", "3622876": "Kevin Metcalfe", "5874123": "Jeffrey Postlethwaite", "5860972": "Matthew Postlethwaite", "6066682": "Pete Szoradi", "4716838": "Patricia Winker"}, "geners": ["Crime", "Drama"], "runtimes": ["57"],  "plot": ["The Shelbys get a surprise visit by an almost forgotten relative. Thomas has one more dangerous plan with the cops.", "Arthur Senior, who deserted the family a decade ago, returns. Tommy wants nothing to do with him, but 'family head' Arthur Jr. believes he has changed and gives their father a fortune to build casino-hotels in America, only for Arthur Sr. to abscond with it. An IRA leader starts inquiring about the man Grace killed, his brother, and demands the stolen arms, but Grace helps Tommy set a counter-trap and kill him and other IRA member, despite Campbell's less the cooperative lurking cops. In love with Tommy, Grace tells Inspector Campbell that if she tells him where the guns are, he must leave Tommy and his family alone, having guessed the arms are buried in the lead-coated false grave for Danny who is not really dead. Grace informs Campbell and resigns service to the crown. Inspector Campbell proposes marriage, which Grace rejects. Grace and Tommy consummate their connection, secretly witnessed by Campbell, who still calls off the dogs to spare her, and delays his return now the mission is completed. Arthur Junior fails trying to hang himself, Tommy delights him by making the three adult brothers notarized equal partners in the legalized gambling business.—KGF Vissers"], "genres": "N/A", "imdbID": "2461632", "rating": 8.8, "votes": 12176, "number_of_episodes": 36}