{"cast": {"0614165": "Cillian Murphy", "0000554": "Sam Neill", "0567031": "Helen McCrory", "2167957": "Paul Anderson", "0325221": "Iddo Goldberg", "1834115": "Annabelle Wallis", "2570706": "Sophie Rundle", "3771184": "Joe Cole", "0219329": "Ned Dennehy", "2116654": "David Dawson", "0187224": "Charlie Creed-Miles", "1221808": "Karl Shiels", "1833012": "Keith Dunphy", "0686029": "Tony Pitts", "0150999": "Lobo Chan", "0068430": "Neil Bell", "5568680": "Alfie Evans-Meese", "4735652": "Samuel Edward-Cook", "0669667": "Ian Peck", "5333989": "Emma Pearce", "0871425": "Nigel Travis", "0085637": "Richard Blackburn", "4216326": "Lee Bolton", "4015906": "Russ Booth", "3364235": "Neil Broome", "4542634": "Eric Campbell", "5367269": "Paul Chadwick", "5103443": "Grant Crookes", "3417246": "Katie Derry", "0366838": "Jack Hartley", "3622876": "Kevin Metcalfe", "3451817": "Heather Newland", "5045226": "Hugh O'Brien", "4016944": "Nick Owenford", "5106553": "Jade Phipps", "5874123": "Jeffrey Postlethwaite", "5860972": "Matthew Postlethwaite", "5766548": "Tom Raven"}, "geners": ["Crime", "Drama"], "runtimes": ["56"],  "plot": ["Thomas is livid to find out that Ada and Freddie are married; IRA sympathizers tries to get information from Thomas about the stolen guns.", "Thomas is approached by two IRA members anxious to buy the guns, though he is careful not to commit himself. Grace, who has overheard, follows the Irishmen and ends up shooting one in self-defence though the IRA suspect the Peaky Blinders. Next day Thomas takes Grace to Cheltenham races, where he warns Kimber that the Lees are out to rob him. Arthur brings a gang who relieve the Lees of the money stolen as a result of which Kimber hires the Blinders as his security. He also tries to have his way with Grace but Thomas saves her by ungallantly claiming that she has syphilis. Ada and Freddie are married and Polly gives them money to escape Thomas's anger and leave the country but Freddie stays, bringing the arms workers out on strike and returning Thomas's money. That night Thomas dreams about how Freddie saved him during the war.—don @ minifie-1", "Thomas appeases his big, alcoholic brother Athur by putting him in charge of base pub The Garrison, still ignoring that superior barmaid Grace Burgess there is paying off as Campbell's spy, so covers her even after she kills an armed IRA man after Tommy dismissed a republican 'delegation' demanding delivery of the BSA arms. Arthur also leads a hard-handed demonstration that Peaky Blinders can guard the races far better then KImber's lax own security, who are on the take from the Lee gypsies, who are beaten up bloodily. Kimber agrees to a deal, but demands as 'premium' to fuck Grace, who resists rape but is rescued by Tommy pretending she has venereal diseases. Thomas gets nightmares from conflicting loyalties to his Great War comrade in arms, Ada's fresh husband Freddie Thorne, who returned from London hiding and even resumes his syndicalist action, and the Peaky Blinder interest in the deal with Campbell, who can't tolerate a Communist agitator, while aunt Poly''s naive New York emigration offer fails.—KGF Vissers"], "genres": "N/A", "imdbID": "2471506", "rating": 8.1, "votes": 11863, "number_of_episodes": 36}