{"cast": {"1834115": "Annabelle Wallis", "0614165": "Cillian Murphy", "0000554": "Sam Neill", "2570706": "Sophie Rundle", "2167957": "Paul Anderson", "0567031": "Helen McCrory", "2929682": "Aimee-Ffion Edwards", "3771184": "Joe Cole", "0669667": "Ian Peck", "0686029": "Tony Pitts", "1449578": "Colin Connor", "5624308": "Harrison Vaughan", "6804376": "Harry Kirton", "2034064": "Simone Kirby", "0444676": "Rory Keenan", "6791920": "Richard Patterson", "0568611": "Paul McEwan", "2082147": "Daniel Fearn", "0219329": "Ned Dennehy", "3761798": "Natasha O'Keeffe", "0939771": "Jane Wood", "1868206": "Sam Battersea", "4209973": "Rory Gallagher", "1527247": "Alastair Barley", "0521725": "Dorian Lough", "0564500": "Richard McCabe", "4050922": "James Boyland", "6791921": "Tom Mothersdale", "0852965": "Noah Taylor", "6304865": "Jordan Bolger", "4216326": "Lee Bolton", "4542634": "Eric Campbell", "6767196": "Luke Delaney", "3755752": "Philip Howard", "6388152": "Tim Kinneally", "1960816": "Jonathan Sisson", "5538851": "Nicola-Jayne Wells", "5152376": "Brian Woodward", "6473211": "Sam Wright"}, "geners": ["Crime", "Drama"], "runtimes": ["59"],  "plot": ["When Birmingham crime boss Tommy Shelby's beloved Garrison pub is bombed, he finds himself blackmailed into murdering an Irish dissident.", "Two years have elapsed. Freddie has succumbed to illness and at his funeral Thomas asks Ada to return home though she is scornful that he has been so successful with his mix of legal and illegal businesses. When his pub the Garrison is blown up he goes straight to the Black Lion to accuse his Irish rivals, who have a proposition for him involving murder. Returning home he informs the family that he plans to expand his bookies' business to London but John's wife Esme warns him of its dangers given the existing racial turf wars. He takes Arthur and John to London to a club run by Darby Sabini, who controls the southern race courses, where they are anything but welcome. Back in Birmingham Ada is abducted by Sabini's thugs, who give Thomas a severe beating, his being saved by the reappearance of Chester Campbell, who has told Churchill that he has a new undercover agent working in the area. Polly meanwhile visits a medium for news of the children who were taken from her in infancy.—don @ minifie-1", "Two years after Grace shot Campbell, the Garrison is blown up while the family attends Freddie Thorne's funeral. Tommy asks Ada to come home as he plans expansion into London. Tommy goes confront those responsible for the explosion, but is taken to meet with the IRA and assassinates someone on their demand. Campbell, promoted major, is returning to Birmingham. At the Shelby family meeting regarding the expansion of the bookie business, Tommy, Arthur and John overrule Polly and Esme's reservations to the plan to form an alliance there with the Jewish mob against the dominant Italians. Pretending to be on holiday, they men get familiar with the London scene and end up causing a rumpus at Darby Sabini's club. Polly consults a medium on the children that were taken from her. Tommy hires Lizzie as his secretary. In retaliation for the club incident, Sabini has his thugs kidnap and attempt to rape Ada, as well as beat Tommy to within an inch of his life, but major Campbell intervenes before Sabini's men can finish him off, as Churchill and he feel Tommy may prove useful.—KGF Vissers"], "genres": "N/A", "imdbID": "3655782", "rating": 8.4, "votes": 10552, "number_of_episodes": 36}