{"cast": {"0107950": "Jeremy Brett", "0121651": "David Burke", "0350330": "David Gwillim", "0858848": "Gareth Thomas", "0804162": "Alison Skilbeck", "0751425": "Ronald Russell", "0311224": "Nicholas Geake", "0685676": "Pamela Pitchford", "0539112": "John Malcolm", "0734832": "David Rodigan", "0558545": "Eve Matheson", "0769315": "Rosalie Williams", "0852613": "John Taylor"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["54"],  "plot": ["An unknown thief steals an important naval treaty from a Foreign Office clerk; Sherlock Holmes sets out to find it.", "An unknown thief steals an important naval treaty from the office of Mr. Percy Phelps, a Foreign Office clerk. Phelps's distress gives him a brain fever that lasts for nine weeks. As he begins to recover, he writes to his old schoolmate, Dr. Watson, begging him to invite Sherlock Holmes to investigate the matter and find the treaty. Otherwise, his honor and happiness are gone forever. Holmes takes up the case with zest, but gives Phelps no false hopes. The mystery is as dark and tangled as any he has known.—J. Spurlin", "When Dr. Watson receives a plea for help from an old school friend, Sherlock Holmes finds himself dealing a most baffling case. Percy Phelps is an officer at the Foreign Office and nine weeks previously had been tasked by Lord Holdhurst, one of the most senior men in the Foreign Office and Percy's uncle, to copy a naval treaty the British government recently negotiated with the Italians. The document is highly sensitive and the French and Germans would pay a high price for a copy. To his horror, the document was taken from his desk when Percy left the room momentarily. Since that time he has been convalescing at the home of his fiancée, Annie Harrison, a broken man who has nearly gone out of his mind with worry.—garykmcd", "Sherlock Holmes is hired by someone Watson knew at school, Percy Phelps. Mr Phelps works at the Foreign Office and was tasked with making a copy of a top secret Naval Treaty between Britain and Italy. This incredibly important document has been stolen, leaving Mr Phelps a broken man.—grantss"], "genres": "N/A", "imdbID": "0506452", "rating": 7.8, "votes": 1317, "number_of_episodes": 13}