{"cast": {"0107950": "Jeremy Brett", "0121651": "David Burke", "0165551": "Nicholas Clay", "0627822": "Patrick Newell", "0055291": "Tim Barlow", "0286604": "Brett Forrest", "0179893": "Charles Cork", "0727612": "John Ringham", "0769315": "Rosalie Williams", "0820087": "David Squire", "0590134": "Norman Mills", "0933781": "Lucy Anne Wilson", "0949499": "Dusty Young"}, "geners": ["Crime", "Drama", "Mystery"], "runtimes": ["51"],  "plot": ["Sherlock Holmes is contacted by Dr Trevelyan whose medical practice was set up and paid for by Mr Blessington who lives on the premises. Of late Mr Blessington has had spells of intense anxiety. Dr Trevelyan fears for his health and life.", "Dr. Percy Trevelyan seeks Sherlock Holmes' assistance in deciphering his benefactor's recent odd behavior. Trevelyan recounts that some years before, Mr. Blessington plucked him out of an obscure and virtually non-existent practice and offered to set him up at a prestigious address. In return for this investment, Blessington would receive a percentage of his income and would provide him with free medical care. For quite some time now the arrangement has worked well for both parties and Blessington has profited from the arrangement. Recently however, Blessington has been acting very strangely. Having read of a burglary in a nearby home, Blessington was overwrought and had bars installed on all the windows. Holmes is intrigued by the case but subsequent events soon have him investigating a murder.—garykmcd", "Sherlock Holmes is contacted by Dr Percy Trevelyan. Dr Trevelyan's medical practice was set up and paid for by Mr Blessington, who lives on the premises. Of late Mr Blessington has had spells of intense anxiety and fear. The doctor also had two Russian guests who disappeared mid-consultation but appeared to enter Mr Blessington's bedroom. Dr Trevelyan is worried for his benefactor's health and life.—grantss"], "genres": "N/A", "imdbID": "0506455", "rating": 8.0, "votes": 1094, "number_of_episodes": 13}