{"cast": {"3474956": "Riann Steele", "2876300": "Emily Bevan", "0627639": "Luke Newberry", "1270132": "Stewart Scudamore", "1924735": "Alexander Arnold", "1140350": "James Foster", "0186469": "Kenneth Cranham", "4909365": "Harriet Cains", "0378269": "Karen Henthorn", "0254927": "Juliet Ellis", "2174363": "Marie Critchley", "1883730": "Stephen Thompson", "0400373": "Sandra Huggett", "0878610": "Susan Twist", "4323630": "Lee Toomes", "5591570": "Rachel Toomes", "2334634": "Steve Cooper", "3906046": "Danielle Vitalis", "1770205": "John Owen-Jones", "0263740": "Steve Evets", "0915287": "Gillian Waugh", "1236809": "Kevin Sutton", "3137396": "Gerrard Thompson", "0866870": "Ricky Tomlinson", "4399920": "Oliver Birch", "0908873": "Sue Wallace", "0308650": "Steve Garti", "9956584": "Paul Humphreys", "5045226": "Hugh O'Brien"}, "geners": ["Comedy", "Drama", "Horror"], "runtimes": ["59"],  "plot": ["In an alternative Britain, zombies are being rehabilitated into society by the government. These sufferers of Partially Deceased Syndrome who can be saved are given flesh-tinted make-up and contact lenses to mask their situation though the vigilante Human Volunteer Force is anxious to do away with them. Young Kieren Walker, one of the sufferers, returns home to Roarton for rehabilitation, whilst his sister Jem is a member of the HVF led by fanatical Bill Macy and hate preacher Oddie. Even driving Kieren home his loving parents Steve and Sue risk an encounter with another vigilante Ken though friendly nurse Shirley shows them how to administer medication to keep their boy 'normal' whilst Shirley's son Philip is a fervent HVF devotee anxious to prove himself. Kieren himself decides to join the Undead Liberation Army but Oddie and Macy are onto him and it is Jem who saves him by diverting them towards another target.—don @ minifie-1", "Those suffering from partially deceased syndrome - zombies who rose from the grave but have now been successfully treated - are being reintegrated with society. Those who survived the zombie uprising remember a difficult and dangerous time and there continues to be opposition to the program despite the government's advice that the partially deceased are completely safe provided they take their medication. Kieren Walker has now returned home but it's clear that it will not be an easy transition. The local minister, Vicar Oddie is one of the leaders of the anti-zombie movement and Kieran's own sister Jem is a member of the Human Volunteer Force, the HVF, many of whom died during the uprising. Kieren's parents do their best to keep his return a secret but rumors begin to spread. Bill Macy, head of the local HVF plans to do something about it. Bill hears some surprising news when he returns home.—garykmcd"], "genres": "N/A", "imdbID": "2507526", "rating": 7.8, "votes": 478, "number_of_episodes": 9}