{"cast": {"2334634": "Steve Cooper", "2174363": "Marie Critchley", "0627639": "Luke Newberry", "0263740": "Steve Evets", "1720738": "David Walmsley", "3137396": "Gerrard Thompson", "1236809": "Kevin Sutton", "4260273": "Julian Gorman", "5068791": "Roma Christensen", "0378269": "Karen Henthorn", "2876300": "Emily Bevan", "1883730": "Stephen Thompson", "0400373": "Sandra Huggett", "3474956": "Riann Steele", "4909365": "Harriet Cains", "0186469": "Kenneth Cranham", "0254927": "Juliet Ellis", "0308650": "Steve Garti", "5326957": "Ryan Wilkinson", "0878610": "Susan Twist", "0866870": "Ricky Tomlinson", "9956584": "Paul Humphreys", "4733668": "Matthew James Edge"}, "geners": ["Comedy", "Drama", "Horror"], "runtimes": ["58"],  "plot": ["Kieren returns to the supermarket where he and Amy killed their victim Lisa Lancaster, and he recalls how Jem spared him when she could have shot him. Sister and brother consequently reconcile and together visit Lisa's parents who have her down as missing but they do not have the heart to tell them their daughter is dead. Amy leaves Roarton to join a PDS commune but Kieren declines to go with her. Bill Macy, unaware that his wife Janet is, like Sue, attending Shirley's support group for PDS relatives, orders Rick to kill Kieren but the boy refuses and pays the price. There is another killing before a suicidal Kieren is tracked down by his mother and returns to his now united family.—don @ minifie-1", "Rick and his father quarrel over Kieren and Rick is told to get rid of him. Rick isn't sure that he can go through with it. On his way home, Kieran has to confront his past as he walks by the supermarket when he killed Lisa Lancaster. He has a new flashback and recalls that his sister Jem was on patrol with Lisa that evening but Jem chose not to eliminate him. They visit Lisa's parents but they refuse to even consider the idea that she might be dead. Amy decides to leave Roarton. Kieran isn't certain he wants to continue living in his present circumstances.—garykmcd"], "genres": "N/A", "imdbID": "2507534", "rating": 8.4, "votes": 385, "number_of_episodes": 9}