{"cast": {"0627639": "Luke Newberry", "0866870": "Ricky Tomlinson", "4909365": "Harriet Cains", "2334634": "Steve Cooper", "2174363": "Marie Critchley", "0263740": "Steve Evets", "0400373": "Sandra Huggett", "0378269": "Karen Henthorn", "1720738": "David Walmsley", "0308650": "Steve Garti", "0254927": "Juliet Ellis", "3137396": "Gerrard Thompson", "1236809": "Kevin Sutton", "0186469": "Kenneth Cranham", "1883730": "Stephen Thompson", "2876300": "Emily Bevan", "3474956": "Riann Steele", "0915287": "Gillian Waugh", "4260273": "Julian Gorman", "5068791": "Roma Christensen", "7020771": "Besses O'Th' Barn Band", "9956584": "Paul Humphreys", "5045226": "Hugh O'Brien"}, "geners": ["Comedy", "Drama", "Horror"], "runtimes": ["58"],  "plot": ["Following the fate of a Partially Deceased neighbour Steve hides Kieren from callers but the boy feels stifled and goes to the cemetery where he was buried, meeting Amy Dyer, who is in the same position as himself but fun-loving and determined not to let it get her down. Macy's soldier son Rick, with whom Kieren was very close, returns from Afghanistan, severely scarred. He too is a 'rotter' but, as Macy's boy, has some protection. Amy persuades Kieren to attend Rick's homecoming party but it is interrupted by a call for a zombie hunt. A father and daughter pair of rotters are found but Kieren persuades Rick not to kill them.—don @ minifie-1", "Bill Macy is still reeling from the news that his son Rick, killed as a soldier serving in Afghanistan, is suffering from partially deceased syndrome. He makes it clear to his followers that he expects their full support and welcomes his son home. They both act as if everything is normal. Kieren continues to have flashbacks to the time when he first became a zombie and the things he did before being treated. It doesn't help that he sees the poster of a woman he killed. On a visit to his grave site, he meets Amy Dyer, also partially dead. They go to a funfair but he is recognized by someone who attended his funeral. His parents hesitate to tell him about Rick's return. Jem refuses to accept Bill's double standard vis-a-vis Rick. The manner of Kieran's death is revealed.—garykmcd"], "genres": "N/A", "imdbID": "2507528", "rating": 8.0, "votes": 368, "number_of_episodes": 9}