{"cast": {"4909365": "Harriet Cains", "6177451": "Christopher Jordan", "0627639": "Luke Newberry", "2174363": "Marie Critchley", "2334634": "Steve Cooper", "4209973": "Rory Gallagher", "1236809": "Kevin Sutton", "0915287": "Gillian Waugh", "0308650": "Steve Garti", "2148911": "Wunmi Mosaku", "1883730": "Stephen Thompson", "4486962": "Sarah Jane Corrigan", "2876300": "Emily Bevan", "6462913": "Eve Austin", "1631384": "Emmett J Scanlan", "5891519": "Bryan Parry", "3137396": "Gerrard Thompson", "4262321": "Jayne Sheldon", "0142179": "Jim Cartwright", "5591600": "Rachel Levine", "4123011": "Tasha Connor", "4123932": "Cajun Sanderson", "5875606": "Jack North", "3400781": "Charlie Kenyon", "3390565": "Ann Saville", "5570126": "Rik Garrad", "0450414": "Sara Kestelman", "2139979": "Will Attenborough", "0922405": "Charlotte West-Oram", "0435877": "Harmage Singh Kalirai", "2090205": "Fiona Wass", "0400373": "Sandra Huggett", "2246577": "Emma Edmondson", "0913107": "Paul Warriner"}, "geners": ["Comedy", "Drama", "Horror"], "runtimes": ["58"],  "plot": ["Kieren's plans to leave Roarton are put on hold as Maxine tightens her grip. Jem is forced to confront her demons when a rabid appears in the school. Simon reveals he has feeling for Kieren; meanwhile disaster strikes in the woods.", "Now in possession of the late vicar Oddie's register of the PDS sufferers Maxine imposes a travel ban, scuppering Kieren's plan to move to France, as she also withdraws his citizenship for six months after which he must reapply. The PDS are given community work, to repay society, and Kieren and Simon have to help build a perimeter fence. Simon asks Kieren to an Undead party, where he hopes to build up the UDL but Kieren is put off by its violence and the fact that the party-goers are high on sheep's brains. Amy has also been acting oddly and tells Dr Russo that she has been on home-made medication whilst at the commune. Shirley's son Philip has a fetish about PDS women and visits a brothel where he asks a girl to pretend to be Amy. At school Jem's past as a member of the HVF makes her a heroine but when a classmate temporarily regresses into becoming a rabid after taking Blue Obliv pills Jem fails to kill him and is reviled as a coward. She joins her fellow HVF colleague Gary, who wants Maxine to revive the force, and they head to the woods where, in the dark, Jem shoots a PDS sufferer who turns out to be her admirer Henry.—don @ minifie-1"], "genres": "N/A", "imdbID": "3711706", "rating": 7.7, "votes": 252, "number_of_episodes": 9}