{"cast": {"1759996": "Linzey Cocker", "5891519": "Bryan Parry", "0223527": "Sacha Dhawan", "1236809": "Kevin Sutton", "4909365": "Harriet Cains", "0627639": "Luke Newberry", "2090205": "Fiona Wass", "2148911": "Wunmi Mosaku", "3400781": "Charlie Kenyon", "2334634": "Steve Cooper", "2174363": "Marie Critchley", "2876300": "Emily Bevan", "1631384": "Emmett J Scanlan", "3390565": "Ann Saville", "1883730": "Stephen Thompson", "0450414": "Sara Kestelman", "3137396": "Gerrard Thompson", "5570126": "Rik Garrad", "0913107": "Paul Warriner", "10973291": "David Crowley", "6490089": "Anita Breheny", "0939820": "Kate Wood", "6462913": "Eve Austin", "1012657": "Sam Phillips"}, "geners": ["Comedy", "Drama", "Horror"], "runtimes": ["57"],  "plot": ["Despite Gary's efforts to dissuade her Jem feels she must admit to Maxine that she killed Henry though Maxine does not condemn her and when Henry's mother reports him missing Maxine suggests that he may have gone to join an extremist ULA group. Meanwhile PDS sufferer Freddie Preston has returned from the dead to find his wife Haley has a new boyfriend, her boss Amir, and though they let him live with them Amir wants Freddie out, leading Freddie to ask Haley to run away with him. Kieren is working with Simon as cleaners at the sympathetic Dr Russo's surgery, where they see two caged rabids waiting to be collected for treatment. Simon aims to free them but Kieren prevents him and Simon returns to his group, advocating another rising. Maxine is aware that history may repeat itself and asks Gary to look out for her. Freddie turns rabid and desperately begs Haley to kill him after she refuses to leave with him and Gary is called in to shoot him. However Kieren is aware that Freddie only needs his medication to stabilize him and administers it. This persuades him that Simon might have a point after all and the two embrace as Kieren seemingly joins the group.—don @ minifie-1"], "genres": "N/A", "imdbID": "3653268", "rating": 7.7, "votes": 237, "number_of_episodes": 9}