{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0411050": "Hideo Ishikawa", "1355336": "Katsuhisa Hôki", "1840556": "Ami Koshimizu", "1074164": "Masaki Aizawa", "7471569": "Makoto Kuramochi", "1276234": "Kazuya Kobayashi", "5918905": "Kazuma Takeo", "7471570": "Mimi Tamaki", "7471571": "Mi-Ko", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "1027678": "Michael Adamthwaite", "0110167": "Chris Britton", "0229889": "Brian Dobson", "0229923": "Michael Dobson", "0238546": "Brian Drummond", "0432228": "Alessandro Juliani", "0511429": "Lalainia Lindbjerg", "0841448": "Brad Swaile", "0862703": "French Tickner", "0865064": "Lee Tockar"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["While formulating a plan to get the name of the man following him, Light tests the limits of the Death Note.", "After testing the power limits of the Death Note on six convicts, Light manipulates the circumstances of a psychotic bank robber's death to reveal the name of his stalker, FBI man Ray Pember, which includes putting the presence of Ryuk to purposeful use.—statmanjeff", "Episode 4: pursuit Light tells Ryuk that he is trying to create an ideal world where no criminals are left unpunished and that as the god of such a world he cannot sacrifice half of his life for the shinigami eyes. Light begins experimenting to find out how much control he has over how a criminal dies. He tries to have prisoners escape or draw L's face before they die. When they fail to do so, he learns that the Death Note is not all-powerful. Using this knowledge, Light devises a plan to find out who has been following him. Light has a drug dealer touch the Death Note and makes him hijack a bus before he dies. During the hijacking, Light gets his tracker to reveal that he is Raye Penber, a Federal Agent from the United States employed by L and his associate Watari.", "\"Pursuit\": Light tells Ryuk that he is trying to create an ideal world where no criminals are left unpunished, and that as the god of such a world, he cannot sacrifice half of his life for the shinigami eyes. Light begins experimenting to find out how much control he has over how a criminal dies. Using this knowledge, Light devises a plan to find out who has been following him. He makes a drug dealer hijack a bus on which Light, and by extension, his follower, are passengers. During the hijacking, Light manipulates his tracker to reveal that he is Raye Penber, a Federal Agent from the United States employed by L and his associate Watari."], "genres": "N/A", "imdbID": "0901528", "rating": 8.7, "votes": 6474, "number_of_episodes": 37}