{"cast": {"1465001": "Mamoru Miyano", "1217394": "Shidô Nakamura", "1435774": "Aya Hirano", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0149218": "Chafûrin", "0411050": "Hideo Ishikawa", "1074164": "Masaki Aizawa", "0383022": "Noriko Hidaka", "0648768": "Masaya Matsukaze", "6355424": "Miwako Inagaki", "0841448": "Brad Swaile", "0238546": "Brian Drummond", "1275101": "Shannon Chan-Kent", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0675354": "Ward Perry", "0229889": "Brian Dobson", "1027678": "Michael Adamthwaite", "0921699": "Cathy Weseluck", "0607516": "Kirby Morrow", "0319308": "Tabitha St. Germain", "17047381": "Prince Patel", "1154301": "Jason Simpson"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Near escapes the mob attack, and Light once again proves his ability to stay a step ahead by creating a fourth Kira.", "Near contacts the Japanese task force and announces that Kira is among their members. He asks for insider information, and Aizawa, already beginning to doubt Light, responds. Near now believes without doubt that the new L is really Light Yagami and that Light is Kira.—Anonymous", "From pre-establish safeguards, Near escapes the lynch mob attacking his Manhattan headquarters. Contact from Aizawa affirms Near's suspicions that the new L is Light is Kira, but Light again proves himself a brilliant strategist by once again wiping Misa's memories, this time in the creation of a fourth Kira.—statmanjeff", "\"Transfer\": Demegawa commands Kira's followers to break into the SPK headquarters in New York, while Misa watches the scene on television, waiting to kill Near as soon as he exits the building. Near asks the Japanese investigation team to consider that Light may be Kira. He and the remaining SPK members then escape the building by dropping buckets of money out of the windows to distract the protesters. Aware that his team is beginning to doubt his identity, Light e-mails Misa with a new plan. Meanwhile, we see Aizawa at home. His daughter Yumi, now a teenager, is awake studying for her exams. After this, Aizawa calls Near and offers information about the past investigation that leads Near to conclude that Light is Kira. Aizawa then tells Light that he would like to resume surveillance on Misa and him to help clear their names. Light does not object. Demegawa appears on television soon after, asking Kira's followers to donate money to build a temple to worship Kira. Disgusted, Light has Teru Mikami, the new owner of Misa's Death Note whom Light selected based on his appearances in Kira's Kingdom, kill Demegawa. Back at the investigation team headquarters, Aizawa realizes that with both Light and Misa under observation, the new killings cannot be attributed to either of them."], "genres": "N/A", "imdbID": "1021403", "rating": 7.6, "votes": 4608, "number_of_episodes": 37}