{"cast": {"1465001": "Mamoru Miyano", "1217394": "Shidô Nakamura", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "1933722": "Haruka Kudô", "0766483": "Ai Satô", "1074164": "Masaki Aizawa", "0846659": "Aruno Tahara", "1143491": "Mitsuru Ogata", "0847123": "Hiroki Takahashi", "0383022": "Noriko Hidaka", "0960022": "Hiroshi Ôtake", "0765815": "Nozomu Sasaki", "0407435": "Masaru Ikeda", "0841448": "Brad Swaile", "0238546": "Brian Drummond", "1275101": "Shannon Chan-Kent", "0110167": "Chris Britton", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "0550449": "Kristie Marsden", "0376588": "Saffron Henderson", "1027678": "Michael Adamthwaite", "0229923": "Michael Dobson", "0636868": "John Novak", "0451918": "Sam Vincent", "0921699": "Cathy Weseluck", "0354826": "Ron Halder", "1870399": "David Robert Moore", "0170809": "Ted Cole", "0796941": "Howard Siegel", "17047381": "Prince Patel", "0008533": "Alistair Abell"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["The first moves of two new investigators cause Light to make a spontaneous decision with long-term consequences.", "New investigator Near steps forward, a central figure in the SPK, an American organization trying to catch Kira without relying on L (whom they know is a fake). Near, aware of the existence of Death Notes, wants to get his hands on one, but a challenge to his efforts comes from his orphanage rival, Mello, who throws a curve into Near's efforts by having his underworld thugs kidnap Japanese Police Director Takimura, ready to trade him for a Death Note.—Anonymous", "\"Abduction\": Orphanage caretaker Roger Ruvie informs L's successors, Mello and Near, that L has died. Relinquishing the opportunity to succeed L, Mello leaves the orphanage to pursue Kira on his own, backed by the American Mafia. Near allies himself with the President of the United States. Along with Steve Mason of the FBI, he forms an organization whose goal is to catch Kira, the Special Provision for Kira (SPK). Aizawa informs Soichiro that the director of the NPA has been kidnapped and demanded the Death Note under Light's task force's possession as ransom. They don't know this yet, but it was Mello who kidnapped the director. As soon as Light discovers this, he kills the director. Mello then decides to kidnap Light's sister, Sayu. While scrambling to find a way to rescue Sayu, the investigation team contacts SPK for help in solving the case of kidnapping. This is where Near reveals that he knows of L's death and that someone has attempted to replace him."], "genres": "N/A", "imdbID": "1007230", "rating": 7.2, "votes": 4822, "number_of_episodes": 37}