{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0299401": "Issei Futamata", "1203697": "Hirofumi Nojima", "0363066": "Kiyoyuki Yanada", "1074164": "Masaki Aizawa", "1307121": "Hiroyuki Yokoo", "0632641": "Rintarô Nishi", "2069528": "Eiji Hanawa", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "1275101": "Shannon Chan-Kent", "0110167": "Chris Britton", "1925154": "Vincent Tong", "0442515": "Andrew Kavadas", "0170809": "Ted Cole", "0465959": "Michael Kopsa", "0801347": "Martin Sims", "0238546": "Brian Drummond", "0650991": "David Orth", "0222175": "Trevor Devall", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["After Light establishes a mole within the Yotsuba Group, L separates himself from the rest of the task force and recruits Misa.", "L's team discovers that the Yotsuba Group meets in secret to discuss the elimination of individuals who are troublesome to their company and concludes that Kira must be one of the seven remaining executives. Can Light posing as L ferret out the right one?—Anonymous", "\"Makeshift\": The investigation team installs wiretaps and surveillance cameras to monitor the Yotsuba Group meetings and are amazed at how openly they discuss their use of Kira. Light and L come up with a plan to contact one of the members of the Group, Reiji Namikawa. Namikawa agrees to act as a spy and help postpone Kira's killings by discussing them at the meetings. L reveals that he still suspects Light is the first Kira by playing mind games with him. Afterward, L questions Misa and wants her to infiltrate the Yotsuba Group to obtain information. Soichiro worries that even if they do gather enough information on the Group it will be difficult to capture all of its members at the same time."], "genres": "N/A", "imdbID": "0966785", "rating": 7.3, "votes": 4925, "number_of_episodes": 37}