{"cast": {"1465001": "Mamoru Miyano", "1217394": "Shidô Nakamura", "1435774": "Aya Hirano", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0149218": "Chafûrin", "0411050": "Hideo Ishikawa", "1074164": "Masaki Aizawa", "0846659": "Aruno Tahara", "0847123": "Hiroki Takahashi", "0383022": "Noriko Hidaka", "1337113": "Akeno Watanabe", "0765815": "Nozomu Sasaki", "0841448": "Brad Swaile", "0238546": "Brian Drummond", "1275101": "Shannon Chan-Kent", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0675354": "Ward Perry", "0229889": "Brian Dobson", "1027678": "Michael Adamthwaite", "0229923": "Michael Dobson", "0451918": "Sam Vincent", "0921699": "Cathy Weseluck", "0067754": "Lisa Ann Beley", "1870399": "David Robert Moore", "0607516": "Kirby Morrow", "17047381": "Prince Patel", "1154301": "Jason Simpson"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Mello busts into SPK headquarters to retrieve a photograph of himself to make sure he won't be killed by Kira. In exchange for Near giving him the picture, Mello drops an important hint about the Death Notes: some of the rules are fake.", "With Demegawa broadcasting as The Voice of Kira, with the President of the United States calling off his American investigation team, and with even petty criminals fearing to speak their own names, Kira's unchallenged despotic rule over the Earth seems near. Mello, to protect himself by retrieving his only known photograph from Near, shares information: some of the Death Note rules are fake. Near, concluding that Light is Kira, uses that intel to spread dissension among the Japanese Task Force and fish for allies among them. Light sees no choice but to spark a manhunt for Near and kill him.—statmanjeff", "\"Justice\": The President of the United States declares America's neutrality regarding Kira in Sakura TV's program Kira's Kingdom. Meanwhile, a scarred Mello uses SPK agent Halle Lidner as hostage to gain entrance into Near's headquarters and meet with him. Mello wants the picture Near has of him so that he will remain safe from Kira. In return, he tells Near about shinigami and that some of the Death Note's rules are fake. Already suspicious of Light, Near proposes to the investigation team that they test the \"thirteen-day\" rule, but none of them believe that they should. Near also tells them that if they have any interest in helping him to give him a call and we see that Aizawa has started to suspect Light. In response to Near's actions, Light contacts the President of the United States, asking for information on the whereabouts of the SPK and threatening to kill him if he does not cooperate. Aizawa is trying to decide whether he should contact Near about Light or not. Ide is sitting beside him and tells him to do what he thinks is right. Later, Hitoshi Demegawa, the host of Sakura TV's show, goes to America as Kira's messenger and gives a worldwide broadcast inciting people to break into the newly found headquarters of the supposedly evil SPK."], "genres": "N/A", "imdbID": "1021404", "rating": 7.6, "votes": 4601, "number_of_episodes": 37}