{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0462017": "Kiyoshi Kobayashi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0149218": "Chafûrin", "0619179": "Miki Nagasawa", "0299401": "Issei Futamata", "1203697": "Hirofumi Nojima", "1307121": "Hiroyuki Yokoo", "2069528": "Eiji Hanawa", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "0862703": "French Tickner", "1275101": "Shannon Chan-Kent", "0110167": "Chris Britton", "1925154": "Vincent Tong", "1006313": "John Murphy", "0675354": "Ward Perry", "0856197": "Venus Terzo", "0442515": "Andrew Kavadas", "0170809": "Ted Cole", "0222175": "Trevor Devall", "0238546": "Brian Drummond", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["After learning that Higuchi is Kira, L decides that they mustn't apprehend him till they understand his killing method.", "L determines (and Light concurs) that Light used to have the power of Kira but no longer. Kyosuke Higuchi has it now, but the mechanics of how he wields it remain unknown. Using Touta Matsuda on live TV as bait, L engineers the means by which to find out. Calling for a favor from their mole, Reiji Namikawa, the team discovers that he and others of the Yotsuba Group have already pegged Higuchi for Kira as well. Kyosuke Higuchi soon finds himself on the verge of being outed and, unable to use the Death Note for the lack of knowing Matsuda's real name, races out in a panic to kill Matsuda any way he can.—statmanjeff", "\"Guidance\": After learning that Higuchi is Kira, L decides that the police must not apprehend him until they understand his killing method. He points out that this will be an advantage in curing society of Kira and proving that he has been caught. He arranges for Sakura TV to air a \"Kira special\" where Matsuda will declare he knows the identity of Kira to lure out Higuchi. Having been granted immunity from prosecution, several of the businessmen trick Higuchi and lead him to follow L's plan. As the third Kira races to the television station, determined to kill the whistleblower, L and the investigation team watch his every move via cameras and wiretaps."], "genres": "N/A", "imdbID": "0972447", "rating": 8.1, "votes": 4940, "number_of_episodes": 37}