{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0462017": "Kiyoshi Kobayashi", "1435774": "Aya Hirano", "1211596": "Kimiko Saitô", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "2445666": "Takuya Kirimoto", "0619179": "Miki Nagasawa", "0299401": "Issei Futamata", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "0862703": "French Tickner", "1275101": "Shannon Chan-Kent", "0923791": "Colleen Wheeler", "0110167": "Chris Britton", "1925154": "Vincent Tong", "1006313": "John Murphy", "0650991": "David Orth", "0856197": "Venus Terzo", "0442515": "Andrew Kavadas", "0170809": "Ted Cole", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["L and Light, watching from the investigation team building, wonder whom Higuchi (seemingly alone) is talking to. L wonders if it's a shinigami. With Rem beside him, Higuchi - frantic to kill Matsuda - takes \"the deal\" to become unstoppable.", "As the trap to catch Kira unfolds with the aim for him to reveal how he kills, Higuchi's actions leave L and Light nonplussed. Who's this Rem he seems to be talking to in his car, why did he seem relieved after writing down Matsuda's name in a notebook, and what's \"the deal\" he's agreeing to? Suddenly, Higuchi has the power to kill on sight, just like the second Kira, and L gives the word to mask all faces and take him down, but a former ally enters the action.—statmanjeff", "Higuchi writes Matsuda's alias in his Death Note. When it fails, he makes a deal with Rem for the Shinigami Eyes. He kills a police officer who pulls him over, showing the investigation team that he has the Second Kira's powers. Light and L decide to go to the scene via helicopter, while also handcuffing Misa to a chair to prevent her from escaping. L declares the situation too dangerous and orders his immediate arrest. Higuchi goes to Yotsuba, where he tries to get Matsuda's name from the security footage, but discovers the tapes switched. Soichiro, who is at Sakura TV, switches out Matsuda and the interviewer with mannequins and plays a recording of the rest of the interview, while Mogi, Wedy, and Aiber arrive at the station. Higuchi arrives and realizes he has been set up. The Task Force members try to arrest him, but Higuchi shoots at Wedy, and Soichiro jumps in front of her to protect her. This results in Higuchi non-critically shooting Soichiro in the arm. Wedy hands her gun to Aiber, but he fires and misses, resulting Higuchi to escape. Higuchi encounters a police roadblock and is pinned in by the Task Force. From L's helicopter, Watari shoots Higuchi's front tire, sending him crashing into the embankment. Finally out of options, Higuchi draws his gun and attempts to shoot himself in the head, but Watari snipes the revolver out of his hand. Light declares that it is over.", "\"Frenzy\": While driving to Sakura TV, Higuchi talks with Rem about his situation. L, Light and Misa watch from the investigation team building and wonder who he is talking to. L wonders if Higuchi is talking to a shinigami. Rem convinces Higuchi to go to the station, but he has his own selfish motives for doing so. Higuchi enters the station's offices and writes Matsuda's fake name in his Death Note. The team thinks he has just written a note to himself, but find his subsequent erratic behavior odd. L argues that Higuchi has attempted to use his killing method. Higuchi then makes the deal with Rem to obtain shinigami eyes. A furious pursuit ensues when L realizes Higuchi can kill after looking at a person's face and orders the police to apprehend him. Aizawa and Ide return, leading a squad of police cars to block Higuchi's path. After this, Aizawa returns to the Task Force."], "genres": "N/A", "imdbID": "0983351", "rating": 8.8, "votes": 5614, "number_of_episodes": 37}