{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0620017": "Kazuya Nakai", "1428827": "Hidenobu Kiuchi", "0411050": "Hideo Ishikawa", "0559471": "Naoko Matsui", "1143491": "Mitsuru Ogata", "5918905": "Kazuma Takeo", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "1027678": "Michael Adamthwaite", "0110167": "Chris Britton", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "0229923": "Michael Dobson", "0238546": "Brian Drummond", "1853731": "Jeremy From", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "1006313": "John Murphy", "0319308": "Tabitha St. Germain", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Soichiro confronts L about the FBI agents investigating the police, and Light makes a move against the FBI.", "After further tests with the Death Note, Light targets Agent Pember to remove him and all other FBI agents from the investigation. Unbeknownst to Light, it leaves behind Pember's fiancée, also an agent, who wasn't part of the investigation but now has reason to join it. Meanwhile, Light's action reduces the official investigation team down to five determined policemen, including his father and young officer Touta Matsuda. Now that only the most dedicated are left, L arranges to meet these officers in person - all part of his plan to find Kira.—statmanjeff", "Episode 5: tactics Light waits one week before killing Raye Penber. He follows Raye onto a train forces him to write down the names of his fellow agents on a piece of the Death Note by threatening Raye's family. Because of the simultaneous death of these twelve FBI agents in Japan, the police are scared to continue investigating, and the American President pulls the FBI off the Kira case. However, Penber's fiancée, a former FBI agent, seeks to find Kira for revenge. Light has another criminal leave a third coded note for L which finishes the phrase 'L, do you know? Gods of Death love apples'. Although there is truth to this, L determines that Kira is only mocking him as he considers his next move.", "\"Tactics\": One week later, Light follows Penber onto a train and forces him to write down the names of his fellow agents on a piece of the Death Note by threatening Raye's family. Because of the simultaneous death of these twelve FBI agents in Japan, including Penber, the police are scared to continue investigating, and the American president pulls the FBI off the Kira case. However, Penber's fiancée Naomi Misora, a former FBI agent, seeks to find Kira for revenge. The Japanese police, who were previously unaware that there were FBI agents in Japan, conclude that L hired them to investigate the Japanese police and their families, causing them to distrust L. Soichiro announces that because of the heightened stakes of the case, any officer who no longer wishes to work on the Kira investigation may leave, and will not be demoted for doing so. Only five officers decide to remain on the case. In an effort to repair his relations with the Japanese police, L meets in secret with the remaining detectives who want to work on the Kira case."], "genres": "N/A", "imdbID": "0903684", "rating": 8.5, "votes": 6113, "number_of_episodes": 37}