{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0462017": "Kiyoshi Kobayashi", "1435774": "Aya Hirano", "1211596": "Kimiko Saitô", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "0862703": "French Tickner", "1275101": "Shannon Chan-Kent", "0923791": "Colleen Wheeler", "0110167": "Chris Britton", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "17047381": "Prince Patel", "16109057": "Hibiki Yamashita"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Light, his memory recovered, orders Misa to begin killing after Higuchi dies. The Shinigami Rem realizes that everything is going according to Light's plan, and that L will arrest Misa as Kira unless Rem acts quickly.", "After a respite, the killings resume, and Rem sees Light's ingenious yet despicable plan for what it is. L, hearing the peals of a distance clock tower all day, knows enough not to ask for whom it tolls. Light strikes, clearing away several obstacles.—statmanjeff", "\"Silence\": L asks Rem about Death Notes; she reveals as little information as possible to avoid implicating Light or Misa. Meanwhile, Misa begins to use her Death Note to kill criminals. Although Light denies Misa's involvement, L becomes very suspicious of her and Rem realizes that it was Light's plan all along to endanger Misa so that Rem would sacrifice herself to kill L. Later, Light finds L on the roof of the investigation team headquarters. The latter laments how distant he is from other people and how often they, like most people, lie. When the two rejoin the rest of the team, L reveals that he is planning on testing the thirteen-day rule, the only thing currently absolving Misa. Before he can do so, however, Rem kills Watari and L at the cost of her own life. After secretly snatching away Rem's Death Note, Light celebrates his victory in silence."], "genres": "N/A", "imdbID": "0990611", "rating": 9.6, "votes": 11129, "number_of_episodes": 37}