{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0620017": "Kazuya Nakai", "1428827": "Hidenobu Kiuchi", "0559471": "Naoko Matsui", "2239419": "Yukitoshi Tokumoto", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0222175": "Trevor Devall", "0238546": "Brian Drummond", "1853731": "Jeremy From", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "1006313": "John Murphy", "0319308": "Tabitha St. Germain", "0841448": "Brad Swaile", "1925154": "Vincent Tong"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Light runs into a woman at the police department who has information for L that could lead to Light's capture.", "L meets with the remaining five of the Kira Task Force. L's not quite what the men expect, but hearing him out convinces Soichiro that he can be no other. As L lays plans for how to close in on \"Kira,\" Light meets Kanzo Mogi (Pember's fiancée) in the police station lobby before she can deliver a crucial supposition to the task force. As the two leave together, Light knows he can't afford to let her live.—statmanjeff", "Episode 6: unraveling In an effort to repair his relations with the Japanese police, L meets in secret with the remaining detectives who want to work on the Kira case. L insists that they use false identities for protection against Kira and asks that they call him Ryuzaki instead of L. He reveals his thoughts about how Kira might be following the murders of the FBI agents and pinpoints who the federal agents were tracking during that period. Meanwhile, Light happens to meet a woman who introduces herself as Maki. As the two talk, he realizes that she is Penber's fiancée and that she has worked out that Kira can kill by means other than heart attacks. Convinced that it is his destiny to use the Death Note to create a better world, Light is euphoric that he has come into contact with the very person who can get him caught. He formulates a plan to get rid of her.", "\"Unraveling\": The Japanese police, who were previously unaware that there were FBI agents in Japan, conclude that L hired them to investigate the Japanese police and their families, causing them to distrust L. Soichiro announces that because of the heightened stakes of the case, any officer who no longer wishes to work on the Kira investigation may leave, and will not be demoted for doing so. Only five officers decide to remain on the case. In an effort to repair his relations with the Japanese police, L meets in secret with the remaining detectives who want to work on the Kira case. He reveals his thoughts about how Kira might be following the murders of the FBI agents and pinpoints who the federal agents were tracking during that period. Meanwhile, Light meets a woman who introduces herself as Shoko Maki. As the two talk, he realizes that she is Penber's fiancée and that she has worked out that Kira can kill by means other than heart attacks, information she plans to share with the police. Light decides that he must eliminate this woman."], "genres": "N/A", "imdbID": "0905451", "rating": 8.2, "votes": 5849, "number_of_episodes": 37}