{"cast": {"1465001": "Mamoru Miyano", "1217394": "Shidô Nakamura", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "1074164": "Masaki Aizawa", "0847123": "Hiroki Takahashi", "0383022": "Noriko Hidaka", "1337113": "Akeno Watanabe", "0765815": "Nozomu Sasaki", "0648768": "Masaya Matsukaze", "0841448": "Brad Swaile", "0238546": "Brian Drummond", "1925154": "Vincent Tong", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "1027678": "Michael Adamthwaite", "0451918": "Sam Vincent", "0921699": "Cathy Weseluck", "0067754": "Lisa Ann Beley", "1870399": "David Robert Moore", "0607516": "Kirby Morrow", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Though Mikami has written all the investigators' names in the Death Note, a minute passes and everyone is still alive. Near seizes Mikami's Death Note, and all is at last revealed.", "It's over. Near's careful strategy succeeds, revealing Light Yagami as Kira. Cornered and going into hysterics, Light makes a last ditch effort to beat Near and make a case for keeping himself alive, active and at liberty, but he fails, prevented by one who had up to this point greatly admired him. As forewarned from the start, and now that, at best, only life-imprisonment looms ahead for Light, Ryuk writes one last name in his Death Note.—statmanjeff", "\"New World\": Mikami's Death Note fails to work. Near reveals that he knew about the fake notebook and had actually tampered with the real one. Mikami is restrained and, faced with Near's undeniable evidence, Light confesses that he is Kira. Light then attempts to write names down on a piece of the Death Note hidden in his watch, but Matsuda stops him by shooting him several times. Seeing Light writhe on the floor in agony, Mikami kills himself, causing a commotion that allows Light to flee the warehouse. However, Light's wounds do not allow him to travel far and Ryuk, as he had promised in the beginning of the series, writes down Light's name in his Death Note. Light dies of a heart attack, seeing L's figure in front of him."], "genres": "N/A", "imdbID": "1043075", "rating": 8.7, "votes": 7780, "number_of_episodes": 37}