{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "1428827": "Hidenobu Kiuchi", "1211596": "Kimiko Saitô", "0149218": "Chafûrin", "0407435": "Masaru Ikeda", "4110285": "Taichi Masu", "3861681": "Daisuke Sugaya", "5094203": "Yôko Nobutomo", "2942471": "Yasuhiro Mamiya", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "1275101": "Shannon Chan-Kent", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "0238546": "Brian Drummond", "1853731": "Jeremy From", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "0675354": "Ward Perry", "0796941": "Howard Siegel", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong", "0923791": "Colleen Wheeler"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Video tapes reportedly from Kira air on Sakura TV, although L suspects that this is the work of another Kira.", "Through television, Kira broadcasts a public message, asking for cooperation in working together towards a better, crime-free world. L deduces with 70% certainty that this isn't the original Kira but a second Kira, one willing to strike down the innocent, and asks that Light join the task force. Light, meanwhile, not only realizes this is a second Kira but one that has paid the price for shinigami eyes to become more powerful. The struggle to stop Kira proves there are still policemen willing to stand up but it costs them a member of the task force.—statmanjeff", "\"Assault\": Sakura TV is forced to broadcast several prerecorded audio messages allegedly from Kira. L determines the messages are trying to gain public support for Kira and must be stopped, but the investigation team are unable to contact the station directly. Hirokazu Ukita, one of the investigators working with L, rushes to Sakura TV but mysteriously dies in front of the station, along with two police officers. The investigation team realizes that Kira no longer needs to know the person's name to kill, while L suspects this may be a new different Kira. Soichiro Yagami, hearing news of the broadcasts, hijacks a bus and crashes into the Sakura TV lobby to avoid being seen while seizing the Kira tapes. With help of the police and the investigation team to block any view of his face while leaving, Soichiro brings the tapes back to the investigation team headquarters. At the end of the episode, a young girl named Misa Amane is seen discussing her admiration for Kira with a shinigami named Rem, and she reveals that she has made the trade for shinigami eyes."], "genres": "N/A", "imdbID": "0919371", "rating": 8.7, "votes": 5661, "number_of_episodes": 37}