{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "1211596": "Kimiko Saitô", "1177402": "Masumi Okamura", "2746325": "Yuka Shioyama", "3285432": "Kanako Kondô", "2582044": "Orie Kimoto", "9257983": "Izukomo Morinaga", "9257984": "Sana Kobayashi", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "1275101": "Shannon Chan-Kent", "0222175": "Trevor Devall", "1976541": "Heather Doerksen", "0238546": "Brian Drummond", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "17047381": "Prince Patel", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong", "0923791": "Colleen Wheeler"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Convinced the two Kiras have met and worried at the prospect of his own murder, L declares that the event of his death will prove Light is Kira.", "With Rem ready to kill L at Light's behest, Light can't wait for her to take L out, but L, with no other suspects at hand and believing the two Kiras have met, informs the task force that his death in the next two days will constitute proof that Light is Kira. With Light, hearing this from L himself, stuck as to how to proceed, Misa's tactless actions reveal herself as the second Kira. Straightaway, L has her arrested, bound, blindfolded, and isolated. As Misa's suffering progresses, she finally begs Rem for death, but Rem alleviates it instead by having her relinquish ownership of the Death Note, which removes all memories related to the Death Note - all but her feelings for Light.—statmanjeff", "\"Wager\": Worried at the prospect that he might be murdered, as he is convinced the two Kiras have met, L demands that in the event of his death, Light should be arrested. Later, Light and L meet each other outside college. Much to the anger and frustration of Light, Misa appears and converses with the two. Minutes after Misa leaves, Light receives the news from L that she has been arrested on grounds of being the second Kira. Misa appears to be blindfolded and tied to a chair, while L instructs Watari to torture her to obtain information. A few days later, Misa relinquishes ownership of her Death Note, thus erasing her memories of its existence."], "genres": "N/A", "imdbID": "0947906", "rating": 8.9, "votes": 5860, "number_of_episodes": 37}