{"cast": {"1465001": "Mamoru Miyano", "1435774": "Aya Hirano", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "0757087": "Maaya Sakamoto", "1074164": "Masaki Aizawa", "0847123": "Hiroki Takahashi", "0383022": "Noriko Hidaka", "1337113": "Akeno Watanabe", "0648768": "Masaya Matsukaze", "0841448": "Brad Swaile", "1275101": "Shannon Chan-Kent", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "1976541": "Heather Doerksen", "1027678": "Michael Adamthwaite", "0451918": "Sam Vincent", "0921699": "Cathy Weseluck", "0067754": "Lisa Ann Beley", "0607516": "Kirby Morrow", "0238546": "Brian Drummond", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Near goes to Japan, allegedly as bait for Kira. Following Light's instructions, Takada asks Mikami to send her five pages of the Death Note. She tells him that he will continue his work in a fake book made to look like the real one.", "The SPK comes to Japan, where former CIA agent Halle Lidner becomes one of Kiyomi's four new bodyguards. Per Light's instructions, Kiyomi surreptitiously obtains five pages of the Death Note by which to carry on Kira's work while Teru, using a copy of his own creation, carries on as if his new fake Death Note is real. Meanwhile, a chance meeting between Kiyomi and Misa leads to the two having a private dinner by which to establish which is truly Light's legitimate girlfriend.—statmanjeff", "\"Scorn\": Near goes to Japan, allegedly as bait for Kira, and Light silently accepts the challenge. Near ponders on how to beat Light, knowing that the one who is doing his will has shinigami eyes and that the two communicate via Takada. Following Light's instructions, Takada asks Mikami to send her five pages of the Death Note. She tells him that he will continue his work in a fake book made to look like the real one. While walking to a broadcast, Misa runs into Takada and rushes her, jealous that she is not the most popular star. Halle Lidner, who has been sent by Near to act as Takada's bodyguard, stops her then, but Takada meets with Misa for a girl-to-girl talk soon after. Lidner sits in with them. By the end of the conversation, Takada is convinced that Misa is stupid and Lidner reports to Near about the love triangle between Light, Takada and Misa. Elsewhere, SPK member Stephen Gevanni confirms that Mikami is the new Kira, after watching him kill a man by writing something in a notebook."], "genres": "N/A", "imdbID": "1029788", "rating": 7.1, "votes": 4620, "number_of_episodes": 37}