{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "2476035": "Aoi Inaba", "2480841": "Kensuke Nishi", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0222175": "Trevor Devall", "0238546": "Brian Drummond", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Light, entirely aware of L's surveillance equipment in his home, begins a very careful game to throw off suspicion.", "While Light covers his tracks and sets up deaths in advance, L, having researched Agent Pember's case load, decides to set up surveillance cameras and wire taps in the two households he was investigating - those of Deputy Director General Kitamura and Detective Superintendent Yagami. Almost immediately, Light is aware that his bedroom has been invaded. Surreptitiously, he tells Ryuk to curb his appetite for apples and ferret out all the bugs while he coolly begins a very careful game to throw off suspicion.—statmanjeff", "Episode 8: Glare L is close to discovering the identity of Kira. Misora's disappearance causes L to shortlist the people who were being tracked by the FBI at the time of Raye Penber's death. He requests surveillance equipment to be installed in the homes of those he suspects, including Soichiro Yagami's son. Light, however, becomes aware that he is being watched and has the shinigami locate all the cameras in his room. Later, he deceives the surveillance team by watching the news on a portable television hidden in a bag of potato chips and continues to kill the criminals being reported. This throws off L's suspicions that he is Kira.", "\"Glare\": L is close to discovering the identity of Kira. Misora's disappearance causes L to shortlist the people who were being tracked by the FBI at the time of Raye Penber's death. He requests surveillance equipment to be installed in the homes of those he suspects, including Soichiro Yagami's son. Light, however, becomes aware that he is being watched and has Ryuk locate all the cameras in his room. He deceives the surveillance team by watching the news on a portable television hidden in a bag of potato chips and continues to kill the criminals being reported."], "genres": "N/A", "imdbID": "0919369", "rating": 8.4, "votes": 5672, "number_of_episodes": 37}