{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0395975": "Mitsuaki Hoshino", "1074164": "Masaki Aizawa", "2752320": "Tomoya Kawai", "0462074": "Toshio Kobayashi", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0229889": "Brian Dobson", "0238546": "Brian Drummond", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "1006313": "John Murphy", "0841448": "Brad Swaile", "0862703": "French Tickner", "0865064": "Lee Tockar", "1925154": "Vincent Tong"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["As the Task Force and L's investigation deepens, Ryuk tells Light that someone is shadowing them. Light needs the man's name, and Ryuk makes an offer.", "Episode 3: Dealings Police authorities discuss the \"Kira case\" with L. Upon inquiring about the time of death of the victims, L concludes that Kira is likely a student with a naive concept of justice. He requests data on how the victims were publicized and begins to suspect that Kira has access to police information. Because the police officer in charge of the Kira case, Soichiro Yagami, is Light's father, Light can monitor the authorities' movements. Meanwhile, Ryuk tells Light that he is being followed. He also explains that not only do shinigami get the lifespans of people they have taken before their time, their eyes can see everyone's name and lifespan floating above their heads. He gives Light the option to trade half his remaining lifespan for the eyes of a shinigami, just like Ryuk's.", "\"Dealings\": Police authorities discuss the \"Kira case\" with L. Upon inquiring about the time of death of the victims, L concludes that Kira is likely a student with a naive concept of justice. He requests data on how the victims were publicized and begins to suspect that Kira has access to police information. Because the police officer in charge of the Kira case, Soichiro Yagami, is Light's father, Light can monitor the authorities' movements. Meanwhile, Ryuk tells Light that he is being followed. He also explains that shinigami get the lifespans of people they have taken before their time, and their eyes can see everyone's name and lifespan floating above their heads. He gives Light the option to trade half his remaining lifespan for the eyes of a shinigami, just like Ryuk's."], "genres": "N/A", "imdbID": "0909466", "rating": 8.4, "votes": 6319, "number_of_episodes": 37}