{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "3516167": "Tsunehisa Fujii", "0557965": "Yasunori Masutani", "1074164": "Masaki Aizawa", "0395975": "Mitsuaki Hoshino", "1372872": "Ryûji Mizuno", "0875320": "Shinpachi Tsuji", "1167392": "Tetsuo Sakaguchi", "3058109": "Masaru Suzuki", "2239419": "Yukitoshi Tokumoto", "2966194": "Kôta Nemoto", "3101220": "Umeka Shôji", "3547229": "Aiko Aihashi", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0229889": "Brian Dobson", "0229923": "Michael Dobson", "0238546": "Brian Drummond", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "1006313": "John Murphy", "0675354": "Ward Perry", "0841448": "Brad Swaile", "0862703": "French Tickner", "0865064": "Lee Tockar", "1925154": "Vincent Tong"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["The series of mysterious deaths catches the attention of world-renowned detective L, who confronts the killer on live television.", "As Light continues his plan to be the god of a better world, Ryuk presents a new fact: anyone who touches the death notebook will be able to see him, too, not just Light, prompting Light to establish some ingenious protection. Meanwhile, the brilliant and mysterious L sets a trap to convince the world of Light's existence and narrow the search for where to find him.—statmanjeff", "Episode 2: Confrontation as criminals begin dying from inexplicable heart attacks left and right, Interpol convenes to discuss the phenomenon. Unable to come up with an explanation for it, they turn to the world's top-ranked detective, L, whose true identity is a well-kept secret. L speaks to the Interpol representatives through a computer and an electronic voice, promising them that they are dealing with mass-murder and that he will soon confront the killer whom the general public has been calling Kira (a play on the Japanese pronunciation of the English word killer). This displeases Light, who has been going to great lengths to keep the Death Note hidden, since learning that Ryuk becomes visible to anyone who touches the book. L tricks Light into revealing that Kira lives in Japan's Kanto region with a fake television broadcast. Having played right into L's hands, an enraged and humiliated Light swears to eliminate L.", "\"Confrontation\": As criminals begin dying from inexplicable heart attacks, Interpol convenes to discuss the phenomenon. Unable to explain it, they turn to the world's top-ranked detective, L, whose true identity is a closely guarded secret. L speaks to the Interpol representatives through a computer and an electronic voice, promising them that they are dealing with mass-murder and that he will soon confront the killer, whom the general public has been calling Kira (the Japanese pronunciation of the English word killer). This displeases Light, who had been going to great lengths to keep the Death Note hidden. L tricks Light into revealing that Kira lives in Japan's Kanto region with a television broadcast. A humiliated Light swears to eliminate L."], "genres": "N/A", "imdbID": "0900488", "rating": 9.0, "votes": 8139, "number_of_episodes": 37}