{"cast": {"1465001": "Mamoru Miyano", "1217394": "Shidô Nakamura", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "0766483": "Ai Satô", "0946295": "Kazuki Yao", "0765815": "Nozomu Sasaki", "1074164": "Masaki Aizawa", "0559690": "Takashi Matsuyama", "0841448": "Brad Swaile", "0238546": "Brian Drummond", "1275101": "Shannon Chan-Kent", "0110167": "Chris Britton", "1925154": "Vincent Tong", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "0376588": "Saffron Henderson", "0451918": "Sam Vincent", "1870399": "David Robert Moore", "0170809": "Ted Cole", "0229923": "Michael Dobson", "17047381": "Prince Patel", "1154301": "Jason Simpson"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Mello learns some valuable information concerning false entries in his Death Note from its true owner. Soichiro agrees to take on the shinigami eyes to thwart him.", "Light tries to discover where Mello and his Mafia associates are hiding and uses Misa's eyes to find the Death Note's current owner. Light writes the owner's name in the Death Note and stealthily manipulates him into revealing the group's whereabouts. As Light transfers ownership of his Death Note in preparation for an attack on Mello's stronghold, Mello and his associates meet Sidoh and learn about the two false entries in the book.—Anonymous", "\"Father\": Light uses the Death Note to have a member of Mello's Mafia mail him the address of their hideout. Sidoh sees the address and goes to find Mello, revealing to him that the 13-day rule is fake. Meanwhile, Light informs Ryuk that he will give up ownership of his Death Note and borrow Misa's. The next day, Misa, posing as Kira, calls the investigation team to tell them that she will give them her Death Note. She also tells them that most of the members of Mello's mafia will die on November 10 and that will be the best time to find the stolen Death Note. Upon receiving the second Death Note, Soichiro makes the deal with Ryuk to obtain shinigami eyes. The investigation team storms Mello's facility on the set date. Soichiro comes face to face with Mello and reads his true name: Mihael Keehl. Before he can write it on the recently recovered Death Note, however, Soichiro is shot. Mello escapes by detonating explosives and Soichiro is taken to a hospital, where he dies comforted by the knowledge that his son cannot be Kira because he can see Light's lifespan. Light returns Sidoh's lost Death Note to him."], "genres": "N/A", "imdbID": "1021402", "rating": 7.9, "votes": 4868, "number_of_episodes": 37}