{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0462017": "Kiyoshi Kobayashi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "2445666": "Takuya Kirimoto", "0619179": "Miki Nagasawa", "0299401": "Issei Futamata", "1203697": "Hirofumi Nojima", "0363066": "Kiyoyuki Yanada", "1074164": "Masaki Aizawa", "0632641": "Rintarô Nishi", "2239419": "Yukitoshi Tokumoto", "2069528": "Eiji Hanawa", "6355424": "Miwako Inagaki", "1145592": "Shiho Kawaragi", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "0862703": "French Tickner", "1275101": "Shannon Chan-Kent", "0110167": "Chris Britton", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0650991": "David Orth", "0856197": "Venus Terzo", "0442515": "Andrew Kavadas", "0170809": "Ted Cole", "0465959": "Michael Kopsa", "0801347": "Martin Sims", "1139021": "Simon Hayama", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["L's depression causes a scuffle to break out in the new headquarters, and a recent string of CEO deaths has L and Light thinking that Kira may be killing for monetary profit.", "The investigation moves into L's new security building. L admits he's depressed over drawing wrong conclusions about Light and Misa, causing Light to erupt over the number of innocent lives he's risked and lost so far. Among recent deaths, Light notices a number of prominent CEOs dying of heart attacks that benefits the Yotsuba Company. As the task force turns its attentions to this, political bribes from Kira pull all police interest from the case, forcing individuals on the team to decide whether to stay or not. Afterwards, two new members of the task force are introduced.—statmanjeff", "\"Ally\": L proposes that he be tied to Light, causing a scuffle to break out in the new headquarters. It is some time until Kira begins killing again, which has L and Light thinking that Kira may be killing for monetary profit. Their suspicions lead them to the Yotsuba Group, a rich organization that dominates global markets. Kira is also reported to have been sending threats to politicians and the investigation team is forced to conduct their operations in secret. As far as the public is concerned, the Kira investigation remains unsolved. Aizawa, initially unable to decide whether to stay on the Task Force or not, ultimately quits, angry at L for testing his loyalty. At this point, L brings two new members to the investigation team, Aiber and Wedy. At the end of the episode, we see Aizawa sitting at the park after having just quit the Task Force. His wife Eriko and young daughter Yumi happen to be walking through the park and see him. Aizawa explains that he was given some time off, but begins to break down at this point as he really didn't want to leave the Task Force."], "genres": "N/A", "imdbID": "0954288", "rating": 7.3, "votes": 5039, "number_of_episodes": 37}