{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "0149218": "Chafûrin", "0407435": "Masaru Ikeda", "2058950": "Takafumi Kawakami", "2769316": "Takeshi Mori", "9231331": "Ken'ichirô Ishikawa", "3285432": "Kanako Kondô", "2476035": "Aoi Inaba", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0238546": "Brian Drummond", "0290075": "Andrew Francis", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "0675354": "Ward Perry", "0796941": "Howard Siegel", "0319308": "Tabitha St. Germain", "0841448": "Brad Swaile", "0862703": "French Tickner"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["L challenges Light to a tennis match and tests his deductive abilities; an urgent call has them rushing to the hospital.", "L and Light play a \"friendly\" game of tennis by which to suss each other out, with their playing skills attracting campus attention. Afterwards at a coffee shop, L presents Light a test of deductive reasoning skills, using Kira's messages. News of Light's father's heart attack interrupts them. Meanwhile, a newspaperman who seeks riveting stories gets just what he wants in a direct message from Kira.—statmanjeff", "Episode 10: doubt In a bid to profile Light's behavior, L challenges him to a game of tennis. L asks him some questions regarding the Kira case and invites him to help in the investigation. The two then receive news that Soichiro Yagami has had a heart attack and is in the hospital. Light promises to his father that he will make sure Kira is caught and executed for making him suffer. On the way out, L confronts and scrutinizes Light, still uncertain whether or not he is Kira. Light attempts a bluff and demands to be placed in a prison cell without television for one month to prove his innocence. L is satisfied but curious that Light should offer this proposition. Meanwhile, television station Sakura TV receives audio tapes from an anonymous person claiming to be Kira.", "\"Doubt\": In a bid to profile Light's behavior, L challenges him to a game of tennis. L asks him some questions regarding the Kira case and invites him to help in the investigation. The two then receive news that Soichiro Yagami has had a heart attack and is in the hospital. Light promises to his father that he will make sure Kira is caught and executed for making him suffer. On the way out, L confronts and scrutinizes Light, still uncertain whether or not he is Kira. Light attempts a bluff and demands to be placed in a prison cell without television for one month to prove his innocence. L is satisfied but curious that Light should offer this proposition. Meanwhile, television station Sakura TV receives audio tapes from an anonymous person claiming to be Kira."], "genres": "N/A", "imdbID": "0919368", "rating": 8.1, "votes": 5512, "number_of_episodes": 37}