{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "1428827": "Hidenobu Kiuchi", "0559471": "Naoko Matsui", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0222175": "Trevor Devall", "0238546": "Brian Drummond", "1853731": "Jeremy From", "0432228": "Alessandro Juliani", "1006313": "John Murphy", "0319308": "Tabitha St. Germain", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Light uses the Death Note to try to get rid of the woman who could get him captured and is shocked when it doesn't work.", "As L introduces his confederate and concludes his meeting with the policemen (distributing false I.D.s and tracking devices for their safety), Light works fast to gain the trust of Pember's fiancée before she can relay crucial information she's figured out about Kira.—statmanjeff", "Episode 7: overcast Light writes the name Maki on the Death Note. When nothing happens, he realizes that Penber's fiancée has kept an alias and fears that she may lead the police to him. Ryuk starts pressuring Light to get the shinigami eyes, but Light coaxes her true name, Naomi Misora, out of her by pretending to work for L. As the Death Note takes effect, Light informs her that he is Kira and watches as Naomi walks away to commit suicide, tauntingly yelling after her how he could easily contact his father now, with her only feebly returning that she has nothing to say. Meanwhile, Watari reveals his identity in the meeting with Light's father and the other detectives. He gives the detectives special gadgets embedded in clothing in the event Kira comes into contact with them or they are in trouble. Detective Shuichi Aizawa is sent to the police headquarters by L and just misses Penber's fiancée.", "\"Overcast\": Light writes the name Shoko Maki on the Death Note. When nothing happens, he coaxes her true name, Naomi Misora, out of her by pretending to work for L. As the Death Note takes effect, Light informs her that he is Kira and watches as Naomi walks away to commit suicide. Meanwhile, Watari reveals his identity in the meeting with Light's father and the other detectives. He gives the detectives special gadgets embedded in clothing in the event Kira comes into contact with them or they are in trouble. Detective Shuichi Aizawa is sent to the police headquarters by L and just misses Naomi handing her driver's license to Light as a form of identification."], "genres": "N/A", "imdbID": "0919367", "rating": 9.1, "votes": 7857, "number_of_episodes": 37}