{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1217394": "Shidô Nakamura", "0462017": "Kiyoshi Kobayashi", "1435774": "Aya Hirano", "1211596": "Kimiko Saitô", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0299401": "Issei Futamata", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "0238546": "Brian Drummond", "0862703": "French Tickner", "1275101": "Shannon Chan-Kent", "0923791": "Colleen Wheeler", "0110167": "Chris Britton", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0442515": "Andrew Kavadas", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["The team arrests Higuchi for being Kira and causing multiple murders. Inspecting Higuchi's Death Note, team members who touch it abruptly discover that shinigami do exist, and when Light takes the Death Note from L, his memory returns.", "As the team finally collars Higuchi for the recent Kira murders, members touching the confiscated Death Note see Rem standing among them and suddenly realize that shinigami indeed exist. As the Death Note finally reaches Light, his memories return. He quickly works to kill Higuchi to make their return permanent. As Light labors to restore Misa's full memory and have her kill L immediately, L deduces that at least two Death Notes have been in play.—statmanjeff", "\"Revival\": Higuchi is arrested on grounds of being Kira and causing multiple murders in the region of Kanto. After inspecting Higuchi's Death Note, L discovers that shinigami do exist. While L is stunned, Light takes the Death Note from him and remembers that he is the original Kira. Light then kills Higuchi by writing his name on a scrap of the Death Note. It is revealed that when Light gave away his Death Note, he added a fake rule stating that, after having written in the book, its owner must continue to use it at least once every thirteen days or perish. The investigation team reviews the rules written in the book and finds that they can do little to get rid of it. Meanwhile, Light orders Misa to recover the other Death Note he had hidden a few months earlier. Misa makes a second deal with Ryuk for the shinigami eyes in order to find out L's true identity."], "genres": "N/A", "imdbID": "0990612", "rating": 9.3, "votes": 7945, "number_of_episodes": 37}