{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "1211596": "Kimiko Saitô", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "2445666": "Takuya Kirimoto", "0299401": "Issei Futamata", "1203697": "Hirofumi Nojima", "0363066": "Kiyoyuki Yanada", "1074164": "Masaki Aizawa", "2069528": "Eiji Hanawa", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "1275101": "Shannon Chan-Kent", "0923791": "Colleen Wheeler", "1925154": "Vincent Tong", "1006313": "John Murphy", "0650991": "David Orth", "0442515": "Andrew Kavadas", "0170809": "Ted Cole", "0465959": "Michael Kopsa", "0801347": "Martin Sims", "0222175": "Trevor Devall", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["The third Kira sets his eyes on Misa after meeting her. While Misa takes a break from meeting the Yotsuba Group, Rem contacts her. Misa is able to see the shinigami, but her memories of being the second Kira do not return.", "Groomed on how to respond at her interview, Misa meets with the Yotsuba Group, but Rem, fearing for her safety, enables Misa to see her once again and reveals the identities of all three Kiras. Thrilled, Misa goes rogue and rendezvous with the sleazy third Kira to record a confession from him. Meanwhile, delving into the first Kira's history leaves Light feeling unnerved.—statmanjeff", "\"Performance\": The third Kira sets his eyes on Misa after meeting her. While Misa is taking a break from meeting with the Yotsuba Group, Rem contacts her. Misa is able to see the shinigami, but her memories of being the second Kira do not return upon touching a portion of the Death Note that Rem has brought her. Rem then tells Misa about everything that has happened and that she must trust Light lest she be killed. Upon re-entering the room, she spots who the third Kira must be: Kyosuke Higuchi. Misa goes on a date with him and is able to obtain proof that Higuchi is the criminal L is looking for. Her ease in determining who Kira is leaves L very suspicious, since he could not deduce it himself."], "genres": "N/A", "imdbID": "0972446", "rating": 7.7, "votes": 4884, "number_of_episodes": 37}