{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "1211596": "Kimiko Saitô", "2963540": "Shigeo Kiyama", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "1275101": "Shannon Chan-Kent", "0222175": "Trevor Devall", "0238546": "Brian Drummond", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong", "0923791": "Colleen Wheeler"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Light goes to Aoyama to discover the identity of the second Kira before L becomes more suspicious, but Misa Amane, the new Kira, uses her unusual gift to find Light before he finds her.", "The task force receives a journal sent to a TV station by the Kira copycat, designating a date for a meeting between the two Kiras, but Light notes a different entry of greater interest under a different date. Though his investigation with Matsuda comes to nothing, he unknowingly reveals himself to the copycat, who comes to meet him in person at his home and make a personal request.—statmanjeff", "\"Confession\": Detective Touta Matsuda and Light volunteer to go to Aoyama to investigate on the date mentioned in the journal entry. Light intends to find out who the second Kira is, and in order to keep his identity unknown to the shinigami following Misa, he gets a group of his friends to surround them while they walk. Possessing the shinigami eyes, however, Misa finds out that Kira is Light Yagami because his life span is the only one she can't see. Later, Misa confirms to the investigation team that she has found the real Kira. The team decides to change their approach and try to reason with her. They release a television broadcast condemning Kira as a heartless murderer who will kill anyone who discovers his identity. Furthermore, they offer to lessen the severity of the punishment the second Kira will face if she reveals information about the real Kira. Misa ignores this, finds Light and explains that she tracked him down because she loves him."], "genres": "N/A", "imdbID": "0924023", "rating": 8.3, "votes": 5286, "number_of_episodes": 37}