{"cast": {"1465001": "Mamoru Miyano", "1217394": "Shidô Nakamura", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "1074164": "Masaki Aizawa", "1143491": "Mitsuru Ogata", "0847123": "Hiroki Takahashi", "0946295": "Kazuki Yao", "0880872": "Hideyuki Umezu", "0383022": "Noriko Hidaka", "0765815": "Nozomu Sasaki", "0841448": "Brad Swaile", "0238546": "Brian Drummond", "1275101": "Shannon Chan-Kent", "0110167": "Chris Britton", "1925154": "Vincent Tong", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "1027678": "Michael Adamthwaite", "0636868": "John Novak", "0451918": "Sam Vincent", "0229923": "Michael Dobson", "0921699": "Cathy Weseluck", "1870399": "David Robert Moore", "0354826": "Ron Halder", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["In trying to retrieve his kidnapped sister, Light learns of two opposing factions trying to take him down, the SPK lead by N and a crime syndicate lead by Mello.", "Light, acting as L, reveals to Near that Sayu (his sister) has been kidnapped by someone wanting to trade her for the Death Note. With the exchange set to take place in Los Angeles, Near lends his support while secretly planning to take the Death Note and bring down Kira; however, Mello (Sayu's kidnapper) resets the time and place of the exchange to get the notebook. As he succeeds and wipes out nearly every member of the SPK in return, Near and Light decide to cooperate more fully with each other from now on. Meanwhile, the true shinigami owner of a Death Note stolen by Ryuk plans a reluctant trip to the human realm to retrieve it.—Anonymous", "\"Impatience\": Near suggests that he and Light cooperate to rescue Sayu. Soichiro takes the Death Note to the exchange point chosen by the kidnappers in Los Angeles, but Mello's men hijack the plane he is on and drop him off in the middle of the desert. Light monitors his father via satellite, until he enters an underground facility. There, Soichiro exchanges the Death Note for Sayu. Mello slaughters most of the SPK once he obtains the Death Note. Near then proposes to Light that the two cooperate completely in the future, and shares his suspicions that Mello is playing a game to see who can catch Kira faster. Meanwhile, in the shinigami realm, a shinigami named Sidoh tells another, Armonia Justin, that he lost his Death Note. Justin informs him that it was stolen by Ryuk and dropped in the human world."], "genres": "N/A", "imdbID": "1010095", "rating": 7.3, "votes": 4691, "number_of_episodes": 37}