{"cast": {"1465001": "Mamoru Miyano", "1435774": "Aya Hirano", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "0757087": "Maaya Sakamoto", "0632769": "Tomohiro Nishimura", "0648768": "Masaya Matsukaze", "0765815": "Nozomu Sasaki", "0841448": "Brad Swaile", "1275101": "Shannon Chan-Kent", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "1976541": "Heather Doerksen", "0625334": "Drew Nelson", "0607516": "Kirby Morrow", "1870399": "David Robert Moore", "16109042": "Akira Hebe", "16109046": "Besuta Kawamoto", "16109043": "Keresu Nanto", "16109044": "Parasu Narita", "17047381": "Prince Patel", "1154301": "Jason Simpson", "16109045": "Juno Umezawa"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Star newscaster Kiyomi Takada becomes Kira's spokesperson to the world (after Mikami \"deletes\" Demegawa). She just so happens to have been Light's girlfriend in college. Aizawa's suspicions about Light grow.", "Teru Mikami proves to be the right follower with whom Kira can share his power. After killing the self-centered and avaricious Demegawa, Teru selects Kiyomi Takada (Light's former girlfriend in college, as it turns out) as the new Kira spokesperson. With Mello watching Misa, and the task force watching Light, Light meets with Kiyomi to make direct contact with Teru.—statmanjeff", "\"Selection\": Tragic events in Teru Mikami's childhood convince him that God wants him to stand up to evil. As a result, when criminals everywhere begin to die, Mikami believes that this is God's righteous judgment and becomes a frequent guest on Kira's Kingdom. After Light gives him a Death Note, Mikami becomes ecstatic and passes judgment on criminals in Light's stead. He chooses a new spokesperson for Kira: Kiyomi Takada, who happens to be one of Light's girlfriends in college. Light realizes that he can use this connection to his advantage and sets up a meeting with Takada, presumably for the benefit of the investigation. While the two meet, Takada receives a call from Mikami and Light reveals himself to Mikami as Kira. They create a ploy to force the investigation team to remove all bugs from the room, after which Light tells Takada that he wants her to be his goddess in the new world. Light then tells the investigation team that he will pretend to be Takada's boyfriend to catch Kira. Elsewhere, Mello watches Misa, suspecting her to be the second Kira."], "genres": "N/A", "imdbID": "1029789", "rating": 7.8, "votes": 4690, "number_of_episodes": 37}