{"cast": {"1465001": "Mamoru Miyano", "1435774": "Aya Hirano", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "0757087": "Maaya Sakamoto", "1074164": "Masaki Aizawa", "0847123": "Hiroki Takahashi", "0383022": "Noriko Hidaka", "0841448": "Brad Swaile", "1275101": "Shannon Chan-Kent", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "1976541": "Heather Doerksen", "1027678": "Michael Adamthwaite", "0451918": "Sam Vincent", "0921699": "Cathy Weseluck", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Aizawa figures out what's going on and tells Near, who already knows about the notes. Near instructs Aizawa to continue watching Light, and then puts in motion a plan to separate Misa from Light.", "Near considers how to deal with the presence of a shinigami, who can only be seen by those who have touched the Death Note. Before Misa can publicly announce her engagement to Light at a televised pop music festival, Near has her and her bodyguard, Det. Mogi, picked up for questioning. Simultaneously, he gives Stephen Gevanni (who's been shadowing suspect Teru Mikami - the fourth Kira), an order: touch Teru's Death Note and look around for a shinigami (neither realizing that the book's a fake).—statmanjeff", "\"Vigilance\": After Gevanni's report, Near decides that they must get close to Mikami, but carefully so that the shinigami trailing Mikami will not warn him. Meanwhile, Aizawa marks several notepads before Light and Takada meet, to determine whether or not they are communicating in secret through written notes. Takada tells Light of her meeting with Misa. Annoyed at the trouble that both women cause him, Light assures her that she is the only one for him. He then writes a script for Takada that makes it sound like she has agreed to help capture Kira. After the meeting, Aizawa's suspicions are confirmed. The SPK picks up Misa then and, when Light contacts Near to tell him that they have lost track of her, Near informs him that he has her. Meanwhile, Gevanni searches Mikami's gym locker and finds the notebook. During a second visit, Gevanni takes photographs of the names written in it. Near determines that the handwriting is Mikami's. Now having everything he needs, Near sets his plan in motion."], "genres": "N/A", "imdbID": "1043073", "rating": 7.2, "votes": 4539, "number_of_episodes": 37}