{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0442953": "Yasuhiko Kawazu", "1238027": "Nobuaki Kanemitsu", "9222225": "Yûji Kimura", "3285432": "Kanako Kondô", "2582044": "Orie Kimoto", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "0222175": "Trevor Devall", "0229923": "Michael Dobson", "0238546": "Brian Drummond", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "0458342": "Terry Klassen", "3045630": "Kelly Metzger", "0636868": "John Novak", "0841448": "Brad Swaile", "1925154": "Vincent Tong", "0008533": "Alistair Abell"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["L makes a direct move against his top suspect when Light enters To-Oh University.", "When surveillance of the two homes turns up nothing, L thinks things through to decide what to do or where to turn next. Following an exam, Light enters college where he's number one in his freshman class along with a watchful student who introduces himself to Light as L and invites him to join the Kira Task Force. Recognizing he's been outplayed, Light blows his cool for the first time but soon rallies with a plan, locking the two boys in a deadly battle of wits from here on out.—statmanjeff", "Episode 9: encounter L's suspicions are momentarily subdued, but he does not discard the possibility that Light may be Kira and decides to meet him in person. At the college entrance exams, Light notices a mysterious and eccentric student staring at him, who introduces himself as Hideki Ryuga, the same name as a famous idol. Light is shocked when \"Hideki Ryuga\" told Light he was L. Since it would be too suspicious for L to die right after meeting Light, he decides to befriend L and kill him at a later time. He decides that the best course of action is to get closer to L, gather more information about his true identity and keep an eye on the police.", "\"Encounter\": L's suspicions are momentarily subdued, but he does not discard the possibility that Light may be Kira and decides to meet him in person. At the college entrance exams, Light notices a mysterious and eccentric student staring at him, who introduces himself as Hideki Ryuga, the same name as a famous idol. Light is shocked when \"Hideki Ryuga\" reveals himself as L. Since it would be too suspicious for L to die right after meeting Light, he decides to befriend L, gather more information about his true identity, and kill him at a later time."], "genres": "N/A", "imdbID": "0919370", "rating": 8.5, "votes": 5760, "number_of_episodes": 37}