{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0297873": "Keiji Fujiwara", "0619828": "Ryô Naitô", "1211596": "Kimiko Saitô", "2929280": "Masahiro Yamanaka", "3198364": "Ryou Agawa", "1947564": "Ken'ichi Matsuyama", "0462017": "Kiyoshi Kobayashi", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "1275101": "Shannon Chan-Kent", "0222175": "Trevor Devall", "0229923": "Michael Dobson", "0238546": "Brian Drummond", "0432228": "Alessandro Juliani", "0841448": "Brad Swaile", "0862703": "French Tickner", "1925154": "Vincent Tong", "0923791": "Colleen Wheeler"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Light is invited into the Task Force to help respond to the second Kira, and Rem tells Misa how she came by her Death Note.", "Without given much preamble, Light looks over the tapes from the TV station and voices the same conclusion as L, that there's a second Kira. With this conclusion validated, they work together to draw out the copycat. It works. The copycat gives a live broadcast reply but it proves a liability to Light when the copycat reveals shinigami information best kept secret. Horrified, L now realizes supernatural forces are involved.—statmanjeff", "\"Love\": Light meets with L and the detectives. To test Light's analytical skills, L has him listen to the recordings confiscated by the team to determine if there are any clues in the reader's voice. In this way, L concludes that Light cannot be Kira. The team then broadcasts a recording made by L and Light to trick the second Kira into replying. Misa unwittingly reveals important details about the properties of the Death Note and shinigami when she responds and Light begins to panic. In her reply, Misa demands that the first Kira meet her in person. Shocked and wanting to pursue this lead, the investigation team formulates a plan, while Light decides what to do. Meanwhile, Rem explains to Misa that she knows how to kill a shinigami: to make them fall in love with a human. Rem tells Misa the story of a shinigami named Gelus who obsessively watched over Misa from the Shinigami Realm. One night, as a deranged stalker threatened to kill both Misa and himself, Gelus wrote the stalker's name in his Death Note, ending his own life and adding the remainder of his lifespan to Misa's."], "genres": "N/A", "imdbID": "0924022", "rating": 8.2, "votes": 5355, "number_of_episodes": 37}