{"cast": {"1465001": "Mamoru Miyano", "1435774": "Aya Hirano", "0619828": "Ryô Naitô", "0620017": "Kazuya Nakai", "0297873": "Keiji Fujiwara", "0411050": "Hideo Ishikawa", "0847123": "Hiroki Takahashi", "0383022": "Noriko Hidaka", "0648768": "Masaya Matsukaze", "2428716": "Fujita Daisuke", "0841448": "Brad Swaile", "1275101": "Shannon Chan-Kent", "1925154": "Vincent Tong", "1006313": "John Murphy", "0222175": "Trevor Devall", "0229889": "Brian Dobson", "0451918": "Sam Vincent", "0921699": "Cathy Weseluck", "0607516": "Kirby Morrow", "0238546": "Brian Drummond", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Near, along with the SPK, meets Light and the task force at a warehouse for the final showdown. To everyone's shock, Near reveals that Kira's follower, Mikami, is at the warehouse and is writing everyone's name in the Death Note.", "Kiyomi's announced death prompts many to step forward, eager to be the next Kira spokesperson (to the disgust of many in the task force). The day of the meeting between SPK and the Kira Task Force arrives. As they meet, Near waits before revealing his plan to out Kira through the actions of Teru Mikami, but Light has prepared for this moment with a counter-plan to take out all those around him. Time will tell.—statmanjeff", "\"1.28\": Each having developed a strategy to bring the other down for good, Light and Near finally meet face to face in an abandoned warehouse. Light brings out Mikami to have him write the names of everyone but Light on his Death Note. Meanwhile, Near is confident that the pages of the notebook Mikami is using are fake, revealing that he has tampered with them. All they need to do now is check whose name was not written to find out who the real Kira is. Light struggles to mask his glee as he thinks of how he already knew of Near's actions and that that had been why he had Takada keep the real Death Note while switching Mikami's with a false one. As the seconds before the Death Note's power takes effect count down, Light declares his victory to Near."], "genres": "N/A", "imdbID": "1044252", "rating": 8.9, "votes": 6206, "number_of_episodes": 37}