{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "1435774": "Aya Hirano", "0998211": "Naoya Uchida", "0766483": "Ai Satô", "1933722": "Haruka Kudô", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0620017": "Kazuya Nakai", "1211596": "Kimiko Saitô", "1177402": "Masumi Okamura", "1217394": "Shidô Nakamura", "0110167": "Chris Britton", "1275101": "Shannon Chan-Kent", "0222175": "Trevor Devall", "1976541": "Heather Doerksen", "0238546": "Brian Drummond", "0376588": "Saffron Henderson", "0432228": "Alessandro Juliani", "3045630": "Kelly Metzger", "1006313": "John Murphy", "0841448": "Brad Swaile", "1925154": "Vincent Tong", "0923791": "Colleen Wheeler"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["24"],  "plot": ["Light and Misa show each other their Death Notes, and Light asks Misa to have her shinigami Rem get rid of L, which Misa will do in order to have Light fall in love with her.", "Misa quickly becomes a double-edged sword in Light's life: on the one hand she's a loyal follower with shinigami eyes who will do whatever he wants (mainly, kill L), but on the other hand she's an obsessive wanna-be girlfriend who can't leave him alone and will get him caught. If Light kills Misa to protect himself, her protective shinigami Rem will kill him. Back with the task force, L drops his suspicions and reveals that Light has become the first real friend he's ever had. Even so, Light asks Rem to kill L. Mogi (earlier assigned to tail Light) notes Light's curious number of girlfriends.—statmanjeff", "\"Friend\": After Light introduces Misa to Ryuk, the two discuss their plans to get rid of L. Taking advantage of the situation and of Misa's love for him, Light concludes that he can use her to mislead L, while furthering his plans for a better world. Misa's shinigami, Rem, however, threatens to write down Light's name in her own Death Note if Misa's safety is compromised. In the meantime, L is thrown off the trail by the second Kira and is confused by the new audio tapes purposely denouncing the police's attempt to make the first Kira appear as a pariah. L concludes that the two Kiras might have met and are working towards the same goal.", "Light gains Misa's trust and decides he can use her eyes to eliminate L. When she accepts on the condition that Light date her, he threatens to kill her if she does not obey his orders. In return, Rem threatens to write Light's name in her Death Note if any harm comes to Misa, even though saving Misa will kill her. Light is stuck in the position of having to protect Misa and see her regularly. To make matters more complicated, he discovers that she is a famous model. An audiotape being broadcast from the Second Kira announces loyalty to Kira, and L suspects that Kira and the Second Kira have met and are working together. This heightens suspicion on Light, as the tape did not demand L show his face, and Light knows L's face. Light counters this claim, but discussion comparing Light to Kira upsets Soichiro. L calls Light his first friend, but he quietly tasks Mogi with tracking Light's whereabouts. Misa visits Light again, angering him and drawing Mogi's suspicion. In private, Light questions Rem's devotion to Misa, and because it will make Misa happy and keep her safe without killing Rem, Rem agrees to kill L."], "genres": "N/A", "imdbID": "0947907", "rating": 8.2, "votes": 5222, "number_of_episodes": 37}