{"cast": {"1465001": "Mamoru Miyano", "0945322": "Kappei Yamaguchi", "0462017": "Kiyoshi Kobayashi", "1435774": "Aya Hirano", "1211596": "Kimiko Saitô", "0998211": "Naoya Uchida", "0619828": "Ryô Naitô", "0297873": "Keiji Fujiwara", "0299401": "Issei Futamata", "1203697": "Hirofumi Nojima", "0363066": "Kiyoyuki Yanada", "1074164": "Masaki Aizawa", "1307121": "Hiroyuki Yokoo", "0632641": "Rintarô Nishi", "0841448": "Brad Swaile", "0432228": "Alessandro Juliani", "0862703": "French Tickner", "1275101": "Shannon Chan-Kent", "0923791": "Colleen Wheeler", "0110167": "Chris Britton", "1925154": "Vincent Tong", "0222175": "Trevor Devall", "0442515": "Andrew Kavadas", "0170809": "Ted Cole", "0465959": "Michael Kopsa", "0801347": "Martin Sims", "0238546": "Brian Drummond", "0650991": "David Orth", "17047381": "Prince Patel"}, "geners": ["Animation", "Crime", "Drama", "Fantasy", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["Getting nowhere fast, L thinks of a new plan to get Light, Misa and Mr. Yagami out of confinement.", "As time wears on, Light and Misa give no indications of either being Kira. Using Light's father, L stages a test to force the issue and determine the truth, after which L finally releases Light and Misa but under restrictive conditions until they catch Kira.—statmanjeff", "\"Execution\": In a last bid to determine if Light and Misa are the two Kiras, L and Soichiro stage a stunt in which Light's father attempts to kill Light and then himself out of shame. Seeing Light and Misa's reactions to it, L intervenes and announces that he no longer suspects them of being Kira, although he is still suspicious over the fact that Misa's DNA was found on the audio tapes. Misa is released, but Light continues working on the Kira case. L and Watari move the investigation team's headquarters to a new building inside the city. Elsewhere, Rem speaks to a mysterious businessman about the Death Note. Eight businessmen then plan the next murder Kira will commit in order for the Yotsuba Group to excel in the market."], "genres": "N/A", "imdbID": "0950513", "rating": 8.0, "votes": 5175, "number_of_episodes": 37}