{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0805476": "John Slattery", "0240043": "Anne Dudek", "1581670": "Darby Stanchfield", "0241885": "Alastair Duncan", "0449570": "Jerry Kernion", "1119340": "Kristoffer Polaha", "1820958": "Alexa Alemanni", "0141307": "Price Carson", "1082863": "Michael David Cheng", "0993496": "Kate Connor", "0183960": "Stephanie Courtney", "0280266": "Jennifer Fitzgerald", "2700155": "Lauren Hackman", "2280163": "Maxwell Huckabee", "1408575": "Kent Kasper", "1617837": "Julie McNiven", "1510150": "Jonathan Nail", "0689040": "Josiah Polhemus", "2215143": "Kiernan Shipka", "0801044": "Jeanne Simpson", "0855133": "Adria Tennor", "2804947": "Marten Holden Weiner", "1053452": "Drew Wicks", "2648248": "Kristin Crandall", "2491005": "Candice Cunningham", "1992334": "Emelle", "1724804": "Sarah Jannett Parish", "1909642": "Jennifer Sims", "1914981": "Arne Starr", "2203764": "Callie Thompson"}, "geners": ["Drama"], "runtimes": ["45"],  "plot": ["Pete returns home from his honeymoon excited about his new marriage but conflicted about his past encounter with Peggy.", "Pete Campbell returns from his honeymoon with tall tales and a big grin on his face. He does tell Peggy Olson that their fling before his marriage was for one night only. Don Draper runs into an old army buddy who knows him under the name of Dick Whitman. He also takes a tour of Rachel Menken's store but in a private moment, their mutual attraction becomes evident. The Drapers have friends over for their daughter's birthday party, including the divorcée who lives down the street. Don however is obviously unhappy with his lot in life and seems to be carrying a burden that is not apparent.—garykmcd", "While on the train to work one morning, Don is approached by a man named Larry Kryszinski who recognizes him as someone named Dick Whitman. As Dick Whitman, Don, in turn, seems to recognize this man. The talk in the office is Volkswagen's mockingly self-degrading ads, which work in only that people in general, including those in the office, are talking about them. Other talk in the office occurs between Pete, just back from his Niagara Falls honeymoon, and Peggy, the two who clarify what their one sexual encounter means, especially now that Pete's married. After a disastrous first meeting, the account team meets with Rachel Menken a second time with a campaign outline of what they believe is more in line with what she is looking for. That meeting results in a site visit to Menken's by Don, who does more than just inspect the store's operation. At Sally's birthday party, the focus of attention steers to party attendee and neighborhood newcomer, divorcée Helen Bishop. The events at the party in combination with his meeting with Rachel makes Don's mind wander, he who does something unexpected to those around him.—Huggo"], "genres": "N/A", "imdbID": "1049716", "rating": 7.6, "votes": 4170, "number_of_episodes": 92}