{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "1555340": "Alison Brie", "0608601": "Mark Moses", "0750527": "Troy Ruptash", "1820958": "Alexa Alemanni", "0183960": "Stephanie Courtney", "0395360": "Brynn Horrocks", "0472153": "David Kronenberg", "1617837": "Julie McNiven", "0750851": "Morgan Rusler", "0782525": "Heather Seiffert", "2215143": "Kiernan Shipka", "0804035": "Stewart Skelton", "0843388": "Kevin Symons", "1829813": "Cassius M. Willis", "1991213": "Dared Wright", "1262138": "Dawn Marie Anderson", "3016518": "Claire Bocking", "2648248": "Kristin Crandall", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "1992334": "Emelle", "1525039": "Monica Ford", "2761083": "Britt Hysen", "0425696": "Lyndon B. Johnson", "0448123": "John F. Kennedy", "2654329": "Tim Mars", "0633268": "Pat Nixon", "0633271": "Richard Nixon", "1724804": "Sarah Jannett Parish", "1909642": "Jennifer Sims", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["46"],  "plot": ["Election night arrives and the staff of Sterling Cooper has a party while watching the returns. The election is close and it's obviously going to be a long night. Now a senior partner in the firm, Don Draper must hire a new head of account services, a post that Pete Campbell yearns for. Aware of Draper's secret past, he tries to strong-arm him into giving him the job. With his secret out, Don panics and he asks Rachel Menken to run away with him. Regaining his composure, Don calls Pete's bluff leading to a confrontation with Bert Cooper.—garykmcd", "It's US election day, 1960. With Bert and Don having left the office for the evening, a planned underground election party breaks out in the office. The upbeat mood of the party is largely dependent upon how Nixon is faring, but free flowing and large quantities of alcohol combined with something found in Paul's office change the focus of the gathering away from election results. With Don being made partner, he is in charge of hiring a new head of account services, a job which Pete is eying. It doesn't seem to be in the cards for Pete as Don has publicly paraded a series of candidates through the office, with one, Herman Phillips - nicknamed Duck - taken in to see Cooper. Pete contemplates using insider information - information he stole from Don's office - to get what he wants, not thinking that Don would have any other option than to give him the job. Don turns to the one person he feels he can, not so much for advice but for comfort. But the plight of someone else in the office may provide Don with a different perspective.—Huggo"], "genres": "N/A", "imdbID": "1102103", "rating": 9.0, "votes": 4098, "number_of_episodes": 92}