{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "1679669": "Rosemarie DeWitt", "0607666": "Robert Morse", "0776584": "Paul Schulze", "0092026": "Ian Bohen", "1555340": "Alison Brie", "0191679": "Joseph Culp", "1556400": "Crista Flanagan", "0294050": "Bruce French", "0444539": "Paul Keeley", "0460206": "Brian Klugman", "0615063": "Joel Murray", "0072634": "Rona Benson", "0120783": "Anthony Burch", "1483927": "La Monde Byrd", "1469230": "Anna Campbell", "0183960": "Stephanie Courtney", "2007561": "Aaron Hart", "0395360": "Brynn Horrocks", "1865193": "Brandon Killham", "0515225": "Barry Livingston", "1617837": "Julie McNiven", "1724804": "Sarah Jannett Parish", "1746827": "Kathryn Taylor Smith", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "1992334": "Emelle", "2753160": "Jimmy Heck", "2939878": "Christopher Jude", "2374690": "Rick Mattoon", "1909642": "Jennifer Sims", "3177306": "Holly Stiener"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Pete Campbell and Peggy Olson start an office romance. Peggy's copy for the lipstick account goes over well and the men in the firm congratulate her. A new telephone receptionist, Lois Saddler, takes a liking to Salvatore Romano but his own interests seem to lie elsewhere. Don Draper gets an unexpected bonus from Bert Cooper and wants to take Midge on a surprise trip to Paris. She seems too involved with her beatnik friends however. Don reflects on his unhappy childhood and in flashbacks he reveals some life lessons he learned early on when a hobo spent the day working on the family farm in exchange for a meal.—garykmcd", "Alone in the office early in the morning, Pete and Peggy, as the former deals with a personal crossroads and the latter a professional one, open up to each other in more ways than one. With a little sales job, one of those crossroads ends up being more satisfying than the other on the most part. They, however, are not as alone as they believe. Lois, new to the switchboard, has ulterior motives for getting lost in the office. She does not know that her tour will probably be all for not as witnessed by an incident later that evening at the Roosevelt Hotel. Bert gives Don a lucrative bonus and a little advice. What Don plans to do with the money doesn't quite come to pass. In a marijuana induced haze, Don can't help but think back to an incident with a hobo from his childhood that influenced who he is today and shaped his view of his family life at that time.—Huggo"], "genres": "N/A", "imdbID": "1097128", "rating": 8.3, "votes": 3770, "number_of_episodes": 92}