{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1745019": "Maggie Siff", "0041280": "Remy Auberjonois", "1496294": "Darren Pettie", "1679669": "Rosemarie DeWitt", "0191633": "John Cullum", "0805476": "John Slattery", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0711170": "Gordana Rashovich", "2062645": "Henry Afro-Bradley", "0640081": "Jack O'Connell", "1581597": "Bess Rous", "1617837": "Julie McNiven", "0183960": "Stephanie Courtney", "0366731": "Zandy Hartig", "1102891": "Kristen Schaal", "2942702": "Heather Klar", "1586709": "Jamie Proctor", "0731074": "Emma Roberts", "0568908": "Mark McGann", "12138044": "Dylan Gallagher", "2344529": "Jason Abrams", "1262138": "Dawn Marie Anderson", "3917831": "Melissa Ciesla", "2897598": "Evelyn Edwards", "5298502": "Christina Alice Schmidt", "1909642": "Jennifer Sims"}, "geners": ["Drama"], "runtimes": ["49"],  "plot": ["New York City, 1960s. In the ego-driven Golden Age of advertising, everyone is selling something and nothing is what it seems.", "In 1960 New York City - the high-powered and glamorous \"Golden Age\" of advertising - Don Draper, the biggest ad man in the business, struggles to stay a step ahead of the rapidly changing times and the young executives nipping at his heels.—Official Site", "Don Draper is a senior creative executive for Sterling Cooper, a major Madison Avenue advertising agency. It's 1960 and his big challenge is coming up with a new ad campaign for a major client, a cigarette manufacturer. With increasing evidence that smoking is harmful, he has to come up with a whole new approach to selling the product. For Pete Campbell who is about to be married, his pals at work have organized his stag party. For Peggy Olson, it's her first day on the job. What she's told by her fellow secretary Joan Holloway is that the executives want a cross between a mother and a waitress - most of the time.—garykmcd", "1960. With less than a day until his meeting with the company representatives, Don Draper, the creative director of Sterling Cooper Advertising on Madison Avenue, is having problems coming up with a concept for one of his more lucrative accounts, Lucky Strike, he a Lucky Strike smoker himself. He asks almost everyone he can about their thoughts, including the waiter at the local bar who smokes another brand, and his bohemian and independently minded girlfriend Midge Daniels. He also has to consider, albeit solely in the back of his mind, the recent Readers Digest article warning of the health risks of smoking. There is one person close to him, however, in who he does not confide in his work problems. This day also marks the first day in the office for Don's new secretary, meek and plain Peggy Olson, who does not fit the mold of the secretary working primarily to nab a rich husband. Regardless, Peggy gets advice from the office head secretary, Joan Holloway, on how to conduct herself, the executives who, in Joan's words, are looking for \"something between a mother and a waitress\". One of the partners, Roger Sterling, has his own problems, namely finding the non-existent Jew in the office as window dressing for the meeting with Menken's, a Jewish owned and targeted department store. The meeting with the Menken's representative surprises Don in more ways than one. This day also marks the bachelor party for Pete Campbell, a young, brash upstart, who at this point in his life is more aged frat boy than account executive, and who Don knows is eying his job.—Huggo"], "genres": "N/A", "imdbID": "1059578", "rating": 8.1, "votes": 5981, "number_of_episodes": 92}