{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "0805476": "John Slattery", "1581670": "Darby Stanchfield", "0021597": "Christopher Allport", "1555340": "Alison Brie", "0640382": "Joe O'Connor", "0644750": "Randy Oglesby", "0880820": "Andy Umberger", "0153712": "Channing Chase", "1125587": "Barbara Kerr Condon", "1581206": "Tawny René Hamilton", "2280163": "Maxwell Huckabee", "1101813": "Stephen Jordan", "1760286": "Kiersten Lyons", "2268818": "Haley Mancini", "1617837": "Julie McNiven", "0789972": "Sheila Shaw", "2215143": "Kiernan Shipka", "2804947": "Marten Holden Weiner", "1992334": "Emelle", "0627878": "Bob Newhart", "1724804": "Sarah Jannett Parish", "1950628": "David Pearl", "1909642": "Jennifer Sims", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["46"],  "plot": ["Pete Campbell oversteps the mark when he pitches an idea for ad campaign to the head of Bethlehem Steel without telling Don Draper. Draper wants him fired but learns a lesson in corporate politics. Pete's wife wants to buy a Manhattan apartment but he has to approach his cold and distant parents for a loan. Pete's in-laws, however, are more forthcoming.—garykmcd", "Pete is now feeling like the honeymoon phase of his marriage is over as he gets pressure from all sides. Trudy has found an apartment for them in upper Manhattan. Pete isn't sure he wants to live there or if they can afford it on what he considers his meager salary. He would have no issue in borrowing money from his father, but would feel emasculated in borrowing it from her father. He feels unappreciated at work, that feeling which is strengthened during a Bethlehem Steel post-meeting one-on-one debrief with Don. Pete tries to raise his own profile within the company by making what he considers a brilliant but unsanctioned maneuver, this move which could end up backfiring on him. Elsewhere in the office, Don and Rachel have an uncomfortable encounter while she is there for a meeting with anyone but Don. Meanwhile, Betty, based on a situation she literally walks into, learns more about Helen, who is more than willing to confide in who she considers a potential friend in the neighborhood. Out of this burgeoning friendship, Helen asks Betty for a last minute favor to sit with her two children while she goes to do volunteer work for the Kennedy campaign. During that babysitting session, Betty forms an unusual bond with Glen out of pity for Helen's situation. She obliges an unusual request by Glen which shows her warped sense of judgment.—Huggo"], "genres": "N/A", "imdbID": "1040713", "rating": 7.9, "votes": 3950, "number_of_episodes": 92}