{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "1679669": "Rosemarie DeWitt", "0805476": "John Slattery", "0051104": "Talia Balsam", "0092026": "Ian Bohen", "0187460": "Rebecca Creskoff", "0615063": "Joel Murray", "0723415": "Elizabeth Rice", "0741788": "Irene Roseen", "1820958": "Alexa Alemanni", "2423012": "George Alvarez", "1325248": "Megan Duffy", "0280266": "Jennifer Fitzgerald", "1418963": "Heather Fox", "0395360": "Brynn Horrocks", "2280163": "Maxwell Huckabee", "0414365": "Danny Jacobs", "1865193": "Brandon Killham", "0646786": "Bruno Oliver", "1724804": "Sarah Jannett Parish", "0711170": "Gordana Rashovich", "0750851": "Morgan Rusler", "2215143": "Kiernan Shipka", "1553955": "Hrach Titizian", "1382751": "Alison Anderson", "1262138": "Dawn Marie Anderson", "3016518": "Claire Bocking", "0136133": "David Carbonara", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "1992334": "Emelle", "1525039": "Monica Ford", "2761083": "Britt Hysen", "2284681": "Maura Murphy", "1940736": "Rachel Oliva", "2815203": "David Ott", "1432981": "Franklin Ruehl", "1156393": "Jennifer Shumaker", "1909642": "Jennifer Sims", "1600095": "Erin Stutland", "7179781": "Amanda Vitiello"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["The Agency is looking to land an advertising contract to promote tourism to Israel. Don and his team try to come up with a theme but know so little about the country that they're stumped. So Don calls Rachel Menken to see if she has any ideas. Roger Sterling is getting tired of sneaking around with Joan Holloway and suggests she should get her own apartment but she knows better. Peggy comes up with an advertising concept during a testing session for a new line of lipsticks and she's subsequently asked to write copy.—dfg", "It's Mother's Day. Don is attending to his obligations to Betty, who admits how she feels about being his wife, but his mind is on his childhood following his recent unexpected and unwanted encounters with his half-brother, Adam. At the office, Don is heading a potential campaign for Tourism Israel, who wants to attract high end travelers. Don takes the opportunity to visit with who he considers his favorite Jew, Rachel, who later admits to her sister her true feelings for him. Don may get a better perspective of the client and his work on an evening out with Midge and her bohemian friend, Roy, the \"anti-Don\". Another Sterling Cooper client is Belle Jolie lipstick, which the male account executives feel ill equipped to work on. As such, they decide to hold a focus group brainstorming session with the female secretaries. Unlike the other secretaries clamoring at the wide array of lipstick colors offered to them, Peggy plays the more serious role that the male account executives watching behind the one-way mirror should be playing. And Roger wants to change the nature of his relationship to his mistress to one of exclusivity, she who has intimate knowledge of his \"real\" life from her vantage point. She, on the other hand based on that vantage point, has no illusions that her tryst with him is a long term scenario.—Huggo"], "genres": "N/A", "imdbID": "1042049", "rating": 7.8, "votes": 3802, "number_of_episodes": 92}