{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "0805476": "John Slattery", "0051104": "Talia Balsam", "0193982": "Ryan Cutrona", "0587863": "Allan Miller", "0999270": "Kate Norby", "0723415": "Elizabeth Rice", "2809337": "Alexis Stier", "2807104": "Megan Stier", "0906975": "John Walcutt", "1604064": "Jennifer Fouts", "1779273": "Jill Fouts", "1445952": "Scott Michael Morgan", "0790388": "Darcy Shean", "2215143": "Kiernan Shipka", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "0252032": "Dwight D. Eisenhower", "1992334": "Emelle", "0633271": "Richard Nixon", "2173711": "Jade Ramsey", "2125050": "Nikita Ramsey", "1909642": "Jennifer Sims", "3177306": "Holly Stiener"}, "geners": ["Drama"], "runtimes": ["46"],  "plot": ["It's Labor Day weekend and most of the men are sending their wives away for a few days. Don Draper's wife Betty is dreading the thought, as her father and his new girlfriend, whom she detests, will be staying with them. With the election approaching, the team at Sterling Cooper is gloomy since the Nixon campaign has not been following their advice. Roger Sterling was hoping to spend Friday night with Joan Holloway but having just seen the movie The Apartment (1960), she is feeling a bit used. She plans a night on the town with her old college friend who has some surprising information for her. Don and Roger invite twin sisters from a casting call to join them for a drink but things go badly for Roger who suffers a serious heart attack. After the incident Don ends up spending the night with Rachel Menken where he reveals a lot of his inner self.—garykmcd", "The Labor Day weekend is upcoming. Betty's father, Gene, and his girlfriend, Gloria, have stopped by the Draper house before they will all head to their waterfront recreational property for the long weekend. Betty hates Gloria, or at least the idea of who Gloria is in her father's life, especially as a replacement for Betty's deceased mother. With Mona and Margaret heading off on their own for the weekend, Roger wants to spend the weekend with Joan, who has other ideas based on what she has seen in Hollywood movies. As Joan ends up dealing with a last minute issue concerning her roommate Carol which has its own unexpected consequences, Roger looks for double the trouble with a much needed wingman, who becomes more important to Roger by the end of the evening. Before the weekend, the creatives brainstorm about how to tackle the issue of the pedestrian Nixon ads versus the happy Kennedy ads, which has had the result of Kennedy narrowing the gap in the polls, something that should never had happened. Don and the team also have a meeting with Menken's, this time with both Rachel and her father, which may make the final sell more difficult because of their differing views. Before the weekend begins, Don needs to turn to someone he feels he can trust to get a realistic perspective on his life.—Huggo"], "genres": "N/A", "imdbID": "1094472", "rating": 8.2, "votes": 3494, "number_of_episodes": 92}