{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "0805476": "John Slattery", "0003405": "Nathan Anderson", "0240043": "Anne Dudek", "1556400": "Crista Flanagan", "0338768": "H. Richard Greene", "0880820": "Andy Umberger", "0949477": "Dey Young", "0183960": "Stephanie Courtney", "2280163": "Maxwell Huckabee", "1617837": "Julie McNiven", "0769302": "Rick Scarry", "2215143": "Kiernan Shipka", "1262138": "Dawn Marie Anderson", "3016518": "Claire Bocking", "1721764": "Jakob Bokulich", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "1992334": "Emelle", "2405449": "Gloria A Feralio", "1525039": "Monica Ford", "0448080": "Jacqueline Kennedy Onassis", "1190760": "Dominika Pyk", "2125050": "Nikita Ramsey", "1909642": "Jennifer Sims", "1914981": "Arne Starr", "2467724": "Brooke Stone"}, "geners": ["Drama"], "runtimes": ["46"],  "plot": ["Don is courted by Jim Hobart, head of a larger ad firm who offers him more money and more creative resources to join them. Betty Draper rekindles her interest in modeling after Hobart suggests she should try it. She doesn't realize it's all part of the strategy to get Don on board. Peggy Olsen is fretting over her weight gain but doesn't appreciate Joan's advice about getting ahead in the office. The ad team tries to counter the advertising coming out of the Kennedy campaign. Pete Campbell comes up with an idea to keep Kennedy's image off TV in key States.—garykmcd", "While Don and Betty are out at a Broadway play, they run into Jim Hobart, the head of rival advertising agency McCann Erickson, and his wife Adele. McCann is one of the bigger players on Madison Avenue, especially compared to Sterling Cooper. Jim courts both Don and Betty for different reasons. He wants Betty to audition for some modeling work for a Coke print campaign. He wants Don to come over to McCann, he trying to convince Don that Sterling Cooper's small size limits his opportunities. Betty is a little more eager than Don for the opportunity presented, and the overtures toward Betty are a little more public than toward Don. For Betty, the thought of modeling again - how she earned a living when she met Don - are exciting. She is, however, unaware that her getting the work is dependent upon Don's answer to Hobart, Don who is aware of the situation. Don vows to Betty that he will not ruin the opportunity for her, which is true to a degree. Regardless, Betty uses her new found sense of independence in a surprising way. Peggy becomes the center of attention by Joan and the junior male executives in a negative way. However unclear that that is the reason, one person ends up being her defender. And the executives are discussing how best to help the Nixon campaign in light of the moves by the Kennedy campaign, and a speech by Jacqueline Kennedy Onassis. Pete, with Harry's help, believes he has a solution, but that solution, which the two act upon without telling anyone, could end up backfiring on them.—Huggo"], "genres": "N/A", "imdbID": "1097298", "rating": 8.2, "votes": 3604, "number_of_episodes": 92}