{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "0805476": "John Slattery", "0240043": "Anne Dudek", "0999270": "Kate Norby", "2279230": "Shayna Rose", "1146243": "Teddy Sears", "1581670": "Darby Stanchfield", "0880820": "Andy Umberger", "0050612": "Gary Ballard", "1555340": "Alison Brie", "1483927": "La Monde Byrd", "2741187": "Allison Fleming", "0333402": "Susan Grace", "0354893": "Doug Hale", "2280163": "Maxwell Huckabee", "1617837": "Julie McNiven", "0687573": "Flora Plumb", "2215143": "Kiernan Shipka", "1262138": "Dawn Marie Anderson", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "1679669": "Rosemarie DeWitt", "2605943": "Jeff Doden", "1992334": "Emelle", "1525039": "Monica Ford", "1076606": "Rosemary Garris", "2928994": "Shiloh Goodin", "2761083": "Britt Hysen", "1904115": "Richard Kreps", "2374690": "Rick Mattoon", "0750851": "Morgan Rusler", "1909642": "Jennifer Sims", "1914981": "Arne Starr", "1600095": "Erin Stutland"}, "geners": ["Drama"], "runtimes": ["46"],  "plot": ["When Don invites Roger home for dinner, too much alcohol fuels repercussions between Don and Betty and between Don and Roger. Joan puts Roger off for the weekend, spending time with her roommate Carol instead. Pete exchanges a wedding gift for a rifle, and then shares a hunting fantasy with Peggy. Bertram Cooper arranges for the Nixon campaign to meet with him, Roger, Don, and Pete.—Dehlia", "Pete Campbell is having difficulty adjusting to married life and clashes with his wife over a wedding gift. Don Draper continues to secretly check on his wife's condition with her psychiatrist. Don invites Roger Sterling home for dinner and in a somewhat drunken state, makes a pass at Betty Draper. Don's reaction however is to blame Betty. The creative team at Sterling Cooper starts kicking around ideas for the Nixon Presidential campaign and Roger Sterling is convinced that Nixon is a shoe-in. Pete offers to help Peggy Olson with the copy she is writing for a new lipstick account. Betty has an unpleasant run-in with Helen Bishop at the supermarket.—garykmcd", "At the end of a Thursday working day, Roger is looking for a little fun as Joan is heading off for an early weekend with her roommate Carol. So Roger is able to convince Don to go out for drinks, which further leads to Don inviting him home for dinner with his family. Roger's presence makes it a difficult evening for Betty in more ways than one. Don's reaction to the evening is based partly on news he gets from Betty's psychiatrist, Dr. Wayne. Dr. Wayne's assessment is supported by an incident Betty later has with Helen at the supermarket. Pete returns a duplicate wedding present to the department store. Unable get anything else besides store credit, even using what he considers his easy-going charm, he decides to buy a toy for himself. Besides Pete, only one other person seems caught up in at least the fantasy of the toy. The executives talk about the upcoming election, who the probable candidates will be and how they can best convince the Nixon campaign to use them as their ad agency. And an extended lunch, an ulcer and a broken elevator lead to Roger making an auspicious entrance into a business meeting.—Huggo"], "genres": "N/A", "imdbID": "1050979", "rating": 8.1, "votes": 3629, "number_of_episodes": 92}