{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "0240043": "Anne Dudek", "0091136": "Katherine Boecher", "1555340": "Alison Brie", "0443856": "James Keane", "0608601": "Mark Moses", "0640382": "Joe O'Connor", "0789972": "Sheila Shaw", "0880820": "Andy Umberger", "0906184": "Gregory Wagrowski", "2007561": "Aaron Hart", "0479917": "Deborah Lacey", "3029139": "Lisa Grady", "1913933": "Ross Mackenzie", "2193020": "Mandy McMillian", "2215143": "Kiernan Shipka", "0812020": "Maura Soden", "0817990": "Jonathan Spencer", "2804947": "Marten Holden Weiner", "1408283": "Richard Willgrubs", "1262138": "Dawn Marie Anderson", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "1992334": "Emelle", "2761083": "Britt Hysen", "1724804": "Sarah Jannett Parish", "0694564": "Kate Powers", "1909642": "Jennifer Sims"}, "geners": ["Drama"], "runtimes": ["52"],  "plot": ["Don and Betty Draper have an argument when it becomes apparent that he doesn't want to spend Thanksgiving with her family and she plans on going only with the children. He also learns some information about his brother Adam. Pete Campbell confirms that he has landed an account from his father-in-law for a new skin care product called Clearasil. He objects however when Don gives the account to Peggy Olson, whom he has just promoted to junior copywriter. Peggy proves her mettle in auditions for the weight loss device but later is feeling unwell and goes to the hospital where she is given some shocking news. Don comes up with a brilliant presentation for Kodak on a new wheel-like storage device for a slide projector that he dubs The Carousel.—garykmcd", "It's Thanksgiving in a few days, but the family nature of the holidays will be difficult for many to achieve. Don refuses to join Betty and the children with her family for the holidays, he balking at the notion of the long drive and short time to spend there. Harry has been sleeping at the office following the rift with his girlfriend, Jennifer, the fight because of his sexual liaison with Hildy. Pete is feeling emasculated by his father-in-law, Vick's executive Tom Vogel, who wants Pete to focus on Trudy and starting a family instead of work, which is all he wants to focus on following losing out on the head of accounts job. After finally looking at the box sent to him by Adam, Don reaches out to Adam only to find out what happened to him. And Francine has what she considers proof that Carlton has been cheating on her. Francine turns to Betty for comfort and advice, implying that Betty must know through what she is going. It does make Betty think about her own situation. What Betty finds out, using Francine's play-book, is not quite what she expects. But it makes Betty take decisive action about her own situation, either consciously or subconsciously. Meanwhile, Duck Phillips has started work at Sterling Cooper. He sets a directive for the accounts executives to be aggressive in obtaining accounts, that aggressiveness which he himself demonstrates by getting a meeting with Kodak possibly for their account for their new slide projector. As the projector recreates the wheel, they want the creative to reflect that aspect. Pete takes Duck's talk to heart, but the outcome of Pete's action is not quite what he expects or wants. And Peggy gets two pieces of unexpected news, one which could threaten her meteoric rise at Sterling Cooper.—Huggo"], "genres": "N/A", "imdbID": "1105057", "rating": 9.0, "votes": 4309, "number_of_episodes": 92}