{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "0607666": "Robert Morse", "0191633": "John Cullum", "0805476": "John Slattery", "0051104": "Talia Balsam", "0240043": "Anne Dudek", "0187460": "Rebecca Creskoff", "1341364": "Aaron Hill", "0442066": "Adam Kaufman", "0615063": "Joel Murray", "0667350": "Jay Paulson", "0880820": "Andy Umberger", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "2416676": "Brian Norris", "0681549": "Mario Davis", "1581597": "Bess Rous", "2215143": "Kiernan Shipka", "1712596": "Dominic Paolo Testa", "2491005": "Candice Cunningham", "1992334": "Emelle", "1525039": "Monica Ford", "2761083": "Britt Hysen", "2654329": "Tim Mars", "1909642": "Jennifer Sims", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["46"],  "plot": ["Peggy is given the opportunity to write copy for a new weight loss device that everyone knows is useless. She finds an interesting use for it, however. Afraid of losing the Lucky Strike cigarette account, Bert Cooper gets Roger Sterling to come in for a one-hour meeting but he has another attack. Don Draper becomes a partner and takes over for his friend Roger, but some of the ad men are sharpening their resumes nonetheless. Pete Campbell wants a promotion but Draper doesn't seem too interested. Pete sneaks into Don's office and takes home a parcel sent by Adam addressed to Don that the mail room boy comes to deliver.—garykmcd", "It's been one month since Roger's heart attack, he who is still recuperating. This situation negatively affects Joan's outward emotions, and may negatively affect the one account with which Roger is intimately involved, one of Sterling Cooper's largest: Lucky Strike. Bert has a short term solution that may or may not work to appease Lee Garner, Sr.'s concerns. As a reciprocal favor, a competing ad firm has provided Sterling Cooper with a new account, for a new weight loss device with no proved research that it actually works or reliable testimonials. The creative team decides to give it to Peggy to work on, she unaware that they chose her for more reasons than the good work she did on Belle Jolie, or that it is a device targeted primarily at women. Peggy ends up having a different than publicly advertised effect from the device, which may pose a problem or provide an opportunity. In advancing her career, Peggy finds that she is caught between her known world of Brooklyn versus her emerging world of Manhattan. Roger and Peggy's situations in combination may affect staffing at the office, upon which Pete hopes he can ride the wave. Don and Rachel continue their affair, each trying to figure out what it means in their respective lives, while Betty fantasizes about an extramarital opportunity of her own based on the heat wave that has settled over New York, that heat wave despite it being October. And Adam makes one last overture to connect with Don, his biological brother.—Huggo"], "genres": "N/A", "imdbID": "1108366", "rating": 8.1, "votes": 3326, "number_of_episodes": 92}