{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "1679669": "Rosemarie DeWitt", "0607666": "Robert Morse", "0805476": "John Slattery", "0051104": "Talia Balsam", "0240043": "Anne Dudek", "1581670": "Darby Stanchfield", "0880820": "Andy Umberger", "1193110": "Mark Kelly", "2215143": "Kiernan Shipka", "2280163": "Maxwell Huckabee", "0689040": "Josiah Polhemus", "2804947": "Marten Holden Weiner", "0750142": "Bob Rumnock", "0367719": "Simon Harvey", "1239705": "Cecelia Antoinette", "0715377": "Darryl Alan Reed", "3884870": "Tatjana Bluchel", "4150324": "Elle Carpenter", "2897598": "Evelyn Edwards", "1724804": "Sarah Jannett Parish", "2618228": "Liz Pellini", "1909642": "Jennifer Sims", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Don continues to conceal his complicated personal life, even in the face of Roger's invitation to open up.", "Don Draper is reluctant to talk about his past, or his childhood, whether with his wife Betty or his boss Roger Sterling. Joan Holloway teaches Peggy Olsen how to wrangle a free lunch out of some of the ad men. Roger Sterling raises the issue of working for the upcoming Nixon presidential campaign and while Don doesn't have much enthusiasm, senior partner Bert Cooper insists that they will go ahead and orders Don to put a team together. The creative team has to come up with an ad campaign for a new deodorant in an aerosol spray can. Betty Draper's doctor recommends that she see a psychiatrist.—garykmcd", "During a dinner out between the Sterlings and the Drapers, Don is as usual evasive about his childhood, he believing that such talk is to make up for a deficiency in one's being. Betty, however, secretly does wonder about who Don was as a boy. The dinner also marks the another time Betty has felt some numbness in her fingers, which has some longer term ramifications. This issue brings up whether Betty is truly happy. Later, Betty learns through the local gossip mill of the scandalous news that a divorcée with two children is moving into the neighborhood. Away from home, Don learns more about Midge's life when he isn't around. She in turn sets ground rules for their relationship. Peggy is still navigating through life at Sterling Cooper, both financially and emotionally. With the former, Joan is able to assist at least in getting a free lunch for Peggy. With the latter, Peggy is still figuring out how to turn down the sexual advances from her male colleagues while not getting her into a bind at the office, and while secretly thinking about the one she probably can't have, namely Pete. With business, the creatives are working on the Right Guard campaign, focusing on the new delivery method of the product: the aerosol can. And Bert and Roger get Don to consider seriously about getting the Richard Nixon presidential campaign account.—Huggo"], "genres": "N/A", "imdbID": "1049715", "rating": 7.5, "votes": 4475, "number_of_episodes": 92}