{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "1745019": "Maggie Siff", "1679669": "Rosemarie DeWitt", "0805476": "John Slattery", "0008514": "Jim Abele", "0240043": "Anne Dudek", "1555340": "Alison Brie", "2502226": "Andy Hoff", "0667350": "Jay Paulson", "1820958": "Alexa Alemanni", "2280163": "Maxwell Huckabee", "2215143": "Kiernan Shipka", "3016518": "Claire Bocking", "2491005": "Candice Cunningham", "1992334": "Emelle", "0408427": "Elizabeth Ince", "2288594": "David Japka", "2284681": "Maura Murphy", "1724804": "Sarah Jannett Parish", "1909642": "Jennifer Sims", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["49"],  "plot": ["Don Draper is shaken when his past life comes back to haunt him. After his picture appears in a local newspaper, Adam Whitman, a man who claims to be his younger brother, approaches him. Don, or Dick as his brother knows him, initially denies everything but in the end admits to having taken on a new name. He refuses however to have anything to do with him and tries to buy his silence. When one of the ad men gets a short story published, Pete Campbell is frustrated that his own stories have yet to see the light of day. When his wife approaches an old beau to see if he will publish the stories, he has an interesting proposition for her.—garykmcd", "Don and Roger are in a featured newspaper article about an advertising award they won on the company's behalf. That publicity ends up being unwanted publicity for Don, as he receives a visit at the office from someone from his past who saw the story's accompanying photo, a past that not only does no one at the office know about, but that even Betty does not know about. While Don tries to figure out what to do about the situation - he ultimately doing the only thing he feels he can do about it - he in turn places Peggy in a precarious situation, that precariousness based largely on what Peggy mistakenly believes Don is doing at that specific moment. The product Don develops for one of Sterling Cooper's clients, Liberty National Bank, is a metaphor for what he would like for his life in light of this problem. Meanwhile, Ken is happy to show and tell everyone at the office that he has just had a short story published in the Atlantic Monthly. Although initially outwardly happy for him, most of the other junior executives are quietly or not so quietly jealous, which brings out the wannabe writer in many of them. That jealousy soon becomes more open, Ken who has an appropriate response. One of those wannabe writers is Pete, perhaps the most jealous if only because he and Ken have the same job, this story which has given Ken a perceived upper hand in their parallel climb up the corporate ladder. Pete asks Trudy for a favor in the matter. The favor is difficult enough for Trudy to oblige, but it's the follow-up which may be more problematic for their marriage in showing where their differing individual priorities lie.—Huggo"], "genres": "N/A", "imdbID": "1097127", "rating": 8.1, "votes": 3871, "number_of_episodes": 92}