{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "0608601": "Mark Moses", "0569927": "Melinda McGraw", "0279209": "Patrick Fischler", "0514228": "Peyton List", "0237711": "Sarah Drew", "0146941": "Patrick Cavanaugh", "1561547": "Melinda Page Hamilton", "0324134": "Adam Godley", "0930617": "Gareth Williams", "0650238": "Tom Ormeny", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "3095001": "Edin Gali", "3128726": "James Michael Lambert", "1372708": "Gregory Franklin", "0030992": "Reed Anthony", "3016518": "Claire Bocking", "1601335": "Eve Curtis", "3035582": "Jessica Doehle", "2897598": "Evelyn Edwards", "1992334": "Emelle", "1095191": "Molly Beck Ferguson", "2761083": "Britt Hysen", "1521895": "Jennifer McGraw", "2541493": "Leigh Myles"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["To show that he has \"arrived,\" Don buys a new car. Pete, Harry and Ken come up with a plan to attract new business, and Don's secretary makes a serious error, which could mean trouble for Joan. Cooper gets a new piece of office art that attracts the interest of the Sterling Cooper staff.—Anonymous", "Jane Siegel becomes the center of attention at Sterling Cooper. Her mystique among the accounts boys hits a new high when rumors float around the office of a new abstract painting in Bertram Cooper's office, and what it means. To find out, she leads a few of them in the office clandestinely to view it. The one non-fan of Jane's is Joan. An altercation ensues between the two. Jane manages to wrangle others to her side, most importantly Roger Sterling, but she is now aware that she has to keep her eye on how Joan may get the upper hand in their relationship. On the accounts front, Don and Duck work together to get the Martinson's coffee account, and they go with Duck's idea of hiring the younger talents of Smith and Smith to work on the pitch. As a result, Don reaps the benefits as Cooper and Sterling's choice as the philanthropic face of the company, which includes a new public persona associated with Don's new Cadillac Coup de Ville. Shopping for the car makes Don reminisce about his previous life as a car salesman and again being exposed on not being the real Don Draper. Salvatore has a new crush, that being Ken. Salvatore invites Ken to dinner on the guise of reading his new short story. Salvatore's wife Kitty notices her husband's doting on Ken, but does not understand its full meaning. And Jimmy Barrett extends a personal invitation to the Draper's through Betty to a industry shindig to celebrate the pick-up of Jimmy's new television show, Grin and Barrett. Jimmy implies to both the Draper's individually that he knows of Don's indiscretions with Bobbie.—Huggo", "Don is encouraged by Roger Sterling to buy a flashy new car and he has his eye on a Cadillac Coupe de Ville. When Harry announces that he has a private meeting with Bert Cooper the next day, the staff speculates that it's probably to discuss his new, avant-garde painting. Don's new secretary, Jane, suggests they check it out. When Joan hears of it, she takes decisive action over what she sees as a major transgression but Jane has her own plan. When Ken asks Sal to read a new short story, Sal invites him to Sunday dinner. It's pretty obvious that he has more than just a passing interest in Ken. Don and Betty attend a party at the Stork Club hosted by comedian Jimmy Barrett where he tells Betty of his wife's affair with Don.—garykmcd"], "genres": "N/A", "imdbID": "1118061", "rating": 8.4, "votes": 2981, "number_of_episodes": 92}