{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0608601": "Mark Moses", "0615063": "Joel Murray", "0569927": "Melinda McGraw", "0542759": "Gabriel Mann", "1556400": "Crista Flanagan", "0444539": "Paul Keeley", "0716438": "Laura Regan", "0944886": "Missy Yager", "0279209": "Patrick Fischler", "0269542": "Nat Faxon", "0822878": "Steve Stapenhorst", "0387431": "Jan Hoag", "0000344": "Denise Crosby", "2110814": "Cameron Goodman", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "2416676": "Brian Norris", "0930960": "John Douglas Williams", "0074468": "Philippe Bergeron", "1307792": "David Zelina", "2635230": "Eric Scott Cooper", "1262138": "Dawn Marie Anderson", "3016518": "Claire Bocking", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "3035582": "Jessica Doehle", "2897598": "Evelyn Edwards", "1992334": "Emelle", "1095191": "Molly Beck Ferguson", "2761083": "Britt Hysen", "2939878": "Christopher Jude", "1521895": "Jennifer McGraw", "0668110": "Collin Wilcox Paxton", "1696816": "Michelle Thorson", "0927043": "Kathleen Widdoes"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Trouble rises on the set of a commercial while Don plays hooky from the office.", "Harry tries to gather support around a controversial sponsorship in order to bolster his career. When Don ditches work for a day, trouble brews on the set of a commercial. Later, Betty joins her husband when he attempts to placate his clients with an amicable dinner.—Anonymous", "While Don plays hooky from work, a disaster happens on the set of a commercial for Utz Nuts when a verbal altercation occurs between the temperamental and drunk star of the commercial, comedian Jimmy Barrett, and Edith Schilling, one half of the husband-wife owners of Utz. Don uses Lois as a scapegoat for the problem. He tries to rectify the situation by talking to Barrett's \"people\", namely his manager wife, Bobbie. Bobbie is as strong willed as Jimmy is arrogant. As Bobbie and Don get to know each other better, both play hardball in their negotiations. Harry discovers some inside office information he wish he hadn't, both in that he doesn't like the information and can't hide how he found out. This information threatens his future at Sterling Cooper. However in researching his options including looking for work elsewhere, he stumbles across a possible opportunity for Sterling Cooper. This move puts him in the company's good books, but in the end, Harry doesn't get everything that he wants. Betty finally gets to know more about Arthur Case, her mysterious riding partner, including meeting his fiancée, Tara. Arthur thinks that he has Betty all figured out. Although he is fairly accurate in his assessment, Betty denies all.—Huggo", "All hell breaks loose during the filming of a commercial when comic Jimmy Barrett turns his venom on the product sponsor's wife and they walk off the set. There's much finger-pointing back at the office but it's left up to Don Draper, who was playing hooky at the time and should have been at the shoot, to patch things up. Harry Crane gets a look at Ken Cosgrove's paycheck and realizes that Ken makes 50% more than he does. He decides to take action and suggests that one of their customers sponsor a TV episode with a particularly shocking topic. Betty Draper finds herself rejecting the advances of the young man she has been admiring at the riding stables.—garykmcd"], "genres": "N/A", "imdbID": "1118057", "rating": 7.8, "votes": 2974, "number_of_episodes": 92}