{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0608601": "Mark Moses", "0004988": "Colin Hanks", "0051104": "Talia Balsam", "0656335": "Sam Page", "0913585": "Audrey Wasilewski", "0571578": "Matt McKenzie", "0484541": "Amy Landecker", "0614887": "Christopher Murray", "0752708": "Marty Ryan", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "0479917": "Deborah Lacey", "0930960": "John Douglas Williams", "1508677": "Cathrine Grace", "2355300": "Jonathan Runyon", "0600452": "Caleb Moody", "0567499": "Carolyn McDermott", "1265899": "Chet Grissom", "3149393": "Dana Blackstone", "3016518": "Claire Bocking", "1483927": "La Monde Byrd", "2491005": "Candice Cunningham", "3035582": "Jessica Doehle", "1992334": "Emelle", "1095191": "Molly Beck Ferguson", "0279209": "Patrick Fischler", "1521895": "Jennifer McGraw", "1617837": "Julie McNiven", "2618228": "Liz Pellini", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Betty becomes suspicious that Don is having an affair after her conversation with Jimmy Barrett, Joan helps out in the television department, and Peggy helps the church with a dance flyer.", "For the Heineken beer account, Don and Duck think that targeting upper class suburban housewives is the approach to take. True to their thoughts, Betty even ends up buying Heineken for a small company dinner party. When an inside joke is made at the party about her buying Heineken, Betty uses this situation to later confront Don with her knowledge of his affair with Bobbie Barrett. Don denies everything, although Betty deep in her heart knows the truth. She searches for conclusive evidence of the affair, without luck. But Betty makes a short term decision about their marriage. With other work goings-on, Harry is chastised for a faux pas regarding airing a Maytag commercial on a television movie Maytag deemed unsuitable. Harry, working alone, pleads for extra help for the fledgling television department. Roger denies his request but does allow Harry to co-opt someone from the secretarial staff to assist in at least reading scripts. Thinking it sound interesting, Joan volunteers. She enjoys this new job and is good at it, as the Maytag folks are pleased with the new direction of their account. Despite what seems to be a new direction for her at Sterling Cooper, Joan quietly and sadly accepts the news that her tenure in the position is short-lived. Another account, albeit a pro bono one is for Peggy's church. Father Gill wants Peggy's help in developing a campaign for an upcoming youth dance. Peggy treats this task as she would any account, speaking bluntly to Father Gill about what she think right and wrong. On the flip side, Father Gill uses this situation to question Peggy about her life.—Huggo", "After an advertiser refuses to pay when their ads are badly placed during a television episode, Harry Crane feels the pressure to do more but he's refused any additional staff. He needs someone to read the scripts and get the best placements for their clients. Joan offers to help out and not only enjoys the work but proves to be quite good at it. Father Gill is concerned at Peggy Olson's lack of participation in church activities so he asks her to help him out on a project. Don's ideas for the Heineken beer account doesn't go down well at home when Betty, whose behavior borders on the bizarre, learns that he has been touting her as their market target.—garykmcd"], "genres": "N/A", "imdbID": "1118062", "rating": 8.3, "votes": 2925, "number_of_episodes": 92}