{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "1555340": "Alison Brie", "1561547": "Melinda Page Hamilton", "0656335": "Sam Page", "0944886": "Missy Yager", "0640382": "Joe O'Connor", "0470182": "Brian Krause", "1168813": "Josh Braaten", "0566911": "Mary Anne McGarry", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "0918207": "Charles Weiner", "0674664": "Gregg Perrie", "2090998": "Collin Christopher", "1262138": "Dawn Marie Anderson", "3016518": "Claire Bocking", "1601335": "Eve Curtis", "1992334": "Emelle", "2177627": "Chandler Hill", "1521895": "Jennifer McGraw", "4734166": "Brandon Tate Rosen", "1482750": "Alexander von Roon"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don drops off the Sterling Cooper radar and visits the wife of the man whose identity he stole. Back at the office, Bert and Roger consider the merger offer, Peggy makes a play for a real office, and Peter loses his father-in-law's account.", "No one at Sterling Cooper knows where Don is. Since he abandoned Pete in Los Angeles, he has been missing. In fact, he is still in California visiting with his old friend, Anna Draper, the widow of the real Don Draper. The two came to an understanding years earlier where Don has been her financier and confidante. Don is contemplating remaining in California for good, resuming a life now known as Dick Whitman. Back in New York, the partners, including Bertram's sister Alice and without Don, are reviewing the merger with Putnam, Powell & Lowe and make their decision in Don's absence. Things are not going well personally or by association professionally for Pete. He and Trudy are still arguing over the possibility of adopting. Because of the magnitude of their argument, Trudy tells her father Tom of the issue, he who gives Pete an ultimatum: make Trudy happy by giving her what she wants, or he'll pull the Clearasil account from Sterling Cooper. Pete is decisive in his decision. Peggy's fortunes at the office are better. Almost single-handedly, she gets the Popsicle account for the company. And she is the only one who is forthright enough to ask Roger for Fred Rumsen's vacant office. Joan's life outwardly seems to be extremely happy now that she's engaged to Dr. Greg Harris, but their relationship is not unlike the bunch of roses he gave to her: fragrant and sweet at some times, with thorns under the surface. Betty is still trying to deal with life without Don. She decides to tell Sally about her and Don's marital troubles. And she and Sarah Beth argue over Arthur and Tara's impending marriage.—Huggo", "Don Draper is still awol from work and visits someone from his past. In flashbacks, her identity and relation to the real Don Draper is revealed. Don loves the lifestyle he finds there and begins to re-assess what he wants in life. Back in New York, Peggy Olson nails the Popsicle account on her own and then asks Roger Sterling for Fred Rumsen's old office. Pete Campbell hits the roof when his wife goes ahead and makes an appointment for them to visit an adoption agency. He adamantly refuses to go and his father-in-law subsequently decides to pull the Clearasil account. Joan Holloway's fiancé picks her up at the office but she doesn't know what to do when he forces her to have sex in Don's office. The Sterling Cooper partners - minus Don Draper - meet to decide on the merger offer they've received. Betty Draper decides to tell her daughter that she and Don are having problems.—garykmcd"], "genres": "N/A", "imdbID": "1118054", "rating": 8.5, "votes": 2983, "number_of_episodes": 92}