{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "0608601": "Mark Moses", "0004988": "Colin Hanks", "0240043": "Anne Dudek", "0574131": "Ryan McPartlin", "1555340": "Alison Brie", "0877252": "Myra Turley", "1556400": "Crista Flanagan", "0789478": "Charles Shaughnessy", "0234606": "David Doty", "0498536": "Beverly Leech", "0864121": "Patti Tippo", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "0479917": "Deborah Lacey", "2980728": "Brandon Hayes", "0742886": "Joe Roseto", "0448123": "John F. Kennedy", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "2605619": "Stephanie Ann Davies", "2897598": "Evelyn Edwards", "1992334": "Emelle", "1922509": "Alisha Gaddis", "1521895": "Jennifer McGraw"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Under the backdrop of the Cuban Missile Crisis, Don returns to New York just as Betty finds out that she is pregnant. Meanwhile, everybody at Sterling Cooper contemplates their futures as news of the merger slowly leaks out.", "The Cuban Missile Crisis is preoccupying the minds of Americans. Nuclear war is a very real possibility and as such, many are thinking about where and with whom they would want to die. Trudy wants to be with her parents, whereas Pete wants to stay in Manhattan. Father John uses the crisis as a basis for one of his sermons and also ties in with it a private conversation with Peggy about her life. Betty learns that she's pregnant and because of the state of the world and her family, she's not sure she wants to keep the baby. Coinciding with this news is Don's return back to New York, he who wants to resume his life as it was, both personally and professionally. Don's return does not alter Betty's feelings, but a night alone on the town while Don has the children gives Betty the opportunity to figure out what she wants and needs to do. At Sterling Cooper, Don is surprised by the news of the merger, whereas the accounts and creatives executives are wondering about what's going on, most thinking that Don is opening a west coast branch office. For a price, Lois, who has been working at the switchboard since being fired as Don's secretary, uses her position to broker what she thinks is a deal for herself in the new Sterling Cooper. And Duck brings Pete into his confidence about being the new President of the company and wanting Pete to fill his old position. Pete uses this information to what he thinks his best advantage. Duck is anticipating that the new management structure will either bring Don in line under his thinking or will send Don packing into another line of work altogether. The restructuring meeting does not go according to Duck's plans. And Peggy and Pete have a heart to heart about their professional and personal lives.—Huggo", "Everyone is on edge wondering what tomorrow may bring when President Kennedy announces on national television that the Soviets are stationing ballistic missiles in Cuba. Don returns to New York but Betty still won't have anything to do with him. She also gets some interesting news from her doctor and decides to have a fling of her own. At the office, Roger Sterling tells him of the upcoming merger. The staff also learn through their own sources that they are about to be taken over and worry about their futures. Duck Phillips takes Pete Campbell into his confidence and tells him that he will be President of the new Sterling Cooper and that Pete will be the head of accounts. Pete decides to play both sides and tells Don what is really going on. With his marriage on the rocks, Pete opens his heart to Peggy Olson but she tells him of her pregnancy and what happened to their baby.—garykmcd"], "genres": "N/A", "imdbID": "1118055", "rating": 8.9, "votes": 3256, "number_of_episodes": 92}