{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "0608601": "Mark Moses", "0615063": "Joel Murray", "0240043": "Anne Dudek", "1119340": "Kristoffer Polaha", "1555340": "Alison Brie", "0913585": "Audrey Wasilewski", "1556400": "Crista Flanagan", "0877252": "Myra Turley", "0237711": "Sarah Drew", "0716438": "Laura Regan", "0726164": "Matt Riedy", "0153712": "Channing Chase", "0404475": "Rich Hutchman", "1483273": "John Patrick Jordan", "0035932": "Vaughn Armstrong", "0004405": "Jerry O'Donnell", "0140768": "Christopher Carroll", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "1724804": "Sarah Jannett Parish", "2335338": "Andrew Astor", "0037702": "Donielle Artese", "3017040": "Miranda Lilley", "1169332": "Maurice Patton", "0875025": "Malana Lea", "2842997": "Alicia Baker", "3016518": "Claire Bocking", "1601335": "Eve Curtis", "3118295": "Katie Marie Davies", "3174163": "Matthew Corbett Davis", "3035582": "Jessica Doehle", "1095191": "Molly Beck Ferguson", "2761083": "Britt Hysen", "2860854": "Mark Langston", "1521895": "Jennifer McGraw", "2541493": "Leigh Myles", "2809337": "Alexis Stier"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["A plane crash causes the firm to go after the account for the airline involved and drop the smaller airline they have an account with. Peggy pays a visit to her mother and sister, who are now guardians of a child.", "A conflict of interest does not deter the Sterling Cooper agency from aggressively pursuing an airline account. Also, Paul introduces his special somebody to his Sterling Cooper colleagues when he throws a party at his place, and Peggy has dinner with her family.—Anonymous", "The crash of American Airlines Flight 1 on March 1, 1962 leads to friction at the office. Duck Phillips immediately contacts the airline and gets signals that they might be looking for a new agency to re-build their image. Don Draper thinks the whole thing is nonsense and argues against giving up the Mohawk Airlines account just to sit down with AA. He's overruled however and Roger Sterling orders him to deliver the bad news to Mohawk. Pete Campbell learns that his father was on that aircraft and decides to use this information to raise his profile at the agency. He also learns that his father died penniless and that he may have also spent a good part of his mother's trust fund. Peggy pays a visit to her mother and sister, who are now guardians of a child. Paul Kinsey throws a party at his New Jersey apartment and introduces his girlfriend to his friends. The next day, Joan Holloway tells him exactly why she thinks he's adopting this more bohemian lifestyle.—garykmcd", "On March 1, 1962, American Airlines flight #1 crashes in Jamaica Bay killing ninety-five on board. This incident places a general pall over New York. On the professional front at Sterling Cooper, the immediate issue is the ads they've produced for rival airline, Mohawk, and the public sensitivities required regarding airlines and flying in general. But an opportunistic Duck learns through one of his old contacts at American, almost immediately following the crash, that American may want to change advertising agencies to re-brand the airline to get the public mindset away from the crash. In pursuing that account, Sterling Cooper would have to drop the Mohawk Airlines account due to a conflict of interest. Duck is supported by both Bertram and Roger on this move, but Don think it crass and unloyal, especially for just a shot at the American account. On a more personal issue, Pete learns that his father was on that flight. He is having trouble mourning the passing of his father. What's more, Pete learns through his brother, Bud, in dealing with the estate that his father squandered all the family's money - including some of his mother's trust fund - on a lavish lifestyle leaving the family estate worthless. Back at the office, Duck tries to convince Pete that he should be one of the major faces in the presentation to American due to his family tragedy. Although both Duck and Pete realize the request is insensitive and opportunistic, Pete does not say no. On other issues outside the office, Peggy pays a visit to her mother and sister, who are now guardians of a child. Paul, living an artist's lifestyle in New Jersey, throws a party with his Sterling Cooper colleagues in attendance. The party is in part to introduce his new girlfriend Sheila, who happens to be black, to his friends. About his lifestyle including dating outside his race, Joan accuses Paul of wanting to appear more liberal in his attitude than he actually is. And an unknown someone uses the office photocopying machine on a gag at Joan's expense.—Huggo"], "genres": "N/A", "imdbID": "1118056", "rating": 7.9, "votes": 3023, "number_of_episodes": 92}