{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "1555340": "Alison Brie", "1581670": "Darby Stanchfield", "1426686": "Eric Ladin", "0404475": "Rich Hutchman", "0193982": "Ryan Cutrona", "1172273": "Megan Henning", "0153712": "Channing Chase", "0942193": "Aloma Wright", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "0479917": "Deborah Lacey", "2804947": "Marten Holden Weiner", "0790388": "Darcy Shean", "0037702": "Donielle Artese", "1483927": "La Monde Byrd", "1820958": "Alexa Alemanni", "2897598": "Evelyn Edwards", "1992334": "Emelle", "2761083": "Britt Hysen", "1521895": "Jennifer McGraw", "0608601": "Mark Moses", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don and Betty try to keep up appearances as they go to Betty's parents after her dad has a stroke. Peter has a long-dreaded meeting with his mother before he and Kinsey leave for a convention in Los Angeles.", "The talk around the office is the business trip that Pete and Paul are going on to Los Angeles to a aeronautics convention in the hopes of gaining contracts from the emerging aerospace industry. For Paul, this trip is a good excuse not to accompany Sheila to Mississippi where she hoped he would assist her in a civil rights campaign. Family fronts are not going as well. Pete and Trudy are still arguing about their lack of progeny, Trudy wants to adopt. With the other generation, Pete is finding it difficult to relate to his mother, who still is not aware of her new poor financial situation. With the Drapers, Betty's father, Gene, has suffered a mild stroke which brings Don and Betty temporarily back together as Betty needs Don's support in visiting with her family. Although the Hofstadt family outwardly does not want to discuss the seriousness of the situation, it looks like Gene is in the early stages of Alzheimer's. Back home, away from Gene and Gloria's, Betty still does not allow Don back into the family home. To preoccupy himself, Don decides to take Paul's place on the trip to Los Angeles, much to Paul's dismay who can now go with Sheila to Mississippi. Back at the Draper household, Betty, alone, finds that Glen Bishop has run away and has been hiding in her backyard. Besides having problems at home, Glen wants to be Betty's knight in shining armor. Although still not on speaking terms with Glen's mother Helen, Betty calls Helen to pick up Glen, and ends up confiding to Helen about her own personal situation with Don.—Huggo", "Betty Draper's father, Gene Hofstadt, has a stroke and she and Don visit. There's still a cold chill between her and Don, as there is in the Hofstadt household where tensions arise between Betty and her stepmother. Her father's confused state is particularly upsetting to her. Pete Campbell's brother tells him of the sorry state of their late father's finances. Campbell and Paul Kinsey are also headed to California to see what business they can drum up in the aerospace industry. This creates particular problems for Kinsey who was supposed to go on a voter registration drive with his girlfriend. The staff have a party for Harry Crane who is about to become a father. Bert Cooper makes an impromptu appearance. Still banned from the family home, Don decides to go to California himself. Glen Bishop runs away from home and Betty finds him in her garden shed.—garykmcd"], "genres": "N/A", "imdbID": "1118052", "rating": 7.9, "votes": 2793, "number_of_episodes": 92}