{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0608601": "Mark Moses", "0615063": "Joel Murray", "0542759": "Gabriel Mann", "0240043": "Anne Dudek", "1555340": "Alison Brie", "0944886": "Missy Yager", "0146941": "Patrick Cavanaugh", "0000344": "Denise Crosby", "1556400": "Crista Flanagan", "0222336": "Seamus Dever", "2509902": "Scott MacArthur", "0237711": "Sarah Drew", "1308076": "Jennifer Siebel Newsom", "1042741": "Gerald Downey", "0100762": "David Bowe", "0856856": "John Thaddeus", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "1193110": "Mark Kelly", "0479917": "Deborah Lacey", "1556232": "Michael Christian Alexander", "3095001": "Edin Gali", "2281884": "Jeff Grace", "0584461": "Norma Michaels", "0636839": "Frank Novak", "1443788": "Tess Parker", "2842997": "Alicia Baker", "3149393": "Dana Blackstone", "2909963": "Bill Blair", "3016518": "Claire Bocking", "1601335": "Eve Curtis", "0210885": "Vincent De Paul", "3035582": "Jessica Doehle", "1992334": "Emelle", "1095191": "Molly Beck Ferguson", "0448080": "Jacqueline Kennedy Onassis", "1724804": "Sarah Jannett Parish", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["On Valentine's Day, the staff of the Sterling Cooper Advertising Agency is hustling and checking out the newest office equipment. Don and Duck clash over an account, and Betty hears from an old friend.", "It's Valentine's Day 1962, approximately 15 months since we last saw these cast of characters. On personal fronts, Don and Betty seem to have settled into an agreement of sorts that Don will try to be a better husband and father. Although Don makes a romantic gesture for Valentine's - dinner and a hotel stay at the Savoy Hotel - both Betty and Don realize there are still unspoken problems in their marriage. Joan and Roger have cooled off their romance, with Joan now actively dating. Pete and Trudy have worked out their early problems to now have what seems to be a supportive marriage, although the one stress in their lives is that they have not yet conceived a baby. And after an undisclosed leave of absence, Peggy has returned to her copy writers job at Sterling Cooper. There is much speculation among the men at the office as to Peggy's obvious weight loss, some speculating - correctly - that she had a baby, but wrong in that it is Don's (what else could explain Peggy's meteoric rise on the corporate ladder?), others thinking she went to a fat farm during her leave. On the work front, Duck is wanting a younger staff to provide the perception that Sterling Cooper is a hip, modern company with hip, modern ideas, this against Don's view of what is good for the company. Under this overriding directive, Salvatore and Peggy are working on the Mohawk Airline account. And the clerical staff is gawking over the newest office acquisition: a photocopying machine. The problem is it's size and where to put it.—Huggo", "It's Valentine's Day 1962 and the men and women of Sterling Cooper may be facing changes. Duck Phillips, in charge of accounts, feels that the creative team needs younger people and as word gets around that Don Draper is interviewing people, worries set in. The team is also having trouble with creating a new campaign for Mohawk Airlines but Peggy Olson seems to be ahead of the rest. The office receives its first Xerox machine and Joan isn't quite sure where to put it. Harry Crane's wife is pregnant and Pete Campbell's wife is unhappy that they have not yet had a baby. Don's romantic Valentine's evening with wife Betty doesn't quite end as planned. Betty is also shocked to learn that her former roommate is now a call girl. Don is told by his doctor he is getting older and that his drinking and smoking is not good for him.—garykmcd"], "genres": "N/A", "imdbID": "1118051", "rating": 7.6, "votes": 3128, "number_of_episodes": 92}