{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0615063": "Joel Murray", "1745019": "Maggie Siff", "0569927": "Melinda McGraw", "1555340": "Alison Brie", "0279209": "Patrick Fischler", "0877252": "Myra Turley", "0913585": "Audrey Wasilewski", "0315288": "John Getz", "0514228": "Peyton List", "0533155": "Donald Sage Mackay", "1695198": "Nick Toren", "1553640": "Jack Impellizzeri", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "2071294": "Jennifer Dawson", "1931672": "Randolph Adams", "3016518": "Claire Bocking", "1601335": "Eve Curtis", "3035582": "Jessica Doehle", "2897598": "Evelyn Edwards", "1992334": "Emelle", "1095191": "Molly Beck Ferguson", "1667140": "Gill Garci", "2765532": "Arlo Hemphill", "2761083": "Britt Hysen", "3010041": "Alina Kaufman", "1521895": "Jennifer McGraw", "2541493": "Leigh Myles", "3864686": "Elin Rose"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Joan finds Don the perfect secretary, and Don finds himself in the middle of issues between TV comedian Jimmy and his wife, Bobbie.", "Pete and Trudy visit a doctor to discuss their problems conceiving a child. Pete deals insensitively with the resulting news. Bobbie continues her personal pursuit of Don. After a drunken evening with Bobbie (in which they run into a now married Rachel Menken), Don, driving Bobbie home, gets into a traffic accident. He fails the breathalyser test and calls the only person he can think of who can bail him out of this predicament and will protect this secret for him. Through flashbacks, we learn why Don chose this person as his confidante. Although Don walks into the office the following day with his arm in a sling, he is paid little attention due to the arrival of Don's attractive new secretary, Jane Siegel, and an engagement ring on Joan's finger. Despite falling under the radar of doing anything wrong with Bobbie, Don dreads an urgent meeting called by Jimmy Barrett. And Peggy receives some career advice from an unexpected source.—Huggo", "Don Draper accepts Bobbie Barrett's invitation for a drink to celebrate the fact that she has sold a pilot for her new TV show. While there he runs into Rachel Mencken, who is now married. After a few drinks they decide to go off to her beach house on Long Island only to have a serious car accident on the way. Don, who was driving, fails the sobriety test and has to call Peggy Olson to help him out when he doesn't have enough cash to pay the fine. Peggy also lets Bobbie stay at her apartment as she doesn't want to have to explain her black eye to her husband. She gives Peggy some advice on how to get ahead at the office. Joan hires a new secretary for Don and the men are all quite interested. We learn through flashbacks that Don visited Peggy in the hospital after she gave birth. Pete Campbell is thrilled when medical tests confirm that his wife's inability to get pregnant isn't down to him.—garykmcd"], "genres": "N/A", "imdbID": "1118059", "rating": 8.3, "votes": 3028, "number_of_episodes": 92}