{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0608601": "Mark Moses", "0615063": "Joel Murray", "0051104": "Talia Balsam", "0542759": "Gabriel Mann", "0279209": "Patrick Fischler", "0514228": "Peyton List", "0944886": "Missy Yager", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1617837": "Julie McNiven", "0479917": "Deborah Lacey", "1483927": "La Monde Byrd", "0874751": "Angelo Tsarouchas", "1376366": "Joeanna Sayler", "1449868": "Freedom Bridgewater", "3016518": "Claire Bocking", "2897598": "Evelyn Edwards", "4190995": "Lynly Ehrlich", "1992334": "Emelle", "2734923": "Gregory George Frank", "1958815": "Kater Gordon", "1521895": "Jennifer McGraw", "0600452": "Caleb Moody", "4264005": "Jayde Rossi", "0006649": "John H. Tobin"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don checks in to a hotel after his separation from Betty. Back at the office, he is forced to get rid of Freddy against his will because of his drinking problem.", "Marilyn Monroe has just passed away, and Joan and many of the women in the office are feeling the loss of a person with who they could identify. Betty and Don are still on bad terms with each other, and don't have all the answers in how to deal with their situation publicly. The ball is basically in Betty's court on the next step. She takes some solace in her horseback riding in the company of Arthur Case, but privately she is still not taking her problems with Don very well. Don finally confides at least to Roger and Jane about the fact that he is no longer at home, the information which creates some unexpected issues with others. On other office fronts, Freddy embarrasses himself just before a presentation to clients, this embarrassment a manifestation of over-drinking. He is lucky that this embarrassment did not happen in front of the clients. Because of this issue, Roger and Duck feel that Freddy should take an extended leave of absence, effectively meaning that he should be fired. Freddy understands the implications of his forced leave. However, before Freddy is gone for good, Roger and Don treat him to one last night on the town. Someone in the office is promoted to Freddy's job, the person happy about the promotion but not the reasons for it.—Huggo", "At Betty's insistence, Don moves out and is living in a hotel temporarily. Betty is depressed to the point that she cannot even dress in the morning and is drinking far too much. Fred Rumsen's heavy drinking finally catches up with him when he embarrasses himself during a team meeting in his office and eventually passes out just before an important meeting with a client. Peggy Olson saves the day but Pete Campbell reports Rumsen's drunkenness and Roger Sterling decides the man has to go. He and Don take Fred out for dinner to break him the news that he has six months off with pay, but he knows he will never again work at Sterling Cooper. During a long night out, Roger takes Don's advice a little too seriously and Don finds himself accused of breaking up the Sterlings' marriage.—garykmcd"], "genres": "N/A", "imdbID": "1118063", "rating": 8.5, "votes": 2974, "number_of_episodes": 92}