{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "0608601": "Mark Moses", "0004988": "Colin Hanks", "0569927": "Melinda McGraw", "0051104": "Talia Balsam", "0877252": "Myra Turley", "0913585": "Audrey Wasilewski", "0723415": "Elizabeth Rice", "0603413": "Marguerite Moreau", "0218749": "Michael Dempsey", "0004405": "Jerry O'Donnell", "0140768": "Christopher Carroll", "2215143": "Kiernan Shipka", "2007561": "Aaron Hart", "1508677": "Cathrine Grace", "1484231": "Derek Ray", "1349934": "Julia Carpenter", "2335338": "Andrew Astor", "1262138": "Dawn Marie Anderson", "3102854": "Joshua Andreacola", "3016518": "Claire Bocking", "1601335": "Eve Curtis", "1984771": "Dianne Curwick", "1992334": "Emelle", "2761083": "Britt Hysen", "1521895": "Jennifer McGraw", "3240106": "Jakob Salvati", "2817105": "Joshua Salvati", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Freddy and Ken take a client out to lunch who stirs Roger Sterling's heart.", "A last minute pitch meeting has Sterling Cooper staffers working double time in preparation. Peggy's family hosts lunch for their church's new priest, and Don and Betty have a family weekend together. Also, Roger Sterling is smitten with a \"date\" that Pete and Ken provide to a client for a business lunch.—Anonymous", "Don Draper and much of the staff spend a Sunday at the office when they learn that American Airlines has moved up the date for the presentation. Don and his creative team deliver the goods on time only to learn that Duck Phillips principal contact at AA was fired the morning of the presentation likely meaning that they are sunk. Roger Sterling arranges for a meeting with a prostitute. At home, Betty Draper is fed up at what she sees as Don's lax attitude toward disciplining the children, especially their son Bobby, who seems to be having a spate of minor accidents. Peggy Olson takes a liking to a new parish priest and even gives him some advice for his forthcoming Palm Sunday sermon. Her sister however is having difficulty with Peggy's successful career and apparently happy private life. Bobbie Barrett visits Don at the office, without an appointment, to pitch her idea for a new TV show. That isn't all that she is after.—garykmcd", "There seems to be familial bliss in the Draper household, especially between Don and Betty. However Bobby is acting out, which leads to a major disagreement between his parents on the issue of discipline. This disagreement places a strain on their bliss, but this change is made all the more clear when Don confesses to Betty for the first time the nature of his own abused childhood. A family that seems to be experiencing even less bliss, specifically below the surface, is Peggy's. Father Gill is a visiting new minister at Katherine's church, one who pays particular attention to Peggy. But a tearful Anita goes to confession and speaks to Father Gill about her frustrations with Peggy regarding Peggy's life, including she having a bastard child. Father Gill indicates to Peggy that he at least knows about the child, which may place walls between Peggy and the Father and Anita. Frustrations are also emerging at Sterling Cooper when staff is called into the office on Palm Sunday for an emergency work session to develop materials for the American Airlines pitch later that week. Don's daughter Sally has to accompany her father that day and adds a bit of spice to the day for some of the staff, especially Joan and Paul. Duck has some devastating news for the hard working staff just prior to the meeting with the American Airlines representatives. Although present at the American Airlines pitch, Roger was inconspicuously absent from the working session, as he is back to his womanizing ways, this time with one of Ken's \"paid\" girls by the name of Vicky. And Bobbie Barrett pays Don a surprise visit. She uses the guise of pitching a television series for Jimmy for her visit, but in reality her visit was primarily to seduce Don.—Huggo"], "genres": "N/A", "imdbID": "1118058", "rating": 8.1, "votes": 2973, "number_of_episodes": 92}