{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0608601": "Mark Moses", "0615063": "Joel Murray", "0569927": "Melinda McGraw", "0542759": "Gabriel Mann", "1555340": "Alison Brie", "0514228": "Peyton List", "0404475": "Rich Hutchman", "0571578": "Matt McKenzie", "0787283": "Edmund L. Shaff", "0419273": "Peter Jason", "0000575": "Alexandra Paul", "1279065": "Gina DeVivo", "2215143": "Kiernan Shipka", "0942792": "Sarah Wright", "2007561": "Aaron Hart", "1349934": "Julia Carpenter", "3017040": "Miranda Lilley", "1898292": "Kim Swennen", "0376944": "Jesse Henecke", "2548854": "Greg Felden", "1452242": "Jonathan Strait", "2580734": "Benjamin Seay", "1009333": "Darian Weiss", "1262138": "Dawn Marie Anderson", "3149393": "Dana Blackstone", "3016518": "Claire Bocking", "2852429": "Jenni Cardone", "3570593": "Chris Chamberlain", "1601335": "Eve Curtis", "3035582": "Jessica Doehle", "2897598": "Evelyn Edwards", "1992334": "Emelle", "1095191": "Molly Beck Ferguson", "2761083": "Britt Hysen", "1521895": "Jennifer McGraw", "2541493": "Leigh Myles", "1724804": "Sarah Jannett Parish", "1914981": "Arne Starr", "1865618": "Andrea VanEpps", "1273445": "Rima Yazbeck"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don and Duck try to bury the hatchet, and Peggy attempts to join in on the execs' after-hours meetings. Also, Duck receives a family visit at the office.", "Duck is facing pressures both at home and at work. On a Memorial Day holiday visit from his children, he learns that his ex-wife is planning on remarrying. At the office, he is still smarting from the loss of the American Airlines account, from which much tension still exists between himself and Don. Roger orders a truce between the two, who comply. More work stress is added on Duck's plate when one of Sterling Cooper's largest clients, Playtex, who has been happy with their advertising thus far, have of late aspired to the edgier advertising of their competitor, Maidenform. Ultimately, the stress for Duck becomes too much, Duck's dog Chauncy taking the initial hit. With the Playtex account, Peggy has been shut out by \"the boys\" in providing any meaningful input and even asks for advice from Joan on how to infiltrate the boys' network. But working on the account for Clearasil, the client of who is Pete's father-in-law, Peggy does develop a new concept that plays well at least informally with Pete and his father-in-law. On personal fronts, Betty has been avoiding Arthur at the riding stable, but Arthur eases Betty's mind about any future advances. Pete relieves some of his sexual frustrations with a model auditioning for the Playtex account. And Don and Bobbie intensify their sexual liaison. However, Bobbie make an off the cuff comment which makes Don realize that he has to be more careful about his public personal life.—Huggo", "It's Memorial Day weekend 1962 and Don Draper ducks out of a day at the club to spend it with Bobbie Barrett only to find that she has made other plans. At the office, Duck Phillips again treads on Don's toes by suggesting they come up with a new ad campaign for Playtex bras. Don wonders why they would bother because Playtex is currently number 1 in the market but he agrees. Although they come up with a brilliant idea, the company passes for just the reasons Don had earlier suggested. Peggy Olson is concerned when she is left out of after work meetings and seeks Joan's advice. Duck Phillips has his children and his dog for the Memorial Day weekend. Roger Sterling tells Don to patch up his differences with Duck over lunch. They skip the lunch and have a chat, but it's not obvious they've buried the hatchet.—garykmcd"], "genres": "N/A", "imdbID": "1118060", "rating": 7.9, "votes": 2886, "number_of_episodes": 92}