{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "0607666": "Robert Morse", "0608601": "Mark Moses", "1377561": "Laura Ramsey", "0107531": "Philippe Brenninkmeyer", "1645468": "Justine Eyre", "0424608": "Bjorn Johnson", "0514228": "Peyton List", "0789478": "Charles Shaughnessy", "0089781": "Alan Blumenfeld", "0553020": "Rudolf Martin", "0160703": "Kevin Christy", "1705473": "Emilio Roso", "0291711": "Nina Franoszek", "0146941": "Patrick Cavanaugh", "3095001": "Edin Gali", "2980728": "Brandon Hayes", "0018010": "Alexia Aleman", "2754187": "Lolly Allen", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "2897598": "Evelyn Edwards", "1992334": "Emelle", "0448123": "John F. Kennedy", "1521895": "Jennifer McGraw", "3602547": "Kelly O'Leary", "1478964": "Dusty Sorg"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["Don blows off the convention in Los Angeles when he meets a beautiful, exotic woman. Back at Sterling Cooper, a member of the creative staff comes out of the closet, and Duck falls off the wagon and initiates his power play.", "After leaving Mona, Roger asks Jane Siegel to marry him, an offer which she accepts. The divorce looks to be a messy proceeding. At the office, Duck wants to make partner, but Roger, being candid, tells him that his performance to date doesn't warrant such a move. Duck decides he has either to be more aggressive in looking for a better job elsewhere or in finding additional business for Sterling Cooper to warrant the partnership. Still at the office, the creative team is talking about the difficult time Paul seems to be having in Mississippi from what they see on the news, the good time that Don and Pete are probably having in Los Angeles, the Right Guard campaign and Bob Dylan. With the latter, Kurt asks Peggy to Dylan's concert after she expresses interest in his music. Peggy sees this as a date, whereas Kurt sees it purely as friends going out as he assumed she and everyone in the office knew he was gay. This news brings out everyone's deep feelings about homosexuality and pushes Salvatore deeper into the closet. However, Kurt helps Peggy in other ways. In Los Angeles, Don pushes Pete into working harder than he expected - Pete expected a lot of time sitting by the pool and swimming - but Don himself abandons Pete and work when he meets Joy and her band of \"beautiful people\" who seem to have a lot of money but don't work for it. Don's time with Joy and her friends makes him think about making a connection to his past life.—Huggo", "Don Draper and Pete Campbell are in California to attend a aerospace convention. Don's luggage goes astray but initially, he's all business. Until he meets some new friends, that is, and he finds himself off to Palm Springs leaving Campbell on his own. Back in New York, Roger Sterling proposes to his 20 year-old girlfriend but his lawyer warns him that the divorce will cost him plenty . Peggy Olsen agrees to go out on a date with Kurt who announces to everyone at work that he is a homosexual. Duck Phillips speaks to Roger about the possibility of a partnership. After Roger shoots him down, Duck approaches some European contacts with the suggestion that they buy Sterling Cooper and install him a President.—garykmcd"], "genres": "N/A", "imdbID": "1118053", "rating": 8.3, "votes": 3093, "number_of_episodes": 92}