{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "2215143": "Kiernan Shipka", "1555340": "Alison Brie", "0193982": "Ryan Cutrona", "0514228": "Peyton List", "0656335": "Sam Page", "0743304": "Chelcie Ross", "0822448": "Christopher Stanley", "0146941": "Patrick Cavanaugh", "0716438": "Laura Regan", "0279702": "Miles Fisher", "0878954": "Jud Tylor", "0435071": "Judy Kain", "0747398": "Pamela Roylance", "0810909": "Tim Snay", "0479917": "Deborah Lacey", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "2462534": "Amy Scott", "0368386": "Jamison Haase", "3304502": "Kristin Chiles", "1914981": "Arne Starr", "3419695": "Kristina Sutton"}, "geners": ["Drama"], "runtimes": ["50"],  "plot": ["Roger Sterling throws an expensive party with his new wife, Joan throws a dinner party, Peggy and Paul get stoned while working on an ad campaign, and Don's daughter Sally steals money from her grandpa.", "Several members of the creative team - including Smitty, Peggy Olson and Paul Crane - are at work on a Saturday trying to come up with new slogans for their Baccardi campaign. It's rough going however and fresh ideas are rare. Paul contacts an old university friend and they smoke marijuana in his office. Once again Peggy surprises all of them and shows that she is as adventurous as they are. The rest of the staff are at Roger Sterling's lavish party. While the surroundings are sumptuous, a few of the guests are uncomfortable with Roger's singing performance. Betty Draper has an interesting encounter while Jane Sterling gets pie-eyed. Joan Holloway hosts a dinner party for husband Greg's boss and a colleague. She reveals her own hidden musical talents. Betty's father claims that someone stole $5 from his money clip, but no one takes him too seriously.—garykmcd", "It's the weekend, but not many are feeling like it will be a relaxing time. Peggy, Paul and Smitty are forced to work to come up with creatives for the Bacardi Rum account. Beyond making their work atmosphere be like a vacation to match the creatives, Paul calls in his old Princeton colleague, Jeffrey Graves, for some chemical inspiration much to the consternation of Olive, Peggy's new officious secretary. Supposedly having a better time are the Drapers, the Campbells, the Cranes, Bertram and Ken, who are attending a garden party hosted by the Sterlings. Don and Betty in particular don't want to be there, they feeling like it is work more than a social outing. Jane, wanting to fit into her new social circle, causes a bit of problem by the end of the evening. And Joan and Greg are hosting a small dinner party of their own for Greg's medical colleagues and their wives. Joan does whatever she has to to seem the perfect hostess and to show Greg to his best advantage. Meanwhile back at the Draper house, Gene, Betty's father, has moved in. Sally is the unknowing culprit causing a bit of a stir for her grandfather and by extension everyone else in the house.—Huggo"], "genres": "N/A", "imdbID": "1484415", "rating": 8.1, "votes": 2841, "number_of_episodes": 92}