{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "2215143": "Kiernan Shipka", "1555340": "Alison Brie", "0822448": "Christopher Stanley", "0743304": "Chelcie Ross", "0789478": "Charles Shaughnessy", "0191679": "Joseph Culp", "0142206": "Ryan Cartwright", "0146941": "Patrick Cavanaugh", "0566445": "J. Patrick McCormack", "0479917": "Deborah Lacey", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "3095001": "Edin Gali", "0395360": "Brynn Horrocks", "1865193": "Brandon Killham", "1187976": "Bobby Hall", "0020730": "Kevin Scott Allen", "0446964": "Leonard Kelly-Young", "2747290": "Cynthia Cales", "3248978": "Jake Radaker", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["With another sale on the horizon, Sterling, Cooper, and Draper convince Lane Pryce to fire them and then join them as they start up a new advertising firm. At home, Betty follows through with her plans to divorce Don.", "Don's life is falling apart around him. He learns from Connie about the sale of Sterling Cooper and, because of it, the loss of the Hilton account. As Don passes the news to Roger and Bertram, the three decide to plot strategy for what each wants in their professional future. Among their options are to go to the new company (which for Bertram will probably mean the end of his professional life), or the preferred option which is to buy back Sterling Cooper from Putnam, Powell and Lowe. What is not an option is to quit since they are all under contract, which would prevent them from working in advertising altogether. With the assistance of an unexpected person however, they come up with another option. The success of this option depends on the assistance of many, who may or may not decide to help, and some quick action before the rest of the world figures out what's going on. Because this maneuver feels like starting over, Don reminisces about a big change in his life when he was a young boy. At home, Betty has asked Don for a divorce, which Don does not want to grant. With the advice of a divorce lawyer, Betty has figured out a way that will make it difficult for Don not to grant her wish. His home life may more difficult to rectify than his professional life.—Huggo", "It's the beginning of the end for Sterling Cooper when Connie Hilton tells Don that the ad agency, along with their London-based parent company, have been sold to McCann Erickson effective January 1. That's only two weeks away and Don goes into action. He has no interest in working for a huge agency like McCann Erickson and approaches Bert Cooper with a proposal: they and Roger Sterling should buy back the Agency. He first has to patch up his relationship with Roger but they are soon on a mission to recruit a team from their best employees and make sure they get their hands on as much paperwork on the clients they will take with them as they can. None of them have a clue about what the paperwork even means but Roger knows just the perfect person to sort it all out for them. They have an unexpected ally after Lane Pryce gives London a call. Don's home life deteriorates after Betty tells him that she wants a divorce and will be going to Reno to get one.—garykmcd"], "genres": "N/A", "imdbID": "1484414", "rating": 9.7, "votes": 5617, "number_of_episodes": 92}