{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "2215143": "Kiernan Shipka", "1555340": "Alison Brie", "0743304": "Chelcie Ross", "0822448": "Christopher Stanley", "0240043": "Anne Dudek", "0582420": "Mark Metcalf", "0891224": "Ned Vaughn", "0712141": "Nina Rausch", "0196325": "Federico Dordei", "2872135": "Giuseppe Raucci", "0056249": "Joanne Baron", "1617837": "Julie McNiven", "0479917": "Deborah Lacey", "2765519": "Jared Gilmore", "0801044": "Jeanne Simpson", "1946645": "Edoardo Beghi", "0689040": "Josiah Polhemus", "3117996": "Jared Dante", "0210885": "Vincent De Paul", "2003548": "Michael Mallory", "2166477": "Ivo Nandi", "2147871": "Jasen Salvatore", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["Don and Betty renew their love affair while on a business trip to Rome, while Peter has a bout of infidelity with an au pair in his building while his wife is away.", "It's the summer vacation season, and many New Yorkers are out of town, including Trudy. Pete, alone at home, is feeling a little restless. His restlessness is cured when he meets Gudrun, an au pair who is working for his neighbors. Pete decides to assist a teary eyed Gudrun with a problem she is having. In doing so, Pete runs into an old colleague, which is slightly embarrassing for both. In doing this favor for Gudrun, Pete expects more than just a little gratitude in return, which causes some problems. Upon Trudy's return, Pete makes an unexpected request from her. At the Drapers, Betty is buoyed by the help that Henry Francis has provided in at least delaying the reservoir project. Henry admits that he helped for one specific reason. Don, who is also taking time off from work, is unexpectedly called by Connie to make a two day site visit to one of his hotels in Rome. Although a work trip, Betty, on Don's invitation, accompanies him on this trip. The two end up having more than just a little fun while in Rome. Arriving home, Betty realizes that her life in Terrytown is not perfect. She also needs to have a heart to heart mother-daughter talk with Sally, sparked by an incident while Betty and Don were away but which encompasses many of the feelings Sally has been experiencing since Grandpa Gene's death.—Huggo", "It's the dog days of August and Don is at home with a few days off between trips related to the Hilton Hotels account. Betty Draper continues her journey into political activism by attending a local council hearing on the water reservoir issue. With the help of Henry Francis, they have the project postponed. Thrilled at the successful outcome, Betty decides to join Don on a quick business trip to Rome. Staying at the Rome Hilton, they have a passionate few days. Peter Campbell is also on his own as his wife is away visiting her parents. He makes the acquaintance of Gudrun, a neighbor's au pair. He decides to help her out and tries to return an expensive dress she borrowed from her employer and then stained with red wine. Peter is surprised when he meets the manager of the boutique. His subsequent entanglement with Gudrun also has a profound impact on him.—garykmcd"], "genres": "N/A", "imdbID": "1484662", "rating": 7.9, "votes": 2630, "number_of_episodes": 92}