{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "0608601": "Mark Moses", "2215143": "Kiernan Shipka", "0193982": "Ryan Cutrona", "0817844": "Abigail Spencer", "1140952": "Matthew Bushell", "0240043": "Anne Dudek", "0846834": "Jayne Taini", "0133614": "Michael Canavan", "0810379": "Yeardley Smith", "1483927": "La Monde Byrd", "0106998": "Peter Breitmayer", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "0611795": "Lou Mulford", "0146941": "Patrick Cavanaugh", "3083887": "Adam Knapp", "1777047": "Steven Koller", "1617837": "Julie McNiven"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["Betty has hallucinations of her deceased father as she delivers her baby, Peter considers trying to sell the untapped \"Negro market\" to a reluctant client, and Peggy begins to question her future at Sterling Cooper.", "Betty goes into labor just as Don arrives home from work. At the hospital, she has a strange dream while in a drug induced semi-consciousness and he spends a night in the waiting room chatting with another expectant father. At the office Lane Pryce is worried about expense account spending and the excessive use of office supplies. Don walks out of the meeting and later tries to get him to focus on the bigger picture. Duck Phillips re-appears and is trying to recruit two of Sterling Coopers finest to join him at his new ad agency. Peggy approaches Don about a raise but in the current cost-cutting climate, doesn't get much encouragement. Pete Campbell, still unhappy about sharing his duties, is dealing with the Admiral TV account. Their sales are down but in looking at the demographics, finds they may have a market that is not reaching its full potential. His idea falls flat with both Admiral and his bosses but Lane Pryce thinks he may be onto something.—garykmcd", "Sally has been acting up in school because of grieving for her Grandfather, Gene. Sally's teacher, who has a conference with Don and Betty, is over-sensitive to the reason behind Sally's behavior. Sally isn't the only person who misses her grandpa. Meanwhile, Betty goes into labor. Out in the waiting room, Don has a philosophical chat with new expectant father, Dennis Hobart, a prison guard by profession, about family life. Betty, under sedation, dreams about her lot in life with Don. At Sterling Cooper, Lane is scrutinizing the executives expenses accounts, especially what he sees as over use of office supplies. This penny-pinching irks Don. With Sterling Cooper in this financial situation, it is not a good time for Peggy to ask for a raise. Pete is also feeling under-appreciated with, in his mind, the short stick of the accounts distribution versus Ken. So he makes a controversial decision on one of his accounts, Admiral Television. Peggy and Pete have other considerations, specifically in discussions with Duck Phillips. The events at Sterling Cooper over their respective situations may sway their decisions.—Huggo"], "genres": "N/A", "imdbID": "1484417", "rating": 8.0, "votes": 2685, "number_of_episodes": 92}