{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "2215143": "Kiernan Shipka", "1556400": "Crista Flanagan", "0656335": "Sam Page", "0743304": "Chelcie Ross", "0789478": "Charles Shaughnessy", "1471089": "Jamie Thomas King", "0142206": "Ryan Cartwright", "0146941": "Patrick Cavanaugh", "0435071": "Judy Kain", "0479841": "Carol Locatell", "1617837": "Julie McNiven", "3095001": "Edin Gali", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "1193110": "Mark Kelly", "0225698": "Neil Dickson", "0008650": "Don Abernathy", "1262138": "Dawn Marie Anderson", "3149393": "Dana Blackstone", "3118295": "Katie Marie Davies", "3083887": "Adam Knapp", "0470546": "Susan Krebs", "1633895": "Calle Morgan", "0697650": "Faith Prince", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["The bosses come in from London to reorganize Sterling Cooper, but a key player's career is sidetracked by a freak accident. Meanwhile, as Joan prepares to leave her job, her husband gives her some bad news.", "A lot is happening at Sterling Cooper in the lead up to Independence Day. The office will be closed on July 3rd, and the staff are looking forward to the holiday. July 2nd will be Joan's last day before she settles into being a housewife as Greg is primed to be promoted to Chief Resident of Surgery. But plans change when Sterling Cooper's British parent company representatives are coming for \"an inspection\". This essentially means that the office will now be open on July 3rd. Ken is buoyed by this news as he has just brought in another lucrative account, John Deere tractor. Bertram and Roger believe the visit really is to provide an official evaluation and promotion for Don, with who the Brits were impressed ever since the takeover meeting when Don overthrew Duck Phillips. They think he will get a creative executive position, splitting his time between New York and London. To make the visit smoother, Bertram wants Don and Roger to reconcile their differences. But when the Director and Chair arrive with young dynamic Guy Mackendrick in tow, it is Guy who delivers the unexpected news to the masses. It ends up being an eventful day for Guy in the office. It also ends up being an eventful time later that day for Don as he meets with an old acquaintance. At the Harris household, there is also an unexpected turn of events. And at the Draper household, Sally has been totally ignoring baby Gene. Betty's attempt to get Sally to bond with her new baby brother fails. Don eventually learns what is troubling Sally.—Huggo", "The staff of Sterling Cooper prepare for a visit from the new British owners just before the July 4 holiday. Bert Cooper tells Don that he thinks the creative director is in for a big promotion but when the bosses arrive and lay their plans on the table, the senior staff is not very happy. Don gets a call to meet the well known hotelier Conrad Hilton and on seeing him, realizes they have met before. It's also time to say goodbye to Joan as it's her last day at work. The farewell party for her leads to a serious accident that will affect everyone at the agency. Joan is also not not in good spirits as her surgeon-husband Greg has received bad news at his work. Meanwhile, Betty and Don have to deal with Sally who refuses to have anything to do with her newborn brother Gene. Betty thinks she is jealous but Don finds out it is something else.—garykmcd"], "genres": "N/A", "imdbID": "1484435", "rating": 9.1, "votes": 3639, "number_of_episodes": 92}