{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "0051104": "Talia Balsam", "2215143": "Kiernan Shipka", "0193982": "Ryan Cutrona", "0001110": "Embeth Davidtz", "1426686": "Eric Ladin", "0817844": "Abigail Spencer", "0723415": "Elizabeth Rice", "1172273": "Megan Henning", "0004668": "Kevin Cooney", "1851040": "James Immekus", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "1484231": "Derek Ray", "0139287": "Brian Carpenter", "1468085": "Billy Finnigan", "0007103": "Mark Brandon", "2537226": "Jeremy Scott Johnson", "2717268": "Austin Trace", "3446406": "Richard Marlow", "1352905": "Courtney Bell", "2929189": "Mike Cross", "2491005": "Candice Cunningham", "1601335": "Eve Curtis", "3716391": "Rick L. Dean", "1992334": "Emelle", "2111250": "Erin Pickett", "1914981": "Arne Starr", "0913585": "Audrey Wasilewski"}, "geners": ["Drama"], "runtimes": ["50"],  "plot": ["Don is brought in to save the day for a P.R. campaign involving the building of the new Madison Square Garden, only to have the rug pulled out from under him. At home, Betty argues with her brother over how to care for their sick father.", "There's trouble in both the Sterling and Hofstadt families. With the Sterlings, Roger's daughter Margaret informs him that she doesn't want his wife, Jane, at her wedding, Margaret being ashamed that her step-mother is the same age as her. With the Hofstadts, Gene's Alzheimer's is getting worse, and his wife Gloria has left him. As such, Betty and her brother William have to make some decisions about what to do with their father. William gets some unsolicited and unwanted advice in this matter. At the office, two accounts are on the minds of the executives. One is for Patio Cola, Pepsi's diet soda. Pepsi wants to go with an Ann-Margret Bye Bye Birdie (1963) feel. Peggy does not agree with this approach. Despite that, Peggy is feeling in an Ann-Margret spirit in her personal life. The other has Don trying to win the business of the town's new planned multi-purpose facility, Madison Square Gardens. Don gets some bad and unexpected news on this front.—Huggo", "Betty Draper has to deal with her brother William who wants to place their father Gene in a home for the aged. He says that they do not have the resources to keep him but Betty suspects he just wants to get his hands on their Dad's house. William keeps laying on the guilt and it's up to Don to settle it all. At the office, Don and Roger Sterling go after a major account: the group that wants to build the new Madison Square Gardens and demolish the beautiful Penn railway station. They're successful but head office in London has other ideas. Peggy doesn't agree with the Agency's approach to a new Pepsi campaign thinking that it should be directed more at women that at men. She still feels like the odd \"man\" out on the creative team even though, consciously or otherwise, she is beginning to act more and more like her male colleagues. With his daughter's wedding soon upon him, Roger Sterling has to deal with the fact that his daughter doesn't want his new fiancée to attend.—garykmcd"], "genres": "N/A", "imdbID": "1449612", "rating": 7.8, "votes": 2665, "number_of_episodes": 92}