{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "0608601": "Mark Moses", "0051104": "Talia Balsam", "2215143": "Kiernan Shipka", "1555340": "Alison Brie", "0822448": "Christopher Stanley", "0723415": "Elizabeth Rice", "0303013": "Carla Gallo", "0514228": "Peyton List", "0435071": "Judy Kain", "0716438": "Laura Regan", "1617837": "Julie McNiven", "0479917": "Deborah Lacey", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "3095001": "Edin Gali", "1484231": "Derek Ray", "0403486": "Patrick John Hurley", "1814480": "Veronica Taylor", "0926355": "Sewell Whitney", "2071294": "Jennifer Dawson", "0120783": "Anthony Burch", "0919952": "Shannon Welles", "0146941": "Patrick Cavanaugh", "3798424": "Hesley Harps", "3638581": "Marguerite Gioia Insolia", "1024584": "Ralph Kampshoff", "3683166": "Alistair Steel", "3792788": "Stewart Strauss"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["On the weekend of the John F. Kennedy assassination, Pete finds out that he lost the promotion to Cosgrove, Roger Sterling's daughter's wedding goes off as planned, and Betty musters up the courage to respond to Don's confessions.", "It's November 21, 1963, and no one seems to be particularly happy. The heating/cooling system at Sterling Cooper isn't working properly, so people are either freezing to death or sweltering in the heat. That is nothing compared to the news Pete receives: Ken has been made sole Vice-President of Accounts. This news makes Pete contemplate his future. Don is upset that no one has been hired to replace Sal, and it doesn't look like Lane is in any hurry to do so. Margaret Sterling's wedding is in two days and she is still upset that her step-mother, Jane, is planning on attending. Jane, on the other hand, is angry that Roger dotes on his daughter more than he pays attention to her. The unlikely allies in the Sterling family feud are Roger and Mona. But none of these unfortunate goings-on compare to the news the world hears the following day: that President John F. Kennedy has been assassinated. This news places a pall over the world, and makes people reconsider attending the Sterling wedding. Those few that do attend are still preoccupied with the assassination. But Betty is equally as preoccupied with Don's identity as Dick Whitman, and with Henry Francis, who is also a wedding reception attendee. Henry ends up making an unexpected proposition to Betty.—Huggo", "It's a special day in the lives of everyone at Sterling Cooper. Pete Campbell learns from Lane Pryce that Ken Cosgrove is to be appointed as Vice President in charge of accounts with Pete being assigned to a lesser job leading him re-consider Duck Phillips' offer. Don learns that he won't be able to hire the man he hoped would replace Sal Romano as Art Director and Peggy Olson arranges to spend her lunchtime in bed with Duck at a nearby hotel. It's November 22, 1963 however and their lives all seemingly come to a swift halt with the announcement that President John F. Kennedy has been assassinated in Dallas, Texas. Roger Sterling's daughter decides to go ahead with her wedding planned for the next day, even though few people show up. Betty sees Henry Francis at the wedding and meets him the next day where he has a surprising question for her. Feeling hollow and empty, she finally tells Don what she really feels about him.—garykmcd"], "genres": "N/A", "imdbID": "1484251", "rating": 8.9, "votes": 3078, "number_of_episodes": 92}