{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "2215143": "Kiernan Shipka", "0656335": "Sam Page", "1426686": "Eric Ladin", "0817844": "Abigail Spencer", "0005081": "Mary Page Keller", "0146941": "Patrick Cavanaugh", "1119340": "Kristoffer Polaha", "0221430": "Dan Desmond", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "3095001": "Edin Gali", "0120783": "Anthony Burch", "2241686": "Troy Vincent", "1307272": "Jay Burns", "0230436": "Mark Doerr", "0762575": "Julia Sanford", "9065119": "Cary Huff", "1914981": "Arne Starr", "3688615": "Doug Turcza", "3586038": "Hayley Zeccardi"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["An old flame and potential client reenters Roger Sterling's life, Joan's husband searches for a new job, and Don finally comes clean to Betty about his true identity.", "Two women from Roger's past reenter his life. The first is Annabelle Mathis, a former lover from twenty years earlier. Her business, Caldicott Farms, specializes in horse meat for dog food. She is looking to advertising firms to help save her business, the industry which has received bad publicity because of the movie The Misfits (1961). Annabelle may not be able to separate her professional and personal relationship with Roger. The second is Joan, who calls him to help her look for a well paying job in light of Greg's professional situation. Joan knows that she can't get her old job back, but wants something more lucrative than being just a secretary or a sales clerk. At home, Joan is feeling frustrated with Greg's lack of focus on what he will do with his professional life. Ultimately, Greg makes an extreme decision. At the Draper household, the kids are looking forward to Halloween, while their parents have more pressing matters. Betty takes the children back to Philadelphia so that she can deal with Gene's house and what she and William will do with it. While there, Betty takes the opportunity to speak to the Hofstadt family lawyer for advice on what to do with the information she found about Don's true identity as Dick Whitman. Betty makes decisions based on this advice. With Betty away, Don and Suzanne talk about taking a trip together. A crisis strikes Don which makes him forget about some important things he has left waiting in his car.—Huggo", "A former client returns to to Sterling Cooper as she is now in charge of her father's business and says she wants to try to regain the market share they lost when they were targeted for using horse meat in their dog food. She also clearly has an interest in Roger Sterling who she had a thing for years before. Betty and the kids go to their father's house to settle his affairs but she takes the opportunity to get advice from the family lawyer on her own marital situation. She returns early and decides to confront Don with what she knows. Joan is looking for work as her husband looks to change his residency to psychiatry. While she is being supportive he's just feeling sorry for himself and they have have a major falling out over his future. She calls Roger to see if he can help her find a job but Greg makes a major career move without consulting her.—garykmcd"], "genres": "N/A", "imdbID": "1484250", "rating": 9.2, "votes": 3595, "number_of_episodes": 92}