{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "2215143": "Kiernan Shipka", "1555340": "Alison Brie", "0001110": "Embeth Davidtz", "0822448": "Christopher Stanley", "0817844": "Abigail Spencer", "0789478": "Charles Shaughnessy", "1483867": "Marshall Allman", "0514228": "Peyton List", "1556400": "Crista Flanagan", "0716438": "Laura Regan", "0142206": "Ryan Cartwright", "0566911": "Mary Anne McGarry", "0484900": "Hal Landon Jr.", "0479917": "Deborah Lacey", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "0225698": "Neil Dickson", "0120783": "Anthony Burch", "0919952": "Shannon Welles", "0146941": "Patrick Cavanaugh", "8453499": "Denise Crovetti", "0435071": "Judy Kain"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["As Sterling Cooper prepares for its 40th anniversary party, the bosses in London drop a bombshell to Lane. Miss Farrell's troubled brother pays a visit to her and Don, and Betty stumbles onto her husband's secrets.", "The 40th anniversary party for Sterling Cooper is approaching, but not many seem to be excited about it. Bertram, who does not feel the need to reminisce, is not planning to attend. And Roger doesn't want to see more praise stowed upon Don, which is supposed to happen at the party. But the Brits at head office want the party to be a success, if only to carry out their clandestine plan. With others in the office, Paul is feeling threatened by Peggy, who he sees as Don's favorite. Paul however comes up with what he believes is a brilliant idea for a campaign, if only he can remember what that idea is. And Lane is feeling pressured by his wife Rebecca, who hates living in New York. At the Draper household, Betty is keeping her distance from Henry Francis, but Don is continuing his affair with Suzanne Farrell. Being the private person that he is, he wants no one to know about it, even Suzanne's epileptic brother Danny, who she wants Don to know. But Betty stumbles across something Don left in his pocket, which may end up exposing more to her than he wants.—Huggo", "With Sterling Coopers' 40th anniversary of its founding on the horizon, Don is told to prepare a speech for the occasion. He's still having an affair with Suzanne Farrell and telling Betty he's working late on the Hilton account. Betty finally finds a key to the desk drawer that Don always keeps locked and finds his shoebox with photos and the documents, not to mention the secrets, he's kept hidden from her. Paul sees Peggy Olson as a threat when she always seems to come up with the right idea at the right moment. He pulls an all-night'er on an account they've been assigned but he fails to jot down a brilliant idea and draws a blank the next morning. Peggy saves the day yet again. Lane Pryce gets a call from London with news that will affect everyone in the firm.—garykmcd"], "genres": "N/A", "imdbID": "1484249", "rating": 8.3, "votes": 2657, "number_of_episodes": 92}