{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "2215143": "Kiernan Shipka", "1555340": "Alison Brie", "0142206": "Ryan Cartwright", "0309461": "Michael Gaston", "1007554": "Sunny Mabrey", "0444940": "Jack Kehler", "0191679": "Joseph Culp", "0425616": "Lauri Johnson", "1617837": "Julie McNiven", "2765519": "Jared Gilmore", "2302566": "Orestes Arcuni", "1375569": "Trisha LaFache", "0395360": "Brynn Horrocks", "2745125": "Kelly Huddleston", "0514518": "Annie Little", "2530037": "Joel Lambert", "0255373": "Jamie Elman", "3130334": "Stephanie Carrie", "3561066": "Laura Beth Coakley", "1601335": "Eve Curtis", "1992334": "Emelle", "1660476": "Andrew Hoagland", "2618228": "Liz Pellini", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["Don accidentally learns a secret about Salvatore during a business trip to Baltimore. Back at the office, the firings continue, but the new management appoints Peter and Ken as new co-heads of accounts.", "Don and Betty are back together in marital bliss as they await the birth of their next child. Don is daydreaming about an ominous view of his own birth, which may be a sign about Betty's pregnancy. At Sterling Cooper, financial officer Layne Price from the parent British office and his personal secretary John Hooker have been brought in to do some housecleaning. The British way of doing business is foreign to most of those at Sterling Cooper. One-third of the staff is being let go, including Head of Accounts, Burt Peterson. In Burt's old position, Layne installs Pete, much to his relief and excitement. But his excitement is short lived when he learns he will be sharing the job with Ken. They are told in coded language that one of the two will emerge as the sole person in the position based on performance. Also because of Burt's dismissal, Don and Sal are sent to Baltimore in his place to meet with their London Fog account contacts. While in Baltimore, they, masquerading as \"Bill\" and \"Sam\", socialize with their New York to Baltimore flight crew. As the evening ends, Don shows that his personal life has not changed with Betty's pregnancy. Sal also unexpectedly exposes a little of his personal life to Don.—Huggo", "A few months have passed since we last saw the men and women of Sterling Cooper and much has changed. The new British owners, in the form of finance man Lane Pryce, have disposed of one-third of the staff. All the secretaries are enamored by John Hooker, Pryce's right hand man, but others have taken to calling him Miss Moneypenny. Pete Campbell is ecstatic when told he is to be the new Head of Accounts until he learns that he and Ken Cosgrove will be sharing the duties, with specific clients assigned to each of them. Ken is thrilled with his promotion and refuses to play Pete's games. Don Draper and Salvatore Romano go off to Baltimore to calm a nervous client but Don catches Sal in a compromising situation. At home, Don and Betty await the imminent arrival of their baby and in flashbacks, more of Don's past is revealed.—garykmcd"], "genres": "N/A", "imdbID": "1439792", "rating": 8.2, "votes": 2869, "number_of_episodes": 92}