{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "2215143": "Kiernan Shipka", "0193982": "Ryan Cutrona", "1426686": "Eric Ladin", "0822155": "Aaron Stanford", "0303013": "Carla Gallo", "0142206": "Ryan Cartwright", "1556400": "Crista Flanagan", "0237711": "Sarah Drew", "0877252": "Myra Turley", "0913585": "Audrey Wasilewski", "0782978": "David Selby", "1172273": "Megan Henning", "0582079": "Kenneth Meseroll", "1197237": "James Giordano", "0397984": "James Howell", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "0468014": "Daniel Kountz", "2336136": "Kelsey Sanders", "0027055": "Larry Anderson", "3584445": "Johnny Carnevale", "1879797": "Pamela Lundquist", "3261526": "Richard Markman"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["Don has reservations about a misguided potential client who wants to sell jai alai as the \"new national pastime.\" Meanwhile, Sal produces the \"Patio\" television commercial, Peggy searches for a roommate, and Betty's father passes away.", "At the Draper house, Gene is indulging his grandchildren against Don and Betty's wishes. Gene wants to discuss his death arrangements with Betty, which distresses her. And Gene's presence in general is making Don think about his own parents. But these issues with Gene and the Drapers take a major turn. Meanwhile, Peggy decides to move from Brooklyn to Manhattan, being able to do so only if she finds a roommate. She dreads telling her mother about this decision. Her roommate ad in the paper is the brunt of jokes within the office. Joan is an unexpected source of support for Peggy. With work, Pete brings in a new account, that from his college chum, Horace Cook, Jr. - HoHo to his friends. He wants to promote the sport of jai alai, and is willing to pay a large sum for its promotion. Don knows that Horace Cook, Sr. is a close friend of Bertram's and wants to make sure that Cook Sr. is aware of what his son is doing with the family money. With the Patio Cola account, Sal is a last minute replacement to direct the television commercial. The end product has an unexpected response from the client. But Sal uses his work stresses as an excuse to Kitty as to his inattentiveness to her at home.—Huggo", "Peggy Olson decides the time has come for her to move to Manhattan despite her mother's objections. She puts an ad on the bulletin board at work but gets ridiculed as a result and Joan makes a few suggestions to help her find the right kind of roommate. The agency is going ahead with Pepsi's request for a commercial that mimics the opening of the movie Bye Bye Birdie (1963) but when the director drops out at the last minute, Sal gets to direct. The agency also has to deal with Horace Cook Jr., a very rich young man and the son of Bert Cooper's close, personal friend who is apparently prepared to spend a cool million dollars on promoting a Jai Alai league that he is convinced will rival baseball in a few years. Don Draper is less than comfortable taking his money and does his best to warn him off the venture. At home, Don still has to put up with his father-in-law Gene, who isn't very cooperative. When Gene fails to come home from the supermarket and pick up the kids at school, Betty gets some sad news.—garykmcd"], "genres": "N/A", "imdbID": "1484416", "rating": 8.0, "votes": 2661, "number_of_episodes": 92}