{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0805476": "John Slattery", "2215143": "Kiernan Shipka", "0743304": "Chelcie Ross", "0822448": "Christopher Stanley", "0240043": "Anne Dudek", "0817844": "Abigail Spencer", "1496294": "Darren Pettie", "0146941": "Patrick Cavanaugh", "0479917": "Deborah Lacey", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "3095001": "Edin Gali", "0801044": "Jeanne Simpson", "0120783": "Anthony Burch", "0855133": "Adria Tennor", "1687798": "Jim Hoffmaster", "0753246": "Ann Ryerson", "2466202": "Jefferson Black", "3928073": "Tara Burrows", "1958046": "Matt Hanson", "1914981": "Arne Starr"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["Betty tries to meet with Henry Francis again, while Don steps up his pursuit of his daughter's former teacher. At the office, Don disappoints Conrad Hilton and is forced by a client to fire Salvatore over an unwelcome advance.", "Connie is constantly calling Don, even in the middle of the night. But the carrot of the entire Hilton account is enough for Don to endure these intrusions on his personal life. Don may ultimately have a black mark with Connie when he does not literally follow through with a thought Connie provides to him. Sal is working on a commercial for Lucky Strike. But an incident with the client, Lee Garner, Jr., may jeopardize not only his position on the account but his position at Sterling Cooper. Sal takes out his frustrations by resorting to his primal urges. At the Draper house, Don and Betty are both preoccupied with their infatuations, Don's with Sally's former teacher Suzanne Farrell, and Betty's with Henry Francis. Both go to extreme measures to progress those infatuations.—Huggo", "Betty Draper continues her flirtation with Henry Francis after he suddenly drops in to see her. She ends up hosting a fund-raiser but things don't quite go as she had hoped. Don keeps receiving late night phone calls from Connie Hilton about the ad campaign for his hotels. He's feeling stressed and while he comes up with a brilliant approach, Hilton is less than pleased. Don also decides to pursue his daughter's former schoolteacher. Sal is still directing commercials for the Agency's ad clients but runs into a problem when the owner of one of their biggest accounts makes a pass at him. After Sal rebuffs him, the client demands that he be fired. With two clients having walked out in a huff, Roger Sterling blows up at Don.—garykmcd; correction by mcl-40435"], "genres": "N/A", "imdbID": "1484663", "rating": 8.1, "votes": 2592, "number_of_episodes": 92}