{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0061262": "Bryan Batt", "0321591": "Michael Gladis", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "0607666": "Robert Morse", "0805476": "John Slattery", "0364813": "Jared Harris", "0608601": "Mark Moses", "2215143": "Kiernan Shipka", "0743304": "Chelcie Ross", "0822448": "Christopher Stanley", "0240043": "Anne Dudek", "1119340": "Kristoffer Polaha", "0817844": "Abigail Spencer", "0639871": "Trever O'Brien", "1139258": "Erin Sanders", "0191679": "Joseph Culp", "0470546": "Susan Krebs", "1036537": "Jacqueline Hahn", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "0801044": "Jeanne Simpson", "2383557": "Dani Repp", "3293593": "Graham Clarke", "1633895": "Calle Morgan"}, "geners": ["Drama"], "runtimes": ["60"],  "plot": ["As Don secures an account with Conrad Hilton, Sterling and Cooper try to strong-arm Don into signing a contract. Meanwhile, Betty meets with her acquaintance from the governor's office, and Duck tries to get Peggy to leave Sterling Cooper.", "Don's acquaintance, Connie, better known to the rest of the world as Conrad Hilton, stops by the office on an unexpected visit. As a start, he wants to transfer the advertising business of his New York hotels to Sterling Cooper. Don is reluctant to specify the nature of Connie's visit to the staff, who are all abuzz about Don even knowing the powerful Hilton, let alone the possibility of working on a campaign for Hilton Hotels. On the pretense of the new Hilton account, Bertram, Roger and Lane discuss an administrative issue with Don. Betty gets caught in the middle of the battle between Don and the partners. Don himself gets caught up in two other unusual incidents, the first with Sally's teacher Miss Farrell, and the second with a couple he picks up who are hitchhiking to Niagara Falls. Both incidents make him ponder his future. At the office, Pete has definitely made up his mind not to accept Duck's offer for a position at Gray Advertising, especially with the possibility of the Hilton campaign. Although she also has verbally stated she has made the same decision, Peggy is having second thoughts about going to Gray. Much will depend on what Don will offer her (he not knowing about Gray) and what Duck will. The latter offers her something she probably wasn't expecting. Betty has much on her plate. In addition to redecorating the living room, she is back at work volunteering with the Junior League. They need some political help in advancing their latest cause. Although a few people in the league know him including Betty, she, as the \"adorable\" one in the group, is tasked with contacting Henry Francis in the Governor's office. Their meeting continues the sexual tension they experienced when they first met.—Huggo", "For Don Draper, the day starts off badly and goes downhill from there. He arrives a bit late for work to find that hotelier Conrad Hilton is in his office waiting for him. Don is uncharacteristically flustered but Hilton tells him that he wants Sterling Cooper, Don to be more precise, to handle the ad accounts for his three New York hotels. Don is pleased, but it later turns out that Hilton's lawyers will require Don to be under contract with Sterling Cooper for the deal to proceed. Don has serious doubts about giving up his freedom. His frustrations leads to an unfortunate encounter with two hitchhikers. Peggy Olson hears about the Hilton account second hand but when she asks Don about it, he tells her to focus on doing a better job. As a result, her planned meeting with Duck Phillips takes an interesting turn. At home, Betty Draper gets involved in politics through the Junior League, who are trying to stop a water diversion project. She contacts Henry Francis from the Governor's office, with whom she met at Roger Sterling's party and they have coffee together.—garykmcd"], "genres": "N/A", "imdbID": "1472778", "rating": 8.4, "votes": 2750, "number_of_episodes": 92}