{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0608601": "Mark Moses", "0120648": "Cara Buono", "1668265": "Matt Long", "0664175": "Jessica Paré", "0272474": "Jay R. Ferguson", "0834960": "Danny Strong", "0706716": "Kevin Rahm", "0030100": "John Aniston", "0212498": "Tim DeZarn", "0906345": "Becky Wahlstrom", "0375374": "Randee Heller", "1305105": "Beth Hall", "2049551": "Alexandra Ella", "0400194": "Brent Huff", "0726773": "Roger Rignack", "0639625": "John O'Brien", "0951008": "Michael Yurchak", "0609474": "Amy Motta", "3086048": "Ben Alagna", "1907725": "Jennifer Riker", "3079971": "Chris Smith", "5037125": "Elizabeth Thurmond"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don has a wild lost weekend after winning a CLIO award, while Peggy is forced to work all weekend in a hotel room with an \"uninspired\" co-worker. Meanwhile, Peter is livid after he learns that the other partners hired Ken Cosgrove.", "The firm is on a high as Don has been nominated for a Clio Award for the Glo-Coat ad. The one person who has some issue specifically with Don is Peggy, who feels that Don has not provided any recognition for her significant contribution to that ad and who is not among those from the company invited to the awards ceremony at the Waldorf-Astoria Hotel. On top of that, Don is giving her deadline ultimatums for the Vicks account, the hold-ups which she feels are not her fault, but that of the new art director, Stan Rizzo, who Don seems to respect more than her. To make their working relationship function, Peggy takes Stan up on what she considers a bluff, which has mixed reactions. During this time, an inebriated Don also pitches a bad and stolen idea to their Life cereal clients, who love the idea. Peggy, at that meeting, knows its original source. That action by Don may be the last Peggy will tolerate from him in this already bad weekend for her. Don gets out of this predicament in a way that surprises Peggy in not a good way. The end of the weekend also gets Don in hot water with an already angry Betty. Another person at the office who is not too happy is Pete, who learns from an outside source of someone who may be joining the firm. Pete tries to flex his muscles in this matter as one of the firm's partners. Lane counters that the extra body is required as the accounts grow and Roger's contribution to the company dwindle to being solely that of figurehead. Roger is more focused on dictating his memoirs, which makes him reminisce about when he first met Don and how Don, with no formal experience, came to work at Sterling Cooper. That situation mirrors to some extent something that Don is currently going through, with Don now in the Roger role.—Huggo", "It's a busy Friday at SCDP. It's time for the ad industry's Clio awards and Don is nominated. He and Peggy Olson interview someone for the creative team but he doesn't make much of an impression and seems to have only one idea. The executives from Life cereal have been held up due to fog and the presentation will likely have to be rescheduled. The drinking starts early and throughout the afternoon but when Don gets word that the Life cereal execs have arrived by car, they all rush to the office to make the presentation. A drunken Don makes a mistake when brainstorming a slogan for them however. Peggy meanwhile is not getting along with the new Art Director who insists on seeing her copy before sketching out his own ideas. They end up working the entire weekend to come up with something for Don by Monday morning. She does manage to put him in his place however. Pete Campbell is more than just a little upset when he hears that Lane Pryce is trying to recruit Ken Cosgrove.—garykmcd"], "genres": "N/A", "imdbID": "1615665", "rating": 8.6, "votes": 2767, "number_of_episodes": 92}