{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0822448": "Christopher Stanley", "1668265": "Matt Long", "0240043": "Anne Dudek", "0656335": "Sam Page", "0120648": "Cara Buono", "0272474": "Jay R. Ferguson", "2319871": "Anna Camp", "0375374": "Randee Heller", "1843993": "Peter Gray Lewis", "2765519": "Jared Gilmore", "1318793": "Brian Elerding", "3014867": "Daniel Vincent Gordh", "2568541": "J.P. Gillain", "2797050": "Christy Williams"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["While Don's thoughts turn inward while he deals with Anna's death, Peggy is placed in a difficult situation when an obnoxious employee in the creative department is disrespectful to Joan.", "Don has come to the realization that his life is falling apart, fueled in large part by his excessive alcohol consumption. To get his life back on track, he is swimming regularly - a difficult task at first - and writing a journal, the latter which may be the more difficult task as he admits he has never strung together more that 250 words at any given time. His problems are compounded by the fact that Gene's second birthday is coming up, Gene's official party to which he is not invited. He also knows in his heart that Gene considers Henry to be his father. Don also evaluates the state of his relationships, especially with Bethany. Betty is not coping much better with her life, the thought of Don which causes her unending grief. A chance social meeting with Don totally unravels Betty, unfortunate for Henry that it takes place at an important dinner with regard to Henry's political future. Betty's emotions take their toll on the Francises. Joan is also going through a rough time with Greg soon heading off to basic training. She is also butting heads with Joey, who is treading on shaky ground in that he is not an employee but a freelancer who does not respect the role that Joan plays in the office. A specific incident between Joey and Joan may be the last straw for her. A move by Peggy to stand up for Joan has a surprising result.—Huggo", "Don is trying to clean up his act somewhat. He's exercising regularly and has cut back on his drinking considerably. At the office, he's not happy with the proposed Mountain Dew campaign and sends Peggy and the others back to the drawing board. The men, especially Joey Baird, are at their juvenile worst making sexist remarks around Joan and telling dirty jokes and the like. After Don tells Peggy that she should take charge and do something about it, Peggy confronts Joey but gets severely criticized from an unexpected quarter. Henry Francis and Betty are invited out for dinner where he is sounded out about the possibility of managing Mayor Lindsay's presidential run which is in its very early days. The evening is ruined however when Betty sees Don in the same restaurant having dinner with Bethany Van Nuys. She is convinced Don is 'living the life', as she says, and doesn't feel he deserves any of the joys that their children may bring to him. She particularly doesn't want him to attend their son's birthday party on the weekend.—garykmcd"], "genres": "N/A", "imdbID": "1615667", "rating": 8.6, "votes": 2866, "number_of_episodes": 92}