{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "1679669": "Rosemarie DeWitt", "0822448": "Christopher Stanley", "1555340": "Alison Brie", "0120648": "Cara Buono", "0664175": "Jessica Paré", "0272474": "Jay R. Ferguson", "0834960": "Danny Strong", "0043891": "John Aylward", "0706716": "Kevin Rahm", "0018099": "John Ales", "0404656": "Patricia Bethune", "1534037": "John Sloman", "2765519": "Jared Gilmore", "2804947": "Marten Holden Weiner", "1318793": "Brian Elerding", "3163113": "Megan Albertus", "2909963": "Bill Blair", "3235031": "Craig Calman", "4328837": "Brody McMackin"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don makes a bold, desperate move to save Sterling Cooper Draper Pryce, but the other partners are furious with his actions. Meanwhile, Sally's psychiatrist suggests that she is improving, but Betty is skeptical.", "Sally is continuing on with her therapy sessions with Dr. Edna, who believes Sally is progressing so much that the frequency of her sessions can be reduced. However, Sally is also having unofficial therapy sessions with Glen Bishop, about which Betty is unaware. Betty feels the need to speak to someone herself about life, but doesn't want it under the guise of therapy sessions. She will really need to speak to someone after she makes a discovery, which in turn may set Sally's therapy back. Meanwhile, life at SCDP is not getting any better following Lucky Strike's departure. Although Don has an off the record meeting with Heinz arranged by Faye, they have the same opinion as all other potential clients: business is a possibility in six months if SCDP is still in operation. Beyond Lane's need to deal with the operational aspects of the the business such as payroll, none of the partners has a concrete proposal to get them out of their predicament. And an idea from Peggy to Don is dismissed as being unfeasible. Knowing that everyone on the outside sees fear and desperation at SCDP, Don takes a unilateral and bold measure. Whatever the result, Don sees that his life isn't all that bad in comparison to others after he has a not so chance encounter with an old friend.—Huggo", "SCDP is scrambling for new clients but are finding few takers with most potential clients waiting to see if they will survive as a firm. Each of the partners is required to put in new capital to keep their bank happy but it puts Pete Campbell, who doesn't have the money, in a predicament. Fed up with the status quo and inertia around him, Don takes a drastic step without first consulting his partners. He's also surprised when he runs into Midge in his office building but it's not quite what it at first seems to be. Sally's therapy is progressing well and her psychiatrist recommends reducing her sessions, which makes Betty uncomfortable. When she learns that Sally has been sending time with Glen Bishop, she decides it's time for them to move.—garykmcd"], "genres": "N/A", "imdbID": "1615659", "rating": 8.8, "votes": 2682, "number_of_episodes": 92}