{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0615063": "Joel Murray", "0936403": "Ray Wise", "0120648": "Cara Buono", "0664175": "Jessica Paré", "0272474": "Jay R. Ferguson", "0834960": "Danny Strong", "0389324": "Charlie Hofheimer", "0514228": "Peyton List", "0541082": "Zosia Mamet", "0706716": "Kevin Rahm", "0640382": "Joe O'Connor", "0789972": "Sheila Shaw", "1204858": "Tommy Dewey", "0646351": "Larisa Oleynik", "0367087": "John Hartmann", "0860612": "Randy Thompson", "0257588": "Bradford English", "0184087": "Dale Waddington", "0173246": "Mark Colson", "2061039": "Chad Hall", "0873451": "Leo Trombetta", "3163113": "Megan Albertus", "2909963": "Bill Blair", "0118564": "Laura Buckles", "3608746": "Jessica Lee Wrabel"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["The partners try to keep their cool after they discover that Roger has lost their biggest account, Peter's wife goes into labor, and Don tries to convince Faye to compromise her ethics to drum up new business.", "Despite Peggy's less than friendly last encounter with Abe, the two begin a relationship following a chance social outing with Joyce. Stan can smell Peggy's resulting sexual energy. Unaware of Abe, Stan tries to exploit what he sees as Peggy's want for sex. And Trudy has gone into labor. But as Peggy states, when something good happens, something bad always happens. The bad is the rumor of Lucky Strike abandoning SCDP, which comes into the firm through the back door i.e. not from Roger, the one and only person in the firm dealing with that account. But once the rumor spreads amongst the partners, Roger does confirm the rumor but does whatever he can to hide the fact that he's known about Lucky Strike leaving for some time. The loss of this account potentially could mean the end of SCDP, especially if this news makes current and potential clients feel uncertain about SCPD's future. The partners try to put on a brave face to the staff, who are asked to be more diligent than ever with current accounts. This news has an affect on all staff, including in their personal life, and on Joan and Roger's relationship. Desperate times call for desperate measures as the partners try to exploit a grieving family, and Don tries to exploit a personal relationship. Despite Roger's denial of any wrongdoing with the account, he takes the brunt of the blame internally, which dampens the joy of a parcel waiting for him at home.—Huggo", "The principals at SCDP finally learn that they've lost the Lucky Strike account, though not from Roger Sterling but from Ken Cosgrove who runs into a competitor at dinner. With Lane Pryce away in London, an urgent meeting is called of all the partners but Roger plays dumb saying it's the first time he's heard of it. Everyone in the firm goes all out to find new accounts and make sure they keep the accounts they have. Roger meanwhile is feeling sorry for himself and confides in Joan. Peggy meanwhile hooks up with Abe Drexler and their relationship seems to have some promise. Trudi Campbell gives birth to a baby girl and Pete, egged on by his father-in-law, begins to question his future at the firm.—garykmcd"], "genres": "N/A", "imdbID": "1615658", "rating": 8.3, "votes": 2462, "number_of_episodes": 92}