{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0656335": "Sam Page", "1561547": "Melinda Page Hamilton", "0504185": "Susan Leslie", "2362068": "Caity Lotz", "1423270": "Erin Cummings", "1052666": "Will Janowitz", "0041280": "Remy Auberjonois", "1708795": "Bayne Gibby", "1820958": "Alexa Alemanni", "3014645": "Elaine Carroll", "1151401": "Gina Torrecilla", "0251179": "Liesl Ehardt", "3121372": "Brian Whelan", "3235031": "Craig Calman", "3735515": "Amanda Eby", "3016743": "Grant Christopher Maquet", "3936201": "Erika Maz"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don flies to Los Angeles to visit Anna before his New Year's vacation to Acapulco, but her bad news influences him to cancel his vacation and return to New York, where he discovers that Lane has problems of his own.", "Plans are being made for the New Year's break. Don, heading to Acapulco, makes a twenty-four hour stop in Los Angeles to visit with Anna, who's broken her leg which is in a cast. The two spend the day with Anna's grown niece, Stephanie. Alone with Stephanie at the end of the evening, Don tries to seduce her, but his seduction plans change when she gives him some sobering news. Don has to figure out what to do with the news before he leaves Los Angeles. Because of the news, Don changes his New Year's plans. Back in New York, Joan and Greg want to start a family, but have to find time when both are free. Lane denies her the two days she wants in January when Greg is off, after which she expects he will be headed to Vietnam at the completion of basic training. Lane's attempt to make it up to Joan which goes slightly awry and a mishap at home combined with the underlying stress of trying to find the time with Greg finally take their toll emotionally on Joan. And Lane was supposed to go back to England to spend time with his family, but for personal reasons decides to stay in New York to work instead, work which is his new grounding in life. He gets some unexpected company, the two who paint the town for January 1st, 1965, which provides Lane with some much needed distraction.—Huggo", "As the New Year approaches, several of the staff are planning holidays. Dick is planning a holiday in Acapulco but spends a day en route in Los Angeles with Anna Draper. Don learns some shocking news about Anna from her niece. Joan has a check-up with her doctor as she and Greg are thinking of starting a family. Her request for a few days off later in January to accompany Greg to Texas for his basic training is gruffly rejected by Lane Pryce. His attempt at an apology leads to even harsher words and a firing. On a drunken night out, Lane reveals a different side of himself.—garykmcd"], "genres": "N/A", "imdbID": "1615662", "rating": 8.7, "votes": 2915, "number_of_episodes": 92}