{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0822448": "Christopher Stanley", "0479917": "Deborah Lacey", "0656335": "Sam Page", "0696303": "Lawrence Pressman", "0664175": "Jessica Paré", "0120648": "Cara Buono", "0541082": "Zosia Mamet", "0490811": "Jack Laufer", "0542074": "Jon Manfrellotti", "2362068": "Caity Lotz", "2069987": "Cassandra Jean Amell", "2286966": "Jay Seals", "2765519": "Jared Gilmore", "2804947": "Marten Holden Weiner", "0115102": "Barbara Brownell", "0688495": "Kim Poirier", "4589890": "Andrea Dimity", "2744326": "Ian Novotny", "7044277": "Eddy Perez", "3746459": "Yael Shir"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don takes the kids to California and comes back with a surprise announcement. Meanwhile, Betty fires the kids' nanny before they move out of the old house over one questionable incident, and Peggy gets a shot at a new account.", "The staff at SCDP are taking their opportunities where ever they come. After Don's diatribe in the form of the advertisement in the New York Times against tobacco advertising, he and Pete have a meeting with the Board of Directors of the American Cancer Society for their business. It's not so much the advertising contract of a non-profit organization that they want but those of the businesses for which the board members actually work. They ask Ken to use some social connections to leverage some of that potential. And based on a social conversation Peggy has with Joyce, Peggy pounces on an opportunity for another contract, but has to work fast to get it. Within all these goings-on, Don is taking some time away from the office to take the kids to California, where he has to deal with some aspects of Anna's estate. But Betty, acting on an emotional impulse in the process of moving to a new house, thwarts Don's plans, for which he has to make some quick last minute adjustments to those plans. The result for Betty is a feeling of isolation. In California, Don, feeling emotional while thinking back to his friendship with Anna but also seeing his children and himself in a more relaxed setting and thinking about a comment from Faye about reconciling the Don and Dick sides of his life, also makes an impulsive decision which catches everyone in his life by surprise.—Huggo", "Don's full-page advert in the NY Times has drawn the attention of the American Cancer Society. SCDP is more interested in the Board's members than the Society itself and try to get Ken Cosgrove to use his social connections to drum up business. Ken makes sure they know exactly where his priorities lie. Don's trip to California seems to hit a bump in the road when Betty fires the children's nanny, Carla, who was going to accompany them. Carla's crime: she let Glen Bishop into the house to say goodbye to Sally. Don's solution to his problem is to ask his secretary Megan to accompany them. She turns out to be a natural with the children but the trip turns out to be a life-changing event for her and Don. With Don away, Peggy Olson learns of an opportunity for a new client and she and Ken Cosgrove set out to snag it.—garykmcd", "Opportunity arises for Don and Peggy.—AMC Publicity"], "genres": "N/A", "imdbID": "1615660", "rating": 9.0, "votes": 3098, "number_of_episodes": 92}