{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0608601": "Mark Moses", "1555340": "Alison Brie", "1668265": "Matt Long", "0272474": "Jay R. Ferguson", "0834960": "Danny Strong", "1561547": "Melinda Page Hamilton", "0003942": "Blake Bashoff", "0664175": "Jessica Paré", "0877252": "Myra Turley", "0913585": "Audrey Wasilewski", "0004405": "Jerry O'Donnell", "2362068": "Caity Lotz", "0375374": "Randee Heller", "1100405": "Rachel Style", "0400765": "Lorne Hughes", "0301045": "Steven M. Gagnon"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don deliberately delays returning an important call from California, because he knows it's bad news about Anna. Instead, he keeps himself occupied by forcing Peggy to miss her birthday dinner to pull an all-nighter with him for a client.", "It's May 25, 1965, the date of two milestones. First, it's the much anticipated heavyweight boxing rematch between Sonny Liston and Cassius Clay. All of the guys from the office are planning on watching the fight at the Loews movie theater, making a night out of it with dinner and drinks beforehand, with Roger and Don having work plans with the Ponds clients before the match. And second, it's Peggy's twenty-sixth birthday. She receives an initially intriguing birthday present from Duck, the present which she quickly realizes is less substantial than at first glance. But it ends up not being the greatest birthday for her when she and Don butt heads over the latest campaign for Samsonite, this argument for Peggy an extension of her recent negative feelings toward Don. But working on the campaign, which makes Peggy miss her birthday dinner with Mark (the dinner which for Mark is more important than he initially lets on) and Don miss both his work function with Roger and the fight, leads to a roller coaster of emotions for both Don and Peggy. The evening ends up being the first real intimate moment the two have spent with each other since Don visited Peggy in the hospital following her giving birth. The date also ends up being another milestone for Don, but one he would rather have not happened.—Huggo", "Everyone at the agency is looking forward to the Sonny Liston-Cassius Clay heavyweight championship boxing match. When Don receives a message from Stephanie in California to call him urgently, he knows the news about Anna Draper cannot be good. He continues to drink heavily - he's now seems to be drunk most of the time - and tries to focus on work rather than make the call. He's not too happy with what the creative team has come up with for the new Samsonite luggage campaign and so asks Peggy to stay on after work not realizing it's her birthday and she has a romantic dinner planned with her boyfriend. To make matters worse, Peggy doesn't realize that her boyfriend has invited all of her family as well and her eventual cancellation leads to a break-up.—garykmcd"], "genres": "N/A", "imdbID": "1615666", "rating": 9.7, "votes": 7030, "number_of_episodes": 92}