{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0822448": "Christopher Stanley", "1555340": "Alison Brie", "0120648": "Cara Buono", "0664175": "Jessica Paré", "1496294": "Darren Pettie", "0490811": "Jack Laufer", "1166613": "Naturi Naughton", "0792003": "William Morgan Sheppard", "0191631": "JD Cullum", "0761389": "Casey Sander", "0698727": "Ray Proscia", "0619365": "Rob Nagle", "0418012": "Jim Jansen", "0006721": "Susan May Pratt", "1305105": "Beth Hall", "2114358": "Brooke Newton", "1311890": "Brian Catalano", "3163113": "Megan Albertus", "9065119": "Cary Huff", "4388396": "Amie Meadows", "3584290": "Heather Rene Smith", "3608746": "Jessica Lee Wrabel"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don becomes frightened that his lie will be exposed when government agents question Betty about him, Lane has shocking news for his father when he comes to bring him home, and Joan considers having an abortion.", "SCDP's fortune's are on the upswing and Don is buoyed by that fact. Harry is getting him tickets to a Beatles concert, to which he is taking an excited Sally. And SCDP are in final negotiations with North American Aviation, whose marketing budget has been substantially increased. However, the contract with North America Aviation has some unforeseen consequences, the results which unnerve Betty, concern Pete who does whatever he can to handle the situation within his means albeit with some reservations, but most importantly threaten Don's entire future. As Don prepares for his family's security if he is taken down, the reality of the situation begins truly to sink in. With others in the office, Lane receives an unexpected visit from his father. The purpose of the visit is to bring Lane home to deal with his marital issues. But Lane has a particular reason for wanting to stay permanently in New York, which he has to decide whether to tell his father. And Roger and Joan's sexual indiscretion has an unplanned consequence: Joan is pregnant. They discuss what to do, with keeping the baby and passing it off as Greg's an option on the table. Roger receives news of another bombshell, this one of a professional nature, and one that may bring on another heart attack more than news of Joan's pregnancy.—Huggo", "Joan has some news for Roger Sterling and it's not the only bad news he gets when the head of Lucky Strike tells him their business relationship is over. Roger doesn't share the information at the next partners meeting. Don has a big surprise for daughter Sally when he tells her he has tickets for the Beatles concert at Shea stadium. Lane Pryce is expecting his son for a visit but has a surprise awaiting him when it's his father Robert who shows up. Lane takes him to the Playboy club but it's one particular bunny that he's interested in. North America Aviation is getting into the big leagues and expecting major government contracts. It's looking good for the agency as well, until two FBI agents show up at the Francis residence to do a background check on Don for a security clearance. Betty doesn't tell them anything but Don realizes his lifelong ruse may be coming to an end and has a panic attack.—garykmcd"], "genres": "N/A", "imdbID": "1615657", "rating": 8.7, "votes": 2634, "number_of_episodes": 92}