{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0615063": "Joel Murray", "1820958": "Alexa Alemanni", "0640382": "Joe O'Connor", "0120648": "Cara Buono", "0664175": "Jessica Paré", "0541082": "Zosia Mamet", "1668265": "Matt Long", "0389324": "Charlie Hofheimer", "0375374": "Randee Heller", "0789972": "Sheila Shaw", "1305105": "Beth Hall", "1960625": "Benjamin Scott Perry", "2049551": "Alexandra Ella", "1787491": "Abby Miller", "0007018": "Karimah Westbrook", "0160460": "Gil Christner", "2516127": "Murray Gershenz", "0068679": "Anne Bellamy", "1505314": "Elena Natalie Castro", "1248867": "Mary Pascoe Conway", "2883942": "Kelly Frazier"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Peter finds out that he will become a father, and has to break some bad business news to his father-in-law. Meanwhile an office focus group study for a client has some unintended personal consequences for Don.", "With the firm now handling the Ponds cold cream account, Pete is given the news that they have to let go of Clearasil - an account only half the size - despite Pete's connection to the account through his father-in-law, Tom. Pete is directed to tell Tom the news by the start of the next working day. However, Pete's news to Tom is overshadowed by news Tom has for Pete, which makes Pete forget about his task, at least for the time being. Once the news of what Tom told Pete makes the rounds at the office, everyone seems happy for Pete, with perhaps the exception of Peggy, who finds the news somewhat bittersweet. With Ponds, Fay - oops, Faye - holds a focus group with the younger secretaries of the firm. Don, Freddy and Peggy, viewing the focus group behind a two-way mirror, find the focus group illuminating, but for Don having to do with an issue not associated with the product. This revelation during the focus group leads to a frank discussion between Allison and Don. Meanwhile, Pete renews an acquaintanceship, while Peggy begins new friendships with Life magazine photo editor Joyce Ramsay, and her pop artist friends.—Huggo", "Peggy and Freddy continue to disagree on the best approach for marketing their new client, Ponds. They decide to hold a focus group with some of the secretaries in the office but Don's New Year's eve fling with his secretary Allison causes a stir. Pete Campbell is told that the agency will have to drop the Clearasil account as it creates a conflict with Ponds. Pete had lobbied his father-in-law to get that business and is reluctant to deliver the bad news but gets big news of his own in return. Peggy Olson is invited to a party with a slightly different bent and meets some interesting people. She's also affected by Pete Campbell's big news.—garykmcd"], "genres": "N/A", "imdbID": "1615663", "rating": 8.2, "votes": 2614, "number_of_episodes": 92}