{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0822448": "Christopher Stanley", "0479917": "Deborah Lacey", "0120648": "Cara Buono", "1668265": "Matt Long", "0706716": "Kevin Rahm", "0954253": "Nora Zehetner", "0793634": "Sab Shimono", "2319871": "Anna Camp", "0146941": "Patrick Cavanaugh", "0404656": "Patricia Bethune", "0805930": "Amy Sloan", "0790260": "Christopher Shea", "0375374": "Randee Heller", "2765519": "Jared Gilmore", "1318793": "Brian Elerding", "0699243": "Timi Prulhiere", "0813157": "Michael Sollenberger", "0003457": "John Henry Canavan", "2009056": "Akie Kotabe", "0387521": "Keisuke Hoashi", "3235031": "Craig Calman"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don is forced to compete with a cocky upstart rival for a potential account with Honda motorcycles, but Roger's prejudice causes unexpected problems. Meanwhile Betty considers a psychiatrist for Sally because of her behavior.", "The general scuttlebutt within the Madison Avenue advertising world is that Ted Chaough is the next Don Draper, and that Ted's firm, Cutler Gleason & Chaough (CG&C), is stealing all the accounts from Sterling Cooper Draper Pryce (SCDP), the latest being Clearasil. Although not quite the truth, the perception that CG&C is the up and coming ad agency may make life tougher for an already struggling SCDP. Pete has connections for what may be the next big account up for grabs, Honda Motorcycles, worth $3 million in potential billings. Don wants everyone dealing with the account at SCDP to brush up on their Japanese etiquette as the leg up for the firm in nabbing the account. Ted lets Don know that CG&C is also in the running for the lucrative business. Everyone in the know in the ad world seems to want the account, except for Roger, who has strong remembrances of his time in the last world war. When Roger makes a move that may jeopardize the account before they even get it, Don comes up with what he thinks is the only way to salvage their chances, while making the competitors look bad. Meanwhile, Sally has been acting up more of late, first with one parent, and then with the other, which places Don and Betty on worse terms than they were before. With Henry added to the mix, they individually have differing views of what should be done to deal with Sally's issues. Betty, with Henry's advice, has the final say.—Huggo", "Pete Campbell may have struck gold again when he hears that Honda is looking for a new ad agency. He manages to get them on the short list for an interview with company officials but Roger Sterling's view of the Japanese - not to mention his rudeness to them when they visit the office - virtually sinks them. It's left to Don to pick up the pieces and he comes up with a clever plan that he hopes will not only repair the damage Roger has done but get rid of a pesky competitor at the same time. Don's private life continues to be in turmoil. With his two older children visiting, he leaves them in the hands of a babysitter only to have 10 year old Sally lash out. A second incident at a friend's sleepover convinces Betty that Sally needs professional help and enlists the aid of a psychiatrist.—garykmcd"], "genres": "N/A", "imdbID": "1615664", "rating": 8.6, "votes": 2742, "number_of_episodes": 92}