{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0120648": "Cara Buono", "0664175": "Jessica Paré", "0541082": "Zosia Mamet", "0913175": "David Warshofsky", "0389324": "Charlie Hofheimer", "0272474": "Jay R. Ferguson", "0375374": "Randee Heller", "1197231": "Christopher Gehrman", "0606574": "Grinnell Morris", "1305105": "Beth Hall", "0072262": "Sarah Benoit", "1484068": "Kevontay Jackson", "4086244": "Camilla Tar", "3420500": "Andrew James Scott"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Sally makes an unwelcome surprise visit to the office to see Don, Peggy tries to stop an acquaintance from publishing an article that could get her in hot water, and Roger Sterling tries to reconnect with Joan.", "Emotional issues are infiltrating life at the office. An incident with Sally causes Don some problems, both because of the issue itself and how it affects his professional and now budding personal relationship with Faye. Sally and Don's life in combination with this issue is not made any easier with Betty's take on it. Although hiding it, Joan is feeling vulnerable with news that Greg is being sent to Vietnam following his stint in basic training. Roger wants to be a support to Joan, and admits that his support is partly for his own lustful wants for Joan although he doesn't expect anything to happen with her. But an additional stressful situation which Roger and Joan face together may change what happens or doesn't happen between them. And Peggy is being wooed by Joyce's friend, the socially conscious Abe Drexler. Abe's attempts to get into Peggy's good graces go slightly awry, and may even get her fired if a gift he gives her, which was supposed to flatter her, is made public. But Peggy is affected by that gift and her discussions with Abe, especially in relation to her work with Fillmore Auto Parts, a company that does not hire blacks in the south. On top of all these issues, another incident at the office concerning Miss Blankenship surprises everyone but is one that has the greatest emotional effect on Bert.—Huggo", "It's a hectic few days for several people at CSDP. Don is thrown for a loop when 10 year-old Sally shows up at the office. She simply got on a train and went into New York without any money and was 'rescued' by a good Samaritan who made sure she got to the office okay. He asks Faye Miller to help him out but it may have a serious impact on their relationship. Peggy meanwhile is set up with Abe Drexler, whom she'd met at a party. They hit it off pretty well but when talk turns to politics, she's not sure their on the same wavelength. He's particularly concerned about her latest client who refuses to hire African-Americans in the South. Her attempt to raise the issue at the office falls flat. Don's secretary Miss Blankenship, who had been Bert Cooper's secretary for many years before that, has one last surprise for everyone. Joan is upset to learn that her husband will be going straight to Vietnam from his basic training. Roger's attempt to be extra nice to her is misunderstood and it all gets out of hand.—garykmcd"], "genres": "N/A", "imdbID": "1615668", "rating": 8.8, "votes": 2889, "number_of_episodes": 92}