{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "0822448": "Christopher Stanley", "1668265": "Matt Long", "1423270": "Erin Cummings", "2319871": "Anna Camp", "0003942": "Blake Bashoff", "0242405": "Pamela Dunlap", "0490811": "Jack Laufer", "1510136": "Chris McGarry", "0674052": "Ron Perkins", "0058692": "Paul Bartholomew", "1820958": "Alexa Alemanni", "2765519": "Jared Gilmore", "0002773": "Norma Maldonado", "1814480": "Veronica Taylor", "1816558": "J. Michael Silver", "0188453": "Alyson Croft", "0480563": "Cathy Ladman", "0088797": "Sean Blodgett", "3834442": "Aidan Miner", "1907725": "Jennifer Riker", "3235031": "Craig Calman", "1423978": "Vanessa Ross", "3608746": "Jessica Lee Wrabel"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["The new firm is struggling for business, so Peter and Peggy resort to a cheap publicity stunt to lure a client. Meanwhile, Don's personal problems and an unflattering newspaper interview puts his and the firm's image in jeopardy.", "The new Sterling Cooper Draper Pryce has been in business for one year, and it as a business is still floundering. They still have Lucky Strike as their big account, but all other clients account for a small proportion of total revenue. For every new innovative campaign they do, such as the recent television commercial for Glo-Coat, they have problems with another client. For example, Peggy, Pete and Joey are working on a campaign for Sugarberry Ham, and they feel they need to come up with a publicity stunt to replace the non-existent media budget, the stunt which they don't clear with Don and which goes slightly awry. And Don refuses to compromise his creative stance to kowtow to potential new clients. The company is housed in a small office that is not well furnished - it doesn't even have a conference table, the circle of chairs acting as the conference area they tell their clients is to foster dialogue. Don is being interviewed for Ad-Age Magazine, which the other partners trust will increase their exposure but the interview for which Don takes lightly. On the personal front, Don is living in an apartment in town, while Betty and Henry, now married, are living in the Draper house. Life for both Don and Betty personally is not perfect. Don is resisting any notion of a long term relationship, and is treating sex as something other than a loving act. And Betty, who should now be out of the house as per the divorce agreement, hasn't even started looking for alternative housing yet. On top of that, Sally is having problems adjusting to Henry's extended family, Henry's mother, who in turn, is having her own problems with Henry's new instant family.—Huggo", "The new advertising firm of Sterling, Cooper, Draper and Pryce is up and running. They now have office space and a reduced staff from their previous enterprise but have managed to pull in some accounts and are struggling to make a go of it. Don is interviewed by an industry magazine for a profile on him but doesn't take the opportunity to promote the firm or any of their clients. Realizing he screwed up, he decides to do something about it. Peggy Olson and Pete Campbell decide to pull a publicity stunt to try and get a local firm to buy more advertising. They decide not to tell Don about it but Peggy is left with little choice when she has to bail the actors they hired out of jail on Thanksgiving. Don is now living alone in a downtown apartment with Betty still living in their old house. There is still a good deal of anger on both sides of the relationship however.—garykmcd"], "genres": "N/A", "imdbID": "1615656", "rating": 8.5, "votes": 2926, "number_of_episodes": 92}