{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0822448": "Christopher Stanley", "0615063": "Joel Murray", "0479917": "Deborah Lacey", "1820958": "Alexa Alemanni", "1668265": "Matt Long", "0003942": "Blake Bashoff", "0120648": "Cara Buono", "0043891": "John Aylward", "0664175": "Jessica Paré", "1496294": "Darren Pettie", "0514228": "Peyton List", "0716438": "Laura Regan", "0954253": "Nora Zehetner", "2765519": "Jared Gilmore", "1305105": "Beth Hall", "2804947": "Marten Holden Weiner", "3714908": "Marcus Kiehl", "2935933": "Veronica Barriga", "2909963": "Bill Blair", "1892728": "Matt Cinquanta", "4328837": "Brody McMackin", "1339748": "James Pomichter", "3608746": "Jessica Lee Wrabel"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Freddy returns with a valuable new client, the firm reluctantly throws a Christmas party for its most important client, and Don prepares for his first Christmas away from his children.", "The Christmas season is in full swing, but that only compounds the problems for Sterling Cooper Draper Pryce. Feeling the company still financially insolvent, Lane will only allow a meager office Christmas party, with no spouses or partners. Roger makes a unilateral decision to change that directive from Lane to keep their one major client, Lee Garner Jr. of Lucky Strike, happy. Roger wants the company to appear cheerful and busy to those in the outside world that matter. The company's fortune may change for the better when ex-Sterling Cooper fired employee Freddy Rumsen, now clean and sober for sixteen months, walks through their doors, he who brings with him a lucrative contract with Pond's cold cream. One of his two major stipulations is that he comes with the contract. Peggy, who has been Freddy's biggest supporter in the past, may regret what she wished for as she and Freddy butt heads over the concept for Pond's. Also to assist in improving the company's fortunes, Bertram enlists the help of an old friend, the head of marketing research company, to provide their services, which doesn't sit well with Don for personal reasons. Don in general isn't feeling much in the Christmas mood, he who has been drinking more than usual over the thought of not spending Christmas with his kids. He looks for female companionship wherever he can find it, which may end up not being in his best interest or that of the women involved. Sally, too, is feeling sad not only over not seeing her father more, but by still living in the family home with his memory. Her old friend, Glen Bishop, takes unilateral action to help her out with this problem. And Peggy, in a developing relationship with Mark Kerney, isn't totally forthright with him about her past concerning their future. Peggy's actions are in light of both her short and long term wants, the short being primarily not to be alone on New Year's Eve.—Huggo", "It's Christmas-time and business is still tight at SCD&P. Lane Pryce has ordered strict expenditure controls and as a result, the Christmas party isn't going to be much of an affair this year. That is until their biggest client, the head of Lucky Strike that provides over two-thirds of their income, announces he wants to attend and is expecting a big bash. Don is faced with a tricky situation the day after the party. Don walks out of a presentation by a marketing firm that thinks they can improve the agency's performance; Don thinks it's all nonsense. When one-time colleague Freddie Rumson walks in with a $2 million account for Ponds cold cream, he's back on board. He's assigned to work with Peggy Olson but his old fashioned ways don't sit well with her. Sally's friend Glen leaves a special present for her at the house.—garykmcd"], "genres": "N/A", "imdbID": "1615661", "rating": 8.2, "votes": 2641, "number_of_episodes": 92}