{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "2656869": "Mason Vale Cotton", "1534037": "John Sloman", "3500582": "Teyonah Parris", "1133651": "Ben Feldman", "0242405": "Pamela Dunlap", "0855133": "Adria Tennor", "0741642": "Robin Pearson Rose", "0578833": "Stephen Mendel", "2201055": "Hayley McFarland", "1757373": "Ken Barnett", "1568793": "Sophi Bairley", "0002985": "Mari Weiss", "1270217": "Ryan Smith", "1363951": "Lyn Mahler", "4539804": "Nicholas de Graffenreid", "4212479": "Lena deLoache", "4629678": "Talyn Edelson", "2049551": "Alexandra Ella", "6487921": "William Evans", "9065119": "Cary Huff", "4971298": "Evan Londo"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Betty discovers that she has a tumor, Peggy interviews an obnoxious young copywriter for a job, the firm tries to get the Mohawk Airlines account back, and Don and Harry try to court The Rolling Stones to record a commercial.", "Betty has gained some weight, which she can't shed for whatever reason, which in turn is making her depressed. Or is her depression the cause of emotional eating which is reason for her weight gain? Going to see a doctor for a prescription for diet pills, the doctor instead finds a growth on her thyroid, which may be cancerous and which may be the cause of her weight gain. With Henry not around when she receives the news, she turns to Don for emotional support. This news affects the Draper household. As Betty begins to think about her mortality, she also begins to understand that this tumor is a no win situation for her. Meanwhile, at SCDP, Pete is able to secure the Mohawk Airlines account once again, which is a small coup for the company. Pete begrudgingly assigns the account to Roger, since the Mohawk executives know Roger, and both sides will treat the account like their best drinking buddy. But they need to hire a dedicated copywriter for the account, someone creative but who also fits into that old boys network. Peggy is assigned to find that person. The end product of her search, Michael Ginsberg, brings her and Roger to a common point in their careers. The Heinz executives come up with the idea to rework The Rolling Stones' song \"Time Is on My Side\" for a commercial to target the youth market. Despite Don thinking it a bad idea, he indulges the client, with him and Harry the footmen in trying to set up a meeting with the band at one of their concerts. Trying to meet the band also makes Don and Harry quite aware that they aren't as young as they used to be. And SCPD's mock \"equal opportunity\" ad results in Don getting a new secretary, a black woman named Dawn.—Huggo", "Betty Francis is depressed at her weight gain and her inability to shed her extra pounds. She visits her doctor for diet pills but his examination reveals a growth in a neck gland. She assumes the worse and undergoes the necessary tests. At the lab she meets an old acquaintance who has terminal cancer. Don takes the news hard but Megan tells him to remain optimistic. At the office, Pete Campbell reels in the Mohawk airlines account but tells Roger Sterling he's to be their day to day contact. Pete again makes a point of rubbing Roger's nose in it. With the new account, Peggy Olsen is tasked with hiring a new copywriter and she is very impressed with Michael Ginsberg's portfolio. After she meets him though, she's not so sure. Don and Megan have dinner with Raymond Geiger and his wife from Heinz who suggest that they get the Rolling Stones to make a commercial. It leads to Don and Harry Crane spending an evening trying to meet the rockers.—garykmcd"], "genres": "N/A", "imdbID": "2049169", "rating": 7.8, "votes": 2556, "number_of_episodes": 92}