{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "3500582": "Teyonah Parris", "1133651": "Ben Feldman", "0656335": "Sam Page", "0261452": "Christine Estabrook", "0242405": "Pamela Dunlap", "0541082": "Zosia Mamet", "0715295": "Alyson Reed", "0724224": "Lou Richards", "0000749": "Mädchen Amick", "2286886": "Stephanie Drake", "0675278": "S.E. Perry", "2560926": "Matt Biedel", "4054836": "Zac Goodspeed", "2293418": "Nicholas Cutro", "2656869": "Mason Vale Cotton", "4971298": "Evan Londo", "5004387": "Johnny Love", "5809057": "Lisa Y. Sheeler", "3089710": "Jared Winkler"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don runs into someone from his past. Joan makes a decision, and Roger gives Peggy extra work.", "Three news items affect the SCDP staff and their families. The first news item is the rape and murder of nurses in Chicago. Although Henry's mother Pauline, who is babysitting Sally while Henry and Betty are on a business trip, doesn't believe such news stories should be heard or read by someone of Sally's age, it ultimately becomes a meeting point for the two in what is otherwise an antagonistic relationship. The second news items is the general race riots taking place across the country. This news item initiates a meeting point between Peggy and Dawn, the two seeming outsiders at SCDP. And the third news item is an airlines mechanics strike which has a different affect on Mohawk than it does on its larger competitors. As Mohawk is still operating through the strike, they continue on with their other business such as their advertising. This news catches Roger off guard, he who has to think fast or get someone else to think fast to get a pitch ready from scratch over the weekend. Meanwhile, Michael pulls a stunt at a client pitch meeting which threatens his job. Joan is eagerly awaiting the arrival home of Greg, who has completed his tour of duty. Greg comes home with some unexpected news which results in Joan making a decision of her own on the matter. And Don is chastised by Megan for once again being approached by one of his former or perhaps not so former paramours, this time a woman named Andrea. Don, who has a nasty summer cold, believes he has dealt with the issue of Andrea, especially if he can't hold off his adulterous urges.—Huggo", "Struggling with the flu, Don is taken aback when someone he used to see flirts with him in the elevator with Megan standing beside him. Megan doesn't take it well and he assures her that all of that is in the past. At work, Roger Sterling pays Peggy Olson to work late on a Friday night to come with a campaign for Mohawk Airlines who they are seeing on Monday morning. She finds someone sleeping on the couch in Don's office. New employee Michael Ginsberg comes up with a good campaign for a shoe company but almost blows it at the presentation. Joan meanwhile is thrilled that her husband Greg is finally coming home on leave. He has news for her that forces her to make a difficult decision.—garykmcd"], "genres": "N/A", "imdbID": "2049170", "rating": 8.6, "votes": 2790, "number_of_episodes": 92}