{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0514228": "Peyton List", "0001110": "Embeth Davidtz", "0261452": "Christine Estabrook", "0164068": "Jeff Clarke", "1046714": "Brian Scolaro", "1305105": "Beth Hall", "2049551": "Alexandra Ella", "2286886": "Stephanie Drake", "0113124": "Bill Lee Brown", "1530992": "Dennis Apergis", "3303130": "Maranda Barskey", "2051771": "Sarah Beth Shapiro"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Megan is hurt by Don's negative response to the surprise party, Lane finds a missing wallet in a cab, Joan makes an unexpected visit to the office, and Pete makes a play for a bigger office.", "Joan feels that she may be seen as dispensable from Sterling Cooper Draper Pryce when her mother shows her an item in the newspaper, which in reality is solely SCDP's dig at a rival ad agency. Joan decides to make an unexpected visit to the office with Kevin in tow to find out first hand if she indeed has a future at SCDP. That item in the newspaper has another unintended consequence for the company. Another item all the talk at SCDP is Megan's birthday gift to Don, some of that talk which gets a little out of hand. That talk becomes a problem for Don and Megan in managing both a professional and personal relationship. What is foremost on Pete's mind is gaining more control at the company, which includes a larger office to show clients that he does wield authority at SCDP. He also figures out how Roger has been finding out about his meetings with clients and how he can get Roger to stop doing so. And Lane finds a wallet in a taxicab. Despite the fact that there is a lot of money in the wallet, Lane is more interested in something else in the wallet.—Huggo", "Megan isn't speaking to Don after he takes her to task over the party. She simply can't believe someone would be upset over a surprise party. They're still talking about the party at the office and Harry Crane proves himself particularly adept at putting his foot in his mouth. Pete Campbell is still chafing at the perceived lack of recognition of his contribution and asks for Roger Sterling's office. Roger won't hear of it but tries another solution. Pete for his part has a solution for Roger Sterling constantly snooping in his agenda. Joan starts to worry about her job when she sees an ad in the NY Times. She visits the office only to learn from Lane Pryce that the finances are falling apart without her. Lane meanwhile tries to return a wallet he's found in a taxicab and is intrigued by the young woman who takes his call.—garykmcd"], "genres": "N/A", "imdbID": "2049168", "rating": 8.5, "votes": 2688, "number_of_episodes": 92}