{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0514228": "Peyton List", "0088127": "Alexis Bledel", "0266697": "Richard Fancy", "0573896": "Kate McNeil", "2656869": "Mason Vale Cotton", "1133651": "Ben Feldman", "0164068": "Jeff Clarke", "0266611": "Mark Famiglietti", "0055888": "Eileen Barnett", "2948887": "Meghan Bradley", "1387907": "Gabrielle Wagner", "2547061": "Natalie Nicole Gilbert", "1305105": "Beth Hall", "9065119": "Cary Huff", "3087463": "Robert Robbins"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["A depressed Betty tries to make things uncomfortable for Don and Megan, Roger tries to take out some secret weapons for a meeting with a prospective Jewish client, and Don makes a snap judgment that angers the creative department.", "Betty is going to Weight Watchers to deal with her weight issue. Whether she wants to admit it or not, she is aware that her envy of Megan is part of her unhappiness and associated eating and weight gain. After an incident with Megan (of which Megan herself is unaware), Betty decides to use Sally as a pawn, which places Sally, Don and Megan in the middle of Betty's game, of which only Don seems aware. At the office, Roger is hustling for the Manischewitz wine account to show that he, beyond financing the company, is still useful in a day-to-day sense, and to show that Pete, who has lined up a potential major New York Times article featuring SCDP, is not the SCDP wunderkind he makes himself out to be. Roger's plan, the creatives for which he plans to pawn off as his own to the clients, includes the use of both Jane and Ginsberg, which doesn't sit well with Peggy or ultimately with Jane. And Don decides to go back into the creative realm, coming up with an idea at a brainstorming meeting with copywriters Peggy and Ginsberg on the Sno Ball account. Don ultimately shows how competitive he is against even those within the SCDP team.—Huggo", "Don decides to try his hand at coming up with an ad campaign for Sno Ball and finds himself in competition with Michael Ginsburg. Don has the upper hand however, always a good learning experience for a junior employee like Michael. Roger Sterling asks Michael to come up with some ideas for Manischewitz wines. Peggy Olson is less than pleased when she hears about it. A overweight Betty is attending Weight Watcher's but not having a great deal of success. She goes out of her way to create trouble for Don and Megan by telling Sally about Don's first wife, Anna. Megan ensures Don doesn't blow a fuse and even Sally, after a small hissy fit, doesn't let her mother get away with it.—garykmcd"], "genres": "N/A", "imdbID": "2049175", "rating": 8.0, "votes": 2417, "number_of_episodes": 92}