{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0001110": "Embeth Davidtz", "2656869": "Mason Vale Cotton", "0137114": "Timothy Carhart", "2804947": "Marten Holden Weiner", "0936403": "Ray Wise", "0157297": "Michael Chieffo", "2948887": "Meghan Bradley", "1237088": "Sadie Alexandru", "0461639": "John Knox", "1460787": "Henry Dittman", "0093753": "Roberto Bonanni", "2547061": "Natalie Nicole Gilbert"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Lane's entire world comes crashing down after getting busted for forging Don's signature on a check, and Sally experiences an awkward rite of passage while spending the weekend with the Drapers.", "Don learns about Lane's forged check. Don's subsequent discussion with Lane and Don's unilateral decision about what to do about Lane's fraud without telling any of the other partners about the fraud itself lead not only to Lane making his own decision about his future but also Don beginning to think more about SCDP's future as a whole. Don's thoughts about going after bigger accounts leads to even more maneuvering in-house, this time affecting Ken and Pete most directly. Meanwhile, the Francises are planning on going on a weekend ski trip, on which Sally doesn't want to go. An exasperated Betty decides that if Sally is going to be a bother, she will send Sally to stay with Don and Megan regardless of what Don and Megan want. Sally's visit with Don and Megan adds to more strain between Don and Megan as they go about their own lives over the course of Sally's stay - Don's having to do with the work issue around Lane and its aftermath - which Sally tries to use to her advantage in testing the waters in her relationship with Glen, who she wants to be her boyfriend. But an incident while with Glen brings Sally closer to her mother.—Huggo", "The partners have a decision to make when Jaguar proposes a different way for the ad agency to bill them. It leads Bert Cooper to open the mail and find the canceled check Lane Pryce had forged. He speaks to Don who says he'll take care of it. Don calls Lane into his his office and immediately asks for his resignation. Lane is understandably upset but no one is prepared for what happens next. Don also decides he's tired of dealing with only small accounts and gets Roger to arrange an appointment with Dow Chemicals. Sally meanwhile spends the weekend with Megan and Don but something unexpected happens while she's out with her friend Glen.—garykmcd"], "genres": "N/A", "imdbID": "2049166", "rating": 9.4, "votes": 3777, "number_of_episodes": 92}