{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0001110": "Embeth Davidtz", "3500582": "Teyonah Parris", "0646351": "Larisa Oleynik", "0402408": "David Hunt", "2982211": "Amanda Bauer", "2875233": "Parker Young", "2044920": "Cherilyn Wilson", "0072126": "Eve Gordon", "0048789": "Nan Baker", "2467078": "Ted Ferguson", "9065119": "Cary Huff", "3087463": "Robert Robbins", "4432222": "Mark Roman"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["While Lane needs some help closing with a potential new client, Peter begins to crack under the pressure of both his home life and work life.", "Lane is trying to break ties with his homeland. That doesn't stop Rebecca from making friends for her and Lane with the Bakers, compatriots from England. Lane does however feel that he can take advantage of this friendship with Edwin Baker by bringing his company's business, Jaguar, into SCDP, as Jaguar is trying to enter the US market. Despite being the sole Brit in the office and thus the logical choice in his own mind to deal with a fellow Brit, Lane has no experience in account management. The process of Lane learning how to become an account manager and him being the reason SCDP gets Jaguar's almost seemingly surefire account makes Lane evaluate his professional life. Meanwhile, Pete is feeling restless in his marriage, one result from which is eying a high school senior in his driver's education class. Life at work is different as he feels he is gaining more power in the office. A small measure of that office power is being able to convince a reluctant Don and Megan to attend a small dinner party at his and Trudy's suburban home. Pete's issues and Lane's issues come to a meeting point, the resulting incident which excites those who are witness to it. Meanwhile, Ken is continuing his writing, which he is getting published under a pseudonym. Ken wants to keep this part of his life a secret from those at SCDP, which may be difficult to do as he confesses to Peggy, who sees him with a possible publisher, and as Cynthia is more than happy to divulge her husband's success at any opportunity. This writing may become a problem for Ken in his life at SCDP.—Huggo", "It's the summer of 1966 and Lane Pryce is pleased as punch when a fellow ex-pat Brit, Edwin Baker, tells him that his employer, Jaguar, is moving into the US market and they need an ad agency. The other partners are equally impressed though Pete Campbell plays it down, much to Lane's annoyance. Lane, with no experience, also decides that he want to lead this account and although Roger Sterling gives him a few tips, his dinner with Baker doesn't provide the results he'd hoped for. Pete, Roger and Don take Baker out for dinner and when the the Brit expresses an interest in having a bit of fun afterward, they all end up in a bordello. It all goes bad for the agency and to fisticuffs the next day at the office. Pete Campbell seems to be at a crossroads in his life, unhappy in his marriage and at work. At a dinner party, Ken Cosgrove's wife Cynthia tells everyone about his secret career writing science fiction ad fantasy stories for magazines. Roger has some definite advice for him.—garykmcd", "Lane strikes up an interesting friendship. Pete entertains guests.—AMC Publicity"], "genres": "N/A", "imdbID": "2049171", "rating": 9.0, "votes": 3398, "number_of_episodes": 92}