{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0514228": "Peyton List", "0001110": "Embeth Davidtz", "2656869": "Mason Vale Cotton", "0389324": "Charlie Hofheimer", "0646351": "Larisa Oleynik", "0490811": "Jack Laufer", "0261452": "Christine Estabrook", "1534037": "John Sloman", "0726164": "Matt Riedy", "0164068": "Jeff Clarke", "1046714": "Brian Scolaro", "1305105": "Beth Hall", "2049551": "Alexandra Ella", "4718905": "Irving Green", "2948887": "Meghan Bradley", "0256258": "Taylor Emerson", "1594244": "Steven Lee Allen", "3329229": "Devin Skrade", "1107495": "Brian Jack", "2257388": "Dominic Dierkes", "0507531": "Mary Margaret Lewis", "1499734": "Algerita Wynn", "1200036": "Angela Sargeant", "2286886": "Stephanie Drake", "0113124": "Bill Lee Brown", "1530992": "Dennis Apergis", "4971298": "Evan Londo", "4708968": "Marc Abbink", "3235031": "Craig Calman", "6979296": "Jacob Tittl"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Megan throws Don a surprise birthday party, the war between Pete Campbell and Roger Sterling intensifies, and new mother Joan begins to wonder if she still has a job when she's ready to come back.", "The finances at Sterling Cooper Draper Pryce are stable, although not overly flush. There are some staff changes, including Megan, now Mrs. Draper, moving into a junior creative position. But most of those staff changes are the result of Joan being on a temporary leave having just given birth. With Greg still in military service, Joan has some assistance from her visiting mother, who often doesn't provide Joan with the support she wants or needs. One change that Pete, as account manager, would like to see is Roger having less control and say in the day to day operations, especially in front line dealings with customers. Pete is especially bothered when Roger shows up unannounced and uninvited to client meetings. Meanwhile, Don's fortieth birthday is approaching. Going through his Rolodex for potential invitees, Megan, at the last minute, plans a surprise birthday party for him, despite advice from Peggy that Don doesn't like such surprises. At the party, Megan's gift to Don causes a bit of an uproar, especially among the Draper's work colleagues.—Huggo", "Don Draper and Megan are now married. She's still working at Sterling Cooper Draper Pryce, in the creative department under Peggy Olson. She decides to throw a surprise party for Don's 40th birthday but he is aghast and hates it. Everyone except Don seems to have had a good time and the newlyweds have a serious argument about it. For his part, Roger is concerned about his standing in the firm since the loss of the Lucky Strike account. He makes a point of dropping in on Pete's meetings with clients. Joan Harris has given birth to a baby boy and has taken some time off from work. Her mother is visiting to help out but Joan is exhausted from lack of sleep. Peggy makes her pitch to Heinz on a new campaign for baked beans. It doesn't go very well.—garykmcd"], "genres": "N/A", "imdbID": "2048448", "rating": 8.5, "votes": 2983, "number_of_episodes": 92}