{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0615063": "Joel Murray", "1555340": "Alison Brie", "3500582": "Teyonah Parris", "1133651": "Ben Feldman", "0261452": "Christine Estabrook", "0706716": "Kevin Rahm", "0059630": "Gary Basaraba", "1065218": "Jordan Feldman", "1305105": "Beth Hall", "2948887": "Meghan Bradley", "1193110": "Mark Kelly", "0517106": "Marty Lodge", "1318793": "Brian Elerding", "1929663": "Patrick Brown", "3800533": "Mary Czerwinski", "2734923": "Gregory George Frank"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Peter asks Joan to make an unspeakable sacrifice to help secure the Jaguar account, Peggy prepares to make a drastic move in response to Don's treatment, and Megan's acting career begins to create tension with her and Don.", "Tension is rising at the firm as the date for making their pitch to Jaguar approaches. Don and most of the creative team are huddling in the conference room trying to get it right. Another complication arises when one member of the three man panel who will select the winning agency makes it clear that if they want any chance of winning, it will be necessary for Joan to spend the night with him. Joan scoffs at the idea but in the end demands a high price for her cooperation. Peggy Olson meanwhile decides the time may be right to get a job elsewhere. Freddy Rumsen encourages her and helps her get the word out. Megan meanwhile is excited at getting a call-back for a stage play but Don is only now realizing what that implies.—garykmcd", "Most of those at SCDP are preoccupied by the upcoming presentation for the Jaguar account, that is except Peggy who has been given the task of managing all the other accounts in the interim. Not working on the high profile and lucrative Jaguar account and an incident with Don makes Peggy turn to an old colleague for advice, which in turn makes her reconsider her future at SCDP. As the Jaguar creative team - which consists of Don, Ginsberg, Stan and a few freelancers - brainstorm for ideas, which don't come easily, Pete and Ken schmooze with Herb Rennet, Jaguar's head of dealerships and one of three on the advertising account selection committee. Herb implies that SCDP will get the account if Joan as his plaything is thrown into the package. Pete takes this information directly to Joan and to the partners, which he tries to spin in a manner of Joan doing whatever is required for SCDP to get the account. Each of the partners is affected differently by the news either by their own relationship with Joan or their own personal situation. Joan, on the other hand, has to decide how offended she will ultimately be by the request even made of her. On the home front, Megan's fledgling acting career is again a potential sticking point in her and Don's relationship.—Huggo"], "genres": "N/A", "imdbID": "2049165", "rating": 9.4, "votes": 3944, "number_of_episodes": 92}