{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0088127": "Alexis Bledel", "1133651": "Ben Feldman", "3500582": "Teyonah Parris", "0164068": "Jeff Clarke", "0368172": "Dennis Haskins", "1065218": "Jordan Feldman", "0867020": "Doug Tompos", "0789231": "James Sharpe", "1402335": "Molly Hawkey"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Megan convinces Don that she should give up her job at the firm so that she can pursue a career on Broadway, while Peter has a fling with an acquaintance's wife.", "Megan has been lying to her colleagues, including Don, about her whereabouts at certain times of the day. She is caught in the lie by both Don and Peggy. She is able to make up a credible enough excuse to Don, but Peggy confronts her on it. Based on that discussion, Megan decides to come clean to Don about what she's been doing. Don's reaction surprises her, which leads to a major change at SCDP. But Don's true reaction may actually be closer to what she had anticipated based on an encounter Don has with Peggy. Meanwhile, Pete is still feeling more fulfilled at work as clients, without even having met him, are giving him gifts. But he is feeling more and more restless at home, especially after he learns that his train commuting colleague Howard Dawes has embarked on an affair in the city. Taking a cue from Howard and given the opportunity, Pete embarks on a wannabe affair of his own, the \"wannabe\" part based on the insecurities of the other party.—Huggo", "Peter Campbell is surprised to learn from Howard Dawes, with whom he commutes daily on the train, that he now has a girlfriend. Howard even managed to convince his wife that they should keep an apartment in the city. Pete's not sure how he gets away with it but when when he gets off the train one evening, he meets Howard's wife, Beth. She's locked herself out of her car and with no Howard in sight, he gives her a ride home. They also end up making love though she's less receptive to his subsequent pursuit of her. At the office, Megan is keeping a secret from Don but finally breaks down and tells him the truth - she has secretly been going on casting calls and wants to pursue her dream of being an actress. She repeats that she hates the advertising world, despite her obvious knack for it. Peggy Olson for one doesn't understand and while Don supports Megan's choice, he too doesn't quite get it.—garykmcd"], "genres": "N/A", "imdbID": "2049174", "rating": 8.2, "votes": 2552, "number_of_episodes": 92}