{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0514228": "Peyton List", "1133651": "Ben Feldman", "0389324": "Charlie Hofheimer", "3500582": "Teyonah Parris", "0578833": "Stephen Mendel", "1534037": "John Sloman", "1046400": "Tony Pasqualini", "0000787": "Bess Armstrong", "0962120": "Tom Beyer", "0943566": "Lisa K. Wyatt", "2006513": "Joe Williamson", "0552355": "Greg Allan Martin", "0588766": "Kristen Miller", "0019969": "Keith Allan", "1667719": "Thomas Lumberg Jr.", "0093684": "Lou Bonacki"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["A peaceful hotel getaway ends in disaster for Don and Megan, an LSD trip could have a disastrous effect on Roger's marriage, and Peggy loses her cool after an unsuccessful pitch meeting.", "The same day is seen through the eyes of three people: Peggy, Roger and Don. The start for the day is the same for all three: Roger invites Don on a boys only romp to visit the business of a client - the Howard Johnson's in Plattsburg - so that Roger can avoid an evening out with Jane later that evening. Don instead invites Megan to go along, which means that both Don and Megan will be abandoning the Heinz team at their pitch meeting that day, leaving that responsibility to Peggy, and that Roger is left out in the cold with regard to the Howard Johnson's outing. An incident at the Heinz pitch meeting leaves Peggy contemplating both her professional life at SCDP and her personal life with Abe. A second incident at Don and Megan's outing leaves Megan wondering if she can have both a professional and personal life with Don, or if she even wants anything to do with Don, while Don tries to regain some lost control over the situation and a situation brought to his attention the following day by Bert. And a third incident happens in Roger and Jane's outing, which is a party with friends of Jane's, the party to explore the use of LSD. Roger and Jane's musings to each other while they're high brings to the surface what each knows he/she is feeling and what each knows the other is feeling about their marriage.—Huggo", "When Don learns that a Howard Johnson's in Plattsburgh, N.Y. is looking for advertising, he decides that it would be a perfect getaway for Megan and himself. Megan feels more than a little guilty about setting off as it's also the day that the team is making it's latest pitch to Heinz. The weekend turns into a disaster after they argue and Megan disappears. The Heinz presentation is equally disastrous with Peggy Olson losing her temper with the client. On his return to the office, Don gets a few words of wisdom from Bert Cooper. Meanwhile, Roger Sterling and his wife go to an interesting dinner party where the after dinner treat is taking LSD. Everyone seems to have an interesting time not the least of whom is Roger who the next morning comes to an interesting decision about his future.—garykmcd"], "genres": "N/A", "imdbID": "2049172", "rating": 9.1, "votes": 3710, "number_of_episodes": 92}