{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0000566": "Julia Ormond", "0001110": "Embeth Davidtz", "0088127": "Alexis Bledel", "0667350": "Jay Paulson", "3500582": "Teyonah Parris", "1133651": "Ben Feldman", "0706716": "Kevin Rahm", "0724224": "Lou Richards", "0164068": "Jeff Clarke", "0542074": "Jon Manfrellotti", "2286966": "Jay Seals", "2032150": "Emily Baldoni", "0446457": "James Martin Kelly", "1237088": "Sadie Alexandru", "0905430": "Geoffrey Wade", "0330437": "Mary Kathleen Gordon", "2684517": "Madeleine Hamer", "3998859": "Kevin Wayne Berger", "5847363": "Timothy Douglas", "2049551": "Alexandra Ella", "2796389": "Stephanie Gillis", "9065119": "Cary Huff", "0419830": "Al Jean", "1377184": "Robert Malone", "3792788": "Stewart Strauss"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["As the partners consider expanding the office space, Don begins seeing ghosts and gets a request to advance Megan's acting career. Meanwhile, Peter's affair comes to a disappointing end, and Megan's mom briefly reunites with Roger.", "Among those who are depressed about their lives are Megan, Pete and Beth. Beyond getting what she believes are obscene phone calls, Megan is feeling that her acting career is going nowhere, especially after being duped by an unscrupulous agency who filmed a screen test for her. She feels she gets little support from her visiting mother, Marie, and Don. She uses a request from her acting friend Emily to what she hopes will be her own advantage, but she will need some help from Don to achieve her end goal, which he may not be willing to provide. Pete is still restless in his life, even more so when he sees Beth again, this time with Howard on the commuter train. He learns from Beth to where she is going which is directly related to her own depression. Her ultimate destination continues the vicious cycle which is her life. She hopes that Pete will be at least a minor sanctuary from that life. Meanwhile, Don, who refuses to see a dentist about a chronic toothache, continually sees visions of his dead brother Adam all around him. Roger has two immediate goals, both which he hopes will involve Marie. Peggy is trying to settle into her new job, which has some challenges. Without letting the staff know, Joan is looking for extra office space for the company especially in light of the company's somewhat flush financial state (ironic considering Lane's need for personal income, despite much of the company's up front investment being from him) and no one wanting the office in which Lane committed suicide. And the partners decide what to do to memorialize Lane, which garners an unexpected reaction from Rebecca.—Huggo", "The end of the financial quarter brings good news as Joan reports a decent cash flow. The firm is looking to expand its office space to include the upstairs floor and some are already jockeying for better digs. Joan is a bit upset to get get a large check on a life insurance policy the firm had on Lane. Don's attempt to repay Lane's wife the amount he had invested in the firm gets a icy reception from Mrs. Pryce. At home, Don's mother-in-law is visiting for a week. Megan however hears that one of the agency's clients, Butler Shoes, will be shooting a commercial and she very much wants the key role. His initial refusal is devastating to her but he eventually gives in, something that has a profound effect on him. Pete Campbell meanwhile spends an afternoon with Beth Dawes and is shocked when he hears of her upcoming plans.—garykmcd"], "genres": "N/A", "imdbID": "2049167", "rating": 8.6, "votes": 2814, "number_of_episodes": 92}