{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0051104": "Talia Balsam", "0000566": "Julia Ormond", "0349749": "Ronald Guttman", "0389324": "Charlie Hofheimer", "2656869": "Mason Vale Cotton", "1133651": "Ben Feldman", "0877252": "Myra Turley", "0936403": "Ray Wise", "1534037": "John Sloman", "0741642": "Robin Pearson Rose", "0242405": "Pamela Dunlap", "0646351": "Larisa Oleynik", "2804947": "Marten Holden Weiner", "1395437": "Nick Benson", "4285029": "Beverly Ann Smith"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don gets a visit from the in-laws and his children just as he's about to receive a prestigious award and tries to save the Heinz account. Meanwhile, Peggy and her boyfriend take the next step in their relationship.", "Don is receiving an award from the American Cancer Society for his anti-smoking editorial in the New York Times. He sees the award as a honor regardless of the fact that he has not quit smoking, that the editorial was purely a dig at Lucky Strike for pulling their business, and the people at the Society know none of this information. Roger and Pete plan on being at the awards ceremony to drum up business from the Society's wealthy Board members, who probably now see SCDP in a different league than all the other Madison Avenue agencies. Roger, still on a euphoric high (figuratively) after his LSD trip, turns to an unexpected source for help on this matter. Also attending the awards ceremony will be Megan's parents, Dr. Emile and Mrs. Marie Calvet, who have come to town partly on business, partly to see Megan and partly to meet Don and attend the ceremony. Upon meeting, Don knows that he has to do more than win a prestigious award to impress especially Dr. Calvet. A last minute attendee to the ceremony is Sally, who with Bobby, are unexpectedly staying with Don and Megan while Betty and Henry are out of town and as Henry's mother Pauline has broken her ankle, the latter incident which was Sally's fault but she who does not confess to it. The evening makes Sally feel grown up, especially as Roger treats her as his pseudo-date. Two incidents at the awards ceremony place a damper on the evening for Don and Sally. Meanwhile, the Heinz team are grasping at straws for ideas. A last minute good one comes from an unexpected source, which they have to act on quickly not only because of their imminent next pitch meeting, but also because of some yet as unknown news from Raymond Geiger. This situation brings Don and Megan closer together in all respects. And Peggy is concerned about whatever it is that Abe wants to talk to her about. His question catches her off guard as it does for Mrs. Olson.—Huggo", "Megan's parents, Emile and Marie Calvet, arrive in New York City for a visit. Emile is a socialist of some sort and doesn't approve of their apartment and the obvious show of wealth. They're there at least in part to attend an American Cancer Association dinner where Don will receive an award for the anti-tobacco ad he ran when they lost the Lucky Strike account. Peggy Olson's boyfriend insists that they have dinner and she's worried he's going to break up with her. Joan sets her straight telling her to expect the opposite. He doesn't quite propose but she's excited with his idea. Her mother's reaction isn't quite so positive. As for the Cancer Society dinner, it proves to be revelatory for everyone: Megan is taken to task by her father for giving up her dreams; Megan's mother has a fling with Roger; young Sally sees something she is far too young to have seen; and Don learns there is a price to pay for biting the hand that feeds you.—garykmcd"], "genres": "N/A", "imdbID": "2049173", "rating": 8.7, "votes": 2817, "number_of_episodes": 92}