{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "0364813": "Jared Harris", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "0607666": "Robert Morse", "0805476": "John Slattery", "0321591": "Michael Gladis", "0001110": "Embeth Davidtz", "3500582": "Teyonah Parris", "1133651": "Ben Feldman", "3580571": "Anna Wood", "0346415": "Nicholas Guest", "0003069": "James DuMont", "1697724": "Mitchell Fink", "1305105": "Beth Hall", "1237088": "Sadie Alexandru", "2286886": "Stephanie Drake", "1234841": "Wajid", "2694809": "Eli Bildner", "2419966": "David Crane", "0222772": "Chris Devlin", "0221181": "Aimee Deshayes", "3114820": "Elisha Yaffe", "1702360": "Ben Bela Böhm", "1655978": "LynNita Ellis", "9065119": "Cary Huff", "3676129": "Devin O'Rourke", "3295425": "Tim Padilla"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Lane searches for a way to get rid of a sizable debt, the firm prepares to pull out all the stops when it gets a second chance to land Jaguar as a client, and Don tries to comfort Joan when she reaches her breaking point.", "Lane faces a personal cash flow problem when he is informed that he owes the British government £2,900 for back taxes, payable in two days time. He comes up with a scheme using supposed SCDP funds, which don't actually exist, in the form of Christmas bonuses to all staff, including to the partners. But one problem after another with Lane's scheme have the potential of bringing his entire world crashing down around him. It promises to be a busy Christmas season since SCDP is once again in the running for the Jaguar account, the pitch from agencies to be done in mid-January, giving them about six weeks to come up with a presentation. Meanwhile, Harry gets a telephone call from old colleague Paul Kinsey to meet, which Harry reluctantly does. Harry ends up meeting a much transformed Paul. Although Harry does not agree with the transformation itself, he does get caught up in it. As Harry guessed, Paul does ask him for a professional favor. When Harry doesn't believe he can accommodate Paul's request without compromising his own professional standing, Harry has to figure out what to do. He decides to help Paul out in his own way. And Joan has an uncharacteristic outburst at the office when she is served divorce papers there. In part using the work required for Jaguar, Don provides Joan with some much needed emotional support.—Huggo", "Harry Crane has been doing his best to avoid his former co-worker Paul Kinsey but finally gives in only to find that Paul has joined the Hare Krishnas. Despite his faith, Paul is keen to write and wants Harry to try and push a script he's written for Star Trek. Harry agrees but a visit from one of Paul's Krishna friends, Lakshmi, makes sure he knows what they expect. Harry remains a true friend. Pete Campbell proudly announces that Jaguar has been in touch with him and that the firm has been invited to make a pitch for their business. He can't seem to generate any enthusiasm among the partners however. Lane Pryce finds out he owes $8000 in taxes in the UK and is at his wits end trying to figure out what to do. He decides to get funds from the firm, without telling anyone. After Joan receives divorce papers at the office, Don takes her out for a drink. He gets home quite drunk and to a very frosty reception from Megan.—garykmcd"], "genres": "N/A", "imdbID": "2049164", "rating": 8.2, "votes": 2522, "number_of_episodes": 92}