{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "2312345": "James Wolk", "0834960": "Danny Strong", "3500582": "Teyonah Parris", "0002122": "Harry Hamlin", "0308208": "Spencer Garrett", "0921550": "Gary Werntz", "0199000": "Mike Damus", "2557308": "Patrick Mapel", "2286886": "Stephanie Drake", "3491395": "Christine Garver", "0018795": "Wayne Alexander", "1212051": "Rachel Roberts", "5706251": "Evan Lorene", "3235031": "Craig Calman", "5227734": "Spencer Jacob Grau", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "2873822": "Shaun Rylee", "5809057": "Lisa Y. Sheeler", "5428282": "Devri Speaks", "4834738": "Cassandra Starr"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Cutler and Chaough prepare to make radical changes to the firm while Sterling and Draper are visiting a client in Los Angeles. Joan's decision to go after a new account on her own leaves Pete furious and frustrated.", "The discussion of the Vietnam War at the Democratic National Convention, where many expect the party to come out with an official anti-war policy, has an effect on the populace and in turn the personal and professional lives of many of those at the merged company, which is still going through growing pains. They still have no name, and no consensus of a name on the horizon. And there is still an \"us\" and \"them\" mentality by many. But work continues. Don, Roger and Harry are heading to Los Angeles to deal with their Carnation and Sunkist accounts among others. The east versus \"left\" coast mentalities become evident. And between the three, there are differing priorities for this trip. But they all end up indulging in the California counter culture, which especially affects Don. Ted is dealing with the problematic Chevy account in Detroit. Jim is not happy dealing with the Manischewitz account as he sees it as a leftover of SCDP, the creative which is led by Ginsberg who he doesn't like (with the feeling being mutual). He sees Don and Roger's absence as a good time to clean \"SCDP\" house. Meanwhile, Joan sees an opportunity to turn a personal relationship into a business relationship with Fortune 500 company, Avon. She also sees this opportunity as a chance to get out of her glorified secretary role. But Joan's tactics may backfire on her.—Huggo", "Don, Roger and Harry travel to California to deal with a potential new client. They're not well received with the company feeling left out out by their previous New York advertising agency. While there, they take advantage of the warm weather and go to several parties. Don and Roger don't quite seem to fit in. Back in New York, Jim Cutler wants Ted to decide on a new name for the company. He also wants to fire some of the staff. Joan has a surprise when her friend at Avon arranges a lunch for her with one of their senior executives. She quickly sees an opportunity to land a big account of her own but when it appears Pete Campbell is going to step in and take over, she ensures he doesn't get invited to the meeting. She also puts her job on the line by doing so.—garykmcd"], "genres": "N/A", "imdbID": "2939966", "rating": 8.1, "votes": 2321, "number_of_episodes": 92}