{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0051104": "Talia Balsam", "0514228": "Peyton List", "0004802": "Linda Cardellini", "2312345": "James Wolk", "3500582": "Teyonah Parris", "1305105": "Beth Hall", "0389324": "Charlie Hofheimer", "0309461": "Michael Gaston", "0028886": "Tyler Francavilla", "0242405": "Pamela Dunlap", "0251851": "Trevor Einhorn", "0548498": "Brian Markinson", "0009410": "Ray Abruzzo", "0823675": "David Starzyk", "0703398": "Kalani Queypo", "0084125": "Loanne Bishop", "2557308": "Patrick Mapel", "0723415": "Elizabeth Rice", "1484231": "Derek Ray", "0115282": "Rob Brownstein", "0804361": "Pat Skipper", "1343939": "Michael Bunin", "1748388": "Kerris Dorsey", "0850335": "Barbara Tarbuck", "1622768": "Wes Robinson", "1498895": "Brett DelBuono", "0416596": "Jesse James", "0572125": "Rod McLachlan", "1694149": "Steve West", "0179275": "Matt Corboy", "0072673": "Wendy Benson-Landes", "2286886": "Stephanie Drake", "2639311": "Kit Williamson", "0403486": "Patrick John Hurley", "4437593": "Ann Benson", "0123307": "Marcia Ann Burrs", "3027508": "Barrett Shuler", "0798811": "Tracy Silver", "0787307": "Erica Shaffer", "0670194": "Mike Peebler", "5500008": "Alison Abernathy", "5077128": "Nancy Linsky", "3482354": "Ryan McGrady", "7487268": "Cheyenne Nugent", "4685551": "Jamie Owen", "3615551": "Hudson Phillips", "5014507": "Jay Renshaw", "1308960": "Robert Stilwell"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don strikes up a friendship with the surgeon in his building, Peggy tries to save her campaign, Roger makes a scene at his mother's funeral, and Betty goes to Manhattan to find Sally's friend.", "With Megan working everyday, Don has time on his hands. He attends a wake for Roger's mother but has had a bit too much to drink, leading to a memorable afternoon. Roger gets particularly upset when an unexpected guest arrives. His daughter is quick off the mark when it comes to the family's finances. Sally's friend Sandy has run off and Betty sets off to find her. She spends the better part of a day in a flophouse waiting for her to show up. She decides she needs a change in her life. Don's presentation to the Royal Hawaiian group doesn't go over too well. Peggy meanwhile seems to have found the solution to her ad campaign. The Drapers have a few of their neighbors over on New Year's eve....and Don seems to have reverted to his old ways.—garykmcd", "The funeral for Roger's just deceased mother doesn't end up quite the way anyone expects, the turn of events which starts with an unfortunate incident by Don. But it ends up being somewhat of a cathartic situation for Roger as he clears the air with Jane, Mona and Margaret. This situation eventually opens up the floodgates for Roger as he receives some more tragic news. At CGC, Peggy is struggling both with her own thoughts and those of her creative team in trying to manufacture a fix for the Koss Super Bowl commercial, which isn't helped by not being able to get a hold of Ted, who is away on Christmas vacation. At SCDP, Don, who inserts a little of Jonesy's near fatal incident and what he himself felt while being in Hawaii, comes up with an experiential campaign for Sheraton, which evokes much the same imagery from all those concerned, which in turn may not be as unexpected as Don would like to think. Someone in the office calls Bob out on what he believed was his quiet campaign to get noticed by the brass at SCDP. Megan's Hawaiian absence from \"To Have and to Hold\" does not seem to have hurt her upward trajectory on the show. Betty learns of a lie told by Sandy to Sally, which sends Betty on a quest into Manhattan to find Sandy. And the Drapers officially ring in the new year with a small three couple gathering in their apartment, while Don unofficially rings in the new year with a relatively new acquaintance.—Huggo"], "genres": "N/A", "imdbID": "2649564", "rating": 7.7, "votes": 2489, "number_of_episodes": 92}