{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0608601": "Mark Moses", "2312345": "James Wolk", "3500582": "Teyonah Parris", "0002122": "Harry Hamlin", "0723415": "Elizabeth Rice", "1484231": "Derek Ray", "0750851": "Morgan Rusler", "0404475": "Rich Hutchman", "0391885": "Jim Holmes", "0098746": "David Dean Bottrell", "0063592": "Richard Bekins", "1305105": "Beth Hall", "1865193": "Brandon Killham", "0699243": "Timi Prulhiere", "2049551": "Alexandra Ella", "1225333": "Timothy Brennen", "0369838": "Allan Havey", "3235031": "Craig Calman", "0498497": "Zak Lee", "2313459": "Gina Manegio", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "2873822": "Shaun Rylee", "5809057": "Lisa Y. Sheeler"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["With his personal and professional life crumbling around him, Don positions himself for a change of scenery. Meanwhile, Pete's life is falling apart as well, thanks to the meddling of Bob Benson.", "Sunkist has requested from SC&P a dedicated west coast representative. Despite it being a demotion, Stan asks Don to be that person as Stan has his own ideas of what that west coast position means: the beginning of another advertising firm of his own. Considering Stan's request, Don contemplates his own future based on his recent past behavior, both professionally and personally. He has finally come to the realization of it being destructive and he makes a decision for himself and Megan which would get them away from many of Don's problems, such as Sally's revelation of his affair with Sylvia, and from Sylvia herself. Don's intent of how he will conduct his life is made public during a presentation to a potential lucrative new client, Hershey's. Ted and Peggy also come to decisions of their own with regard to their personal relationship, especially following a series of cat and mouse sexual games, where the role of cat and the role of mouse are not always well defined. Roger, who is on bad terms with his own \"legal\" family, still wants to build a life of sorts with Joan and Kevin. As such, he doesn't like Bob seemingly infiltrating that territory. And Pete deals with several pieces of news regarding his mother. As Bob is both a part of his professional life and personal life, the latter albeit indirectly, Pete takes his frustrations out on Bob. But an incident concerning the Chevy account leads to a determination of Pete's immediate future.—Huggo", "Things seem to be going from bad to worse for Don. He skips out on a meeting with Sheraton to go to a bar - he's drinking almost continuously, when a fight lands him in the drunk tank for the new life. It seems to have a positive effect on him and he decides to act on Stan's idea to open a branch in Los Angeles to deal with Sunkist. He convinces Megan they should pack it in and head to California. Peggy makes another play for Ted and all seems well with them - until one has a change of heart. Pete is shocked by an unexpected telegram and has his hands full when he goes to Detroit. Sally gets into a mess at her new school and has little time for her father. The firm gets to make a pitch to Hershey chocolate and Don makes one of his better pitches - only to feel it necessary at the end to tell the truth about his own childhood. For the partners it's all a bit too much and Don pays the price.—garykmcd"], "genres": "N/A", "imdbID": "2939968", "rating": 9.1, "votes": 3043, "number_of_episodes": 92}