{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0051104": "Talia Balsam", "0514228": "Peyton List", "0004802": "Linda Cardellini", "2312345": "James Wolk", "3500582": "Teyonah Parris", "1305105": "Beth Hall", "0389324": "Charlie Hofheimer", "0309461": "Michael Gaston", "0028886": "Tyler Francavilla", "0242405": "Pamela Dunlap", "0251851": "Trevor Einhorn", "0548498": "Brian Markinson", "0009410": "Ray Abruzzo", "0823675": "David Starzyk", "0703398": "Kalani Queypo", "0084125": "Loanne Bishop", "2557308": "Patrick Mapel", "0723415": "Elizabeth Rice", "1484231": "Derek Ray", "0115282": "Rob Brownstein", "0804361": "Pat Skipper", "1343939": "Michael Bunin", "1748388": "Kerris Dorsey", "0850335": "Barbara Tarbuck", "1622768": "Wes Robinson", "1498895": "Brett DelBuono", "0416596": "Jesse James", "0572125": "Rod McLachlan", "1694149": "Steve West", "0179275": "Matt Corboy", "0072673": "Wendy Benson-Landes", "2286886": "Stephanie Drake", "2639311": "Kit Williamson", "0403486": "Patrick John Hurley", "4437593": "Ann Benson", "0123307": "Marcia Ann Burrs", "3027508": "Barrett Shuler", "0798811": "Tracy Silver", "0787307": "Erica Shaffer", "0670194": "Mike Peebler", "5500008": "Alison Abernathy", "12533314": "Hualalai Chung", "5077128": "Nancy Linsky", "3482354": "Ryan McGrady", "7487268": "Cheyenne Nugent", "4685551": "Jamie Owen", "3615551": "Hudson Phillips", "5014507": "Jay Renshaw", "1308960": "Robert Stilwell"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don and Megan take a trip to Hawaii for the holidays, Sally's friend visits the Francis family, a comedian torpedoes Peggy's Super Bowl ad campaign, and Roger gets some bad news about his mother.", "It's December 1967 and Don is in Hawaii with Meagan on a working holiday. They're staying at the Royal Hawaiian hotel, a client, so that Don can get an idea of what it's like for their new ad campaign. He has an interesting encounter with an army private currently serving in Vietnam but on leave to get married. He has a proposition for Don. They return home to finds their doorman, who had a serious heart attack standing in front of them, on the job. Megan is concerned that her employers may be diminishing her TV role. At the office, the firm has expanded to include the floor above but Don is not too happy to find that his office furniture has been rearranged. Roger Sterling learns that his mother has died. Betty takes a motherly interest in Sally's friend Sandy who lives next door and whose mother died recently. Sandy has an adventurous streak that Betty perhaps wishes she had at her age. At her new employer, Peggy Olson faces something of a crisis when recent news may force her to redo an entire campaign.—garykmcd", "It's the Christmas holiday season, but the war in Vietnam pervades much of what is going on in life. Don and Megan are in Waikiki on a business trip as they stay at the Royal Hawaiian on the bequest of SCDP's new client, Sheraton. Don doesn't know how to convey the experience he felt while being in Hawaii and at the hotel to the creative team, which includes a chance war related encounter he has in the hotel bar. Megan, while she enjoys her time away, is more concerned about what that absence means for her budding acting career on the soap opera, \"To Have and to Hold\". Their arrival home includes strengthening their friendship with another couple in their building, the Rosens, who they recently only met in what was potentially a tragic situation. Don also comes back to much activity at the office, including a employee in accounts who will do whatever it takes to get noticed by the head honchos. At CGC, Peggy is having her own work woes as a war related comedy monologue on a late night television show threatens her just launched campaign for Koss, that launch which will peak with a Super Bowl commercial. Peggy has to decide how to do damage control with the client, especially concerning the television commercial. The Francises host Sally's fifteen year old friend, Sandy, a budding violinist who will soon be off to Julliard. Betty learns some information about Sandy, with who she bonds as she sees much of herself at that age in Sandy. And Roger, who is deep in therapy, receives some tragic news, about which he seems unaffected.—Huggo"], "genres": "N/A", "imdbID": "2470504", "rating": 7.5, "votes": 2667, "number_of_episodes": 92}