{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0004802": "Linda Cardellini", "3500582": "Teyonah Parris", "0002122": "Harry Hamlin", "0568672": "Davenia McFadden", "0251851": "Trevor Einhorn", "0750851": "Morgan Rusler", "2303079": "Megan Ferguson", "0453924": "Matthew Kimbrough", "0956053": "Rick Zieff", "1054247": "Alexa Nikolas", "2639311": "Kit Williamson", "1865193": "Brandon Killham", "0395360": "Brynn Horrocks", "3491395": "Christine Garver", "1197375": "Mickey Maxwell", "0164131": "Josh Clark", "0006973": "William Martin Brennan", "1553819": "Jeremy Overstreet", "5363645": "Alexander Michael Helisek", "3615551": "Hudson Phillips", "2873822": "Shaun Rylee", "5428282": "Devri Speaks"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["The creative department has a wild, drug-influenced weekend as they work on the Chevy account, Don has trouble letting go of Sylvia, and Sally walks in on an unwelcome intruder.", "Don has been loitering outside the Rosens' apartment. Sylvia sees the signs that he has been doing so and implores him to stop although Don is desperate to continue the liaison with her. At the office, Ken has been taking the brunt of the issues with the Chevy account, and it is he who relays to the partners that GM has provided a three year timeline with key deadlines, the next to take place the upcoming Monday in 72 hours. It's bad timing especially for the former CGC partners and staff as Frank Gleason has just passed away, meaning that some have to make a presence at the funeral, while others have to work the weekend for that next presentation to GM. To deal with a work related injury that Ken suffered, as well as provide those working the weekend with a boost, Jim calls in his personal physician who provides a vitamin and energy shot to most of the creative staff and partners to get them through the weekend to battle the probable exhaustion that would occur otherwise. The stimulant in the shot takes over the creative thought for most of the weekend. The shot, in combination with a severe chest cold, is making Don remember back to a situation during his puberty, relating both to his relationship with Sylvia as well as the Chevy campaign. Having to work, Don will miss his weekend visit with the children. As Megan has a theater date which she hopes to parlay into a stage role. She, as she has done before, leaves Sally in charge of looking after the boys. Their weekend is disrupted by an unexpected visitor.—Huggo", "Don and the others at the merged ad firm are having major difficulties with their new client, General Motors. They've been at it for weeks and GM has so far rejected every idea they've put forward. They're expecting a new set of ideas by Monday so Don decides everyone will work the weekend. Already exhausted from the work so far, Jim Cutler says he knows just what they need and calls in Dr. Shelley Hecht to inject them with his secret vitamin concoction which is guaranteed to give them a boost. Soon they're on a speed-induced high that is anything but productive. The drugs lead Don to remember aspects of his childhood that might explain why he treats women the way he does now. Meanwhile his children are spending the weekend with Don and Megan. With Don at work and Megan having to go out, 14-year-old Sally is left in charge. She awakens in the night to find a woman in the apartment claiming to be Don's mother.—garykmcd"], "genres": "N/A", "imdbID": "2882250", "rating": 8.7, "votes": 3121, "number_of_episodes": 92}