{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0004802": "Linda Cardellini", "2312345": "James Wolk", "0309461": "Michael Gaston", "0261452": "Christine Estabrook", "0002122": "Harry Hamlin", "0251851": "Trevor Einhorn", "0031193": "Craig Anton", "0153712": "Channing Chase", "0404475": "Rich Hutchman", "2286886": "Stephanie Drake", "0798811": "Tracy Silver", "2639311": "Kit Williamson", "3491395": "Christine Garver", "2049551": "Alexandra Ella", "0041936": "Richard Augustine", "0370935": "Cathy Lind Hayes", "3235031": "Craig Calman", "5847363": "Timothy Douglas", "9065119": "Cary Huff", "3615551": "Hudson Phillips", "5809057": "Lisa Y. Sheeler", "5428282": "Devri Speaks"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Things quickly become awkward after the two firms merge, Don asserts his dominance over Sylvia, Pete has to deal with his ailing mother, and Bob Benson helps out a sick Joan.", "It's the first official day of the merger between SCDP and CGC, with CGC staff moving into the SCDP offices. Beyond the logistical issues of who will be housed where, the mood is generally cordial on the surface, with the exception of Pete, who feels like his usefulness to the company is and will be diluted with a whole new set of partners. His time is also preoccupied by his mother, who, with a case of dementia, is staying at his apartment as she was basically kicked out of of his brother Bud's house because of an altercation with Bud's wife. Some staff will definitely be gone and Joan knows that Bob helping her with a personal issue which she would rather the other staff not know about is primarily a means to keep his job. Bubbling below the surface is a competitive situation between Don and Ted as the heads of creative. Peggy feels somewhat caught in the middle of that struggle between Don and Ted. But much like Pete, Don's mind is not fully at the office, as he gets a call from Sylvia, who had just had a potentially marriage ending fight with Arnold. As Sylvia needs Don as an emotional and by association sexual outlet, Don in turn takes advantage of such to exert his sexual power on their relationship.—Huggo", "The merged companies start to sort things out such as new offices but also deciding who to let go. Ted Cheough makes an immediate impression with the staff. He's not too keen when he finds Don is late for a brainstorming session with the creative team for a potential new client, Fleischmann's margarine. Don is unapologetic about missing the meeting and goads Ted into drinking match that he easily wins. Ted gets payback when he and Don fly to a meeting in Ted's airplane. Bert Peterson is no sooner in the office than Roger fires him.....again. Joan finds herself in considerable pain and Bob Benson takes her to the hospital refusing to leave her there until the emergency is over. She returns the favor. Pete Campbell's mother Dot is suffering from dementia and he finds himself having to care for her after his brother refuses to take her back. Don and Sylvia have been spending a lot of time in a hotel room but his manipulative games bring their relationship to an end.—garykmcd"], "genres": "N/A", "imdbID": "2663614", "rating": 7.9, "votes": 2389, "number_of_episodes": 92}