{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0608601": "Mark Moses", "2312345": "James Wolk", "0389324": "Charlie Hofheimer", "0723415": "Elizabeth Rice", "0324790": "Joanna Going", "1615964": "Brendan Patrick Connor", "0741580": "Michael Rose", "3491395": "Christine Garver", "1889098": "Lucius Baybak", "6513693": "Davis Allsop", "3235031": "Craig Calman", "7487268": "Cheyenne Nugent", "2873822": "Shaun Rylee", "5556054": "Adam Wilson"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Peggy becomes unsatisfied with her apartment and with Abe, Don has an eventful weekend with Betty while Megan has problems on the set, Roger has time with his grandson, and Pete begins exploring his options outside the firm.", "Peggy still feels caught in the middle of what is going on between Don and Ted. Behind closed doors, she sides with Ted, while she can be totally honest with Don. The situation at home - especially in an apartment in an neighborhood she both hates, that hatred which is strengthened by an incident involving Abe - makes her think more about her previous kiss with Ted. Pete is feeling dissatisfied with his prospects at the merged company, and thus looks for possible other opportunities. Roger is focused on the children in his life. While he tries to be grandfather to Margaret's son, Ellery, he would rather be father to his biological son, Kevin, with Joan. Joan has other thoughts on the matter and how best to move on with her less than happy life. Without their respective spouses for at least the first day, Don and Betty attend Bobby's camp, he who is happy to see his parents together again. As they are alone together without outside pressures of what they need to do to keep up pretenses of their own personal situations in relation to each other, Don and Betty fall into old habits if only for their alone time. And Megan is having problems at work in developing her new \"twin\" character, which she thinks will get her fired. She gets some support that she doesn't want, while longs for the support that seems to have long abandoned her.—Huggo", "Peggy has just about had it when she gets home to find that Abe was the victim of a mugging and was stabbed. He's refusing to help the police find who attacked him - they're all bigots as far as he'd concerned - and she is constantly scared. She wants to sell out and he eventually gets her point, so to speak. Don gets to spend a night at Bobby's summer camp where he runs into Betty. Henry's not arriving until the next day and things take an interesting turn. Joan and Bob's plans to go to the beach are interrupted by Roger who drops in unexpectedly. Megan's role in her soap opera has been expanded - she now plays twins - and she's convinced everyone hates her. Her friend from the show stops by to help her relax. Worried about his future at the firm, Pete Campbell meets with Duck Phillips, who now works as a headhunter.—garykmcd"], "genres": "N/A", "imdbID": "2882248", "rating": 8.3, "votes": 2472, "number_of_episodes": 92}