{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0004802": "Linda Cardellini", "2312345": "James Wolk", "0548498": "Brian Markinson", "0059630": "Gary Basaraba", "0251851": "Trevor Einhorn", "1477301": "Yaani King Mondschein", "0750851": "Morgan Rusler", "1918522": "Julie Alexander", "2303079": "Megan Ferguson", "0661164": "Kip Pardue", "1534037": "John Sloman", "2180792": "Collette Wolfe", "0907134": "Katie Walder", "0611407": "Oliver Muirhead", "2286886": "Stephanie Drake", "2639311": "Kit Williamson", "1865193": "Brandon Killham", "0395360": "Brynn Horrocks", "1460843": "Keenan Henson", "1707798": "Bryan Chesters", "2052977": "Toni Torres", "1188508": "Peter Arpesella", "2218784": "Martin Dew", "5847363": "Timothy Douglas", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["While Don continues his affair with Sylvia, Pete's latest infidelity threatens his marriage. Meanwhile, Peggy's icy relationship with her new staff continues, but she also gets an unlikely tip on a potential new client.", "At CGC, Peggy is feeling unliked by her underlings, as it is implied to her that she is too tough on them. Over at SCDP, two clients are causing minor problems. Herb Rennet at Jaguar wants Don and Pete to recommend a specific strategy to head office. Don doesn't agree with the strategy, but Pete believes they have to give him what he wants or risk losing them as clients. Can Don and Pete provide a united front at the Jaguar meeting? And Raymond Geiger at Heinz, head of their beans division, tells Don and Ken in confidence that he doesn't want them providing any business to their ketchup division, as he feels ketchup will steal all the glory away from beans that was built up at SCDP. This conundrum may cause more problems for SCDP than just figuring out if they should kowtow to Raymond, who gave them business when no one else was, or go after the more lucrative ketchup account. Meanwhile, the Drapers and the Rosens are becoming closer as two couples, as Don and Sylvia continue with their sexual liaison. This situation may become more difficult for Sylvia to deal with emotionally as Megan confides in her about a recent event. And Pete and Trudy are settling into suburban life, where flirting and open but implied sexual innuendo seems to be happening with many of their neighbors. This may cause some problems in Pete and Trudy's continual unspoken disagreement over how they live their lives.—Huggo", "Don is still sleeping with his neighbor Sylvia Rosen and seems unconcerned about having to socialize with her husband. A flashback to his youth reveals some of the life he led after he and his stepmother moved into a brothel. Megan has had a rough couple of weeks finally telling Don that she had a miscarriage a few days ago. He says they can have a baby anytime she wants. Pete Campbell is making good use of his Manhattan apartment seducing his neighbor, but it all goes wrong when she tells her husband. Trudy throws him out of the house. Herb the Jaguar dealer stops by the agency. much to Joan's dismay and wants the agency to propose a new direction for the Jaguar ad campaign. Don finds a way to sink it. At her new agency, Peggy is having trouble with her staff - they don't like her.—garykmcd"], "genres": "N/A", "imdbID": "2551222", "rating": 7.8, "votes": 2422, "number_of_episodes": 92}