{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0004802": "Linda Cardellini", "2312345": "James Wolk", "3500582": "Teyonah Parris", "0548498": "Brian Markinson", "0002122": "Harry Hamlin", "0153712": "Channing Chase", "0009410": "Ray Abruzzo", "0699243": "Timi Prulhiere", "0268968": "Andres Faucher", "1997794": "Hudson Thames", "3355003": "Cameron Protzman", "0404579": "Mark Hutter", "2049551": "Alexandra Ella", "1225333": "Timothy Brennen", "3235031": "Craig Calman", "3948170": "Kirstin Masters", "2873822": "Shaun Rylee"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Don is preoccupied with keeping Sylvia's son from being drafted, Peggy has a rat in her apartment, Don and Ted bury the hatchet, Pete has a problem with his mother's new nurse, and Sally makes an accidental discovery about her father.", "Professional relationships and personal business intersect at Sterling Cooper & Partners. Peggy, hating her apartment even more because of an unwanted visitor, doesn't quite get the help she wants from a colleague in alleviating the matter. Ted, Pete and Peggy bond over a few drinks, which opens Pete's eyes to what's going on with his two colleagues, and which highlights what Ted's wife Nan is feeling at home. Pete appreciates the help that Bob provided to him regarding getting a personal nurse for his mother, until Mrs. Campbell divulges some information about the situation, which in turn ends up revealing one of Bob's motivations in providing that help. Don tries to help the Rosens with a major problem, namely the fact that their son, Mitchell, who sent his draft notice back in protest, has now been reclassified as 1A. Don uses a professional connection to try and solve that problem. That action by Don causes a further rift with Ted, who is already irked that Don was proceeding with Sunkist while they already have a promising account with Ocean Spray. That act, however, may make Don and Ted come to an understanding about their working life. On a purely personal issue, Sally and her friend Julie are staying at Don and Megan's while they attend a model UN conference in the city. Their initial encounter with Mitchell is one which they hope becomes more personal. A move by Julie on this front results in an action by Sally which may threaten her relationship with her father.—Huggo", "Don and Ted continue to ignore one another leading to arguments at the office. In the latest round, Ted has been pursuing Ocean Spray while Don and Roger have been pursuing Sunkist. Ted, for one, is taking all of this very personal. Peggy has a rat infestation at home and seek's Stan's help and advice. Meanwhile Pete has to deal with a delicate situation when his mother tells him she and her caregiver, Manolo, are sleeping together. Sally and her friend Julie spend the weekend with Don and Megan. Sylvia and Arnold Rosen face a major dilemma when their son Matthew is reclassified 1A by the selective service board and faces being drafted into the army at any time. Don tries to help them out and it's Ted who may have a solution. It all goes badly however when Sally sees Don in a compromising situation.—garykmcd"], "genres": "N/A", "imdbID": "2939964", "rating": 8.7, "votes": 2619, "number_of_episodes": 92}