{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0004802": "Linda Cardellini", "3500582": "Teyonah Parris", "0389324": "Charlie Hofheimer", "0548498": "Brian Markinson", "1477301": "Yaani King Mondschein", "0578833": "Stephen Mendel", "0002122": "Harry Hamlin", "1004811": "Lennon Parham", "1436647": "Nicole Hayden", "0544611": "William Mapother", "2739851": "Ross Marquand", "0699243": "Timi Prulhiere", "0495698": "Henry LeBlanc", "0387627": "Rodney J. Hobbs", "5500008": "Alison Abernathy", "5323054": "Christopher Clausi", "5847363": "Timothy Douglas"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Set among the events surrounding Martin Luther King's assassination, Peggy tries to get a new apartment, Ginsberg is set up on a date, and Don has a revelation during his weekend with the kids.", "It's April 4, 1968. Ginsberg is on a date, one he didn't want to go on, but was set up by his father at the last minute as a total surprise to Michael. Many of the staff of both SCDP and CGC are at an advertising awards dinner. Both these events are unexpectedly interrupted when news breaks that Dr. Martin Luther King, Jr. has just been shot dead. Beyond the immediate shock of the news and the pall that it places over the general populace, it has more profound effects both personal and professional. People are concerned about general race rioting, which does occur. Don is concerned about Sylvia as she and Arnold are in D.C. where the violence seems to be worse than in other places. Abe is working on a story, one that could be the biggest of his career, on the local aftermath of the shooting for the New York Times. Black people, such as Dawn, are half expected by their employees not to come into work for their own personal safety. Henry has to assist in whatever his boss, New York Mayor John V. Lindsay, needs to do in light of the shooting. And Pete uses the situation to try and reunite with Trudy. But life goes on as usual for some. Peggy's real estate agent wants to use the shooting to underbid for the apartment Peggy wants to buy. Harry is afraid that all the prime time shows being preempted by special news bulletins will negatively affect business. And Betty urges Don not to abandon his time with his children just because of the incident, especially as Bobby has been causing her some grief of late.—Huggo", "It's April 4, 1968. Don and Megan are off to a an advertising awards dinner where she and others are up for an award. They bump into the Cohens in the lobby; they're off to Washington D.C. where Arnold will be making a presentation at a medical convention. The program has barely begun - the guest of honor is Paul Newman - when someone shouts out that Martin Luther King has been assassinated. Everyone is shaken in their own way at the tragic news and riots break out in the city. Betty calls Don to complain that he didn't pick up the kids. He goes out to get them up but then ignores them for most of the weekend. He and Bobby go see Planet of the Apes (1968). In view of what's happening Pete suggests to his wife that he come home; Trudi politely, but firmly, says no. Meanwhile, Peggy is looking to buy a condo but isn't getting much feedback from boyfriend Abe.—garykmcd"], "genres": "N/A", "imdbID": "2717848", "rating": 8.2, "votes": 2519, "number_of_episodes": 92}