{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0000566": "Julia Ormond", "2312345": "James Wolk", "0389324": "Charlie Hofheimer", "0548498": "Brian Markinson", "0059630": "Gary Basaraba", "0002122": "Harry Hamlin", "0031193": "Craig Anton", "0640382": "Joe O'Connor", "0533380": "Peter Mackenzie", "1263939": "Danielle Panabaker", "0453924": "Matthew Kimbrough", "0017698": "Sarah Aldrich", "1305105": "Beth Hall", "3027508": "Barrett Shuler", "0798811": "Tracy Silver", "3491395": "Christine Garver", "1212588": "Courtney Taylor Burness", "3062315": "Marlane Barnes", "0369838": "Allan Havey", "3235031": "Craig Calman", "5665592": "Christopher Hedrick", "9065119": "Cary Huff", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "0742467": "Paul Mitchell Rosenblum"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["As the firm prepares to go public, Don and Pete's actions cause them to lose two huge clients. However, Roger uses a new connection to put them in position to gain their biggest client ever.", "Bert, Pete and Joan work with an underwriter to prepare SCDP's public offering, which is unknown to the other partners. If they get what they want, this public offering would make each of the partners a millionaire. Over at CGC, Ted deals with the news that fellow partner Frank Gleason is suffering from pancreatic cancer, which makes Ted think about the viability of their company. Otherwise, the thoughts in both offices are on cars. Herb Rennet at Jaguar has requested a business dinner with Don and Roger, which Don is dreading if only for his disdain for Herb and by association the Jaguar account. And CGC has lost the Alfa Romeo account. However, CGC is one of three short listed companies up for the account all advertising firms would do anything for: General Motors, to promote Chevy's yet unnamed new vehicle. Through a personal contact, Roger, unilaterally, maneuvers an unofficial meeting with Mikey O'Brien of Chevrolet. This news does not sit well with Ted, until... Meanwhile, Megan's mother is in town for a visit for Mother's Day. However, Marie's thoughts steer more toward Roger than with her daughter. Peggy has just purchased a new apartment in the neighborhood that Abe wanted, but it's not quite what she expects. Her mind also wanders from Abe and the apartment to work, but not for professional reasons. And Pete has an uncomfortable encounter with his father-in-law in an unexpected location, that meeting which could affect Pete both personally and professionally.—Huggo", "Don and Roger have a dinner with Herb from Jaguar and spouses are to come. When he hears that Megan's mother is in town Don insists that she come along as well. Roger never shows up however and Don has had with Herb who wants his own flunky to write copy for him through SCDP. The business relationship ends brusquely. Unbeknownst to Don - and others - Bert, Pete and Joan have been doing the necessary groundwork to take SCDP public. When they learn they've lost Jaguar it all begins to crumble and Joan has choice words for Don and his selfish attitude. Peggy has moved into a new apartment and while Abe does his best to cheer her up, she isn't too happy. Pete is stunned when he sees his father-in-law at a bordello. Roger missed the dinner with Herb because he was working on a new client - General Motors - and SCDP is now invited to make a pitch on their new car. By the time Don gets to Detroit Ted Cheough, also there to make a pitch for GM's business, explains to him they don't have a chance of winning. Don has an idea however, one that will result in a great deal of change for everyone concerned.—garykmcd"], "genres": "N/A", "imdbID": "2717850", "rating": 8.8, "votes": 2886, "number_of_episodes": 92}