{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "1555340": "Alison Brie", "0004802": "Linda Cardellini", "2312345": "James Wolk", "3500582": "Teyonah Parris", "0261452": "Christine Estabrook", "0324790": "Joanna Going", "0005420": "Marley Shelton", "0569337": "Ted McGinley", "0936403": "Ray Wise", "0661164": "Kip Pardue", "1701107": "Idara Victor", "1620762": "Ken Luckey", "0066972": "Lukas Behnken", "0220711": "Mark Derwin", "2286886": "Stephanie Drake", "1237088": "Sadie Alexandru", "0798811": "Tracy Silver", "1460787": "Henry Dittman", "2424044": "Evan Gamble", "1237494": "Jareb Dauplaise", "6513693": "Davis Allsop", "4749062": "Joseph Emmett DuRand", "2996735": "Josh Kirby", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "2873822": "Shaun Rylee", "5809057": "Lisa Y. Sheeler"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don works in secret on a Heinz ketchup campaign while Megan gets a love scene on the set of her soap opera. Meanwhile, Harry makes his power play while Joan has more trouble with the secretaries.", "There is much going on at SCDP, both professional and personal. Don, Pete and Stan are the only people who are supposed to know about \"Project K\" (which is a presentation for Heinz Ketchup), as they had a clandestine meeting with Tim Jablonski behind Raymond Geiger's back. If they don't get the account no one is supposed to be the wiser. This three-man team gets a few surprises with regard to this work. Dawn is feeling vulnerable as the token black person on staff. Joan, whose resolve is strengthened by a visit by her old friend Kate, exerts her power at the office as she feels she is still treated as a glorified secretary despite being a full partner. And Harry helps Ken with a personal problem which he thinks will boost his career. These issues, in combination, result in a professional standoff between Harry and Joan. Meanwhile Megan's work is being noticed on the set of \"To Have and to Hold\" as she is given her first ever love scene, which she feels she needs to clear with Don. This work results in two personal dilemmas for Megan and Don, one which, on the surface, strengthens Don's need to be with Sylvia.—Huggo", "It's not been a good few weeks at SCDP. Don and Pete have met secretly with Tim Jablonsky from Heinz ketchup to see if he's serious about getting a new agency for their advertising. He assures them he is and that they shouldn't worry about the Heinz beans account. Stan is assigned to work on the campaign but it's all hush-hush leading to a lot of gossip in the office. Don is upset when he sees that Ted Cheough and Peggy Olson are making a pitch as well. Joan, meanwhile, decides to fire Harry Crane's secretary after she gets Dawn to clock her out. Harry challenges her and subsequently barges into a partners' meeting demanding he be made a partner and that, unlike Joan, he has earned it. Megan's acting career seems to be on the upswing and she's given a major storyline involving an affair. It doesn't sit well with Don who accuses her of enjoying it. It doesn't stop him from going straight home and getting into bed with Sylvia.—garykmcd"], "genres": "N/A", "imdbID": "2560864", "rating": 8.0, "votes": 2392, "number_of_episodes": 92}