{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0608601": "Mark Moses", "2312345": "James Wolk", "0002122": "Harry Hamlin", "2804947": "Marten Holden Weiner", "0251851": "Trevor Einhorn", "0153712": "Channing Chase", "0014582": "Liam Aiken", "1105980": "Kathryn Newton", "1767820": "Samantha Hanratty", "1497570": "Paul Rae", "3491395": "Christine Garver", "2049551": "Alexandra Ella", "2744996": "Matthew Iott", "1490516": "Dan Warner", "0311708": "Deborah Geffner", "3235031": "Craig Calman", "7487268": "Cheyenne Nugent", "2873822": "Shaun Rylee", "5809057": "Lisa Y. Sheeler"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Don renews his battle with Ted after seeing his relationship with Peggy, Sally interviews at a boarding school, and Pete discovers Bob Benson's background.", "Another incident with company executives is the last straw for Ken in working on the Chevy account, most specifically in Detroit. While Ken will still retain account responsibilities in the office, the on the ground account responsibilities are given to Pete, who is buoyed by working on SC&P's most prestigious account. What Pete is not happy about is that Bob will still be working on the account, since Bob made a pass at him. As such, Pete calls Duck to tell him that he no longer wants to leave SC&P but that he wants Duck to find Bob another prestigious job lead but not necessarily find Bob that next job. After hearing back from Duck, Pete decides on a slightly different tact in dealing with Bob. Harry, still in California, gets news that Sunkist has reviewed their pitch and wants to get into TV, which would make their account much more lucrative than Ocean Spray. Despite the extra money, this move does not sit well with Ted, the creative lead for Ocean Spray. The work on Ocean Spray and St. Joseph's lead to almost everyone at SC&P realizing that there is a thing between Ted and Peggy, who both believe they are hiding their feelings for each other well. Their blinded devotion to each other causes problems most specifically on the St. Joseph's account, which each defends until called out on it. And Sally, still not speaking to her father after seeing him having sex with Sylvia Rosen, has decided to deal with the issue by asking her parents if she can go away to boarding school. Although Betty would truly like to know why Sally has made this decision, both Betty and Don support the idea, the latter who really does see it as a means to sweep his and Sally's issue under the rug for good. But Sally's interview and overnight stay at the boarding school may put Sally in a situation way over her head.—Huggo", "Don is somewhat taken aback with Ted and Peggy's flirting at the office and concludes that Ted is in love with her. When Peggy's proposed ad campaign for St. Joseph's goes considerably over budget, it's apparent to him that Ted can't or won't do anything about it. When Don learns from Harry Crane that Sunkist is prepared to make a huge ad buy, he goes back on his word to Ted. Ken Cosgrove has had it with the two yahoos from GM and wants off the Chevrolet account. Pete Campbell is happy to step in but not so keen when the other partners want Bob Benson to continue on the account. Pete tasks Duck Phillips to find Bob a job opportunity elsewhere but Duck's research reveals more about Bob than anyone knew. Sally has decided that she no longer wishes to spend weekends with Don and Megan. She also wants to go to boarding school and gets to spend a night at Miss Porter's, a posh private school. She also contacts an old friend and gets him to come over to party.—garykmcd"], "genres": "N/A", "imdbID": "2939970", "rating": 8.5, "votes": 2367, "number_of_episodes": 92}