{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "2656869": "Mason Vale Cotton", "0805476": "John Slattery", "0607666": "Robert Morse", "0339304": "Bruce Greenwood", "4684548": "Sola Bamis", "2639311": "Kit Williamson", "2286886": "Stephanie Drake", "0338768": "H. Richard Greene", "0424035": "Paul Johansson", "0188614": "Greg Cromer", "0606924": "Sarah Jane Morris", "0040015": "Mackenzie Astin", "0932054": "Jama Williamson", "1859626": "Jennifer Hasty", "0626069": "Eric Nenninger", "1634823": "Jill E. Alexander", "0022707": "Iris Braydon", "0787170": "Pamela Shaddock", "0356619": "Tim Halligan", "4181314": "Eva Bella", "5486797": "Ari Herstand", "1580893": "Paul Avedisian", "4773400": "James J. Cox", "2631015": "Elliot Diviney", "2452098": "Elliott Ray Ehlers", "3840800": "Tomas Johansson", "5503852": "Benjamin Pitz", "3130073": "Jeremy Russell"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Don goes AWOL from McCann Erickson in the middle of a meeting. Joan quickly gets fed up with the sexism at the new firm. Roger and Peggy put off reporting to their new jobs as long as possible.", "SC&P has made the physical move to the McCann Erickson offices. Some like Harry are looking forward to the new environment, some not so much. Several SC&P staff members are not going, some by choice, some not invited. One person's move that is delayed is Peggy, whose new office is not yet completed due to a mix-up. As such, she decides to stay at what is the largely empty and closed down old SC&P offices until such time as her new office is ready. She finds that it is a difficult period if only because of trying to do her work in a makeshift environment. Her final days at SC&P are illuminated by the few others who are straggling behind, one who is delaying the move by choice. Joan was anticipating a difficult move, being a partner at SC&P to a small player at McCann Erickson, which doesn't value the accounts on which she is working. Joan finds the transition even more difficult than she anticipated. One problem with a new coworker snowballs into another when she tries to rectify it on her own, without running for support from her old SC&P colleagues. She ultimately decides to take Richard's advice on the matter. One person who is welcomed with open arms is Don, as Jim Hobart has tried to woo him into the organization for years. Don will quickly find if he wants to reciprocate the love. He makes an impromptu decision to satisfy some need in his personal life.—Huggo", "It's moving day for those employees going over to McCann Erickson. Some, like Don, are welcomed with open arms while others aren't so lucky. Peggy, for example, learns that she doesn't have an office yet because they thought she was a secretary. She goes back to the old Sterling Cooper offices and spends time there with Roger who has yet to pack up his things but is already feeling homesick. Joan faces the biggest hurdles however as it becomes clear that her status at the old firm has not carried over the new. It leads to several confrontations and forces her to make a major decision. After Don walks out of a meeting with a roomful of creative directors, he once again sets out on a trek in search of fulfillment.—garykmcd"], "genres": "N/A", "imdbID": "3908436", "rating": 9.0, "votes": 2831, "number_of_episodes": 92}