{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0002122": "Harry Hamlin", "0369838": "Allan Havey", "0251851": "Trevor Einhorn", "4684548": "Sola Bamis", "2362068": "Caity Lotz", "1023127": "Jenny Wade", "2639311": "Kit Williamson", "2286886": "Stephanie Drake", "1634823": "Jill E. Alexander", "5664367": "Jacob Guenther", "0783432": "Keith Sellon-Wright", "0270003": "Heidi Fecht", "2744682": "Daniel Hall", "2319913": "Meg Cionni", "0398293": "Scott Hoxby", "6481648": "Alice Borcean", "3235031": "Craig Calman", "5042482": "Charles Christopher", "5847363": "Timothy Douglas", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "4128617": "Joseph Wilson"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["While Lou becomes the object of ridicule for the copy writers, Don tries to get away to California after a call from his pregnant niece. Meanwhile, the new office computer drives Ginsberg to the brink of insanity.", "Either by design or by accident, Stan finds out about what Lou does in his spare time, this activity which Lou *seemingly* wants kept secret. Stan decides he cannot resist spreading the news amongst the creative staff. This action places Stan in an awkward position, but places Don in a bind with regard to getting away to Los Angeles for the weekend. That last minute weekend trip is to visit with Anna's niece, Stephanie, who telephones out of the blue with the news that she is well-advanced in a pregnancy, and implies that she has no money and the father is no longer in her life. As such, Don offers to meet her at the Laurel Canyon house, with Megan taking care of her until he arrives. Don's Los Angeles trip ends up not being anything like he envisioned. On the personal side, a drug induced incident takes place, which by the sober light of day makes all feel a little embarrassed. But on the professional side, Don, by chance, gets hold of some information about goings-on at Sterling Cooper. He hopes to use this information to get back into the good, before his internal enemies get their way. Meanwhile, Ginsberg is being negatively affected by the white noise emanating from the new computer. Peggy is the unlucky recipient of his paranoia. And during a social gathering during what is regular chit-chat, Betty makes some comments on a topic that differ from Henry's political stance on the matter. This incident places a strain between the two, which is not helped by Sally's temporary return. Bobby, however, seems to be the most frightened by what he sees as the eventual outcome of what is happening in the Francis house.—Huggo", "Lou is upset when the staff learn about his other pursuit - drawing a cartoon character named Scout. They all think it's funny until Lou blows up and keeps them at the office late on a Friday night. It's also the day that Stephanie, Anna's niece, calls Don from California seeking his help. He sends her to Megan's house but because of the Lou situation can't get to Los Angeles until Saturday. He arrives to find that Megan has already given her money and she's left. That might, Megan throws a party and Harry Crane shows up. Harry has some important information about a possible new account - one which may force Don out as a partner. Back in New York, Michael Ginsberg is increasingly agitated by the presence of the IBM computer and forces Peggy to act after a very strange encounter. Elsewhere, Betty Francis is now arguing frequently with her husband Henry and continues to demonstrate her extremely limited parenting skills.—garykmcd"], "genres": "N/A", "imdbID": "3709284", "rating": 8.5, "votes": 2467, "number_of_episodes": 92}