{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "2656869": "Mason Vale Cotton", "0805476": "John Slattery", "0000566": "Julia Ormond", "0004802": "Linda Cardellini", "0714147": "Elizabeth Reaser", "0000211": "Mimi Rogers", "4684548": "Sola Bamis", "3267651": "Erica Piccininni", "0548498": "Brian Markinson", "1384265": "Kim Bubbs", "1305105": "Beth Hall", "4971298": "Evan Londo", "5296616": "Ryder Londo", "2639311": "Kit Williamson", "2286886": "Stephanie Drake", "0106227": "Jonathan Bray", "0205318": "Regi Davis", "5896371": "Calliway Callicott", "5160470": "Brandon Kruhm", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "0768947": "Tim Scanlon", "7661074": "Bruce M. Stockert"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["While Megan comes to New York with her mother and sister to collect her belongings, Don has a romance with the waitress. Meanwhile, Peggy and Stan work with a famous photographer on a commercial shoot.", "As his divorce reaches its final stages, Don learns from Harry that Megan is coming to town and wants Harry's help to find a new agent. Don stays clear of the apartment when Megan is scheduled to clear out her things, supposedly just a few boxes. Megan's mother Marie has something else in mind. When it comes time to sign the divorce papers, Megan tells him just what is on her mind. Harry meanwhile steps over the line. Don visits Diana the waitress who has relocated to the city and they begin a relationship. At the office Peggy and Stan disagree over the use of photographer Pima Ryan for a photo shoot. Peggy thinks she's an artist but Stan, also a photographer, thinks otherwise.—garykmcd", "Don and Megan's divorce proceedings are in their final stages. On the surface, it has so far been cold but at least cordial. Megan plans to go to New York to pick up her items from the apartment, during which time Don plans to make himself scarce. On Megan's side, the divorce process is affected by: help from both her mother and sister, who she has asked to come to New York to provide emotional support, each who has her own perspective of the divorce on the Calvet family, with Marie making a unilateral decision; Roger's unexpected involvement in the move; and Megan's struggling acting career in Los Angeles, and her asking Harry for some help in getting a new agent. On Don's side, the divorce process is affected by: he sitting with Bobby and Gene while Betty and Henry are out for the evening; and his pursuit of Diana, the waitress, and hearing a bit of her life story. Meanwhile, Peggy has decided to hire photographer Pima Ryan for a vermouth campaign, Pima who is renowned in niche circles in the art photography business. This move does not sit well with Stan, who feels Pima will overwhelm his process as art director. Peggy and Stan's individual dealings with Pima lead to two different conclusions on working with Pima.—Huggo"], "genres": "N/A", "imdbID": "3868862", "rating": 7.8, "votes": 2404, "number_of_episodes": 92}