{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "2656869": "Mason Vale Cotton", "0805476": "John Slattery", "1555340": "Alison Brie", "0000566": "Julia Ormond", "0339304": "Bruce Greenwood", "2362068": "Caity Lotz", "0261452": "Christine Estabrook", "1543212": "Amy Ferguson", "1463709": "Fiona Gubelmann", "0004829": "Spencer Treat Clark", "2443416": "Anna Osceola", "1443368": "Brett Gelman", "0661651": "Jeffrey Vincent Parise", "0000644": "Helen Slater", "0036439": "Evan Arnold", "1305105": "Beth Hall", "4971298": "Evan Londo", "5296616": "Ryder Londo", "2286886": "Stephanie Drake", "6505019": "Caiden Milick", "6507096": "Aria Lyric Leabu", "1408499": "Brian Durkin", "4041995": "Ryan Ahern", "0273972": "Francesca Ferrara", "1703287": "Joey Honsa", "0039504": "Phil Aslaksen", "0094145": "Michael Bondies", "6686466": "Lyndell Higgins", "7218598": "Micah Lopez", "2076964": "Linda Neary", "6514521": "Joshua Nicks"}, "geners": ["Drama"], "runtimes": ["56"],  "plot": ["Don's journey ends in California with Anna's niece, Stephanie, where he contemplates his future. Roger decides to marry Megan's mother, Marie. Joan has a business proposition for Peggy, who is coming to terms with her feelings for Stan.", "Many from Sterling Cooper are still evaluating their new lives at McCann Erickson and deciding if there is a future for them there. Roger makes two decisions in his personal life, one relating to his legacy. Pete has decided to start a new life with Trudy and Tammy in Wichita by taking the lucrative Lear Jet job. Peggy believes she's settling into her new McCann Erickson life, despite not finding the environment as easy to maneuver within as it was at Sterling Cooper. Peggy's professional path takes a possible turn with an offer by Joan, who seizes upon an opportunity initiated by Ken to reinvent her professional self. That new professional life may be at odds with Joan's personal life with Richard. What Peggy decides to do professionally may be influenced by a personal revelation that blindsides her. And Don is still traveling the country in his post-McCann retirement life. While doing some speed driving on the Bonneville Salt Flats, he finds out about Betty's terminal lung cancer diagnosis. That and a reunion with Anna's niece Stephanie to return something he believes rightly belongs to her leads to Don critically reviewing his \"Don Draper\" life and if there is a next phase to it.—Huggo", "In the series finale, Don continues his journey, arriving in California where he drops in on Stephanie, his old friend Anna's niece. She drags him off to a retreat where he hits rock bottom. A rejuvenated Don however comes up with yet another great idea. In New York, Joan has lunch with Ken and may have a new company and a new career in her future.Peggy and Stan come to a pleasantly shocking realization about their feeling for one another.Roger and Marie settle into their life together while Pete and his family head off to Wichita in a company jet. Sally grows up considerably and takes over many of her mother's responsibilities.—garykmcd"], "genres": "N/A", "imdbID": "3756834", "rating": 9.3, "votes": 5143, "number_of_episodes": 92}