{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "2656869": "Mason Vale Cotton", "0805476": "John Slattery", "1745019": "Maggie Siff", "0714147": "Elizabeth Reaser", "0251851": "Trevor Einhorn", "0187460": "Rebecca Creskoff", "4684548": "Sola Bamis", "0936403": "Ray Wise", "0542074": "Jon Manfrellotti", "2286966": "Jay Seals", "0646351": "Larisa Oleynik", "0188614": "Greg Cromer", "0495450": "Joshua LeBar", "0424035": "Paul Johansson", "0347957": "Devon Gummersall", "1695198": "Nick Toren", "2286886": "Stephanie Drake", "3457198": "Kirstin Ford", "3958585": "Rainey Qualley", "0425714": "Maliabeth Johnson", "5415032": "Carmela Corbett", "3800604": "Stevie Nelson", "0184087": "Dale Waddington", "1510131": "Alison Martin", "3563401": "Sam Buchanan", "6481648": "Alice Borcean", "4489842": "Alan Charlston", "3178222": "Nicole George", "5237637": "Dylan James Holt", "5253527": "Holly Houk", "0633271": "Richard Nixon", "7487268": "Cheyenne Nugent", "6646040": "Natalie Pelletier", "3615551": "Hudson Phillips", "6522136": "Dylan Ryan", "2515760": "Ryan Self", "3309041": "Jaynee Silvers", "7843257": "Erin St. James"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don is oddly drawn to a diner waitress as he learns about the loss of an old acquaintance, Peggy and Joan are disrespected by a chauvinistic client, and Cosgrove is in for big changes after his biggest business connection retires.", "McCann Erickson's fifty-one percent purchase of Sterling Cooper has led to bigger changes to SC than most of the partners or higher account executives realize. The partners are now all millionaires, and they believe that they can leverage McCann's business to further their own. Topaz is one such account, which is causing problems for Joan and Peggy, the account leads. Topaz, whose primary business is affordable drug store hose, is being squeezed from below by Hanes' new mass market line, Leggs, which not only sells in drug stores but also supermarkets. In consultation with Don, Joan and Peggy go into a meeting with McCann account managers to discuss the proposal. The mixed results lead to an angry Joan evaluating the way she presents herself, while it affects a blind date Peggy has with Mathis' visiting brother-in-law. The Topaz account and another creative involving a commercial where the chosen model will wear a chinchilla fur coat makes Don think about someone from his past. What he eventually learns about her leads to him trying to make amends in his own mind about their past relationship, as well as think about a waitress he sees in a diner, she who triggers an emotional response with what is going on in his more open life, which includes an imminent divorce from Megan. And Ken's father-in-law finally retiring leads to thoughts between Ken and Cynthia about Ken's own future and what he really wants. What Ken decides to do is spurred by something that happens at work.—Huggo", "It all appears to be business as usual at Sterling Cooper after their adversaries purchase just under half of the company. McCann still pulls some of the strings however as is evident when they insist that a senior employee be fired. Joan and Peggy are having trouble with a client, a stockings manufacturer who is now being undercut by a new entrant to the market. They realize part of the solution is store branding and reach out to their partners at McCann for help but it only leads to humiliation, especially for Joan. Don Draper tries to help them out by contacting Rachel Katz but is surprised at what he learns. Peggy meanwhile goes out on a blind date.—garykmcd"], "genres": "N/A", "imdbID": "3239886", "rating": 8.1, "votes": 2549, "number_of_episodes": 92}