{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0615063": "Joel Murray", "0002122": "Harry Hamlin", "0051104": "Talia Balsam", "3500582": "Teyonah Parris", "0369838": "Allan Havey", "0251851": "Trevor Einhorn", "0723415": "Elizabeth Rice", "1789336": "Jessy Schram", "1484231": "Derek Ray", "3129311": "Josh McDermitt", "1151899": "Robert Baker", "1157175": "Stephen Sullivan", "1305105": "Beth Hall", "2286886": "Stephanie Drake", "1634823": "Jill E. Alexander", "4055618": "Jordan Fiderio", "4057157": "Sammy Fiderio", "1723030": "Michelle Lombardo", "2471150": "Jennifer H. Caldwell", "3235031": "Craig Calman", "5710725": "Amy Cates", "7104742": "Michael DeBartolo", "2153594": "Eric John Dugan", "7697720": "Elio Nimali", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "3378785": "Channing Sargent", "2808025": "Julian Vada"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["Don returns to work, but quickly falls off the wagon after learning that he's been assigned to Peggy. Meanwhile, Roger and his ex-wife go to a commune to rescue their daughter, who has abandoned her child.", "In a chance meeting with George Payton, Pete not only learns some news about his father-in-law, but also that a new national account in the form of fast food chain Burger Chef might be up for grabs, which would be a major coup for Sterling Cooper. The strategizing about what to do about Burger Chef takes into account the fact that Don is back at work, albeit in a much diminished capacity, as among the many stipulations are that he refrain from drinking at work except with clients, and that he report to Lou. Regardless, Lou, feeling threatened by Don's return, spends an on-going $5,000 per year of the company's money solely to get the issue of Don off his desk. Peggy is ultimately assigned head of the Burger Chef team, about which she is honored until she begins to realize that the assignment had some ulterior motives. Despite being back in the office, Don feels isolated, especially as he has no partner to which he feels he can turn, as Roger, his one ally, is temporarily away, and as Jim focuses on his pet project, that being the installation of the new mainframe computer Harry has long requested. That installation has longer ranging effects in the office than just its intended job. Don finds out where he fits in the current company pecking order when he takes what he believes is decisive action regarding an aspect of the computer company itself. Don ends up getting a clearer perspective of the current situation from someone who feels he has been there before. Roger's current absence is because he, Mona and Brooks have to figure out what to do about Margaret, who has left Brooks and their son Ellery to go live on a hippie commune upstate.—Huggo", "Don is back at work but has little to do and its clear none of the senior people in the firm, other than Roger, wants him there. In California, Pete Campbell gets a crack at getting the Burger Chef account, a 1000 restaurant fast food chain. Some of the partners want Peggy to lead the campaign and Lou appoints Don to be a member of her team. He resents it and gets drunk but Fred Rumsen has a few choice words for him. Roger's daughter has left her husband and run off to live in a commune in upstate New York. He and his ex-wife Mona travel there but it's Roger who proves to be the most reasonable parent, at least initially.—garykmcd"], "genres": "N/A", "imdbID": "3680402", "rating": 8.5, "votes": 2413, "number_of_episodes": 92}