{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0002122": "Harry Hamlin", "1555340": "Alison Brie", "2312345": "James Wolk", "0369838": "Allan Havey", "0251851": "Trevor Einhorn", "1789336": "Jessy Schram", "0261452": "Christine Estabrook", "0338768": "H. Richard Greene", "4464409": "Mary Grill", "0322182": "Matthew Glave", "2286886": "Stephanie Drake", "2049551": "Alexandra Ella", "1634823": "Jill E. Alexander", "6505019": "Caiden Milick", "6507096": "Aria Lyric Leabu", "0238004": "Eddie Driscoll", "1225333": "Timothy Brennen", "1147128": "Jocelyn Ayanna", "3615551": "Hudson Phillips"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Peggy has second thoughts about her Burger Chef campaign when Don is asked to pitch her commercial, Pete visits his wife and daughter on his trip back to New York, and Bob Benson gets some surprising news from G.M. about the account.", "Peggy is persuaded into assigning Don to deliver the pitch for Burger Chef, but she is reluctant as to whether the work is good enough. Pete visits Trudy and his daughter, the result of which doesn't please Bonnie. Meanwhile, Bob pitches a proposal to Joan, bringing bad news to the company.", "Pete makes a trip to New York, part business to catch up primarily with the Burger Chef pitch, and part pleasure to see his daughter Tammy, who he has not seen in a while. Accompanying him is Bonnie, for who this trip is all pleasure. Pete being preoccupied with his other commitments makes the trip less than what either he or Bonnie wanted. On the personal side, Pete lashes out at Trudy more in that fine line between love and hate. On the professional side, he throws Peggy for a loop, whose Burger Chef pitch to the internal team is generally well received. Pete's suggestion leads to Peggy second guessing herself, she who was less than enthralled with the process of having to conduct surveys of Burger Chef customers across the country with Mathis. This leads to a standoff between her and Don. Another person back in the office is Bob Benson, who has returned temporarily from Detroit with the Chevy team. One of those team members, Bill Hartley, shows that he knows more about Bob's personal life than most. Bill also provides Bob with some news, which not only affects Sterling Cooper, but Joan personally if Bob has his way. Also back in New York temporarily is Megan, who has come for the week primarily to pick up a few things. Although the things she needs she implies are just to carry her over for the season, those things may make her stay in Los Angeles seem more permanent.—Huggo", "Work continues on the Burger Chef account and Peggy makes her presentation to Pete Campbell who has come to New York. He's satisfied, as is Lou Avery, and even Don tells her she did a good job. He wonders however if that's the best they can do which sends Peggy into a black mood of self doubt. Don helps her work through it. Megan is in New York to pick up some of her things and it doesn't appear that she and Don will ever grow closer. Pete Campbell visits his little girl - who barely recognizes him - and take Trudy to task. Pete's girlfriend has had enough of him as well. Bob Benson is also in town with a couple of men from General Motors. He learns that SCP is losing Chevrolet but that will likely land on his feet. He also has a question for Joan.—garykmcd"], "genres": "N/A", "imdbID": "3709286", "rating": 8.9, "votes": 2823, "number_of_episodes": 92}