{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "2656869": "Mason Vale Cotton", "0805476": "John Slattery", "0339304": "Bruce Greenwood", "0251851": "Trevor Einhorn", "2804947": "Marten Holden Weiner", "0369838": "Allan Havey", "1881004": "Rachel Cannon", "1505370": "Hannah Leigh", "1543212": "Amy Ferguson", "3028348": "Madison McLaughlin", "4337287": "Juliette Angelo", "4971298": "Evan Londo", "5296616": "Ryder Londo", "2639311": "Kit Williamson", "2286886": "Stephanie Drake", "3615258": "Kiva Jump", "6505019": "Caiden Milick", "0787170": "Pamela Shaddock", "6442574": "Gabriella Weltman", "7274366": "Bob Brauer", "9129150": "Melissa Renee Armstrong", "6063918": "Phoenix Cirillo", "4522292": "Spencer Jarman", "7487268": "Cheyenne Nugent", "7510247": "Nathan Szczotka", "6012560": "Alexandra Elena Todd"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["Don decides to sell his apartment, Joan stumbles into a relationship while on a trip to Los Angeles, Glen tells Betty and Sally that he is going to Vietnam, and a copywriter gets in trouble for his rude behavior to a client.", "Don has several opportunities to reflect on the state of his life and his future. First, he's in the process of selling his apartment. Melanie, his real estate agent, tells him what the state of his apartment displays to the outside world. Second, he's asked by Roger to prepare some materials for a McCann retreat that Roger is attending in the Bahamas, those materials which is to include a look into Sterling Cooper's future. That reflection is influenced by unofficial discussions he has on the issue with among others Peggy and Ted. Third, he has dinner with Sally and a group of her friends, before they are heading off on a summer educational tour. Sally opens up to Don about her feelings toward their family based in part on that dinner. And fourth, he gets caught up in some internal strife on those working on the Peter Pan cookie account, those people being Peggy, Pete, Mathis and Ed. Meanwhile, Betty learns that Sally has maintained a friendship over all these years with Glen Bishop, who has some surprising news for both Sally and Betty. And Joan takes a business trip to Los Angeles, where she meets a divorced developer named Richard Burghoff, the two who seem mutually attracted to each other from the start. They both seem to want to pursue a relationship, but are somewhat reluctant to bring out the skeletons from their respective closets.—Huggo", "Don is tasked with writing a speech for Roger to deliver at an upcoming retreat for McCann executives. The topic is where he thinks the company will be a year from now but Don is having trouble coming up with just what that might be. He's also trying to sell his apartment but the real estate agent is having trouble finding a buyer. Sally gets a surprise visit from Glen Bishop who tells her he's joined the army and will likely go to Vietnam. She's outraged at what he's done. Betty thinks he's very brave and is flattered by the attention he gives her. In Los Angeles to conduct job interviews with Lou Avery, Joan meets Richard, a property developer, and they take an immediate liking to one another. He changes his tune when he learns that Joan has a four year-old son. Don tells Sally a few hard truths just before she leaves on a school bus trip.—garykmcd"], "genres": "N/A", "imdbID": "3908430", "rating": 8.3, "votes": 2409, "number_of_episodes": 92}