{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "2656869": "Mason Vale Cotton", "0805476": "John Slattery", "1555340": "Alison Brie", "0339304": "Bruce Greenwood", "3500582": "Teyonah Parris", "0369838": "Allan Havey", "4684548": "Sola Bamis", "2286886": "Stephanie Drake", "0338768": "H. Richard Greene", "0424035": "Paul Johansson", "0608632": "William R. Moses", "0217645": "Nikki Deloach", "0823289": "Anthony Starke", "1305105": "Beth Hall", "1634823": "Jill E. Alexander", "3371044": "Anthony Gioe", "0954623": "Scot Zeller", "3732165": "Ava Acres", "7466642": "Samantha Desman", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips", "3530581": "Heather Schlitt", "5809057": "Lisa Y. Sheeler"}, "geners": ["Drama"], "runtimes": ["47"],  "plot": ["The partners discover that the firm is losing its independence and there's nothing they can do about it. Peggy is not sure if she wants to come along. Meanwhile, Pete and Trudy have trouble getting their daughter into private school.", "While working on an account with Stan that involves children, Peggy muses about how terrible a mother she would be. Trudy is facing a difficult time getting Tammy into the pre-school she wants - a school at which a Campbell has attended for as long as Pete can remember - and as such, Pete decides to help Trudy smooth the waters with the school's administration to get Tammy a placement there. These and other personal issues take a back seat when a crisis occurs at Sterling Cooper from what looked to be a simple but devastating clerical oversight. It was not an oversight, but rather a calculated move. The Sterling Cooper partners want the crisis placed under wraps from the staff until they decide how best to handle it. Through the worries of the partners, Don believes he has stumbled onto a solution, which may take some maneuvering to achieve. One of those more difficult manoeuvrings entails getting Ken on side, he who still has hard feelings about being let go by Roger. As they deal with the issues, all the partners reflect on how this crisis will affect their own personal lives, especially their current relationships. As Peggy gets wind of what's going on, she too reflects on where she is in her life, and how giving her son away has affected her psyche.—Huggo", "When Roger receives a letter from the firms landlord saying their lease has been terminated, he's certain it's just a clerical error. A call to McCann Erickson confirms his worst fears: Sterling Cooper is being shut down with the staff moving over to their premises. They have a meeting with Jim Hobart the next day and Don eventually suggests that they try to keep as many of their clients as they can and service them from their small office in California. As word begins to spread around the office, near panic ensues. By the time they meet with Jim it's obvious the decisions they've made are irreversible. Meanwhile. Pete Campbell has a problem getting his daughter in the school of his choice; Ken Cosgrove is having fun as the head of advertising for Dow; and Peggy and Stan talk about the choices she's made in life.—garykmcd"], "genres": "N/A", "imdbID": "3707054", "rating": 8.9, "votes": 2613, "number_of_episodes": 92}