{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0002122": "Harry Hamlin", "3500582": "Teyonah Parris", "0369838": "Allan Havey", "0240043": "Anne Dudek", "0251851": "Trevor Einhorn", "4684548": "Sola Bamis", "0004895": "David James Elliott", "0565611": "Johnathan McClain", "0804361": "Pat Skipper", "1593633": "Kandis Fay", "1305105": "Beth Hall", "4971298": "Evan Londo", "5296616": "Ryder Londo", "2639311": "Kit Williamson", "2286886": "Stephanie Drake", "3847085": "Rachel DiPillo", "3457198": "Kirstin Ford", "0787170": "Pamela Shaddock", "0582773": "Jim Metzler", "2259835": "Brandi Burkhardt", "2601498": "Aynsley Bubbico", "0397912": "Worth Howe", "6481648": "Alice Borcean", "3235031": "Craig Calman", "5483039": "Wayo Dorsey", "6149436": "Haley Lyn Gilchrist", "7487268": "Cheyenne Nugent", "3615551": "Hudson Phillips"}, "geners": ["Drama"], "runtimes": ["48"],  "plot": ["After a fight with Megan during a surprise trip to California, Don decides it's time to get back to work. Meanwhile, Betty joins Bobby on a field trip to a farm.", "Don has a less than satisfying telephone conversation with Dawn, the ultimate problem being Don's remote location and Dawn having other priorities in the office. Then, Don has a telephone conversation with Alan Silver, Megan's agent, which leads to Don making a last minute trip to Los Angeles to surprise Megan. The surprise also ends up being ultimately less than satisfying for both. Next, Don sets up a meeting with Dave Wooster to talk business, which again ends up being a little less than Don wanted. All these events make Don come to the realization that he wants and is ready to go back to work at Sterling Cooper. As such, he talks to the one partner he believes is on his side: Roger. After speaking to Roger, what Don anticipates when he walks back into the office and what happens are two totally different things. Beyond each partner's belief when Don was put on leave, what happens is affected by an earlier meeting in which Harry was required to put out a fire on behalf of Jim. After going on a luncheon with Francine, Betty returns home to discover that Bobby's class is going on a field trip. To be closer to him, she decides to volunteer as a chaperon. The mother/son relationship goes well during the trip until... That situation leads to an emotional Betty wondering about her fitness as a mother.—Huggo", "Don receives a phone call from Megan's agent, Alan Silver, who is worried about his budding young star. She recently freaked out at an audition and later tracked down the director at a restaurant begging for another chance. Don flies out there and she's happy to see him until he tells exactly why he's there. She doesn't react well and he finally decides to tell the truth about losing his job but it only makes matters worse. On his return to New York, he confronts Roger who finally tells him to come into work on Monday morning. When he shows up for work, Roger has not yet come in, some are happy to see him while others make their displeasure known. In the end, the partners agree to let him return, but under strict conditions. Meanwhile, Betty accompanies Bobby on a school trip to a farm but things don't go well.—garykmcd"], "genres": "N/A", "imdbID": "3678086", "rating": 8.6, "votes": 2543, "number_of_episodes": 92}