{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0002122": "Harry Hamlin", "3500582": "Teyonah Parris", "0369838": "Allan Havey", "4684548": "Sola Bamis", "1789336": "Jessy Schram", "0004895": "David James Elliott", "0338768": "H. Richard Greene", "4337287": "Juliette Angelo", "3491395": "Christine Garver", "2286886": "Stephanie Drake", "3615258": "Kiva Jump", "6442574": "Gabriella Weltman", "7487268": "Cheyenne Nugent"}, "geners": ["Drama"], "runtimes": ["45"],  "plot": ["Sally discovers that Don is not working, Pete lands a big account but is undercut by management, and Joan is forced to move some secretaries around after Lou and Peggy have some problems.", "It's Valentine's Day, but there is not much love in the air. Don is still not feeling the love from the other partners, his job situation of which he has not told anyone outside of the office, that including his family. Dawn at least has agreed to keep him in the loop of what is going on in the office as best as she can. Sally, who is in town unexpectedly for the day, drops in on him, which leads to a further rift between father and daughter. Peggy forgets that it's Valentine's Day until she sees a bouquet of roses sitting in her outer office which she assumes are from Ted. Peggy spends most of the day trying to figure out what to do with the roses and how to deal with Ted from afar. Pete is feeling neglected, by Ted but more by the New York partners, most specifically Roger and Jim. A coast to coast conference call also exposes a problem between Roger and Jim. These issues in combination lead to a problem for Joan in orchestrating a session of musical chairs, the problem which is exacerbated by input from Bertram. However, Joan may, through it all, maneuver her own much appreciated change of office scenery.—Huggo", "Don still isn't working but is keeping tabs on the goings on at the office courtesy of regular visits from his former secretary, Dawn. His facade is shattered however when Sally, who's lost her purse on a shopping expedition in Manhattan, goes to his office only to find Lou sitting in his office and her father nowhere to be found. When she confronts him, he lies as he has always done. They find middle ground however and surprisingly form a close bond. Sally's unexpected visit to the office has other repercussions. Lou wants Dawn replaced while Peggy also wants her secretary replaced. Joan is caught in the middle but finds a nice solution, thanks to Jim Cutler. In California, Pete Campbell is frustrated after the office in New York takes over a major client he's just landed.—garykmcd"], "genres": "N/A", "imdbID": "3669680", "rating": 8.3, "votes": 2454, "number_of_episodes": 92}