{"cast": {"0358316": "Jon Hamm", "0005253": "Elisabeth Moss", "0440229": "Vincent Kartheiser", "0005064": "January Jones", "0376716": "Christina Hendricks", "1837590": "Aaron Staton", "1360860": "Rich Sommer", "2215143": "Kiernan Shipka", "0664175": "Jessica Paré", "0706716": "Kevin Rahm", "0822448": "Christopher Stanley", "0272474": "Jay R. Ferguson", "1133651": "Ben Feldman", "2656869": "Mason Vale Cotton", "0607666": "Robert Morse", "0805476": "John Slattery", "0002122": "Harry Hamlin", "0051104": "Talia Balsam", "3500582": "Teyonah Parris", "0369838": "Allan Havey", "0251851": "Trevor Einhorn", "0338768": "H. Richard Greene", "1484231": "Derek Ray", "3129311": "Josh McDermitt", "0005192": "Kellie Martin", "2740213": "Elijah Nelson", "1305105": "Beth Hall", "4971298": "Evan Londo", "5296616": "Ryder Londo", "2286886": "Stephanie Drake", "4055618": "Jordan Fiderio", "4057157": "Sammy Fiderio", "5664367": "Jacob Guenther", "1042946": "Michael Patrick McGill", "0727692": "Scott Rinker", "3967559": "Charlie DePew", "0506346": "Barry W. Levy", "1705451": "Joe Pistone", "5847363": "Timothy Douglas", "5500008": "Alison Abernathy", "6481648": "Alice Borcean", "3235031": "Craig Calman", "2210481": "Marisa Field", "2306491": "Sai Gundewar", "3292617": "Heather Lynch", "7487268": "Cheyenne Nugent", "3102744": "Meredith Ostrowsky", "3615551": "Hudson Phillips", "6254616": "China Taylor", "1467292": "Timothy T Tyler"}, "geners": ["Drama"], "runtimes": ["45"],  "plot": ["Don and Peggy prepare to pitch to Burger Chef, one day after the Apollo Moon Landing. Meanwhile, a power struggle in the firm between Sterling and Cutler leaves Don's future hanging in the balance.", "The Apollo 11 space mission is in progress, which looms over the lives of those associated with Sterling Cooper. The success or failure of the mission will effect the existing feeling of brotherhood and camaraderie among the American populace, which in turn will have an effect on Sterling Cooper's business, especially how receptive the Burger Chef reps will be. But there is also much turmoil within the company. Jim has a vision for the company as being primarily Harry and the computer, as witnessed by Jim's approved motion to make Harry a partner. What has been bubbling under the surface but which has now risen above with a recent incident with the Sunkist reps is Ted's dissatisfaction with his life and his job. A unilateral move by one of the partners on behalf of all the partners leads to some divided loyalties among them, those loyalties between the people involved and what each may see as the good of the company. Regardless of the Apollo 11 mission, real life continues, an incident during which which leads to individuals trying to capitalize on it to advance their own point of view. These manoeuvrings have an effect especially on Don and Peggy in different ways. For Peggy, it may make or break her advertising career, who is at a crossroads in her personal life path as she deals with changing circumstances with her ten year old neighbor, Julio. And with Don, it could mean his general livelihood, as well as provide a clearer perspective on his current personal life with Megan. Meanwhile, the Francis' have house guests in the form of Betty's college friend Carolyn Glaspie, her husband Richard, and their two teenaged sons, Sean the jock, and Neil the geek. Sally uses the opportunity of their visit to test her burgeoning sexuality.—Huggo", "The lunar landing serves as a backdrop. Cutler thinks he finally has Don ousted on a technicality, but Roger brokers a power coup in a diner that will change all the partners' futures. Meanwhile, at Burger Chef Headquarters, Peggy reluctantly takes the lead on the final pitch, and knocks it out of the park. An unexpected event takes out a senior partner, and Sally gets bored with the Big Event and decides to stir things up when Henry's relatives come to visit.—hairgut", "Infighting at the office continues as Don receives a letter from the firm's lawyers saying he's in breach of the terms of his employment - by crashing the Philip Morris meeting - and is fired. Don calls an impromptu meeting in the open space outside Roger's office where the matter is put to rest. While chatting on the phone with Megan who is in California, he realizes they've come to the end of the road. Don, Peggy and Pete head off to Indianapolis to make their pitch to Burger Chef. It's the night that Neil Armstrong and Buzz Aldrin set foot on the moon and everyone is agog. Roger receives a distressing phone call however - one that may result in Don being shown the door. Roger moves quickly however coming up with a plan that satisfies almost everyone.—garykmcd"], "genres": "N/A", "imdbID": "3740788", "rating": 9.5, "votes": 4035, "number_of_episodes": 92}