{"cast": {"1428827": "Hidenobu Kiuchi", "1145982": "Mamiko Noto", "0645634": "Tamio Ôki", "1024956": "Yukari Nozawa", "0015342": "Yôsuke Akimoto", "0998211": "Naoya Uchida", "2714360": "Megu Ashiro", "1145592": "Shiho Kawaragi", "0620383": "Kazuhiro Nakata", "1708798": "Caitlin Glass", "0329361": "Barbara Goodson", "1035500": "Kyle Hebert", "1240448": "Liam O'Brien", "1315809": "Stephanie Sheh", "0448686": "Christopher Corey Smith", "0815040": "Michael Sorich", "0422849": "Doug Stone", "1022263": "Karen Strassman"}, "geners": ["Animation", "Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["With the help of Maurer, a local newspaper journalist, Dr. Tenma is able to track down the Fortners on the day of the twins' twentieth birthday.", "Tenma visits a Heidelberg newspaper agency. He is permitted by a reporter to look through the archives for the article about the twins' disappearance. They find that Mr.Fortner had filed a missing person's report on a boy. Meanwhile, It's Nina's 20th birthday. She goes to the school counselor to talk about her fainting. Upon recollection, Nina says that the boy made her nostalgic. She gets another email asking her to come to Heidelberg castle. Mr. and Mrs. Fortner are reluctant to share information on the report. Tenma sensing danger hurries to Heidelberg castle.—Naveen Srivatsa", "Tenma uncovers evidence that reveals Johan will meet his twin sister Anna in Heidelberg when she turns 20. Tenma reveals everything to Maurer, a journalist for a local newspaper, and asks for his help in finding Anna. Maurer is unwilling at first, but he investigates with Tenma, and the two of them finally pinpoint Anna's location...", "Tenma uncovers evidence that reveals Johan will meet his twin sister Anna in Heidelberg when she turns 20. Tenma reveals everything to Maurer, a journalist for a local newspaper, and asks for his help in finding Anna. Maurer is unwilling at first, but he investigates with Tenma, and the two of them finally pinpoint Anna's location. Meanwhile, Anna has no memories of leaving the hospital. She was adopted by the Fortners and has grown up as Nina. On her 20th birthday, she receives a mysterious message inviting her to Heidelberg Castle."], "genres": "N/A", "imdbID": "1319946", "rating": 8.3, "votes": 1819, "number_of_episodes": 75}