{"cast": {"1428827": "Hidenobu Kiuchi", "0765815": "Nozomu Sasaki", "1145982": "Mamiko Noto", "0645634": "Tamio Ôki", "1024956": "Yukari Nozawa", "0623214": "Gorô Naya", "0840684": "Taimei Suzuki", "0998211": "Naoya Uchida", "2069528": "Eiji Hanawa", "2714360": "Megu Ashiro", "1145592": "Shiho Kawaragi", "1566172": "Shintarô Ôhata", "1327264": "Yasuyuki Kase", "10333318": "Mariko Takigawa", "1349676": "Hunter Mackenzie Austin", "1063287": "Doug Erholtz", "1708798": "Caitlin Glass", "0329361": "Barbara Goodson", "0292823": "William Frederick Knight", "0566332": "Michael McConnohie", "1240448": "Liam O'Brien", "0726184": "Sam Riegel", "1315809": "Stephanie Sheh", "1142722": "Keith Silverstein", "0448686": "Christopher Corey Smith", "0815040": "Michael Sorich", "1022263": "Karen Strassman"}, "geners": ["Animation", "Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["23"],  "plot": ["While Dr. Tenma investigates the serial murders of middle-aged, childless couples and Johan's true identity, law student Nina Fortner receives poetic emails from a stranger.", "In Heidelberg, a girl named Nina Fortner rushes to class. She is a top student and is admired by everyone. She works as a part time pizza delivery girl and also takes karate classes. Nina comes home to find a corny romantic email written to her by an unknown boy. In Koln, Tenma searches for the identity of Yohan. He finds that Yohan lived in a lot of places and went by the names Michael and Franz. A war veteran reiterates that the boy learnt French and English with ease and always wants to hear war stories. Few days later Yohan shows up at Nina's school.—Naveen Srivatsa", "Nina Fortner is a student at the University of Heidelberg. She is an upbeat girl who works hard at her studies, club activities and part-time jobs. She also likes to imagine the \"prince charming\" who sends her romantic anonymous emails. Nina has no memories from before the age of ten...", "Nina Fortner is a student at the University of Heidelberg. She is an upbeat girl who works hard at her studies, club activities and part-time jobs. She also likes to imagine the \"prince charming\" who sends her romantic anonymous emails. Nina has no memories from before the age of ten. Meanwhile Tenma is after Johan, who has committed another murder right before his eyes. In Munich, he meets a blind old man who says that he taught foreign languages to Johan eight years ago."], "genres": "N/A", "imdbID": "1319948", "rating": 7.9, "votes": 1847, "number_of_episodes": 75}