{"cast": {"0644022": "Bob Odenkirk", "0052186": "Jonathan Banks", "0781533": "Rhea Seehorn", "0264579": "Patrick Fabian", "3103126": "Michael Mando", "0571106": "Michael McKean", "1024264": "Julie Ann Emery", "0787892": "Jeremy Shamos", "0592923": "Dorian Missick", "0488095": "Vincent Laresca", "5674152": "Peter Diseth", "0368727": "Jim Hatch", "5095369": "Caleb Burgess", "5771225": "Sage Bell", "5541402": "Rick Anglada", "6730355": "William Fogle"}, "geners": ["Crime", "Drama"], "runtimes": ["48"],  "plot": ["Jimmy must prove that Nacho is innocent when he is wrongly suspected of kidnapping.", "The episode begins some time prior to the series. A younger Chuck meets Jimmy in Cook County Jail, where Jimmy has been imprisoned for unspecified offenses which risk having him labeled as a sex offender. Chuck warns Jimmy that his life will be ruined if the charges go through, and Jimmy pleads with Chuck to help get the charges against him dismissed. Chuck agrees to represent Jimmy under the condition that he cleans up his act. In the present, Jimmy is anxious about Nacho's plot to extort the Kettlemans. He calls Kim Wexler, an acquaintance of his who works at Chuck's former law firm, which is providing legal counsel to the Kettlemans. Jimmy indirectly warns Kim about the potential danger to the Kettlemans, but then breaks off the call, insisting that he \"is no hero.\" Later that night, Jimmy leaves an anonymous tip to the Kettlemans warning them that they are in danger. Concerned, the Kettlemans look outside their house and see somebody in a parked van watching them. The next morning, after badgering a prosecutor into accepting a plea deal, Jimmy receives news from Kim that something has happened to the Kettlemans. He rushes to their house to find it surrounded by police, and finds out the Kettlemans, including their two children, have gone missing. Believing that Nacho has kidnapped them, Jimmy uses Nacho's contact number but only receives a voice-mail. However, while waiting for Nacho's reply, Jimmy is picked up by the police, who tell him that they had arrested Nacho on suspicion of kidnapping the Kettlemans, and he had requested Jimmy as his legal counsel. At the police station, Nacho admits that he had performed surveillance on the Kettlemans but denies kidnapping them. Nacho warns Jimmy that if he does not get the charges dropped, the police might uncover his connections to Tuco, which would result in Jimmy's death. Jimmy unsuccessfully tries to plead Nacho's case to the cops. Jimmy convinces Kim to take him to the Kettleman house to investigate the crime scene. Jimmy notices some inconsistencies, such as a missing child's doll, and theorizes that the Kettlemans staged their kidnapping. Jimmy privately admits to Kim that he warned the Kettlemans about Nacho and probably drove them into hiding. Upon returning to the courthouse, Jimmy starts a fight with Mike, who effortlessly subdues him. The police ask Mike to press assault charges against Jimmy so that they can leverage him to testify against Nacho. Surprisingly, Mike takes Jimmy's side and refuses to press charges, as he believes his theory about the Kettlemans' disappearance is correct. Mike recounts a similar case he investigated as a Philadelphia police officer, where a suspect faked his disappearance. Mike tells Jimmy that the Kettlemans should still be hiding somewhere in the area. With the new lead, Jimmy explores the forest near the Kettleman home and finds their campsite. Jimmy confronts the Kettlemans and gets into a struggle, inadvertently discovering the stolen money.—Jimmy", "Unnerved by Nacho's plan to rob the Kettlemans of the $1.6 Craig Kettleman embezzled as county treasurer, Jimmy makes an anonymous call warning them of the impending house invasion. It comes back to haunt him when he learns that the entire Kettleman family has been kidnapped and that Nacho is under arrest. Nacho swears he's innocent--he was sitting in a van casing out their house--and expects Jimmy to get him off. In looking at the evidence, things don't sit right with Jimmy and he concludes the Kettlemans might have staged the whole thing. The end result is Nacho is set free and Jimmy solves his financial problem. Meanwhile, Jimmy has another run-in with the parking-lot attendant, Mike Ehrmantraut.—garykmcd"], "genres": "N/A", "imdbID": "3858672", "rating": 8.6, "votes": 21646, "number_of_episodes": 63}