{"cast": {"0005381": "Rebecca Romijn", "0437283": "Christian Kane", "0095751": "Lindy Booth", "2279247": "John Kim", "0001242": "Matt Frewer", "2788229": "Lesley-Ann Brandt", "0004852": "Jane Curtin", "0627878": "Bob Newhart", "0001864": "Noah Wyle", "1693186": "Jon Bebe", "5595328": "Luke Schuck", "1055845": "Patrick McHenry-Kroetch", "1530267": "James Sweet", "2217184": "Ben Andrews", "3832591": "Daniel Brockley", "0235227": "Robin Douglas", "1579754": "Foss Curtis", "2580719": "Rick Espaillat", "6262118": "Joseph Thomas Bailey", "9814837": "Tim Bennett", "8818726": "Quentin Contreras", "6777740": "Raul Espericueta", "5901738": "Jason Loitz", "3109090": "Byron Noreen", "7144964": "David A. Velarde", "4726015": "Lloyd Weema"}, "geners": ["Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["58"],  "plot": ["Someone is killing off potential Librarians and it's up to Flynn Carsen and his new Guardian, Colonel Eve Baird, to save the three that are left.", "Colonel Eve Baird who is a NATO Counter terrorism operative was in the midst of an op to take down some terrorists, when Flynn Carsen, the Librarian shows up looking for an artifact. Flynn somehow helps her and disappears when he gets what he came for. Baird reports what happened so her superiors decides to place her on leave. She then gets an invitation from the Library to come for an interview. She goes and is met by Charlene who says she'd being considered to be the Guardian of the Librarian. And Flynn doesn't think he needs one. And he is at the moment trying to find who the man who called him and who knew he's the Librarian and who would later be killed, is. He learns that the man was one of the candidates along with Flynn who were considered for the position of Librarian. And it appears that other candidates are being killed off. So they set out to find the remaining candidates and protect them. They learn that they're up against the Serpent Brotherhood and they are after the Crown of King Arthur. So they try to get to it first.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "3696750", "rating": 7.7, "votes": 1389, "number_of_episodes": 42}