{"cast": {"0005381": "Rebecca Romijn", "0437283": "Christian Kane", "0095751": "Lindy Booth", "2279247": "John Kim", "0488662": "John Larroquette", "0000276": "Sean Astin", "1260407": "Felicia Day", "6935657": "Elisha Henig", "2903545": "Ryan Tresser", "4678949": "Nicole McCullough", "5359214": "Brice Fisher", "2597295": "Tyler Hughs", "2658917": "Ithica Tell", "13383307": "Tyrone J. Criss", "12336075": "Elliot Orr", "6643442": "Danny Shuell"}, "geners": ["Action", "Adventure", "Comedy", "Drama", "Fantasy"], "runtimes": ["42"],  "plot": ["The Librarians investigate a mysterious traveling carnival and discover how dangerous their collection of magical artifacts could be.", "The Librarians investigate a mysterious traveling carnival and discover how dangerous their collection of magical artifacts could be. Kirby Goulding, a vengeful magician, receives the power of real magic and uses it to find his childhood crush, Charlotte Halloway.—Lynn Blood", "Baird sends Jenkins a message telling something terrible has happened to them and not to find them. Jenkins disregards what she said and goes to where they went, a carnival and finds them part of the attraction and under a spell. Baird is a two headed woman, Cassandra is a mermaid, Stone is the strongman and Jones is a fakir. Jenkins gets them out of it and gets them back to the library. They have no recollection of what happened so Jenkins gives them something to help them remember. They recall that they went to check on a woman in the hospital who suffered severe injuries. They learn she's a lawyer who for some reason decided to join a carnival. They go there and talk to the owner, the magician, Kiirby Goulding. When they tried to leave he sent his minions to get them which was when Baird sent Jenkins the message. Obviously, everyone at the carnival is under some kind of spell so obviously he has something magical which is how he is doing everything he does, so they need to find out what it is.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "5748582", "rating": 7.6, "votes": 525, "number_of_episodes": 42}