{"cast": {"0000100": "Rowan Atkinson", "0042507": "Robert Austin", "0324139": "Simon Godley", "0122689": "Helen Burns", "0831503": "David Stoll", "0889338": "Rupert Vansittart", "0339033": "Andy Greenhalgh", "2749755": "Teddy"}, "geners": ["Comedy", "Family"], "runtimes": ["24"],  "plot": ["Mr. Bean hosts a New Year's party. The next day, Bean buys tools to decorate and improve his apartment. He decides to paint his room by covering everything in newspaper and using a firecracker to blow up a paint can and paint his room.", "Mr. Bean hosts a New Year's party with his friends Rupert and Hubert. The next day, Bean buys many tools and appliances to decorate and improve his apartment. He decides to paint his room by covering everything in newspaper and using a firecracker to blow up a paint can and paint his room.—Todd Suess", "Mr. Bean runs around frantically preparing his New Year's Eve party but when his only guests, Rupert and Hubert - apparently conservative colleagues- arrive his supplies prove desperate inadequate; party hats made from newspaper they can grin, but 'wine' home-made from vinegar with sugar and twigs to nibble in stead of delicacies make them advance his clock so they can leave 'tired, at midnight', but actually join a party next door. Better prepared is his operation New Year's sale, his dummy got him first in line so he can soon load his car with a brand new armchair and various tools and appliances to redecorate his room, but the ride home in his more then full mini turns out a daring adventure. Having installed the chair he moves the other furniture around, leading him to the impulsive plan to moving his serving hatch - his way, 'planning' while he causes havoc. Then he paints his room white, so he covers everything in newspaper -including the loose door knob!- and uses a firecracker to blow up a paint can which catches a surprised 'paling' visitor ...—KGF Vissers"], "genres": "N/A", "imdbID": "0651841", "rating": 8.9, "votes": 2022, "number_of_episodes": 15}