{"cast": {"1938432": "Scott Ryan", "2262964": "Sam Cotton", "6940456": "Julian Maroun", "0380632": "Damon Herriman", "12606178": "John Holmes", "12621185": "Lester Jamieson", "12621186": "Mike Ridings", "2281631": "Chong Wei Zhang", "3912521": "Jackson Heywood", "12621187": "Matthew Berenger", "2506835": "Matt Nable", "1248119": "Mike Duncan", "3291034": "James Archer", "12621188": "Tobias Munday", "12621189": "Bruce Butcher", "12621190": "Anthony Hill", "3720297": "Natalie Tran", "9366003": "Chika Yasumura", "2288170": "Ainslie McGlynn", "7892617": "Abby Smith", "0743127": "Justin Rosniak", "12606180": "Joshua Haak", "12553224": "Cyrus Haddadi-Zuniga", "13811782": "David Hambly", "4824746": "Russell Southam", "12606233": "Peti Ualesi"}, "geners": ["Comedy", "Crime", "Drama"], "runtimes": ["26"],  "plot": ["If you think violence is not the answer, you don't understand the question.", "Having king-hit a pedestrian in front of a passing police patrol car after the man slapped at his car side-view mirror, Ray is now in a Queensland jail after his victim pressed charges. He has called his daughter and been evasive about why he's away. He then helps orient his newbie cellmate, a naïve soul (Adam) who blunders into insulting a hulking inmate by accidentally calling him gay (or properly \"champ\"). Adam instructs Ray on how to meditate before he is ambushed crapping in the shared hallway toilet and beaten badly. In the meantime, Ray has arranged to have a friend outside visit the young punk pressing charges. He is driven out to the woods at night and thrown handcuffed into a grave but is let go after weeping and agreeing to drop the charges. Ray is then promptly released but, has a bigger jury waiting at home in the guise of his sullen daughter, who is angry about his lying to her. Though he tries cleaning up his neighborhood reputation by speaking with his daughter's best friend's mother, he still can't \"fix\" things with his daughter. And sadly, even in his amended version, he is not completely truthful with her about the incident."], "genres": "N/A", "imdbID": "13795344", "rating": 8.0, "votes": 785, "number_of_episodes": 26}