{"cast": {"3116470": "Maanvi Gagroo", "4668046": "Sayani Gupta", "3260483": "Gurbani", "4112854": "Kirti Kulhari", "3070408": "Prateik Patil Babbar", "2161624": "Neil Bhoopalam", "10175163": "Advait Kottary", "10326275": "Jiya Lakhiani", "9422447": "Mona Mathews", "3629670": "Amrita Puri", "10273646": "Anika Radhakrishnan", "5399971": "Ankur Rathee", "0712908": "Lisa Ray", "10326276": "Fahad Samar", "0970210": "Simone Singh", "0813763": "Milind Soman"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["40"],  "plot": ["Siddhi and Sneha's strained relationship comes to a head. Miss VeeVee is excited for her first meet and greet. Umang and Samara take the next big step in their relationship. Damini has a breakdown.", "We get an insight into Siddhi's childhood and her relationship with her mother, Sneha and her nanny who was her best friend growing up till Sneha decided to break into that relationship. Sneha and Siddhi head to a high society baby shower where Sneha is in for a nasty surprise and holds Siddhi responsible for her public humiliation. Viju tries to be the supportive father but avoids taking up for Siddhi in front of Sneha as usual. Jeh comes by to pick up Kutta and Damini has an emotional separation. Umang and her high profile personal training client take things to the next level in their relationship. Anjana bumps into Kavya while shopping for Arya and the two end up having coffee and a conversation. The four girls get together for a walk and some meaningful conversation. Damini breaks down publicly at a café when she sees two young girls talking about Investigator.com as a gossip and scandal website. She bumps into Dr Aamir Warsi who takes her home and comforts her. In his own peculiar way. Anjana has a date courtesy Tinder. But a bizarre confusion sends her running for cover from embarrassment. Damini and Jeh catch up for a drink and he offers to cook for her. Sneha reprimands Siddhi for coming home drunk and two have their biggest fight yet with the past tumbling out of the closet. Siddhi rebels in the most unimaginable way possible."], "genres": "N/A", "imdbID": "9437252", "rating": 5.5, "votes": 160, "number_of_episodes": 30}