{"cast": {"7164276": "Astha Arora", "3070408": "Prateik Patil Babbar", "2161624": "Neil Bhoopalam", "5417955": "Nishit Broker", "7136212": "Madhu Anand Chandhock", "3116470": "Maanvi Gagroo", "4668046": "Sayani Gupta", "3260483": "Gurbani", "4112854": "Kirti Kulhari", "10326275": "Jiya Lakhiani", "7179195": "Nimisha Mehta", "5688044": "Sapna Pabbi", "3629670": "Amrita Puri", "5399971": "Ankur Rathee", "0712908": "Lisa Ray", "10326276": "Fahad Samar", "0970210": "Simone Singh", "0813763": "Milind Soman"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["40"],  "plot": ["Siddhi makes an important decision for Mihir and herself which does not please Sneha at all. Viju compensates by showing his support. The anonymous man issues an ultimatum to Siddhi which leaves her panic stricken. Umang tells her mother that she's ready to get married to the boy her mother has chosen. Pinky is shocked at Umang's sudden change of mind. Damini and Akanksha have a run in in the office which ends on a bitter sweet note. Siddhi sends out an SOS to her friends asking them to meet her at Truck Bar the next day. When the four girls get together, instead of helping Siddhi out, they end up having a big argument. Siddhi decides to do things her way without anyone's help. The anonymous man finally reveals his true identity and Siddhi, although in shock, loses all control. The girls go their own way leaving Anjana alone at the bar. Damini invites Jeh to her award ceremony but things don't go the way she had planned it. Kavya calls Anjana in a moment of crisis about Arya and Anjana makes an impulsive decision which could go horribly wrong. Damini tries calling Umang from the award ceremony when she discovers that the story Akanksha has been working on has now gone live. But Umang is busy at a family dinner with a prospective groom. Umang has an outburst in front of everyone. Damini has a change of heart at the award ceremony which leaves the audience in shock. Anjana's impulsive decision lands her in big trouble. And even bigger trouble with Varun and she end up in a war of words while Kavya plays spectator. Umang is left high and dry by her high profile client but she decides to pursue it and give it one last chance. Damini lands up at Truck Bar to meet with Jeh but she's in for a nasty surprise. Siddhi reaches home to find that word has already reached her parents about her secret life. All isn't well. All might not end well."], "genres": "N/A", "imdbID": "9442874", "rating": 5.8, "votes": 200, "number_of_episodes": 30}