{"cast": {"3116470": "Maanvi Gagroo", "4668046": "Sayani Gupta", "3260483": "Gurbani", "4112854": "Kirti Kulhari", "3070408": "Prateik Patil Babbar", "1715102": "Avantika Akerkar", "2161624": "Neil Bhoopalam", "9400940": "Rajat Ajay Bose", "7179195": "Nimisha Mehta", "5399971": "Ankur Rathee", "0712908": "Lisa Ray", "9793554": "Madhurima Roy", "0813763": "Milind Soman"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["40"],  "plot": ["Flash back to three years ago when Siddhi, Umang, Damini and Anjana meet for the first time. Siddhi is going through a personal crisis because someone close to her has passed away. Damini is just making her mark in the world of journalism after winning a big award and there's the promise of a first round funding for her start-up courtesy Uma Parekh. Umang's first encounter in the big city of Bombay from Ludhiana is for a trainer job in a gym. The interview with the gym manager is clearly a disaster. Anjana returns home after a long day's work to find Varun, for the umpteenth time, having a football game session with his friends without a care in the world for her or the baby. This can only go one way. And that way is down. Jeh is having a bit of a personal crisis too when he decides to say goodbye to Myra, his girlfriend, when he catches her cosying up to another man. Everyone, except Damini, is heading into disaster and is also heading into Truck Bar serendipitously at the same time. In current time, Damini is feverishly investigating her troll story when Uma calls upon her to break some not-so-good news which leaves Damini hurt and fuming. Anjana can't seem to get her mind off her young, new intern and has a bit of an embarrassing run in with him in her office. Umang and her high profile personal training client go undercover for some fun. Siddhi is enjoying her new found passion that no one knows about just yet. Damini consults Anjana on how to deal with the huge blow she has just received from Uma and her board. The four girls reminisce about how they had met in the washroom of Truck Bar three years ago. Including being locked up in the backyard by someone they least expected!"], "genres": "N/A", "imdbID": "9437258", "rating": 5.8, "votes": 167, "number_of_episodes": 30}