{"cast": {"3116470": "Maanvi Gagroo", "4668046": "Sayani Gupta", "3260483": "Gurbani", "4112854": "Kirti Kulhari", "3070408": "Prateik Patil Babbar", "2161624": "Neil Bhoopalam", "10326275": "Jiya Lakhiani", "5688044": "Sapna Pabbi", "3629670": "Amrita Puri", "10273646": "Anika Radhakrishnan", "0712908": "Lisa Ray", "5759095": "Saahil Sehgal", "0970210": "Simone Singh", "0813763": "Milind Soman", "5491188": "Paras Tomar", "10331029": "Rashmi Vaidyalingam"}, "geners": ["Comedy", "Drama", "Romance"], "runtimes": ["40"],  "plot": ["Anjana has a surprise visitor who can't seem to stop singing praises for her former husband. Arya has some uncomfortable questions to ask her mother which takes us into Anjana's past and her reasons for getting hitched to Varun. Siddhi clicks on the link Mohit sent her. The link leaves her scandalised! Akanksha is taking charge slowly and steadily at Investigator.com and holds a briefing with the team with Damini present. Things get tense between Damini and her as she continues to fan the fire. Umang has another session with her high profile client and this time, she finds a way to win her client's trust over with a unique technique. Siddhi discusses the online link with her new found bestie, Mohit. Sneha catches Siddhi and Mohit together and jumps to conclusions about their relationship prematurely. The girls hit the bar. Only this time, they have four very charming boys to deal with. Damini shares an after work drink with Jeh and they seem to be drawing closer. Damini's surprise visitor is back and this time, they have company in Kutta. Umang and her client get together for a glass of wine post their work out till things take a surprise turn. Anjana gets called to work in the midst of planning Arya's birthday party by her boss. But when she returns, there's a surprise waiting for her! The birthday party is a huge success with Varun and Kavya present as well. The only one who is not enjoying herself is Anjana. When things come to a head with Varun, Anjana needs to take control of her life and with the help of the girls, decides to move on. In the most unpredictable way!"], "genres": "N/A", "imdbID": "9437248", "rating": 5.7, "votes": 160, "number_of_episodes": 30}