{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2921091": "Jeremy Jordan", "0362873": "David Harewood", "0001222": "Calista Flockhart", "0004906": "Peter Facinelli", "1128574": "Laura Benanti", "1682832": "Luke Macfarlane", "0355155": "Charles Halford", "1745318": "Bryan Lugo", "4988352": "Stephanie Arcila", "3825357": "Ashton Bingham", "0352674": "Zuhair Haddad", "3777479": "David Lim", "1734947": "Ayo Sorrells", "0833245": "Casey Strand", "1736744": "Yuliya Rudina", "1914621": "Ryan Babcock", "1532479": "Rene Mousseux"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Supergirl, with her recently drained powers taking too long to return, must deal with life without them, while DEO has a powerful escaped alien prisoner in their headquarters.", "Kara and her friends are forced to rely on their inner strength and courage when an earthquake strikes National City, while Alex's mistrust of Hank reaches its breaking point when the earthquake traps them in the DEO with an alien escapee called Jemm.—Anonymous", "Kara's without her powers after her encounter with Red Tornado. So she is told that they'll return but in time. But when the city is struck by an earthquake, everyone is hoping Supergirl will come. So she tries to do what she can. Alex keeps an eye on Henshaw. The earthquake traps them at DEO headquarters and releases an alien. Alex wants to help Henshaw with the alien but he says no which fuels her suspicions.—rcs0411@yahoo.com", "After Kara loses her powers after the events of the last episode she can now get sick, feel pain and even die. Things go down hill as she gets a cold and is forced to go home and breaks her left arm in a huge earthquake, and desperately tried to help a injured dying man but failed. And things get worse after a villain breaks out of the agency which puts the base on lock down.—Mark Casadevall"], "genres": "N/A", "imdbID": "4955284", "rating": 7.9, "votes": 3210, "number_of_episodes": 126}