{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2921091": "Jeremy Jordan", "0362873": "David Harewood", "0001222": "Calista Flockhart", "0001002": "Dean Cain", "1128574": "Laura Benanti", "0000644": "Helen Slater", "1466859": "Owain Yeoman", "0846687": "Faran Tahir", "2384265": "Ben Begley", "0304580": "Robert Gant", "1218732": "Derek Mio", "5844090": "Malina Pauli Weissman", "6491351": "Jordana Taylor", "2633241": "Briana Venskus", "0029890": "Chriss Anglin", "0305404": "Rick Garcia", "0415846": "Nick Jaine", "0570604": "Kinna McInroe", "0629046": "Leyna Nguyen", "2813297": "Paul Stuart", "6226214": "Julian Yuen", "1736744": "Yuliya Rudina", "5673317": "Kevin Caliber", "5323960": "Sheila Collins", "7132862": "Toni French", "4386426": "Ana Franchesca Rousseau", "7661074": "Bruce M. Stockert", "3777421": "Whitney Wegman-Wood"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["45"],  "plot": ["Twenty-four-year-old Kara Zor-El, cousin of Superman, who was taken in by the Danvers family when she was 12 after being sent away from Krypton, must learn to embrace her powers after previously hiding them.", "Twenty-four-year-old Kara Zor-El, cousin of Superman, who was taken in by the Danvers family when she was 13 after being sent away from Krypton, must learn to embrace her powers after previously hiding them. The Danvers teach her to be careful with her powers, until she has to reveal them during an unexpected disaster, setting her on her journey of heroism.—Soumik Ghosh", "Kara Zor-El was sent to Earth when she was a little girl. In theory, her mission was to protect her cousin Kal-El. Her flight across space experienced big difficulties and by the time she arrived, Kal-El was already a grown-up known to the world by the alias of Superman, the most powerful of Superheroes. He took her to an adoptive family who raised her as their own in the company of the daughter they already had. Her adoptive family, the Danvers, were actually scientists that had helped Superman understand his own capabilities. Kara lived many years like a normal girl till her early adulthood, then, one day she decided to save a plane in trouble, using her superpowers. Kara hopes to become the Superheroine her city and THE TRIBUNE Newspaper need to keep their employees from being fired.—David del Real"], "genres": "N/A", "imdbID": "4525842", "rating": 7.1, "votes": 5105, "number_of_episodes": 126}