{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2921091": "Jeremy Jordan", "5534096": "Chris Wood", "0362873": "David Harewood", "0388382": "Tyler Hoechlin", "0001222": "Calista Flockhart", "2692146": "Katie McGrath", "0834947": "Brenda Strong", "5520750": "Frederick Schmidt", "2255698": "Andrea Brooks", "1674869": "Tom Belding", "1941271": "Dawn Chubai", "4643964": "Cameron Dent", "5299655": "Greg Fiddler", "6785305": "Kamaia Fairburn", "2973393": "Amanda May", "1490411": "Cameron Park", "5587142": "Shanel Pratap", "3156122": "Sachin Sahel", "0159106": "Darren E. Scott", "8503204": "Max Winter"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Supergirl and Superman team up to stop a new threat emerging in National City. A Kryptonian pod comes crashing down to Earth.", "When a new threat emerges in National City, Kara/Supergirl teams up with her cousin, Clark Kent/Superman, to stop it. Kara is thrilled to have family in town but it leaves Alex feeling a bit left out. Meanwhile, Hank and Supergirl are stunned by the pod that came crashing to Earth.", "When a spacecraft crashes, Supergirl and John check it out and they see the craft is Kryptonian and there's a man in it. They take him back to the DEO to treat him and wait for him to regain consciousness. Later a new aircraft that can go into space is on it's maiden voyage. But when something goes wrong the plane is about to crash to Earth. Supergirl hears of it and goes to save and In Metropolis, Clark Kent hears of it and changes into Superman goes to help and joins Supergirl. After saving it, they try to find out what happened and they decide to look at Lena Luthor, Lex's sister and new CEO of Lex Corp as a person of interest. Kara and Clark talk to her and she claims she's trying to reform the Luthor name. They're not sure if they believe her. But at an event she's attending, an assassin tries to kill her but they save her. And Cat wants Kara to decide what she wants to do and she's not sure.—rcs0411@yahoo.com"], "genres": "N/A", "imdbID": "5716756", "rating": 8.2, "votes": 3303, "number_of_episodes": 126}