{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2921091": "Jeremy Jordan", "2779018": "Floriana Lima", "5534096": "Chris Wood", "0362873": "David Harewood", "2652716": "Grant Gustin", "4583876": "Carlos Valdes", "0000644": "Helen Slater", "0834947": "Brenda Strong", "2692146": "Katie McGrath", "0304580": "Robert Gant", "0109786": "Byron Brisco", "7726669": "Keisha Haines", "2114724": "Serge Jaswal", "6314378": "Marisa Nielsen", "8580664": "Kirsten Virus", "3498533": "Josh Hallem", "5278723": "Robert Zen Humpage", "2744855": "Erika Walter", "3978335": "Laura May Taylor"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["As Eliza comes to National City for Thanksgiving, Kara turns to Lena for help when Cadmus unleashes a virus that instantly kills aliens, then is asked by Barry Allen and Cisco Ramon for help with an alien invasion on their Earth.", "Eliza comes to town to celebrate Thanksgiving with her daughters. Alex decides it's time to come out to her mother; Kara is shocked when Eliza suggests Mon-El has feelings for her, and Winn and James consider telling Kara the truth about the Guardian. Meanwhile, CADMUS unleashes a virus that instantly kills any alien in the vicinity so Kara enlists an unexpected ally - Lena Luthor. The epic superhero crossover kicks off tonight when Barry Allen and Cisco Ramon seek Kara's help with an alien invasion on their Earth.", "Eliza comes back to National City for Thanksgiving again. And as the team celebrate thanksgiving, CAMUS releases an alien killing virus which leads to Supergirl asking help from Lena Luthor. Also Barry travels back to National City with Cisco to ask Supergirl defend their world against an alien invasion.", "Eliza comes back to Nationals City to celebrate Thanksgiving with the team. But Kara must battle against CADMUS again when they uhleash an alien killing gas. Meanwhile, Barry comes back into town with Cisco to ask Kara for some help with a problem back on their earth."], "genres": "N/A", "imdbID": "5957644", "rating": 7.9, "votes": 2802, "number_of_episodes": 126}