{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2921091": "Jeremy Jordan", "2692146": "Katie McGrath", "0951148": "Odette Annable", "5534096": "Chris Wood", "0362873": "David Harewood", "0525855": "Carl Lumbly", "0005165": "Chad Lowe", "4590173": "Emma Tremblay", "1100839": "Sofia Vassilieva", "5050435": "Nesta Cooper", "2255698": "Andrea Brooks", "1345578": "Nickolas Baric", "5804919": "Ryan McNeill Bolton", "2390004": "Bryan Demore", "0159106": "Darren E. Scott", "6252518": "Shayn Walker", "3272103": "Peter Brown"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["A disciple of Coville's escapes from what's left of his cult and gives Kara and James a journal that could help save Sam; Guardian is found out.", "When Tanya, a disciple of Coville's, escapes from what's left of his cult, she gives Kara and James a journal that could hold the key to saving Sam. Someone learns Guardian's identity and threatens to expose James if he doesn't do what they ask. James contemplates what it means to be a black vigilante without a mask in America.—camillaheggoy91", "Tanya, a linguist saved by Tom Coville's cult, learned Kryptonian as a tribute. This made her very useful. She is worried the cult is making a bomb from his journal, so she steals it and brings it to James. She hopes he can get it to Supergirl. Lena is working on curing Sam of Reign, but still feuding with Supergirl. Alex is trying to get Ruby out of her depression from learning that her mom is also Reign. J'onn sympathizes with her as he is having trouble keeping his father engaged with deepening Martian dementia. They decide an outing to an arcade will help raise the spirits of both. Olivia and other Coville followers arrive at CatCo and kidnap Tanya amid gunfire. James pursues in Guardian garb and has his helmet knocked off, so those present can see his identity. Shortly afterwards the cult sends an ultimatum - give us Tanya and the journal, or we will tell National City that Guardian is James Olsen. Kara and Mon-El search the cult headquarters and learn that the cult is trying to create a fourth Worldkiller in Olivia. The journal indicates that they need the Rock of Yuda Kal to do it. Tanya agrees to offer herself back to the cult so they can traced to their new headquarters. Mon-El disguises himself as a nerdy guy and manages to hop in the van they are using. He grabs a Kryptonian Sunstone that emits a frequency Supergirl can hear and find. She, Mon-El and Guardian stop the ceremony in a nick of time.—Garon Smith"], "genres": "N/A", "imdbID": "7762822", "rating": 6.9, "votes": 1512, "number_of_episodes": 126}