{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2921091": "Jeremy Jordan", "2692146": "Katie McGrath", "0951148": "Odette Annable", "5534096": "Chris Wood", "0362873": "David Harewood", "0525855": "Carl Lumbly", "0000990": "Betty Buckley", "4590173": "Emma Tremblay", "2042776": "Jesse Rath", "3367112": "Amy Jackson", "0828906": "Cynthia Stevenson", "5050435": "Nesta Cooper", "5761980": "Em Haine", "8239726": "Conor Stinson O'Gorman", "12207497": "Tunde Pellicola", "4533072": "Angela Zhou"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["When Reign starts hunting Ruby, Supergirl and Alex work together to keep her safe. Supergirl and J'onn look to Sam's mother for advice on how to stop Reign and come away with shocking news.", "With Pestilence dead, Imra, Brainy and Mon-El plan to head back to the future. Reign surprises Lena and James at her apartment demanding to know where Ruby is. Lena sprays her with kryptonite to send he away. J'onn and Kara go to Sam's mom to learn all they can about her younger days. Sam's mom Patricia says she know that Sam is Reign. She drew her symbol on everything. Her mom kicked her out of the house. Meanwhile, Alex goes to see Ruby who is hidden in Lex's mansion. It is both invisible and has a communications shield. Reign shows up at her mom's hose looking for Ruby. What she sees a figure hiding in an upstairs closet is Supergirl, waiting with an electrical band weapon. In the fight that follows, Patricia is mortally wounded and J'onn and Supergirl realize Reign has all three Worldkiller powers. Brainy tells Mon-El that if one of them stays behind, the chances of beating Reign rise from 51% to 88.8%. As the trio near the disruption point for jumping into the future, Imra tells Mon-El to go back and help Supergirl. Lena brings Kara a case of super-charged kryptonite to use against Reign. Kara is not very gracious, but takes it. Ruby thinks Alex is lying to her about her mom and goes outside to phone her. Reign homes in on the signal. Mon-El says he can use Lena's kryptonite against Reign. At the mansion, Alex, Supergirl and Mon-El take on Reign eventually besting her with kryptonite bullets. Ruby sees that Reign is her mother.—Garon Smith"], "genres": "N/A", "imdbID": "7762814", "rating": 7.5, "votes": 1474, "number_of_episodes": 126}