{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2692146": "Katie McGrath", "2042776": "Jesse Rath", "1022429": "Sam Witwer", "7414233": "Nicole Maines", "1087565": "April Parker Jones", "0362873": "David Harewood", "0000644": "Helen Slater", "0000310": "Bruce Boxleitner", "0834947": "Brenda Strong", "1151899": "Robert Baker", "2384954": "Azie Tesfai", "4207679": "Izabela Vidovic", "4070375": "Olivia Nikkanen", "2255698": "Andrea Brooks", "1784581": "Mark Krysko", "6052072": "Al McFoster", "4113016": "J-C Roy", "10689437": "Sterling Schneider", "1637393": "Colby Wilson"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Kara comes face to face with Red Daughter and the two engage in an epic battle.", "Kara comes face to face with Red Daughter and the two engage in an epic battle. Determined to find a way to extract the Harun-El, Lena turns to an unlikely source for help.Brainy , Nia, and J'on set out to track down aliens who have been abducted by Lex.—The Cw", "Kara tells President Baker that she filed all her sources at CatCo, so her kidnapping will have no effect. But he retaliates by telling he that he had the CatCo servers wiped. All of her evidence is gone. Kara is able to escape because her captors do not realize that she is Supergirl. Lena questions Ben about Lex's motives. He is bowled over to learn that the president is in league with Lex. Ben's notices that he is deteriorating, hanks of hair come loose when he pulls at them. It is the result of injecting himself with the Harun-El serum. Lex's local operation are track to AmerTek. J'onn, Brainy, and Nia infiltrate their factory to save the aliens that were captured and held there. Brainy shapeshifts to Ben, but a guard dog notices the disguise. One of the agents strikes Brainy in the forehead, inadvertently causing him to behave like his ancestors as he reboots. He escapes and intentionally betrays J'onn and Nia, getting them deported with the other aliens so that he can find where they are being sent. Ben finds Otis, who unknowingly reveals that Lex plans to betray Kaznia after they invade the US. Lena places truth-seeker creature around Lillian's arm before questioning her. Lillian convinces her to inject more Harun-El into James to regain his stability. Red Daughter goes to the Danvers home, disguised as Kara and has Mrs. Danvers by the arm as Supergirl arrives. This series of events helps Alex remember that Kara is Supergirl. As the two Supergirls fight, Red Daughter nearly kills Kara. Alex is able to help get sunlight flowing into Kara to help her revive. Lex kills Red Daughter on television so that President Baker can declare him a national hero.Supergirl is framed as the mastermind behind the Kaznia invasion. Haley calls Alex to inform her about the true purpose of the Claymore satellite: it has enough energy to power a Lexosuit.—Garon Smith"], "genres": "N/A", "imdbID": "9826640", "rating": 8.0, "votes": 1334, "number_of_episodes": 126}