{"cast": {"2552034": "Melissa Benoist", "1419635": "Mehcad Brooks", "0500200": "Chyler Leigh", "2692146": "Katie McGrath", "2042776": "Jesse Rath", "1022429": "Sam Witwer", "7414233": "Nicole Maines", "1087565": "April Parker Jones", "0362873": "David Harewood", "0000310": "Bruce Boxleitner", "1151899": "Robert Baker", "2384954": "Azie Tesfai", "2255698": "Andrea Brooks", "0731842": "Françoise Robertson", "6049216": "Parveen Dosanjh", "0308606": "Willie Garson", "0018681": "Reese Alexander", "1372589": "William Belleau", "5355313": "Jason Bempong", "1928561": "Michael Brian", "3252820": "Chris Cochrane", "10185905": "Norah Debra Dobbyn", "10635363": "Koby Holvik", "8540438": "Sean Kuling", "4439787": "Mia Fiona Kut", "8272389": "Jaymee Mak", "3402242": "Donald Sales", "8317735": "Jesse Stretch", "1736744": "Yuliya Rudina", "4702685": "James Tyson"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Kara and Lena head to Stryker's Island to find clues that may help defeat Lex; Kelly encourages James to confide in someone about his PTSD; Alex faces off against Ben Lockwood when he takes powerful weapons from the DEO to hunt Supergirl.", "Kara and Lena head to Stryker's Island to search for clues on how to defeat Lex. At the prison, Kara tries to befriend a nosy prisoner, Steve, who may have insight into what Lex was doing, while Lena studies an array of puzzles Lex left behind in the hopes of discovering his whereabouts. While there, a prison riot breaks out and Kara must find a way to stop the prisoners without revealing her secret identity as Supergirl. Meanwhile, Kelly encourages James to talk to someone for his PTSD, and Alex faces off against Ben Lockwood after he storms the DEO and acquires some powerful weapons to hunt Supergirl.—sarah_l91", "President Baker has declared martial law in the wake of Red Daughter's attack at the White House and has sworn to bring Supergirl to ground. None of Supergirl's associates - Alex, James, Lena, Nia, even Col. Haley - believe that it was her doing. As Supergirl continues to save a man trapped in a car, she realizes how the pubic in general consider her guilty. Ben shows up at the DEO demanding the weapons that can be used against Supergirl and information on how to summon her. Alex declares that it will take a signed order from the President to authorize that. While Ben goes to do that, Kara and Lena go to Stryker's Island, the prison from which Lex escaped. They manage to get the warden to admit that he was taking money so Lex could periodically disappear. They get the warden to give them access to his cell where they search diaries hidden in his chessboard. Lena looks at artwork on the wall and realizes it is a clue to a hidden button that opens access to a hidden lab. Meanwhile, Otis Graves arrives with superpowers and krypton weapons. Lena provides Kara with a Kryptonite shield, but that is systematically compromised. Kara barely escapes with her life using her reporter disguise. Supergirl goes into hiding while Kara interviews the inmate who lived across from Lex's cell. He has a USB drive with everything that Lex sent or received over his wireless network.—Garon Smith"], "genres": "N/A", "imdbID": "10004142", "rating": 7.5, "votes": 1266, "number_of_episodes": 126}