{"cast": {"2552034": "Melissa Benoist", "0500200": "Chyler Leigh", "2692146": "Katie McGrath", "2042776": "Jesse Rath", "7414233": "Nicole Maines", "2384954": "Azie Tesfai", "2255698": "Andrea Brooks", "1194672": "Julie Gonzalo", "7047874": "Staz Nair", "0362873": "David Harewood", "0120648": "Cara Buono", "0525855": "Carl Lumbly", "0482851": "Phil LaMarr", "0019997": "Patti Allan", "0683379": "Mitch Pileggi"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Supergirl finally learns the truth about Lena while tangling with Leviathan; J'onn J'onnz makes a discovery about his brother's whereabouts.", "Margot shows up at Lena's apartment seeking the Medallion of Arcata but fails because Lena's home security system anticipated such a move. The alien Rama Kahn, Leviathan agent, declares he must take action. As Lena is giving a dedication speech about donating land for a park, Leviathan shows up shaking the ground at will. Lena anticipated this, too, and has her watch poised to call Supergirl when she jumps off the cliff to avoid him. Meanwhile, J'onn begins to have visions of Malefic. When he asks his father's spirit for help, he suggests J'onn should attempt to bond with his brother, no matter the outcome. The bond is successful, and Malefic forgives J'onn completely. Back at the D.E.O., Brainy discovers what he thinks is Leviathan's location and travels there with Alex. It is a bomb wrapped in Rip Roar's armor. Alex suffers a concussion. Lena is being clever about gaining access to weapons stored in the Fortress of Solitude. She maneuvers Kara into taking her there to search for a weapon that can defeat Leviathan. Suddenly, they are attacked by Rama Khan. Because he couldn't sense Supergirl or Lena, he knew they had to be there. While fighting him, Kara manages to suppress Khan's powers, forcing him to retreat. Afterwards, Lena admits to Kara she killed Lex, knew her secret before she told her, and rants about how Supergirl broke her trust and deserves to feel her pain. Lena ignores Kara's attempts to reason with her. She asks if she can access the quantum computer to send a message. Supergirl acquiesces. Lena programs it to consider Supergirl an intruder. Kara is trapped in an ice cell full of kryptonite gas. Lena grabs a terrible weapon known a Myriad. Superman hid it there because its effects were so terrible. Back at the DEO, Kelly and Alex bond even closer following the attempt on Alex's life. Brainy pieces together bomb fragments and sees a three-armed shape that is a Leviathan. He recognizes that he has seen the same pattern elsewhere. He takes Alex with him to a dilapidated looking mansion presuming it is the headquarters of Leviathan. He and Alex enter and descend in an elevator. It releases them into a cave tunnel where Leviathan agent Gamemnae appears to have them at her mercy.—Garon Smith"], "genres": "N/A", "imdbID": "10467684", "rating": 7.7, "votes": 1560, "number_of_episodes": 126}