{"cast": {"2552034": "Melissa Benoist", "0500200": "Chyler Leigh", "2692146": "Katie McGrath", "2042776": "Jesse Rath", "7414233": "Nicole Maines", "2384954": "Azie Tesfai", "2255698": "Andrea Brooks", "1194672": "Julie Gonzalo", "7047874": "Staz Nair", "0362873": "David Harewood", "3418510": "Rahul Kohli", "2964642": "Nick Sagar", "0000874": "Steven Bauer", "4901064": "Alexa Najera", "4433613": "Lucy Loken", "0019997": "Patti Allan", "0292114": "Duncan Fraser", "2125645": "Shawn Ahmed", "1534763": "Jan Bos", "9486999": "Miguel Castillo", "3053576": "Lynn Colliar", "0336439": "Amanda Gray", "11124764": "Samantha Davis", "5097431": "Arran Henn", "1653182": "Kelvin Lum", "10572520": "Ryan Mah", "8814174": "Sonia Sunger", "0001083": "Jon Cryer"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["While a new villain is under arrest at the DEO, Supergirl uses him to try and understand who is responsible for the recent attacks. Meanwhile, Andrea and Lena think back on their tumultuous past.", "The DEO is using William to reach the underlying Russell, his best friend, in Rip Roar. There is a breach. In the confusion, the Shadow is after Rip Roar but is unable to grab him. The Shadow escapes to her home and unmasks. It is Andrea. She heads for Lena's hoping for another chance to get inside the DEO. She is sure that Leviathan, the group that forced him to create the tidal wave, is preparing to kill him. She wants to save him. Lena tells Andrea that she will not help, that they are not friends. A series of flashbacks ensues to uncover where Lena's resentment arose. As a girl, her mother would tell her stories of a girl who was looking for the Medallion of Arcata. It would give the holder the power to bend shadows to his/her will. Lena relates this story to Andrea. Later, a satellite image of Costa Rica shows what appears to be the maze-like image associated with the Medallion. Lena and Andrea go to Central America to check it out. The ground where Andrea is standing suddenly drops, taking her with it. She is in a underground chamber with a stone bearing the actual Medallion at its center. She is approached by a messenger from Leviathan who tells her that she must take it, keep it on her person, and never speak of it to anyone. When Lena manages to lower herself on a rope, she sees the Medallion is gone. Andrea says nothing about it. Lena spots it on a chain around Andrea's neck when she is in London. She feels her trust was violated, hence not wanting to help her now. Through her, Russell comes into contact with Leviathan bioengineers who turn him into Rip Roar. Andrea finally talks Lena into helping her. She gives the Medallion to Lena who activates her Supergirl alert drawing her away from the DEO so that Shadow can get in. Lena also initiates a psychic inception attack. DEO personnel are frozen or doing her bidding. This allows her to free Rip Roar, but Leviathan agents are standing by and shoot him. Leviathan is now looking into Tess Mercer's memories.—Garon Smith"], "genres": "N/A", "imdbID": "10467676", "rating": 7.7, "votes": 1535, "number_of_episodes": 126}