{"cast": {"2552034": "Melissa Benoist", "0500200": "Chyler Leigh", "2692146": "Katie McGrath", "2042776": "Jesse Rath", "7414233": "Nicole Maines", "2384954": "Azie Tesfai", "2255698": "Andrea Brooks", "1194672": "Julie Gonzalo", "7047874": "Staz Nair", "1206818": "LaMonica Garrett", "0362873": "David Harewood", "0001083": "Jon Cryer", "0120648": "Cara Buono", "0482851": "Phil LaMarr", "0683379": "Mitch Pileggi", "4813273": "Jay Clift", "0146915": "Tom Cavanagh", "2964642": "Nick Sagar"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Supergirl's struggle against Leviathan reaches a boiling point as she faces off against Rama Khan. Meanwhile, as Lena and Hope work to launch Project Non Nocere, Hope proves to be an invaluable asset to Lena.", "Alex and Brainy go to the Fortress of Solitude to rescue Kara from ice cell filled with kryptonite gas. Lena has fled to Lex's stronghold beneath Mt. Norquay where she and Hope (Eve cyborg) are preparing to launch No Nocere using Myriad. With that in place, she can use Q-waves to control the entire human populace for peaceful ends. Kara goes there to talk her out of doing that and is met with canon fire. When the first round of charges doesn't stop her, they cycle to kryptonite shells. Lena is unwilling to kill her and disables them. Alex tells Kara that Lena is beyond redemption, but Kara disagrees. She talks Brainy into letting her converse with Lena via a hologram link. During the unsuccessful visit, the DEO downloads a virus to take out Myriad. Kara and J'onn head to the La Brea Tar Pits where Khan has forced Andrea to help him create a super-volcano that will result in a cleansing extinction event. The two superheroes are able to impede its start. As the launch of No Nocere is only minutes away, Alex has Claymore aimed at Mt. Norquay. If used, it will kill Lena. J'onn argues that Malefic could use his own Q-waves to repel the Q-waves coming from Lena's device. Alex is reluctant to trust Melefic to help the DEO after all the trouble he has caused. Brainy helps sway her to acquiesce. J'onn wrests the staff out of the underground chamber where Andrea is being held. This allows Kara to subdue Khan. Andrea seals him temporarily in the tar pit before they attack Leviathan's hideout. Leviathan operative Gamemnae tells Khan that he has grown weak, that she is relieving him of further duties. Malefic is able to overcome Lena's No Nocere allowing DEO agents to infiltrate her hideaway. When Lena and Hope are discovered, the Hope grabs Lena's gun and pretends she is holding Lena as a hostage. She takes full blame for No Nocere to allow Lena to go free. J'onn convinces his brother Malefic to return to Mars and help restore peace there. AS Malefic flies off, the Monitor appears J'onn. He reveals that he brought Malefic to Earth to test J'onn for an impending crisis. The Monitor has been able to resurrect Lex, preparing him for the upcoming crisis, too. This will play to Lex's desire to become a hero in exchange for helping him with a favor involving Lena.—Garon Smith"], "genres": "N/A", "imdbID": "10467688", "rating": 7.7, "votes": 1370, "number_of_episodes": 126}