{"cast": {"2552034": "Melissa Benoist", "0500200": "Chyler Leigh", "2692146": "Katie McGrath", "2042776": "Jesse Rath", "7414233": "Nicole Maines", "2384954": "Azie Tesfai", "1194672": "Julie Gonzalo", "7047874": "Staz Nair", "1560632": "Peta Sergeant", "0362873": "David Harewood", "0001083": "Jon Cryer", "0495095": "Sharon Leal", "0461572": "Claude Knowlton", "0004736": "Jason Behr", "2357820": "Tricia Collins", "1160671": "Sandy Robson", "12486291": "Nina Ann Solberg", "0916297": "Simon Webb"}, "geners": ["Action", "Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Supergirl makes a new ally. Lena and Lex battle for control of Luthor Corp.", "Supergirl loses Zor-El in the Phantom Zone, but finds a new ally. Meanwhile, a Phantom transforms Silas into one of its own and sets out to convert more humans to Phantoms, and Lex and Lena continue their game of cat-and-mouse as they try to trump each other.—Gislef", "Supergirl and Zor-El try to escape from the Phantom Zone by holding onto a Phantom as it slides through the portal. It doesn't work. In the process Kara injures her leg. The noise of their distress brings in Kryptonian criminals who grab Zor-El, hoping to sacrifice him to the Phantoms. As they are ready to grab Kara, too, a woman shows up warning that Phantoms approach. It is a ruse to save Kara. The woman explains that she is Princess Nyxly, a depowered, fifth-dimensional imp. She knows Mr. Mxyzptlk and was sent to the Zone by her father who was afraid she would usurp some of his power. As they converse, Nyxly manages to re-spark her powers to the point where she can remove a wrist fetter and fix Kara's leg. They rescue Zor-El, who reveals that Alura Zor-El built the Phantom Zone. The three agree to look for a possible exit point from the Phantom Zone where Alura had attached it. Maybe Nyxly's magic will spring them out? Meanwhile, a Phantom who has escaped into the world transforms Silas into one of its own and sets out to convert more humans to Phantoms. M'Gann disobeys J'onn's instructions and tries to go capture the Phantom. Instead, it is able to attack her and potentially transform her into one of its kind. J'onn is able to snatch her and transfer a piece of her soul into her before the Phantom escapes with hers. Lex and Lena continue to wrestle for control of LuthorCorp. Lena locks Lex out of the computer system and drains his funds into a large donation for the local children's hospital. Lex sends Otis to start a fire at the hospital and get the blame shifted to Lena. Brainy loses patience with Lex and offers to kill him. Lena says that would backfire on him. She decides she has had enough of Lex's shenanigans and quits her position in LuthorCorp. Alex has been despondent over the loss of Kara to the Phantom Zone. Kelly is able to rally a bit of combative spirit in her that jars her loose from her grief-caused paralysis.—Garon Smith"], "genres": "N/A", "imdbID": "13143062", "rating": 7.0, "votes": 1097, "number_of_episodes": 126}