{"cast": {"0881631": "Karl Urban", "4425051": "Jack Quaid", "1102278": "Antony Starr", "3929195": "Erin Moriarty", "1069800": "Dominique McElligott", "1900772": "Jessie T. Usher", "0022306": "Laz Alonso", "2003700": "Chace Crawford", "6150071": "Tomer Capone", "7232332": "Karen Fukuhara", "1756121": "Nathan Mitchell", "0000223": "Elisabeth Shue", "0002064": "Giancarlo Esposito", "0261170": "Jennifer Esposito", "1416900": "Shantel VanSanten", "0193639": "Ann Cusack", "1828818": "Christian Keyes", "0732309": "Laila Robins", "0064769": "Jim Beaver", "0067289": "Brendan Beiser", "10859043": "Parker Corno", "7426827": "JD Smith", "0177684": "Steve Coombes", "8968713": "Cole Kapoor", "7486145": "David Webster", "7870746": "Andrew Perun", "1953721": "Ric Garcia"}, "geners": ["Action", "Comedy", "Crime", "Drama", "Sci-Fi"], "runtimes": ["66"],  "plot": ["Season Finale Time! Questions answered! Secrets revealed! Conflicts... conflicted! Characters exploded! And so much more!", "The Pentagon classifies Compound-V, the Boys are fugitives, and Annie confronts her mother. Vought denies Deep's return to the Seven, causing him an emotional breakdown. An injured A-Train, angry at being racially profiled while out of costume, rebounds to Compound-V, causing Nathan to quit. Butcher takes Hughie to Mallory, who refuses participation, but informs them about Stillwell and warns Hughie about Butcher and his craving for vengeance. Hughie promptly leaves Butcher to ask for Annie's help, but she refuses out of distrust. Later, Maeve opens up and asks Starlight to be herself again. Homelander privately confesses to Stillwell that he secretly made the super-terrorists, and they have sex. At a Black Site, Hughie, who smuggled in his old retainer, has Frenchie pick the lock so Milk can free Kimiko. Starlight rescues them, but A-Train soon arrives so Hughie and Starlight delay him, until A-Train suffers a heart attack. Hughie applies CPR, but Starlight takes over so he can escape. Butcher takes Stillwell hostage strapped with explosives to bait Homelander. Homelander, after revealing he tortured Vogelbaum for the truth about Becca, kills Stillwell. Homelander saves Butcher from his suicide explosion and takes him to the home where Becca has been raising Homelander's son in secret, stunning both Butcher and Becca.—Aaron Kyle"], "genres": "N/A", "imdbID": "8100958", "rating": 9.1, "votes": 20749, "number_of_episodes": 40}