{"cast": {"0881631": "Karl Urban", "4425051": "Jack Quaid", "1102278": "Antony Starr", "3929195": "Erin Moriarty", "1069800": "Dominique McElligott", "1900772": "Jessie T. Usher", "0022306": "Laz Alonso", "2003700": "Chace Crawford", "6150071": "Tomer Capone", "7232332": "Karen Fukuhara", "1756121": "Nathan Mitchell", "0000223": "Elisabeth Shue", "0670408": "Simon Pegg", "0028625": "David Andrews", "0057217": "Malcolm Barrett", "2281371": "Colby Minifie", "1828818": "Christian Keyes", "0998489": "David Reale", "0020329": "Brittany Allen", "5973363": "Mishka Thébaud", "2063213": "Christian Bako", "7928115": "Akiel Julien", "9656790": "Ashton James", "2671505": "Débora Demestre", "1219099": "Kathy Maloney", "2002239": "Mike Massaro", "7325131": "Gavin Pounds", "6325955": "Biden Hall", "6736759": "Makenna Beatty", "1395410": "Chad Allen", "7836038": "Jhonattan Ardila", "2684213": "Sima Fisher", "3857608": "Vincenzo Ruggieri Calvano", "9463813": "Huy Hao Tran"}, "geners": ["Action", "Comedy", "Crime", "Drama", "Sci-Fi"], "runtimes": ["54"],  "plot": ["It's the race of the century. A-Train versus Shockwave, vying for the title of World's Fastest Man. Meanwhile, the Boys are reunited and it feels so good.", "The Boys discover A-Train takes a performance-enhancement drug known as \"Compound V\", which he intends to use in his race against Shockwave. The team are reunited with its original team members, however tensions run high as old wounds resurface.", "As Frenchie and Butcher clean up Translucent's remains, Hughie leaves his home after finally telling his father how he truly feels. Meanwhile, Starlight gains positive publicity for stopping the date-rape, only to learn Stillwell has given her a revealing costume. She declines, but Stillwell forces her to wear it or lose her job. Butcher brings in his former friend, Mother's Milk, to run surveillance on A-Train's girlfriend, Popclaw. Hughie installs spyware on Popclaw's computer, and they learn that A-Train takes a performance-enhancing substance known as \"Compound-V\". Butcher wants to expose them before supers can be allowed into the armed forces, but he needs a vial of Compound-V from A-Train's race with Shockwave. Before the race, Hughie meets Annie as Starlight, inviting her to lunch. The two open up to each other, leading to their exchanging numbers. A-Train uses a vial to win the race and breaks his promise to Popclaw, announcing he is single. With Milk deducing Popclaw swiped some vials, they find her heartbroken, high, and in the midst of killing her landlord during hyper-charged sex. Butcher uses this opportunity to blackmail Popclaw as an informant. At Vought headquarters, Homelander reveals Translucent's remains to Stillwell along with Butcher's message, \"Coming for you\".—Aaron Kyle"], "genres": "N/A", "imdbID": "8100948", "rating": 8.3, "votes": 18514, "number_of_episodes": 40}