{"cast": {"0881631": "Karl Urban", "4425051": "Jack Quaid", "1102278": "Antony Starr", "3929195": "Erin Moriarty", "1069800": "Dominique McElligott", "1900772": "Jessie T. Usher", "0022306": "Laz Alonso", "2003700": "Chace Crawford", "6150071": "Tomer Capone", "7232332": "Karen Fukuhara", "1756121": "Nathan Mitchell", "0000223": "Elisabeth Shue", "0670408": "Simon Pegg", "0005286": "Haley Joel Osment", "0261170": "Jennifer Esposito", "1416900": "Shantel VanSanten", "1307435": "Alex Hassell", "1828818": "Christian Keyes", "7596733": "Alvina August", "0732309": "Laila Robins", "0231283": "John Doman", "0067289": "Brendan Beiser", "9351811": "Nalini Ingrita", "3784038": "Caitlyn Sponheimer", "2649618": "Matt Duncan", "3127378": "Farid Yazdani", "10858907": "Krishan Dutt"}, "geners": ["Action", "Comedy", "Crime", "Drama", "Sci-Fi"], "runtimes": ["56"],  "plot": ["Never trust a washed-up Supe -- the Boys learn this lesson the hard way. Meanwhile, Homelander digs into his past, Starlight discovers that love hurts, and if you're ever in Sandusky, Ohio and a girl asks if she can touch your gills, say NO.", "Hughie and Annie book a hotel room where they have sex, and Hughie agrees to introduce her to his father. Deep finds his transfer to Sandusky, Ohio beyond dull. Deep brings a fan to his apartment who proceeds to sexually assault him by painfully inserting her fingers into his gills. Meanwhile, A-Train needs more workouts after Compound-V destroyed his system. Homelander holds a meeting to discuss Hughie killing Translucent, extorting Ezekiel, and A-Train killing Robin; during which he angrily accuses Starlight of co-conspiracy. Maeve defends Starlight. When A-Train calls Hughie, saying he is holding his dad hostage, the Boys realize Mesmer betrayed them. Hughie obtains some Compound-V, allowing Kimiko to blindside and cripple A-Train. Butcher kills Mesmer, remembering when Mallory had first told him about Homelander. Homelander asks Dr Vogelbaum about Becca Butcher, who informs him that Becca was pregnant with his child, but both died on the table and Vought covered it up. Questioning the revelation's timing, Vogelbaum expresses regret raising him in a lab, calling Homelander his \"greatest failure.\" Butcher calls Raynor to protect Hughie and Milk's families in exchange for evidence. As Raynor charges Stillwell and Vought, she then learns of the superhuman terrorist, \"Naqib\". Annie confronts Hughie, who explains Vought's use of Compound-V, and Butcher arrives shortly after to exfil Hughie after beanbag-shooting Annie.—Aaron Kyle"], "genres": "N/A", "imdbID": "8100956", "rating": 8.7, "votes": 17438, "number_of_episodes": 40}