{"cast": {"0881631": "Karl Urban", "4425051": "Jack Quaid", "1102278": "Antony Starr", "3929195": "Erin Moriarty", "1069800": "Dominique McElligott", "1900772": "Jessie T. Usher", "0022306": "Laz Alonso", "2003700": "Chace Crawford", "6150071": "Tomer Capone", "7232332": "Karen Fukuhara", "1756121": "Nathan Mitchell", "0000223": "Elisabeth Shue", "0000708": "Billy Zane", "0193639": "Ann Cusack", "0072648": "Shaun Benson", "2694584": "Brit Morgan", "2281371": "Colby Minifie", "3678876": "Jess Salgueiro", "7343952": "Jordana Lajoie", "0020329": "Brittany Allen", "1997152": "Nicola Correia-Damude", "0877304": "Bill Turnbull", "8968714": "Shanice Johnson", "1307674": "Joel Rinzler", "9684220": "Hallea Jones", "1868511": "Jim Annan", "0369241": "Thomas Hauff", "10858730": "Aiden Altow", "7609013": "Evangelia Kambites", "2970187": "Jenny Brizard", "11213208": "John Williams", "3194791": "Nicole Maroon", "6922083": "Tiana Leonty", "6970024": "Nneka Elliott", "10858875": "Roger Peterson", "3857608": "Vincenzo Ruggieri Calvano"}, "geners": ["Action", "Comedy", "Crime", "Drama", "Sci-Fi"], "runtimes": ["60"],  "plot": ["The Boys head to the \"Believe\" Expo to follow a promising lead in their ongoing war against the Supes. There might -- MIGHT -- be a homicidal infant, but you'll have to see for yourself.", "At the \"Believe Expo\", Starlight talks with teens while being quietly directed to push an agenda, while Butcher has Hughie meet Ezekiel, the Expo host and their next lead. Maeve feels guilty for letting Flight 37 crash and visits her ex-girlfriend Elena, but leaves before explaining herself fully. Butcher takes time to talk with Rachel, his sister-in-law, over putting a tombstone to Becca. After A-Train kills Popclaw for betraying him, he finds surveillance footage of Frenchie. After Homelander exits a meeting with Ezekiel, Hughie extorts Ezekiel for information about Compound-V. Homelander rallies the crowd with an impromptu hardline speech, energizing the crowd. Starlight breaks script to honestly open up how she feels about her faith while also publicly revealing her sexual assault. She walks off, with Hughie coming by to comfort her and to explain himself about Robin's death and needing some means of coping. Butcher and Milk discover babies exposed to Compound-V to manufacture supers. Frenchie discovers Seven member Black Noir is looking for him. Attempting to escape, he is told to leave the Female behind, but releases her out of sympathy. She seemingly dies protecting him from Black Noir, but then awakens and her wounds immediately heal.—Aaron Kyle"], "genres": "N/A", "imdbID": "8100952", "rating": 8.3, "votes": 17914, "number_of_episodes": 40}