{"cast": {"0881631": "Karl Urban", "4425051": "Jack Quaid", "1102278": "Antony Starr", "3929195": "Erin Moriarty", "1900772": "Jessie T. Usher", "0022306": "Laz Alonso", "2003700": "Chace Crawford", "6150071": "Tomer Capone", "7232332": "Karen Fukuhara", "1756121": "Nathan Mitchell", "2281371": "Colby Minifie", "4707628": "Claudia Doumit", "7805172": "Cameron Crovetti", "2526851": "Susan Heyward", "2038170": "Valorie Curry", "0604742": "Jeffrey Dean Morgan", "0842770": "Tilda Swinton", "0193639": "Ann Cusack", "1859475": "Omid Abtahi", "2204675": "Frances Turner", "6671114": "Erika Prevost", "5629094": "Dan Mousseau", "1968452": "Eddy Kaye", "2942174": "Naomi Frenette", "10579922": "Patricia Wright-Domingue", "2462092": "Sarah D. McCarthy", "9351809": "Ai Barrett", "13347590": "Madeline Ortencio", "3789458": "Caroline Brassard", "6969724": "Adriana Vasquez", "2786196": "Gene Abella", "1302025": "Nina Rolle", "2605843": "Tim Beresford", "0671939": "Colin Penman", "1901617": "Kira Hall", "0788296": "Jamie Shannon", "4225923": "Alexandra Montagnese", "1969866": "Kanja Chen"}, "geners": ["Action", "Comedy", "Crime", "Drama", "Sci-Fi"], "runtimes": ["64"],  "plot": ["Hey kids. Did you know your neighbor, uncle, or even Mom and Dad might be trying to destroy America? Find out how to stop them on the Avenue V Christmas Special!. If you see something, say something!.", "Homelander sends Deep and Noir after the Boys, fires Sister Sage, and the identity of several moles is revealed. Billy has reason to be proud of Ryan on worldwide TV, while Frenchie returns to the fold just in time to develop the anti-supe virus.—Gislef", "While Butcher, Hughie and Starlight get attacked by a shape-shifting Supe, Frenchie has Sameer Shah creating the anti-supe virus under Frenchie and Kimiko's supervision, M.M. struggles to plan leaving New York with his wife and daughter. Which leads him into choosing between leaving with them or protecting them from anything dangerous before fulfilling his wish of finally being with his family. On the other hand, Homelander sends The Deep and Black Noir after Butcher and Starlight, who get ambushed by them both at the Flatiron Building. It's not too long after Homelander fires Sister Sage for not revealing truthful details regarding who in Vought was The Leak. Hughie, while bleeding from his hand, pays a visit to an old friend to try reasoning with her, and while Ryan disagrees with participating in a Christmas Special Song, Butcher remains faithful to Ryan for telling the truth about why he dislikes the idea of participating in the Christmas Special."], "genres": "N/A", "imdbID": "28429723", "rating": 8.2, "votes": 17046, "number_of_episodes": 40}