{"cast": {"0001394": "Derek Jacobi", "0680795": "Siân Phillips", "0000306": "Brian Blessed", "0048468": "George Baker", "0879239": "Margaret Tyzack", "0924788": "Frances White", "0531546": "Simon MacCorkindale", "0029397": "Darien Angadi", "0460808": "Ashley Knight", "0573618": "Kevin McNally", "0506496": "Katharine Levy", "0166244": "Michael Clements", "0460874": "Esmond Knight", "0832325": "Kevin Stoney", "0859826": "Alan Thompson", "0404333": "Diana Hutchinson", "0516689": "Gary Lock", "0449641": "Alister Kerr", "0829796": "Roy Stewart", "0929653": "Nicholas Willatt", "0121308": "John Burgess", "0265022": "James Fagan", "0548456": "Ronald Markham", "0552561": "John Scott Martin", "3261970": "Ronnie Grainge"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["52"],  "plot": ["Whilst Tiberius in exile derives some comfort from hearing of the mysterious death of Gaius, Antonia confesses to Julia her disappointment in Claudius. She chastises his siblings Germannicus and Livilla for shunning him but still feels that he is stupid. However everybody is amazed when an eagle drops a wolf cub into Claudius's arms and an augur reader interprets this as meaning that in the future Claudius will save Rome in its hour of need. Livia continues her campaign against Julia by proving that she is a serial adulteress, leading to her banishment, a fact which upsets Augustus, who actually loved her. With the news that Lucius has also perished, drowned in a boating accident, Augustus recalls Tiberius from his exile to be his co-heir with his grandson Postumus.—don @ minifie-1", "Tiberius is still banished from Rome for his rough treatment of wife Julia but his mother Livia decides it's time for him to return. Emperor Augustus won't hear of and Livia begins to spin her web. Julia has been living by the seaside and enjoying life - perhaps a bit too much as she has a long list of lovers. Livia blackmails one of them to give her a list of names and arranges for the somewhat prudish Augustus to learn what is going on. Julia is locked away. When the Emperor's second grandson dies in a mysterious accident at sea, Tiberius is called back to Rome. Claudius is a young lad now and his mother Antonia isn't quite sure what to do with him given his club foot, stammer and severe spams. Great things are predicted for him however when a wolf cubs literally falls from the sky.—garykmcd"], "genres": "N/A", "imdbID": "1255283", "rating": 8.3, "votes": 457, "number_of_episodes": 13}