{"cast": {"0001394": "Derek Jacobi", "0680795": "Siân Phillips", "0048468": "George Baker", "0879239": "Margaret Tyzack", "0424368": "Stratford Johns", "0357909": "Irene Hamilton", "0730191": "David Robb", "0907731": "Fiona Walker", "0001772": "Patrick Stewart", "0269077": "James Faulkner", "0573618": "Kevin McNally", "0700755": "Roy Purcell", "0126268": "Patsy Byrne", "0695590": "George Pravda", "0604994": "Robert Craig-Morgan", "0262217": "Norman Ettlinger", "0548456": "Ronald Markham", "0552561": "John Scott Martin", "0267256": "Souad Faress", "2433024": "Victor Croxford"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["52"],  "plot": ["Tiberius, aided by Sejanus, is proving to be a harsh ruler with only Germanicus able to keep him under control. However, whilst he is in Syria Germannicus is mysteriously poisoned. His widow Agrippina is able to rally public support due to his popularity and accuses Piso, the governor of Syria, of being the slayer. Despite claiming an alibi, Piso and his wife Plancina are brought before the senate to stand trial, with Martina, a star witness, being kept under wraps. In fact, Martina was the poisoner, encouraged by Germanicus's son, young Caligula, whose insolence and taste for incest with his sister are already giving his elders cause for concern. Piso claims to have scrolls incriminating Livia and Tiberius in the murder but Plancina, in an effort to save herself, stabs her husband to death and passes it off as remorseful suicide. Thus the case is closed.—don @ minifie-1", "With the death of Germanicus, his wife Agrippina vows to get her revenge. She accuses the Governor of Syria, Piso, of the crime. He and his wife Plancina return to Rome to stand trial - accused of treason as well as murder - but is supremely confident that Emperor Tiberius will protect him. As the case progresses, Plancina begins to doubt the Emperor's good will. Agrippina has brought to Rome the woman who poisoned Germanicus, Martina, but as the circle begins to close, Plancina tells her husband there is only one way out for them. Meanwhile a young Caligula, still just a boy, is already showing a wild streak leaving those around him at a loss as to what to do.—garykmcd"], "genres": "N/A", "imdbID": "1255282", "rating": 8.3, "votes": 431, "number_of_episodes": 13}