{"cast": {"0001394": "Derek Jacobi", "0000457": "John Hurt", "0746448": "Jo Rowbottom", "0925453": "Sheila White", "0202113": "Sam Dastor", "0260596": "Norman Eshley", "0235782": "Freda Dowie", "0246014": "Anne Dyson", "0922207": "Lockwood West", "0700781": "Bruce Purchase", "0265022": "James Fagan", "0744395": "Norman Rossington", "0384060": "Bernard Hill", "0063312": "Sally Bazely", "0060819": "Robert Bateman", "0542386": "Gina Manicom", "0136969": "Jan Carey", "0569706": "Stan McGowan", "0035775": "Julian Armstrong", "0094063": "William Bond", "2274343": "Tina Simmons"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["54"],  "plot": ["Caligula has not only made his horse a senator but has turned the palace into a brothel, selling off senators and their wives for sex. Although scared of him - and getting thrown into a river for his pains - Claudius is seemingly the only person who can put any sort of brake on the mad emperor, intervening to save mens' lives on at least two occasions, the second when Caligula fails in his attempt to defeat Neptune and push back the waves, blaming his generals for his failure. Although Claudius has been living in peace with ex-prostitute Calpurnia Caligula thinks it would be fun to mismatch him with the beautiful but wanton Messalina and has them marry each other. Finally, sickened by his excesses the Praetorian guard under Cassius Chaerea kills Caligula. A sergeant finds Claudius cowering under a table and, in the absence of any other claimants, he is declared the emperor of Rome.—don @ minifie-1", "Caligula's outrages continue. He terrifies those around him and everyone realizes that they live at the whim of a madman. He turns the palace into a brothel forcing all prominent Romans to attend - and for their wives to provide their services. He has Claudius work at the door and collect the money from the arriving dignitaries. He also forces his uncle to marry the much younger Messalina. Caligula's lavish spending has bankrupted the treasury and Rome is on the verge of collapse. Caligula is assassinated by his own guards and Claudius installed as a puppet emperor.—garykmcd"], "genres": "N/A", "imdbID": "1255277", "rating": 8.8, "votes": 435, "number_of_episodes": 13}