{"cast": {"0001394": "Derek Jacobi", "0680795": "Siân Phillips", "0000306": "Brian Blessed", "0048468": "George Baker", "0879239": "Margaret Tyzack", "0703946": "Patricia Quinn", "0730191": "David Robb", "0907731": "Fiona Walker", "0145284": "John Castle", "0791219": "Norman Shelley", "0269077": "James Faulkner", "0573618": "Kevin McNally", "0248324": "Donald Eccles", "0136938": "Denis Carey", "0874405": "John Truscott", "0859826": "Alan Thompson", "0805374": "Guy Slater", "0166689": "Vivien Clifford", "0189861": "Jennifer Croxton"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["52"],  "plot": ["Six years have passed. Germanicus has joined Tiberius in the Germanian campaign, to avenge the Roman legion slaughtered at the Battle of the Teutoburg Forest. Claudius remains at home, researching his family history and despised for his weakness - he faints at the gladiatorial games. In the library Pollio the historian advises him to accentuate his deficiencies. That way he will not be seen as a threat in the murderous world about him and has a greater chance of survival. Augustus names Postumus as his successor but Livia aims to thwart him. She gets Livilla to invite him to her room and then claim that he tried to rape her. Postumus is banished but manages to briefly escape before recapture and tells Claudius that he believes Livia killed Marcellus, Agrippa, Lucius and Gaius and that Claudius should inform Germannicus. He too advises the young man to play on his weaknesses. Some time later Claudius is again an object of scorn as he is married to the considerably taller Urgulanilla.—don @ minifie-1", "Claudius is a young man now and both his mother and grandmother are at something of a loss as to what to do with him. With upcoming games in honor of his dead father Drusus, they even wonder if he should be allowed to appear in public. They need not have worried too much - he does attend but faints at the first kill. Claudius is quite studious, spending a great deal of time in the library studying great battles and Roman history. A fellow scholar suggests that he continue to play the fool and maintain a low profile at court. Augustus meanwhile is outraged to learn that the Roman army in Germany has been destroyed. When Livia hears that he has named Postumus as his heir, she again begins to spin her web arranging for him to be accused of rape.—garykmcd"], "genres": "N/A", "imdbID": "1255284", "rating": 8.4, "votes": 446, "number_of_episodes": 13}