{"cast": {"0001394": "Derek Jacobi", "0680795": "Siân Phillips", "0000306": "Brian Blessed", "0048468": "George Baker", "0644707": "Ian Ogilvy", "0924788": "Frances White", "0879239": "Margaret Tyzack", "0666881": "John Paul", "0345295": "Christopher Guard", "0603073": "Angela Morant", "0750835": "Sheila Ruskin", "0387577": "Carleton Hobbs", "0370186": "Michael Hawkins", "0785992": "Renu Setna", "0235782": "Freda Dowie", "0801838": "Guy Siner", "0202580": "David Davenport", "0084696": "Roger Bizley", "0456112": "Amanda Kirby", "0507714": "Russell Lewis", "0722419": "Earl Rhodes", "0238644": "Patrick Drury", "0371304": "Tony Haygarth", "0751454": "Sheridan Earl Russell", "0792543": "Paul Sherman", "0543905": "Andrew Manson", "0231451": "Anni Domingo", "0666459": "Yvonne Patterson", "1546214": "John Cannon", "0326349": "Jill Goldston"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["98"],  "plot": ["In 54 AD, Emperor Claudius - elderly and lame from birth - is writing his biography and the history of his family. He recalls an encounter with the Sibyl, who recognizes him from his stutter and tells him that his account will be famous in 1900 years' time. Back in Rome in 24 BC, Emperor Augustus is celebrating the anniversary of the battle of Actium, when he and his friend Agrippa defeated Antony and Cleopatra. However, now Augustus is tipping his young nephew Marcellus as his heir. This displeases the emperor's wife, the formidable Livia, who wants the succession to pass to her son from her first marriage, Tiberius, even though Tiberius believes that Augustus dislikes him. Agrippa is also annoyed and leaves Rome. When Marcellus falls ill Livia insists on nursing him, and he dies soon afterward - clearly she has poisoned him. This provokes a riot among the citizens but it is quelled by the return of Agrippa, who calms the crowd down. A grateful Augustus gives Julia, Marcellus's widow, to Agrippa as his wife, which once more angers Livia, seeing the union as yet another obstacle to her ambitions - for there had once been a time when Julia and Tiberius seemed destined to be married.—don @ minifie-1", "Now elderly and more than just a little paranoid, Emperor Claudius begins to write the definitive history of his family. Claudius is the grandson of Livia (now married to the Emperor Augustus Caesar) on his father's side, and of Mark Anthony and the Emperor's sister Octavia on his mother's side. He begins his tale in 24 B.C. when the Emperor is celebrating the victory he shared with Agrippa in the battle of Actium. Livia is there, as is the Emperor's son, Marcellus, who clearly holds the Emperor's favor. She does her best to promote the interests of her own son Tiberius, but Augustus has little time for him. Livia is prepared to go to great lengths to ensure her son becomes Emperor.—garykmcd", "Rome, 1st Century AD. Aging Emperor Claudius is writing his biography. He starts his recollections before he was born with the court of his grandfather Caesar Augustus. In particular he details the jealousy of Augustus's wife Livia with Augustus's nephew Marcellus. Marcellus is a favourite of Augustus and tipped to be his heir, a possibility that displeases Livia as she wants her son Tiberius to succeed Augustus.—grantss"], "genres": "N/A", "imdbID": "1255275", "rating": 8.2, "votes": 576, "number_of_episodes": 13}