{"cast": {"0001394": "Derek Jacobi", "0680795": "Siân Phillips", "0000306": "Brian Blessed", "0048468": "George Baker", "0644707": "Ian Ogilvy", "0879239": "Margaret Tyzack", "0924788": "Frances White", "0750835": "Sheila Ruskin", "0785992": "Renu Setna", "0084696": "Roger Bizley", "0371304": "Tony Haygarth", "0231451": "Anni Domingo", "0666459": "Yvonne Patterson", "0722419": "Earl Rhodes", "0507714": "Russell Lewis", "0792543": "Paul Sherman", "0238644": "Patrick Drury", "0543905": "Andrew Manson", "0370186": "Michael Hawkins"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["50"],  "plot": ["It is now 9 BC. Livia has poisoned Agrippa and Tiberius is being forced to divorce his wife Vipsania to marry Julia. Neither Tiberius nor Julia are happy with this arrangement and Julia also confesses to Antonia, daughter of Mark Antony and wife of Tiberius' popular brother Drusus Germanicus, that she believes Livia killed Marcellus. Drusus is all for a return to the Republic and Tiberius envies him because he is not stuck in Rome but spear-heading military campaigns in Northern Europe. However, Drusus dies after a fall from his horse. Livia is anxious that Augustus be deified but there is general caution lest it angers the Gods. After Julia has complained of her husband's ill treatment of her, Tiberius is banished from Rome and Augustus sees the future as lying in his young grandsons Lucius and Gaius. Antonia has also borne a child by Drusus: Claudius.—don @ minifie-1", "Twenty years have passed and Livia, that evil woman as Claudius describes her, continues to spin her web. Her son Tiberius finally got to marry the Emperor's daughter Julia after the death of her second husband Agrippa. The marriage was at Livia's insistence and she forced him to divorce his wife in order to do so. Tiberius still loves her dearly and his marriage to Julia is not a happy one. Livia is not so fond of her other son, Drusus, who is off to the wars in Germany and is a supporter of a republican Rome. When he is injured, Livia sends her personal physician to treat him. He dies shortly thereafter. Drusus' wife Antonio had given him a son however, named Claudius. As for the Emperor, he is confident that his grandsons represent the future of Rome.—garykmcd"], "genres": "N/A", "imdbID": "2384005", "rating": 8.2, "votes": 431, "number_of_episodes": 13}