{"cast": {"0001394": "Derek Jacobi", "0000457": "John Hurt", "0879239": "Margaret Tyzack", "0606384": "Beth Morris", "0048468": "George Baker", "0269077": "James Faulkner", "0722636": "John Rhys-Davies", "0491440": "Jon Laurimore", "0246014": "Anne Dyson", "0922207": "Lockwood West", "0926645": "Arthur Whybrow", "0577435": "Douglas Melbourne", "0875790": "Alan Tucker", "1706934": "Paul Phillips"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["52"],  "plot": ["Tiberius summons Caligula and his cousin Gemellus to Capri, declaring them his joint successors. Soon afterwards Tiberius is smothered by Macro, on the orders of Caligula, and his death is hailed joyfully by the citizens of Rome, unaware that worse is to come. Caligula, clearly unstable, sinks into a coma and on recovering, in addition to having Gemellus executed for trying to poison him, declares that he is the god Zeus and marries his sister Drusilla, declaring her a deity also. When Drusilla falls pregnant by him he cuts open her belly and eats the unborn child to prevent him having greater powers than himself as Zeus once allegedly did. Antonia, sickened by his depravity, kills herself.—don @ minifie-1", "Having spent the last 5 years of his reign in Capri, Tiberius died there = with a bit of help from Macro who smothered him - leaving Caligula and his young grandson Gemellus as joint heirs. His first act is to name his uncle Claudius to as joint Consul. Caligula is clearly not well, suffering from severe headaches. His mind wanders in mid-conversation and eventually madness sets in. He declares himself a god, has Gemellus killed and kills his sister. A reign of terror sets in which, for many, leads them to flee or commit suicide.—garykmcd", "Caligula becomes Emperor after Tiberius dies, murdered by Macro. Initially the replacement of Tiberius with Caligula is seen a positive but his behaviour becomes erratic and extreme, climaxing with him declaring himself a god. In his delusional state nobody is safe.—grantss"], "genres": "N/A", "imdbID": "1255285", "rating": 8.7, "votes": 429, "number_of_episodes": 13}