{"cast": {"0001394": "Derek Jacobi", "0680795": "Siân Phillips", "0000306": "Brian Blessed", "0048468": "George Baker", "0001772": "Patrick Stewart", "0703946": "Patricia Quinn", "0730191": "David Robb", "0145284": "John Castle", "0319168": "Carol Gillies", "0122254": "Jonathan Burn", "0106657": "James Bree", "0746522": "Graham Rowe", "0263779": "John Evitts", "0859826": "Alan Thompson", "0781825": "Michael Segal", "0367836": "Peter Harwood", "0713137": "Charles Rayford"}, "geners": ["Biography", "Drama", "History"], "runtimes": ["51"],  "plot": ["Germanicus returns from Germania in triumph and he and Claudius catch up on family news - Claudius now has a son but is not enjoying married life. He tells Germanicus what Postumus had passed onto him about Livia's murderous exploits and Germanicus in turn tells the emperor. Augustus is pleased with Claudius and apologizes to him for doubting his capabilities. As Augustus visits Postumus to restore him to his will, Livia works out what has happened and initially suspects Livilla, believing Claudius to be too stupid. Augustus is determined to survive any efforts to poison him and resolves only to eat food he has grown himself. However he falls ill and dies as Livia has presumably poisoned the fruit trees in his garden. Postumus is killed by the brutal soldier Sejanus and at last Livia has her wish - to see Tiberius declared emperor of Rome.—don @ minifie-1", "The Roman army, under the command of Claudius' brother Germanicus, returns to Rome in triumph. Claudius tells him of Livia's role in his Posthmous' banishment. Germanicus is somewhat doubtful of Posthumous' tale of Livia systematically poisoning anyone standing in the way of Tiberius succeeding Augustus. Germanicus tells him to keep his counsel but Livia knows something is up when Augustus goes on a mysterious trip. In fact, the Emperor is off to visit Posthumous, in exile for four years now, to make amends. Livia has her own plans and schemes to alter the Emperor's will in the custody of the Vestal Virgins. The Emperor soon after falls deadly ill.—garykmcd"], "genres": "N/A", "imdbID": "1255279", "rating": 8.8, "votes": 456, "number_of_episodes": 13}