{"cast": {"0041003": "David Attenborough", "2486927": "Simon Blakeney", "1287411": "Nick Guy", "3734430": "Roger Munns", "0001856": "Oprah Winfrey"}, "geners": ["Documentary"], "runtimes": ["62"],  "plot": ["How mammals' warm blood and parental care contributed to their dominance of the planet.", "Mammals dominate the planet. They do it through having warm blood and by the care they lavish on their young. Filming in the bitter Antarctic winter reveal how a mother Weddell seal wears her teeth down keeping open a hole in the ice so she can catch fish for her pup. A powered hot air balloon captures stunning images of millions of migrating bats as they converge on fruiting trees in Zambia.—Anonymous", "Around 250 million years ago, mammals began their evolutionary journey. The original mammals were small, nocturnal insect eaters. Their warm bloodedness and nourishing their young with milk allowed them to live in extreme environments. Their big brains made the good problem solvers. They are also quite social allowing for cooperative behaviors and specialization. In Madagascar, aye-aye lemurs fill the niche that woodpeckers hold elsewhere. In equatorial East Africa, elephant shrews build elaborate labyrinths of hunting trails that also help them elude predators. Weddell seals are able to live in Antarctica at temperatures of -40oF because the pups can be breast fed among the most nutritious milk. In the arctic, polar bears are having to adapt to loss of sea ice for seal hunting and take to land. There is much competition as they can smell food 20 miles away. Straw-colored fruit bats in the Congo congregate in the remote Kasanka swamp of Zambia to eat mangos as they ripen - 6,000 tons a night. Reindeer migrate up to 75,000 km that allows them to take advantage of seasonal opportunities. On the Serengeti plains, prides of lions and clans of spotted hyenas battle over kills. It is a size vs numbers game. Kalahari meerkats specialize in breeding, training and doing sentry duty. All female elephants in an African herd share baby care duties. Finally, humpback whales are followed near Tonga as they perform the \"heat run\" ritual in which the males compete for the right to breed with a female. The \"Making of\" special feature covers the heat run filming.—Garon Smith"], "genres": "N/A", "imdbID": "1561895", "rating": 8.5, "votes": 627, "number_of_episodes": 11}