{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0389374": "Isabella Hofmann", "0176599": "William Converse-Roberts", "0856856": "John Thaddeus", "0921550": "Gary Werntz", "0738227": "Andy Rolfes", "0274394": "Matthew Ferreira", "1813689": "Joel Steingold", "1801624": "Erica Tazel", "0652555": "Ron Ostrow", "1712562": "Morina Pierce", "1711263": "Skylar Roberge", "1374980": "Zac Efron"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Mal must choose which crew members to save when one is gravely wounded and two others are kidnapped. Simon finds an uneasy haven in a remote village, but River's uncanny perceptions jeopardize the Tams' temporary safety.", "The Serenity brings the cattle to a plain and, when Mal is negotiating the selling with the traders, there is a shootout and Shepherd Book is hit. Meanwhile Dr. Simon and River are kidnapped by the residents to work in an isolated area. But Mal needs to leave the planet to seek help for Book and leaves the siblings behind. When the locals discover that River can read minds, they believe she is a witch and wants to burn her at the stake.—Claudio Carvalho, Rio de Janeiro, Brazil", "While visiting an outlying planet, Simon and River are kidnapped by local villagers in need of a doctor. Meanwhile, the rest of the crew are forced to seek medical help from an unlikely source when one of their own is shot.—Anonymous", "While visiting an outlying planet for the Serenity crew to drop off their cattle cargo, Simon and River are kidnapped by local villagers in need of a doctor. But soon the superstitious villagers learn of River's powers of clairvoyance and thinking that she's a witch, decide to burn her and Simon alive at a stake. Flashbacks to River and Simon's childhood show the young Simon trying to please his demanding and stern father, Gabriel, to become a doctor, and then abandoning it when Simon learns that River has being abducted by Alliance Academy agents to study her developing clairvoyant powers. Meanwhile, Mal, Zoe, and the rest of the crew are forced to seek medical help from an unlikely Alliance ship when Shepherd Book is shot during a scuffle with ranchers.—Anonymous"], "genres": "N/A", "imdbID": "0579534", "rating": 8.1, "votes": 4917, "number_of_episodes": 14}