{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0411857": "Gregory Itzin", "1101442": "Daniel Bess", "0300824": "Kevin Gage", "0469845": "Zachary Kranzler", "0526185": "Jordan Lund", "0566829": "Bob McCracken", "1712613": "Ronald Craig Williams", "0002540": "John Jabaley", "0631146": "Laura Niemi", "0111745": "Simon Brooke", "0086515": "Clement Blake", "1867155": "Heath Crawford", "1932317": "Tiffany Michelle", "1851519": "Lon Moriarty", "1724136": "Stephen Silberkraus"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["The crew has a job in a town where Jayne once robbed the magistrate but dropped the stolen money, making him a local folk hero, and a target for the local boss.", "Mal and the crew of Serenity land to pick up some contraband In Canton, a township on Higgins' Moon, where labor is provided under servitude run by the local magistrate. Jayne had once robbed the boss with a partner but barely escaped by jettisoning from their getaway vehicle his partner (now waiting for revenge) and the money boxes (who have made him a legendary hero). Jayne is recognized by all and \"welcomed\" accordingly. Sub-plots show Simon and Kaylee face their growing romantic feelings, River first tries to \"fix\" the Bible and is later traumatized by seeing Book's hair. Meanwhile, Inara is \"making a man of\" the magistrate's resentful son who helps the crew escape out of spite to his father. But there has been a confrontation with Jayne's abandoned partner whose vengeful shotgun kills one of Jayne's young hero-worshipers, bringing Jayne to verge of philosophy with Mal.—anonymous", "Mal and his crew go to a planet where miners are explored by Magistrate Higgins and weapons are forbidden to bring cargo to the Serenity and Jayne is afraid to go with them. He explains that four years ago, his partner Stitch Hessian and he robbed the powerful Magistrate. However, while fleeing, there was a problem with their vehicle and he throw Stitch and the money off. But Mal forces Jayne to go with the group and he discovers that he is a hero for the miners and the population that collected the money. Meanwhile Inara schedules and encounter with the Magistrate. She finds that Higgins appointment is indeed for his son that is virgin. When the Magistrate learns that Jayne is in the town, he releases Stitch that is seeking revenge with a shotgun. What will happen to Jayne?—Claudio Carvalho, Rio de Janeiro, Brazil", "Returning to a planet where he once ran into some serious trouble, Jayne discovers that he has become the hero of local folklore. Mal decides to use this entertaining distraction to complete a job, however some unfinished business may derail his plans.—Brandon Smith", "Mal and the crew of Serenity lands on the mud-producing township of Canton, on Higgins' Moon, to pull a heist in a mudder colony town where Jayne once robbed the local magistrate, making him a local folk hero, and a target for the local police, and another target when one of his old gang members wants to settle an old score. Meanwhile, Simon and Kaylee question where they stand with their growing romantic feelings for each other. River has more emotional tics while hanging around Shepherd Book. Elsewhere on Canton, Inara's latest client is the virginal son of Magistrate Higgins whom she asks for help for the Serenity crew's job.—firefly_andy"], "genres": "N/A", "imdbID": "0579530", "rating": 8.7, "votes": 5507, "number_of_episodes": 14}