{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0265637": "Michael Fairman", "0124997": "Katherine Kendall", "0596789": "Rolando Molina", "0242627": "John Dunn", "0072715": "Michael Bentt", "0683685": "Adam Pilver", "1711288": "Johnny Shakespeare", "0888410": "Jason Van", "1364280": "Damion Poitier"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["43"],  "plot": ["Niska catches up with the Serenity crew.", "Wash is jealous of the bond between Zoe and Mal and demands to go with Mal to trade the cargo of medical supplies with locals. However Niska's men capture and bring them on board. Niska tortures them both while Zoe collects money from the crew to pay a ransom for them. However Niska releases only Wash and takes Mal's ear to give to Zoe. But the Serenity's crew decides to fight to bring their captain back.—Claudio Carvalho, Rio de Janeiro, Brazil", "Wash begins to feel threatened by the bond between Mal and Zoe. To see for himself how the two work together, Wash demands that he, instead of Zoe, goes on a mission with Mal to sell the stolen Ariel medical supplies. Unfortunately, the ruthless and sadistic gangster Niska has found out where Serenity is, and captures Mal and Wash and tortures them as revenge for their failure in the train robbery mission (from The Train Job episode). Meanwhile, Inara has another client who is a wealthy councilperson on the planet they're on and to the crew's surprise, the client is a woman. When Zoe learns about Niska's abduction of Wash and Mal, she tries to strike a bargain for their release, but Niska steals all their money and stolen cargo, while releasing only Wash. Realizing that Mal was willing to sacrifice himself for him, Wash persuades Zoe, Jayne and Book and the rest of the crew to help him launch a rescue mission in a full-scale attack on Niska's fortified space station to save Mal. Also, River begins showing more developing powers when she displays some accurate 'blind-shooting' during the rescue when Kaylee is pinned down during the climactic gun battle.—Shiro"], "genres": "N/A", "imdbID": "0579541", "rating": 8.8, "votes": 5048, "number_of_episodes": 14}