{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0869981": "Tom Towles", "0117420": "Andrew Bryniarski", "0265637": "Michael Fairman", "0001344": "Gregg Henry", "0714615": "Valerie Red-Horse", "0929558": "Kevin Will", "1133966": "Lina Patel", "0721680": "David Reynolds", "0725519": "Jeff Ricketts", "0168371": "Dennis Cockrum", "1441925": "Eric Lange", "1581206": "Tawny René Hamilton", "1251323": "Michelle Ferrara", "2156326": "Ernesto Trinidad", "3682061": "Melody White", "1675595": "Rick Williamson"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Mal has second thoughts after discovering that two boxes of Alliance goods his crew has been hired to steal are full of badly needed medical supplies headed for the mining town of Paradiso.", "Captain Mal Reynolds and his motley crew of space traders get a job that seems to be right up their alley. Gangster Adelai Niska wants them to rob a train and deliver the goods to them. Mal and Zoey have little trouble getting the job done and even convincing the local authorities that are just a married couple who have come looking for work. When the overhear that the stolen cargo was urgently needed medical supplies, Mal reconsiders whether he wants to do Nishka's dirty work. Back on the ship, Dr. Simon Tam continues to worry about his sister River who is still having nightmares about her institutionalization.—garykmcd", "Mal and his crew are hired by the dangerous criminal Adelai Niska to heist two packages from a train for him. He goes with Zoe and they find an Alliance troop in the train, but they succeed and Jayne takes the cargo to Serenity. However Mal and Zoe have to stay in the train and Sheriff Bourne investigates the robbery. Soon they learn that the stolen cargoes are medical supplies for the mining settlers that need them; otherwise they will die. Mal and Zoe reevaluate the heist and come up to a decision.—Claudio Carvalho, Rio de Janeiro, Brazil", "Mal and his crew are recruited by a greedy and sadistic gangster, named Niska, to pull off an old-fashioned train robbery. Although the heist goes off without a hitch, Mal and Zoe are detained by the authorities only then to learn that the cargo they stole was medicine going to refugees and are torn whether to risk giving back the cargo and not getting payed for the job.—ardie8"], "genres": "N/A", "imdbID": "0579539", "rating": 8.3, "votes": 5817, "number_of_episodes": 14}