{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0283631": "Steven Flynn", "0901679": "Ilia Volok", "0437852": "Lyle Kanouse", "0341159": "Dax Griffin", "1195518": "Roderick McCarthy", "1409336": "Keith Mooney"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["When Serenity's life support system fails, Mal orders the crew off the ship - but he stays behind.", "Mal and the Serenity crew are celebrating Simon's birthday when there is a fire in the engine room. Soon Keylee learns that the life support system is not working since they need a new converter. Mal order his crew to live Serenity in the two shuttles and Wash releases a distress signal. While breathing with difficulty, Mal recalls how most of the members of his crew joined him in the Serenity while waits for a miracle.—Claudio Carvalho, Rio de Janeiro, Brazil", "Non-linear storytelling reveals how all the characters got thrown together to be the crew members of Serenity, and even shows how Mal chose a rusting hulk to be the steed on which he pinned all of his hopes for freedom out there in the black nothingness.—RavenGlamDVDCollector", "On Simon's birthday, Serenity's engine stops turning and an explosion knocks out auxiliary life support, severely wounding Zoe. With few options, Mal orders the rest of the crew off the ship, but he stays behind hoping for a miracle. The story is told in multiple time frames shifting from Mal's time alone on the ship to the events prior to the crew's departure. Flashbacks to Mal's initial meetings with many of his crew members are also a part of the narrative, showing how and why Mal and Zoe decided to buy the old Firefly-class ship, as well as revealing it wasn't love-at-first-sight for Zoe and Wash when he was hired as the Serenity's pilot, as well as how Inara charmed her way into letting Mal rent out one of the Serenity's shuttles for herself, how Mal met the mechanic/engineer Kaylee in a compromising position, and how the crew met Jayne who was an tough, but dumb, interplanetary bandit.—Azure_Girl", "When Serenity's life support system fails, Mal orders the crew off the ship, but he stays behind to try to repair the life support systems before oxygen runs out. The Serenity's background story is also revealed how Mal and Zoe bought the old Firefly-class ship, and to how they met the crew; the pilot Wash, companion Inara, bandit Jayne, and mechanic Kaylee.—Azure_Girl"], "genres": "N/A", "imdbID": "0579533", "rating": 9.3, "votes": 6651, "number_of_episodes": 14}