{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0415070": "Carlos Jacott", "0791968": "Mark Sheppard", "0880820": "Andy Umberger", "2094174": "Philip Sternberg", "1022481": "Eddie Adams", "0528260": "Colin Patrick Lynch", "0058783": "Bonnie Bartlett", "0889442": "Domingo Vara", "0641693": "Stephen O'Mahoney", "0574535": "Jamie McShane", "0443947": "John F. Kearney", "1387907": "Gabrielle Wagner", "1338528": "Ray Buffer", "4916501": "Michael Keyes", "1062852": "Greg Wendell Reid", "1296401": "Gerard J. Reyes", "0758015": "Rabatan Salem", "0930172": "Brian J. Williams"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["86"],  "plot": ["Malcolm Reynolds is a veteran and the captain of Serenity. He and his crew are smuggling goods, but they need to pick up some passengers for extra money. However, not all the passengers are what they seem.", "After scavenging the remains of a cargo spaceship, Captain Malcolm 'Mal' Reynolds and his crew are found by the Alliance but they escape. They go to Persephone to sell the stolen cargo to the criminal Badger, but he is no longer interested in the wanted goods. Malcom decides to sell the cargo to the outlaw Patience in the planet Whitefall and pick up passenger to raise money. But soon they discover and Alliance's mole on board that is chasing one of the passengers. Who is who? When they arrive on Whitefall, Patience betrays Malcolm and the infamous Reavers have followed them and will attack Serenity. What will Malcolm and his crew do?—Claudio Carvalho, Rio de Janeiro, Brazil", "In the first half of the original pilot episode, the crew of Serenity takes on several passengers and make their way to another planet to try and sell goods they salvaged from a wrecked ship. Their efforts are impeded, though, when Wash and Mal realize that there is an undercover alliance fed on board. In the second half of the original pilot, Simon struggles to save Kaylee, and in turn River and himself while Mal, Zoe, and Jayne attempt to unload the cargo from the salvage to a trigger-happy mayor of a border moon.—Anonymous"], "genres": "N/A", "imdbID": "0579535", "rating": 8.8, "votes": 5935, "number_of_episodes": 14}