{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0767443": "Doug Savant", "0604510": "Branden Morgan", "1248910": "Jared Poe", "0795710": "Lancer Dean Shull", "0915676": "Gary J. Wayton"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["Serenity is pulled in by an Alliance cruiser while investigating a spaceship that was attacked by Reavers. Simon and River must hide to prevent capture, while something is wrong with the lone survivor of the attacked spaceship.", "The Serenity hits a wrecked transport vessel that was transporting settler's families and Mal decides to check whether there are survivors or goods. He goes on board with Zoe and they find a survivor completely mad and bring him to the Serenity. They also find some valuable goods and the fate of the crew that was attacked by the Reavers. When they are ready to go, they are intercepted by an Alliance's spacecraft and their Commander Harken brings them on board for investigation. Soon Mal realizes that they are in danger and tries to convince Harken to check the survivor.—Claudio Carvalho, Rio de Janeiro, Brazil", "The crew of Serenity stumble upon the ruins of a transport ship and decide to search the vessel for any salvageable goods, only to discover that the ship is not entirely deserted.—Anonymous", "The crew of Serenity stumble upon the ruins of a transport ship and decide to search the vessel for any salvageable goods, only to discover that the ship is not entirely deserted. Mal discovers a frightened man who claims he's the sole survivor of a dreaded Reaver attack. When the Serenity gets boarded by troops from an Alliance warship, Mal must not only hide Simon and River Tam from the investigating authorities, but convince the persistent Alliance commanding officer of his legalities, while the mysterious survivor soon reveals to be a little TOO traumatized by the event.—Anonymous"], "genres": "N/A", "imdbID": "0579528", "rating": 8.4, "votes": 5360, "number_of_episodes": 14}