{"cast": {"0277213": "Nathan Fillion", "0868659": "Gina Torres", "0876138": "Alan Tudyk", "1072555": "Morena Baccarin", "0000284": "Adam Baldwin", "0821612": "Jewel Staite", "0536883": "Sean Maher", "1132359": "Summer Glau", "0322002": "Ron Glass", "0940950": "Jonathan M. Woodward", "0121404": "Richard Burgi", "0700094": "Al Pugliese", "1331714": "Tod Nakamura", "0898609": "Craig Vincent", "0750851": "Morgan Rusler", "0626256": "Danny Nero", "1296401": "Gerard J. Reyes", "0923736": "Joss Whedon"}, "geners": ["Adventure", "Drama", "Sci-Fi"], "runtimes": ["44"],  "plot": ["A dying request from an old army buddy turns treacherous for Mal, Zoë, and the rest of the crew.", "Mal and his crew are having entertainment in a space station and Mal goes to the post office to check and he receives a big trunk addressed to Zoe and him. When he opens the box, he finds the corpse of their army pal Private Tracey. They also find a message from Tracey asking Mal and Zoe to deliver his boy to his parents in a planet. The Serenity heads to the planet and out of the blue, she is attacked by another spaceship. Ml asks Simon to make an autopsy in Tracey and they discover that the man is alive. What has happened to Tracey?—Claudio Carvalho, Rio de Janeiro, Brazil", "A pleasant day out at a space station turns sour when Mal and Zoe receive the dead body of one of their old army buddy's in the post office. Their old friend is named Tracey who fought with them during the Battle of Du-Khang during the Alliance-Independence Civil War six years earlier. Along with Tracey's body is an audio message, asking them to take him to his home planet to be buried by his parents. However, Mal begins to suspect something might be wrong when Alliance agents, led by the relentless Lt. Womack, start chasing Serenity, demanding return of their property: the body. It soon turns out that Tracey is actually alive and reveals the real reason why he faked his death, and why he's going to die soon.—Shiro"], "genres": "N/A", "imdbID": "0579538", "rating": 8.4, "votes": 4816, "number_of_episodes": 14}