{"cast": {"0001368": "Ernie Hudson", "0455767": "Terry Kinney", "0674782": "Harold Perrineau", "0907708": "Eamonn Walker", "0009716": "Kirk Acevedo", "0004908": "Edie Falco", "0799777": "J.K. Simmons", "0855564": "Lee Tergesen", "0935921": "Dean Winters", "0000703": "BD Wong", "0411964": "Zeljko Ivanek", "0015382": "Adewale Akinnuoye-Agbaje", "0289213": "Rick Fox", "0315342": "Stephen Gevedon", "0604420": "George Morfogen", "0047536": "Zuill Bailey", "0412907": "J.D. Williams", "0349881": "Murphy Guyer", "0394434": "Tim Hopper", "0743671": "Matt Ross", "0241199": "O.L. Duke", "0502442": "Leon", "0563868": "Tim McAdams", "0781218": "Jon Seda", "0815548": "Jose Soto", "0925878": "Sean Whitesell", "0010999": "Granville Adams", "2988520": "Timothy L. Brown", "0171813": "Bob Colletti", "0188981": "Douglas Crosby", "1203136": "Elyas Khan", "0439449": "Raymond Michael Karl", "2172817": "Peter Mazzeo", "0780070": "Philip Scozzarella", "0785352": "Terry Serpico", "0810750": "Brian Smyj", "1076073": "Frank Bonsangue", "0320234": "Bruno Gunn", "2188940": "Jack Hammel", "1268789": "Jose Hernandez Jr.", "1658955": "John Samuel Jordan", "0579457": "Chazz Menendez", "0725708": "Leif Riddell", "3976974": "R. Marcus Taylor"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["57"],  "plot": ["After a visit with his sons, Schillinger realizes he needs to get paroled. He convinces McManus to let him return to Em City with the condition that he leaves Beecher alone. Beecher comes out of the hole hell-bent on making sure Schillinger doesn't get paroled. McManus gets wind of Wittlesey and Ross' contraband operation and orders her to shut it down. Ross makes it very clear to her that this will not happen. The Muslims meet and discuss how the riot will begin. However, two rednecks beat them to it by fighting over a game of checkers. This causes all the inmates to get involved and they quickly overpower the COs who are trying to break it up. Said orders the Muslims to get out and seize control. Said pulls out the gun he acquired from a rookie CO and fires a shot into the air, causing Em City to quiet down. Said meets with Ross, Adebisi, O'Reily and Alvarez to discuss strategy and demands. Said agrees to let O'Reily, Ross and Adebisi control the main gate and Alvarez will control the hostages. Dobbins was seriously injured during the initial uprising and Hill convinces Vayhue to step up and help. Vayhue and Dobbins leave Em City only to be beaten up by SORT. The hostages require medical attention, so Alvarez and Said vote in favor of a doctor. However, Adedisi, Ross and O'Reily vote no. Governor Devlin orders the National Guard to surround the prison and take it back, but Glynn and McManus think they should see the demands first. McManus volunteers, to Devlin's disgust, to enter Em City to deliver food and check on the hostages. He tries to get COs Armstrong, Mineo and Wittlesey free in exchange for himself. He gets Armstrong and Mineo released, due to their injuries but Wittlesey has to stay. After reading the demands, Glynn realizes that the prisoners are being quite reasonable, however Devlin orders the National Guard and SORT to re-take Em City anyway. Meanwhile Ross' men and Adebisi's are constantly fighting, so Said tells O'Reily to switch Ross' men with Alvarez's at the front gate. A short tie later, Adebisi's men start to fiend due to the depletion of heroin, resulting in a major skirmish. Just as that situation is resolved and the Homeboys are tied up, the lights go out. Said realizes the situation and orders Ross to bring out the hostages as a front line of defense. Soon tear gas is thrown into Em City, then a tractor breaks through the barricade and gunfire rings out in Em City.—alberta1"], "genres": "N/A", "imdbID": "0668282", "rating": 9.2, "votes": 3095, "number_of_episodes": 56}