{"cast": {"0001368": "Ernie Hudson", "0455767": "Terry Kinney", "0001549": "Rita Moreno", "0674782": "Harold Perrineau", "0799777": "J.K. Simmons", "0855564": "Lee Tergesen", "0907708": "Eamonn Walker", "0935921": "Dean Winters", "0146146": "Reg E. Cathey", "0005221": "Christopher Meloni", "0604420": "George Morfogen", "0936001": "Scott William Winters", "0942646": "Michael Wright", "0010999": "Granville Adams", "0167024": "Robert Clohessy", "0546306": "Tom Mardirosian", "0196185": "Craig muMs Grant", "0737480": "Kristin Rohde", "0953882": "David Zayas", "0715953": "Roger Rees", "0000639": "Ally Sheedy", "0072613": "Peter Hans Benson", "0227151": "Carl DiMaggio", "0353415": "Justin Hagan", "0466300": "Jon Korkes", "1865743": "David Laundra", "0693446": "Michael Potts", "0734764": "R.E. Rodgers", "0761024": "Otto Sanchez", "0780070": "Philip Scozzarella", "0782640": "Evan Seinfeld", "0808564": "Jacques C. Smith", "0957257": "Chuck Zito", "0015382": "Adewale Akinnuoye-Agbaje", "0037044": "Mike Arotsky", "1076073": "Frank Bonsangue", "8821213": "Georges Bridges", "0134167": "Cedric Cannon", "0139382": "John Carpenter", "0195400": "Vincent D'Arbouze", "0254233": "Gordon Elliott", "1120264": "Todd Etelson", "1106926": "Ra Hanna", "11778757": "Julie Hansen", "4105692": "Cindy Jordan-Meryll", "1097613": "Amanda KC", "0447028": "Peter James Kelsch", "0457755": "Eartha Kitt", "0522426": "Stephen Love", "0576720": "Seth William Meier", "0657207": "James Palacio", "0661094": "Don Pardo", "0703691": "Rohan Quine", "0751656": "Johnny Russo", "1627600": "Joel West", "0936549": "Steven Wishnoff"}, "geners": ["Crime", "Drama", "Thriller"], "runtimes": ["53"],  "plot": ["Six months have passed. Said was acquitted of Adebisi's murder on grounds of self-defense. \"Up Your Ante,\" a game show, has joined Miss Sally in the prisoner's TV lineup. McManus and Glynn have done their best to keep the events leading up to Adebisi's death a secret. News producer Lisa Logan tours Oz in preparation for the arrival of hard-hitting reporter Jack Eldridge, who will also be spending a night with the new inmate the cameras will follow around on his first day. That man is Omar White, a jittery, homophobic addict fiending for drugs. Busmalis drives the cameras away. After an interview with Beecher Lisa considers focusing the piece on his struggles in Oz. Beecher taunts Keller and Ryan with on camera hints of their involvement in the murders; Keller threatens Ryan when Ryan wants to deal with Beecher; Pete dodges questions; Tidd interrupts a tense moment between Lisa and Vern. After a mention of Adebisi's drug-and-sex videotapes by Poet, Lisa decides to make the piece about the mystery surrounding his final days. Eldridge arrives, digging for information on Ryan after Ryan hints at their past connection. Eldridge blindsides Said with questions about his part in Adebisi's death. Worried about damage to Em City and his and Glynn's careers, Tim points Lisa toward the man he blames: Querns, who kept quiet in exchange for Glynn keeping quiet over his unethical methods. Per Glynn's advice, Querns turns down requests for an interview; per Querns' advice, Glynn destroys the tapes. Glynn and Jack have an off-the-record conversation, leading Eldridge to realize Glynn was a good man caught up in a situation he couldn't control. Jack cancels the Adebisi story. Offering him a constant supply of drugs, Ryan manipulates White into helping him settle an old score against Eldridge. Unfortunately, White tries to attack Eldridge directly in front of the guards. White goes to solitary. Eldridge chooses Cyril for his podmate, sensing good story potential. Cyril, who hasn't been taking his medication, remembers Eldridge and blames him for his mother getting cancer (Eldridge did a piece on Ryan on Cyril when they were in charge of their local Irish gang, painting them as monsters. Their mother developed and died from cancer not long afterward.). Cyril beats Eldridge to a pulp. As he recovers from serious injuries, the network decides to cancel the piece on Oz. Lisa resigns in protest.—Anonymous"], "genres": "N/A", "imdbID": "0668308", "rating": 8.3, "votes": 2072, "number_of_episodes": 56}