{"cast": {"0000059": "Laurence Olivier", "0817354": "Edward Spears", "0244357": "Lawrence Durrell", "0923056": "Siegfried Westphal", "0913948": "Gordon Waterfield", "0912307": "Walter Warlimont", "0902666": "Hasso von Manteuffel", "0064480": "André Beaufre", "0002001": "Maurice Chevalier", "0872081": "Charles Trenet", "0208540": "Charles de Gaulle", "0241164": "Duke of Windsor", "0303907": "Maurice Gamelin", "0320781": "Henri Giraud", "0345626": "Heinz Guderian", "0386944": "Adolf Hitler", "0702457": "Philippe Pétain", "0721534": "Paul Reynaud", "0923369": "Maxime Weygand"}, "geners": ["Documentary", "History", "War"], "runtimes": ["53"],  "plot": ["French politics, the Maginot Line, the Saar Offensive, Blitzkrieg warfare and the Nazi invasion of France and the Low Countries.", "In 1934 France starts building a sophisticated bulwark along the German border called the Maginot Line. It is a network of armed forts, connected by a narrow-gauge, underground railway. At the northern end of the Maginot Line lies the Ardennes, high mountains covered with dense forests. This area is perceived by the French generals as impenetrable, so they haven't much forces located there. 10 May 1940 the German army starts its offensive by invading Holland, and then Belgium. The French generals send 40 of their best divisions into Belgium. The Germans take the opportunity to move through the weakest point in the Maginot Line further south. With their tanks they penetrate the impenetrable Ardennes. They build a bridge across the river Meuse, and soon the German tanks, followed by the infantry, are in France. The German blitzkrieg shocks the French. Holland surrenders on 14 May, Brussels falls three days later. French citizens start leaving Paris and other cities. 12 million refugees are out on the roads of Northern France. On 10 June the French government leaves Paris, and some days later they sign an armistice with Germany.—Maths Jesperson {maths.jesperson1@comhem.se}"], "genres": "N/A", "imdbID": "1129868", "rating": 8.7, "votes": 571, "number_of_episodes": 26}