{"cast": {"0000059": "Laurence Olivier", "0444985": "Hans Kehrl", "8311513": "Georg Konrad Morgen", "8671349": "Heinz Reinheimer", "1232568": "Hugh Greene", "0902534": "Ewald von Kleist", "8671350": "Heipke Remer", "0081401": "Christabel Bielenberg", "8671352": "Siegmund Weltlinger", "0094511": "Emmi Bonhoeffer", "0355191": "E.F.L. Wood", "0105751": "Eva Braun", "1263257": "Joseph Chamberlain", "0150196": "Neville Chamberlain", "0197566": "Édouard Daladier", "0324305": "Joseph Goebbels", "0351425": "Hermann Göring", "0381523": "Rudolf Hess", "0382193": "Reinhard Heydrich", "0385441": "Heinrich Himmler", "0386944": "Adolf Hitler", "0615907": "Benito Mussolini", "0753915": "Ernst Röhm", "0902438": "Paul von Hindenburg", "0902861": "Joachim von Ribbentrop"}, "geners": ["Documentary", "History", "War"], "runtimes": ["52"],  "plot": ["The rebirth of Germany and growth in power of the Nazi Party leading up to the outbreak of war.", "In 1933 Hitler becomes chancellor of Germany. He immediately starts transforming the country into what he calls The New Germany. In March the parliament decides to allow Hitler to govern without the parliament, thus becoming a legal dictator. The Nazis begin persecuting journalists, socialists and Jews, and many intellectuals flee the country. A turning point is 30 June 1934, when Hitler and his body guard, SS, start murdering also opponents and rivals within the Nazi party. Between his appearances Hitler rests at Berchtesgarden in Bavaria, where his mistress, Eva Braun, documents his private life on film. The Treaty of Versailles from 1919 had demilitarized Germany, but step by step Hitler militarizes the country again. His troops also start recapturing the surrounding German-speaking provinces and countries: Saarland 1935, Rhineland 1936, Austria 1938 and Sudetenland 1938. They don't make a halt here, but capture also the rest of Czechia. In the beginning of 1939 they threaten to invade Poland. In August England promises to fight if Poland is attacked. This is counteracted by the Germans, when their foreign minister Ribbentrop on 23 August flies to Moscow, where he concludes a Nazi-Soviet-pact.—Maths Jesperson {maths.jesperson1@comhem.se}"], "genres": "N/A", "imdbID": "1129863", "rating": 8.7, "votes": 751, "number_of_episodes": 26}