{"cast": {"0000059": "Laurence Olivier", "0125033": "R.A. Butler", "0465956": "Bernard Kops", "0095828": "Robert Boothby", "0940318": "Charles Woodhouse", "0173422": "J.R. Colville", "0512275": "Martin Lindsay", "0151500": "Lord Chandos", "0265716": "Lucy Faithfull", "0800388": "John Simon", "0150196": "Neville Chamberlain", "0161476": "Winston Churchill", "0197566": "Édouard Daladier", "0276247": "Gracie Fields", "0286399": "George Formby", "0386944": "Adolf Hitler"}, "geners": ["Documentary", "History", "War"], "runtimes": ["52"],  "plot": ["The invasions of Poland, the Winter War, the sinking of the Graf Spee, the \"phony war\" and Norwegian Campaign, and the elevation of Winston Churchill to Prime Minister.", "France and Great Britain enter World War 2 following Germany's invasion of Poland. But with the exception of its navy Britain is rather uncertain how to prepare. After a failed operation in Norway lead by Churchill, Chamberlain is, ironically, replaced as Prime Minister by Churchill.—David Foss", "On 1 September 1939 Germany invades Poland. Two days later the British Prime Minister declares that because of this his country is at war with Germany. The Russians invade Poland from the east and meet the German army at Brest-Litovsk, where the two occupying powers divide the country. Prime Minister Chamberlain appoints Churchill as the First Lord of the Admiralty. England prepares itself for war, although nothing happens for several months. On 30 November the Russians attack Finland, but cannot defeat the Finnish army in the difficult winter terrain. Churchill develops a plan to stop the trade of Swedish iron ore through Norway to Germany. In April 1940 England and France send naval forces to Norway to invade the three Norwegian towns Namsos, Andalsnes and Narvik in the north, but they cannot defeat the better equipped Nazi forces, who at the same time invade Norway from the south. Because of the loss in Norway, and Russia's final victory in Finland, Chamberlain announces his resignation from his office on 11 May. The King appoints Churchill as the new Prime Minister.—Maths Jesperson {maths.jesperson1@comhem.se}"], "genres": "N/A", "imdbID": "1129867", "rating": 8.3, "votes": 605, "number_of_episodes": 26}