{"cast": {"0355910": "Michael C. Hall", "0004748": "Julie Benz", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0001475": "John Lithgow", "1835900": "Courtney Ford", "0254862": "Greg Ellis", "0544721": "Mary Mara", "2247732": "Christina Robinson", "2259079": "Preston Bailey", "0676648": "Rick Peters", "0040992": "Mark Atteberry", "0341247": "John Griffin", "0662475": "Marisa Petroro", "0399590": "Cooper Huckabee", "3361173": "Alex Lewis", "1660030": "Bill Doyle", "2466273": "Eve Mauro", "2984790": "Jessica Carlos", "2334495": "Lisa Catara", "0391595": "Bruce Holman"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["53"],  "plot": ["Dexter finally strikes a balance between family, career and his secret life, but is thwarted in his pursuit of his next victim, while Debra expresses a renewed and unwelcome interest in their father's checkered past.", "Dexter finds himself enjoying a brief moment of tranquility. He's finally managed to strike a balance between work, family and other pursuits. But he's keenly aware that times like these aren't meant to last. When Miami Metro discovers a string of murders connected to a prominent photographer, Dexter sees an opportunity for a clean kill.", "A dismembered human arm is found inside an alligator, leading Dexter to his next victim, Jonathan Farrow, a photographer, who shoots fairly gruesome pictures of models, apparently killing Latina models who were in America illegally (ensuring no missing persons reports would be filed). Family and work taking its toll, a hurried Dexter accidentally makes his greatest single mistake and violates The Code of Harry. Meanwhile, Arthur Mitchell appears to be disturbed, and is unable to put a doe out of its misery after hitting it with his car. He then proceeds to build a coffin with lumber he obtained with Dexter's help. In order to get more 'alone time', Dexter, acting upon Arthur's advice, attempts to involve his kids in more activities, only to get pulled into the activities with them. After threatening Quinn to keep his girlfriend reporter away from Deb, Quinn starts digging into Dexter's past and makes his life a lot more difficult."], "genres": "N/A", "imdbID": "1444427", "rating": 8.4, "votes": 6801, "number_of_episodes": 96}