{"cast": {"0355910": "Michael C. Hall", "0004748": "Julie Benz", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0001475": "John Lithgow", "0682762": "Geoff Pierson", "0132610": "Julia Campbell", "0544721": "Mary Mara", "2343444": "Brando Eaton", "1404825": "Vanessa Marano", "2932097": "Jake Short", "0582773": "Jim Metzler", "2247732": "Christina Robinson", "2259079": "Preston Bailey", "0998907": "Christopher Goodman", "0710340": "Roger Ranney", "2084644": "Geno Monteiro", "0514704": "John Littlefield", "0230897": "Jullian Dulce Vida", "3819330": "Jacquelyn Burns", "0131235": "Christian Camargo", "0391595": "Bruce Holman", "2280163": "Maxwell Huckabee", "2291212": "Nicole Preston", "2016045": "Jera Sky", "3046500": "Jimmy Star"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["Dexter and Arthur find themselves on a collision course, as Debra unearths a shocking long-hidden truth, Rita admits her marriage to Dexter is troubled, and Batista and LaGuerta face the consequences of an ethics breach. Season Finale.", "**SPOILER ALERT!!** As the noose tightens, Arthur warns Dexter to back off. But Dexter will do anything to stop Arthur from eluding him, even if that means putting himself on the wrong side of the law. Rita acknowledges the rocky relationship she and Dexter share, but reaffirms her support. Meanwhile, Batista and LaGuerta face the consequences of their actions and now that they are married agree to move in together. Debra finally learns that Dexter is the Ice-Truck Killer's brother and tells Dexter. She then tells him he is the only constant truly good thing in her life and that she loves him. At the culmination of the episode, Dexter finally captures and kills Arthur, but then goes home to find Rita dead - apparently killed by Arthur hours earlier in the same manner as the other Trinity bathtub victims. Dexter finds Harrison at the scene of the crime. He was spared, but forced to witness Rita's murder, and is left sitting in a pool of her blood - exactly as Dexter had once been. Dexter flasheÏs back to Harry carrying him out of the shipping container where his mother was murdered as he carries his blood-soaked son out of the house."], "genres": "N/A", "imdbID": "1444421", "rating": 9.8, "votes": 23654, "number_of_episodes": 96}