{"cast": {"0355910": "Michael C. Hall", "0004748": "Julie Benz", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0001475": "John Lithgow", "1835900": "Courtney Ford", "0132610": "Julia Campbell", "2343444": "Brando Eaton", "1404825": "Vanessa Marano", "2247732": "Christina Robinson", "2259079": "Preston Bailey", "0676648": "Rick Peters", "0857107": "Andrew Thacher", "0656754": "Greg Joung Paik", "2240095": "Esther Paik", "3361173": "Alex Lewis", "0004169": "Bo Kane", "3572240": "Harrison Thacher", "0728899": "Steven Ritzi", "1166157": "Kortney Manns", "0341247": "John Griffin", "0391595": "Bruce Holman", "4343506": "Micah James", "2185662": "Heidi Brook Myers", "3046500": "Jimmy Star"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["54"],  "plot": ["Dexter wonders if his father's Code is truly the right path, and hopes to get answers by accompanying Trinity on an out-of-town road trip, while Debra discovers that her single-minded pursuit of Trinity has blinded her to the truth.", "Dexter has always known his father's Code was meant to protect him from exposure. But after committing a serious mistake, he wonders if it could have been designed to protect him from something even more dangerous - human emotion. When he discovers that Arthur is planning an out-of-town trip, Dexter sees an opportunity to ride along and gain insight into the mind of a fellow monster. Even so, Dexter isn't prepared for the startling revelations Arthur makes along the way, revelations about his own past which only serve to convince Dexter of what he must do. Meanwhile, back at Miami Metro, Debra refuses to let a technicality keep her off the Trinity case. She works through others to ensure her voice is heard - that is, until she realizes that her single-minded pursuit of the Trinity Killer may have blinded her to the truth."], "genres": "N/A", "imdbID": "1444428", "rating": 8.4, "votes": 6899, "number_of_episodes": 96}