{"cast": {"0355910": "Michael C. Hall", "0004748": "Julie Benz", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0001475": "John Lithgow", "0682762": "Geoff Pierson", "1835900": "Courtney Ford", "0132610": "Julia Campbell", "0005173": "Roma Maffia", "2343444": "Brando Eaton", "1404825": "Vanessa Marano", "2247732": "Christina Robinson", "2259079": "Preston Bailey", "0481122": "Alicia Lagano", "3046500": "Jimmy Star", "0391595": "Bruce Holman", "0479779": "Patrick Labyorteaux", "3315776": "Aryn Nelson"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["55"],  "plot": ["Dexter doubles his efforts to stay ahead of the official Trinity investigation, and receives relationship advice about the friction between himself and Rita from a most unexpected source.", "Dexter knows it's only a matter of time before Miami Metro discovers the Trinity Killer's latest handiwork. Therefore, he has to work doubly hard to stay one step ahead of their investigation. Under the alias of 'Kyle Butler', Dexter has begun to realize that the closer he gets to Trinity, the more he stands to learn from this very different beast. As the friendly building contractor Arthur Mitchell, the Trinity Killer hides behind a well-kept mask; and getting behind that facade will require some extra prodding on Dexter's part. Meanwhile, Debra becomes frustrated when she finds herself shut out from her own case. She considers bending the rules in the name of justice, risking her career in the process. LaGuerta and Batista come to regret a major decision, and realize that by playing by the rules they may have painted themselves into a corner. And when the friction between Rita and Dexter comes to a head, Dexter gleans relationship advice from a most unlikely source.", "Dexter knows it's only a matter of time before Miami Metro discovers the Trinity Killer's latest handiwork. Therefore, he has to work doubly hard to stay one step ahead of their investigation. Dexter has begun to realize that the closer he gets to Trinity, the more he stands to learn from this very different beast."], "genres": "N/A", "imdbID": "1444426", "rating": 8.6, "votes": 6911, "number_of_episodes": 96}