{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0004988": "Colin Hanks", "0080049": "Yasiin Bey", "0001579": "Edward James Olmos", "0305083": "Aimee Garcia", "0113117": "Billy Brown", "1674570": "Mariana Klaveno", "1622615": "Josh Cooke", "0452748": "Rya Kihlstedt", "0154763": "Maree Cheatham", "4687333": "Luke Andrew Kruntchev", "1454267": "Germaine De Leon", "1014436": "Lacey Beeman", "0822878": "Steve Stapenhorst", "2122480": "Luke Van Pelt", "3882187": "Michael Raif Brizzolara", "2836409": "Shannon Marie Bullock", "0314195": "George Gerdes", "0391595": "Bruce Holman", "3462377": "David Dustin Kenyon", "4687585": "Evan George Kruntchev", "1922788": "Devanny Pinn", "1761677": "Brandon Slagle", "3363414": "Monika Spruch", "7722342": "Shannon Elizabeth Stone", "0915676": "Gary J. Wayton"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["51"],  "plot": ["The search for the Doomsday Killers takes Dexter in a new direction; Batista and Quinn pay a visit to the university where Professor Gellar taught; due to departmental regulations following the shooting, Debra is forced to begin therapy.", "With the help of his newfound friend Brother Sam, Dexter wonders if there is light within him to counter the darkness, while the search for the Doomsday Killers takes him in a new direction; Batista and Quinn pay a visit to the university where Professor Gellar taught; due to departmental regulations following the shooting, Debra is forced to begin therapy.—SHOWTIME", "Miami Homicide starts investigating Professor James Gellar. Dexter examines the angel wings from Doomsday Killers' most recent killing and finds that a unique glue was used to attach a piece of the wing, which leads him to Travis Marshall, who works with rare books at a museum. Masuka hires a new intern, Louis Greene, who helps him with the missing evidence from the Ice Truck Killer case. Deb moves out of Dexter's apartment and gets her own place. After Travis fails to capture a \"Whore of Babylon\" on his own, he and Gellar kidnap a woman together, in preparation for the next tableau. Dexter tries to kill Travis, but later decides that Gellar is the one he must kill. An unknown man shoots Brother Sam in his shop."], "genres": "N/A", "imdbID": "1890883", "rating": 7.9, "votes": 5972, "number_of_episodes": 96}