{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "2088803": "Yvonne Strahovski", "0682762": "Geoff Pierson", "0305083": "Aimee Garcia", "0785594": "Nestor Serrano", "2674140": "Nicole LaLiberte", "4687585": "Evan George Kruntchev", "4687333": "Luke Andrew Kruntchev", "0004968": "Jaime Gomez", "2156591": "Maria Zyrianova", "0415846": "Nick Jaine", "0041936": "Richard Augustine", "5008538": "Clifford Morts", "0726773": "Roger Rignack", "4544836": "Lucas Adams", "1942304": "Jonathan Camp", "1648001": "David Keith Anderson", "0077411": "Ray Berrios", "1964360": "Israel Carbajal", "1874044": "Marcus Eley", "0391595": "Bruce Holman", "2385065": "Scott Reynolds", "1059515": "Darryl D. Stewart"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["As Christmas approaches, Dexter tries to balance his life with Hannah and his relationship with Debra. Dexter learns the man responsible for ordering his mother's death has been released from jail.", "As Christmas approaches, Dexter tries to balance his life with Hannah and his relationship with Debra. Debra follows up on a potentially incriminating tip. Dexter learns that the man responsible for ordering his mother's death has been released from jail.—SHOWTIMEnot approved official SHOWTIME summary", "Dexter plants evidence to steer LaGuerta and Matthews' investigation away from him. Meanwhile, Hector Estrada (Nestor Serrano), the last surviving killer of Dexter's mother, is unexpectedly released on parole, and Dexter plots to make him his latest victim. Debra meets with Arlene Schram (Nicole LaLiberte), a witness to one of Hannah's early murders, and asks her to testify against Hannah. After Arlene tells Hannah about this, Debra has a car accident, and Dexter realizes that Hannah had drugged her. Dexter attempts to kill Estrada, but discovers that he's been set up by LaGuerta. Dexter decides to give Debra evidence incriminating Hannah for Sal Price's murder, resulting in Hannah's arrest."], "genres": "N/A", "imdbID": "2235996", "rating": 8.9, "votes": 6528, "number_of_episodes": 96}