{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0829032": "Ray Stevenson", "2088803": "Yvonne Strahovski", "0305083": "Aimee Garcia", "0001263": "Jason Gedrick", "1085051": "Santiago Cabrera", "2316016": "Katia Winter", "0729060": "Geoffrey Rivas", "1327935": "Andrew Kirsanov", "1599867": "Meredith Giangrande", "0349993": "Jack Guzman", "1853521": "Monica Sanchez", "5804924": "Marc Wayne", "1648001": "David Keith Anderson", "0077411": "Ray Berrios", "1964360": "Israel Carbajal", "3782968": "Sylvester Foster", "2325017": "Amber Hay", "0391595": "Bruce Holman", "1586253": "Diane Modafferi", "8679341": "Julian Reyes"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["54"],  "plot": ["Debra gets to know a local crime writer who's dug up some incriminating dirt on Hannah McKay - Dexter's newest obsession. Quinn gets an offer he tries to refuse and LaGuerta keeps digging into the Bay Harbor Butcher case.", "Debra gets to know a local crime writer who's dug up some incriminating dirt on Hannah McKay - Dexter's newest obsession. Quinn gets an offer he tries to refuse and Batista is drawn to a new business opportunity. LaGuerta keeps digging into the Bay Harbor Butcher case.—SHOWTIME", "Dexter continues to investigate Hannah McKay, suspecting that she may have murdered her late husband. Sal Price (Santiago Cabrera), a true crime writer, approaches Miami Metro for case files on the last Wayne Randall murders, as he is writing a book about Hannah. Meanwhile, the Koshka Brotherhood blackmails Quinn into removing evidence linking Isaak to the bar crime scene. LaGuerta continues to probe into the Bay Harbor Butcher case. Debra finds out that Dexter was not completely truthful in the blood report on the Wayne Randall murders. Dexter takes Hannah out on a date where he intends to kill her, but things do not go quite as planned."], "genres": "N/A", "imdbID": "2207890", "rating": 8.1, "votes": 6141, "number_of_episodes": 96}