{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0904967": "Luna Lauren Velez", "0953882": "David Zayas", "0001664": "James Remar", "0829032": "Ray Stevenson", "2088803": "Yvonne Strahovski", "0305083": "Aimee Garcia", "0001263": "Jason Gedrick", "2316016": "Katia Winter", "2247732": "Christina Robinson", "2259079": "Preston Bailey", "4687585": "Evan George Kruntchev", "4687333": "Luke Andrew Kruntchev", "1327935": "Andrew Kirsanov", "0895666": "Francisco Viana", "2660484": "Dana L. Wilson", "0704163": "Rudy Quintanilla", "0106013": "Bart Braverman", "0992473": "David Fraioli", "0077411": "Ray Berrios", "1085051": "Santiago Cabrera", "1964360": "Israel Carbajal", "1433184": "Lee Christian", "0270591": "Fred Fein", "2222175": "Enver Gjokaj", "0391595": "Bruce Holman", "1059515": "Darryl D. Stewart"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["58"],  "plot": ["Dexter tries to keep Debra in the dark about his relationship with Hannah, but a surprise visit from Astor, Cody and Harrison throws a wrench into his plans. Fresh out of jail, Isaak renews his pursuit of Dexter.", "Dexter tries to keep Debra in the dark about his relationship with Hannah, but a surprise visit from Astor, Cody and Harrison throws a wrench into his plans. Fresh out of jail, Isaak renews his pursuit of Dexter while Quinn continues his power struggle with the Koshkas.—SHOWTIME", "Dexter refuses Debra's request to kill Hannah. Meanwhile, Isaak escapes his police surveillance and attempts to kill Dexter again, but fails. Astor and Cody come to visit Dexter. Batista buys a restaurant. Feeling he is out of control with trying to avenge Viktor's death, the Koshka Brotherhood puts a hit on Isaak. Also, LaGuerta finds a potential link between Dexter and the Bay Harbor Butcher. Elsewhere, Debra learns that Dexter and Hannah are seeing each other and, in conversation with him, reveals more than she wanted. Isaak reveals to Dexter that the reason why he is trying to kill Dexter for Viktor's murder is that Isaak and Viktor were lovers."], "genres": "N/A", "imdbID": "2235982", "rating": 8.8, "votes": 7105, "number_of_episodes": 96}