{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0953882": "David Zayas", "0305083": "Aimee Garcia", "0682762": "Geoff Pierson", "0001664": "James Remar", "2088803": "Yvonne Strahovski", "0001218": "Sean Patrick Flanery", "0682970": "Amy Pietz", "1426686": "Eric Ladin", "1889911": "Darri Ingolfsson", "4399402": "Jadon Wells", "0326928": "Marc Gomes", "0923560": "Suzanne Whang", "1723094": "Mercedes López Renard", "0122073": "Jernard Burks", "0139295": "Charles Carpenter", "3680560": "Skye P. Marshall", "2049050": "Jerry Ying", "1896018": "Brian Oblak", "2946235": "Alexandra Hoover", "2019598": "David Haley", "1943370": "Mary-Bonner Baker", "0678682": "Rachelle Pettinato", "3186208": "Sergio Garcia", "1648001": "David Keith Anderson", "1964360": "Israel Carbajal", "0270591": "Fred Fein", "10744214": "Margaret Rose Flores", "3782968": "Sylvester Foster", "0391595": "Bruce Holman", "6097831": "Lori Morkunas Jones", "1824496": "Darren P. Leis", "1586253": "Diane Modafferi", "5010439": "Mariya Ranieli", "2976895": "Annette Marie Westwood"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["56"],  "plot": ["Series finale. Dexter is faced with impossible odds as a brewing hurricane makes its way towards Miami.", "Debra is rushed to the hospital and Quinn goes with her. At the airport, Dexter, Hannah and Harrison manage to elude Elway, but they are forced to leave the airport due to the fake bomb scare that Dexter has rigged. Hannah and Harrison board a bus to the Jacksonville airport, but Elway is waiting for them. Hannah evades Elway and escapes with Harrison. Saxon goes to the hospital with the intention of killing Debra, but Dexter spots him and he is arrested by Angel. After successful surgery, Debra suffers a massive stroke from a blood clot, leaving her brain dead. Later, Dexter meets Saxon in his cell and provokes him to stab him with a pen. Dexter retaliates and kills him by puncturing his carotid artery with the pen. Angel and Quinn question Dexter about Saxon's killing and, although they suspect what really happened, conclude that Dexter acted in self-defense. Dexter returns to the hospital during the evacuation and takes Debra off life support. He takes her body out to sea and drops it into the water. Once her body is gone, Dexter drives his boat into the hurricane in an apparent suicide attempt. A few days later in Buenos Aires, Hannah reads of Dexter's death. However, Dexter is revealed to have faked his death, and is now living under an assumed identity, working for a lumber company in Oregon.", "At the airport Debra's former boss Jacob Elway is staking out the departure gate waiting to capture Hannah who is hiding in the bathroom. She calls Dexter who devises a plan that clears Elway from the immediate site but their departure plans are scuttled when the terminal is evacuated, so they remain trapped in Miami. Then Dexter receives a call from Deputy Chief Tom Matthews informing him that Debra is in the hospital being treated for the gunshot wound inflicted by Oliver Saxon in his kill-room in a derelict hospital. Until now, he was completely unaware of the events that took place after he left her. Later, when Saxon attempts to finish the kill of Debra at the hospital, Detective Joey Quinn and Lt Angel Batista arrest him and haul him off to jail. Meanwhile, Dexter, with intent to stand vigil by his sister, sends Hannah and his son Harrison ahead with plans to meet them in Argentina.—Harry Tumilson"], "genres": "N/A", "imdbID": "2578802", "rating": 4.8, "votes": 25982, "number_of_episodes": 96}