{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0953882": "David Zayas", "0305083": "Aimee Garcia", "0682762": "Geoff Pierson", "0001664": "James Remar", "2088803": "Yvonne Strahovski", "0001648": "Charlotte Rampling", "0001218": "Sean Patrick Flanery", "3862996": "Sam Underwood", "2267725": "Dora Madison", "1889911": "Darri Ingolfsson", "4399402": "Jadon Wells", "1648001": "David Keith Anderson", "5379368": "Austin Brook", "1964360": "Israel Carbajal", "0270591": "Fred Fein", "10744214": "Margaret Rose Flores", "3782968": "Sylvester Foster", "0391595": "Bruce Holman", "0502342": "Bethany Joy Lenz", "5921716": "Steve Price"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["52"],  "plot": ["Dexter tracks down Zach, concerned that he may have murdered an innocent person. Meanwhile, Dexter tries to help Hannah escape the country.", "Dexter receives instructions to attend the latest murder scene that just happens to be in his apartment building. Upon arrival he sees that the victim is Cassie Jollenston, his pretty next-door neighbor and good friend of his nanny Jamie Batista, Lieutenant Angel Batista's sister. When examining the body, he notes that the cause of death was bludgeoning in a fashion similar to Norma Rivera's demise which he already knew to be the work of Zack Hamilton. Additionally, he finds and takes a sample of blood from under one of Cassie's fingernails. Jamie convinces her lover, Detective Joey Quinn, to stay with her because she is frightened, thus delaying him from going on a hunt for Zack who he also suspects. Dexter again meets with Hannah McKay at the marina and agrees to acquire documents and credit cards to facilitate her escape from the country. In the meantime, Debra Morgan is on the hunt for Hannah, determined to halt her interference once and for all. Niki Walters has started to work in the police lab for her pseudo-father Vince Masuka. Dex later determines that it is, in fact, Zack's blood found on Cassie. He approaches Doctor Evelyn Vogel with this information and states emphatically that, this being the murder of a second innocent woman, Zack, who has disappeared, is not adapting to the 'code' and therefor must be eliminated.—Harry Tumilson"], "genres": "N/A", "imdbID": "2578778", "rating": 7.9, "votes": 6455, "number_of_episodes": 96}