{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0953882": "David Zayas", "0305083": "Aimee Garcia", "0682762": "Geoff Pierson", "0001664": "James Remar", "0001648": "Charlotte Rampling", "0001218": "Sean Patrick Flanery", "1711052": "Rhys Coiro", "4399402": "Jadon Wells", "2660484": "Dana L. Wilson", "0327063": "Nick Gomez", "0041895": "Nadège August", "0160581": "Jennifer Christopher", "1962736": "Lewis T. Powell", "0077411": "Ray Berrios", "1964360": "Israel Carbajal", "0270591": "Fred Fein", "3782968": "Sylvester Foster", "0313368": "Britt George", "0391595": "Bruce Holman", "1059515": "Darryl D. Stewart", "3597334": "Victoria Vertuga"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["53"],  "plot": ["Season 8 premiere. Six months after LaGuerta's death, Dexter is still managing life as a dad, brother and serial killer. Meanwhile, Miami Metro investigates the murder of a man who's had pieces of his brain removed.", "It's been 6 months since LaGuerta's murder - and Dexter is still managing life as a dad, brother, and serial killer. Debra now works as a PI for a private firm and Batista has replaced her as Lieutenant. Meanwhile, Miami Metro investigates the murder of a man who has had pieces of his brain removed.", "Six months after killing LaGuerta, a shattered and guilt-ridden Debra has quit her job at Miami Metro and joined a private investigation company, run by Jacob Elway (Sean Patrick Flannery). In her absence, Batista has returned from retirement and become Lieutenant. Miami Metro investigates a new serial killer, the \"Brain Surgeon\", who takes melon ball size scoops of brain tissue from his victims. The MMPD receives help from psychopath expert Evelyn Vogel (Charlotte Rampling), who also appears to have a keen interest in Dexter. Deb abuses prescription Rx and even cocaine while working undercover to bring in Andrew Briggs (Rhys Coiro), who has stolen jewels from the mob. Dexter warns Debra that Briggs is being targeted by El Sapo, a mob hitman, but inadvertently kills Briggs himself. Quinn and Jamie have begun a relationship, which Quinn wants to keep secret from Batista. Vogel confronts Dexter with murderous drawings from his childhood, and reveals that she knows about Harry's Code."], "genres": "N/A", "imdbID": "2577702", "rating": 8.4, "votes": 8279, "number_of_episodes": 96}