{"cast": {"0355910": "Michael C. Hall", "1358539": "Jennifer Carpenter", "0004993": "Desmond Harrington", "0496934": "C.S. Lee", "0953882": "David Zayas", "0305083": "Aimee Garcia", "0682762": "Geoff Pierson", "0001664": "James Remar", "0001648": "Charlotte Rampling", "0001218": "Sean Patrick Flanery", "0850335": "Barbara Tarbuck", "2660484": "Dana L. Wilson", "0327063": "Nick Gomez", "1445952": "Scott Michael Morgan", "1877906": "Dave Chittick", "1853521": "Monica Sanchez", "0077411": "Ray Berrios", "1964360": "Israel Carbajal", "0270591": "Fred Fein", "10744214": "Margaret Rose Flores", "0391595": "Bruce Holman", "1059515": "Darryl D. Stewart"}, "geners": ["Crime", "Drama", "Mystery", "Thriller"], "runtimes": ["57"],  "plot": ["Miami Metro continues their hunt for the Brain Surgeon, while Dr. Vogel enlists Dexter's help. While on a case, Debra has to take matters into her own hands.", "Vogel reveals to Dexter that she helped Harry create his Code, harboring a perverse interest and admiration for psychopaths. She asks Dexter to track down the Brain Surgeon, whom she believes to be one of her former patients and a grave hazard to her life. While tracking down the stolen jewels, Debra is beaten by El Sapo, but later murders him; Dexter finds traces of her blood at the crime scene, but hides it from the police. Quinn and Jamie argue over Quinn's future and Batista's involvement in their relationship. Dexter tracks down one of Vogel's patients, Lyle Sussman, who he believes is the Brain Surgeon, but discovers he has been murdered. Vogel and Dexter find a DVD from the Brain Surgeon, showing the killer forcing Sussman at gunpoint to do his bidding. Dexter agrees to track down the killer from Vogel's list of suspects.", "Miami Metro continues their hunt for the Brain Surgeon, while Dr. Vogel enlists Dexter to do her bidding based on her own personal experience with her previous patients. Debra continues to track down her PI case and has to take matters into her own hands."], "genres": "N/A", "imdbID": "2578758", "rating": 7.9, "votes": 6260, "number_of_episodes": 96}