{"cast": {"1056659": "John Oliver", "0443286": "David Kaye", "3968866": "Stephanie Abrams", "11402214": "Bruce Aylward", "1693231": "Yang Bo", "1101507": "Jim Cantore", "1401753": "Jennifer Carfagno", "11755356": "John Catanzara", "1078479": "John Cena", "0179479": "James Corden", "10375870": "Mark Elliot", "1711162": "Joe Kernen", "13061017": "Robert Lamay", "11675667": "Freddy Lim", "13061043": "Kharis Templeman", "11465166": "Yvonne Tong", "8898385": "Ing-wen Tsai"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": 0,  "plot": ["John Oliver discusses Taiwan's history of being governed by other countries, its fraught present-day relationship with China, and what its citizens would like their future to look like.", "This week John Oliver takes a look at Taiwan and its fraught relationship with China. Military tension between China and Taiwan are soaring as China's air-force regularly sends an increasing number of warplanes into the Taiwan Air defense zone. The Chinese government considers Taiwan an integral part of China and condemns any statement made referring to Taiwan as an independent country. Taiwan transitioned from a dictatorship to a vibrant democracy and is now the key manufacturer of computer chips which has made it into a developed and wealthy country. But due to stiff Chinese opposition, most countries and international organizations like the WHO, the IOC etc. either don't recognize it or prefer to keep Taiwan's status ambiguous. While China's warmongering has forced Taiwan to buy arms from the U.S. to bolster its defenses, polls show that a vast majority of Taiwanese want to preserve the status quo which John argues seems to be the best option at the moment. John also talks about the vaccine hesitancy shown by some police officers in the in some cities in the U.S. and how it is harming them and the people they are supposed to protect and serve.—cmpunk"], "genres": "N/A", "imdbID": "15654200", "rating": 7.9, "votes": 235, "number_of_episodes": 384}