{"cast": {"1056659": "John Oliver", "0443286": "David Kaye", "13102693": "Janelle Burrell", "1679606": "Jenna Bush Hager", "4187259": "Jim Donovan", "13091145": "Edward Durr", "13102680": "Patricia Hoffman", "13102679": "Bill Johnson", "11094709": "Bill Johnson", "13102662": "Marc Noel", "3252194": "Michael Ramsey", "13102661": "Brian Terhorst", "13102663": "Terry Weickum"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": 0,  "plot": ["John Oliver discusses the current state of the nation's power grid, why it needs fixing, and, of course, how fun balloons are.", "This week John Oliver talks about the current state of the power grid in the U.S. The U.S. grid which is made up of the Eastern, the western and the Texas interconnections was considered to be the supreme engineering achievement of the 20th century. However it has been going down more frequently in recent years mainly due to old age and climate change. Extreme weather like hurricanes, tornadoes and extreme temperature coupled combined with aging electrical infrastructure has been disastrous for the power grid making it ill-equipped to deal with the present needs. However things could get a lot worse in the future because combating climate change will require 40-60% increase in peak electricity consumption which could push the power grid to its limit. However upgrading the power grid is a massive undertaking since it will require new renewable power plants to be made away from population centers and new transmission lines to transport that power. Stringing power lines across the U.S. is a logistical nightmare since it requires approvals from multiple state and federal agencies along with buy-ins from landowners whose land is to be used. People do not want such transmission lines on their land due to multiple reasons which have been effective in killing transmission line projects or delaying it by a decade or longer which makes it harder to bring renewable energy plants online. Also these projects are very expensive and there has been opposition to investing the money that is needed to execute these projects. John argues that fair compensation for land-use and placing transmission lines on land already disturbed lands like along rail-roads, pipelines and highways could alleviate this problem. John also talks about the Democratic defeats in the recent elections and the pledges made by world leaders in the COP26 summit which are insufficient to tackle climate change.—cmpunk"], "genres": "N/A", "imdbID": "15816664", "rating": 7.7, "votes": 222, "number_of_episodes": 384}