{"cast": {"1056659": "John Oliver", "12870395": "Jim Adler", "0071304": "H. Jon Benjamin", "0081182": "Joe Biden", "1654586": "Antony Blinken", "3060501": "Margaret Brennan", "0124133": "George W. Bush", "1227121": "Tucker Carlson", "0299924": "Sasson Gabay", "3820938": "Tamron Hall", "1635032": "Laura Ingraham", "0443286": "David Kaye", "0454730": "Gayle King", "2915874": "Carolyn Maloney", "1193239": "Andrea Mitchell", "1682433": "Barack Obama", "6112029": "Mike Pompeo", "12848206": "Mahbouba Seraj", "12870396": "Mike Slocumb", "11745321": "John F. Sopko", "9365244": "Jake Sullivan", "2325620": "Chuck Todd", "0874339": "Donald Trump", "3212916": "Mark Zuckerberg"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": ["33"],  "plot": ["John Oliver discusses the end of America's war with Afghanistan and the humanitarian crisis being left behind.", "This week John Oliver explains the reasons behind the U.S. withdrawal from Afghanistan and its role in the ongoing humanitarian crisis there. America's war in Afghanistan is coming to a close after 20 years of fighting and it has joined a long line of countries who came to Afghanistan to serve their own interest only to leave defeated. While the primary reason for invading Afghanistan was the 9/11 attack, the U.S. mission was changed to nation building and human rights. But instead of engaging with and understanding the country's complex local politics, the U.S. paid off and co-opted local warlords and drug traffickers which eroded trust between the Afghan people and the corrupt Afghan government. The U.S. came and built projects and institutions on the American model, wholly dependent on American support, with the funds going to American military contractors and put no effort to make them sustainable after the U.S. left. While staying indefinitely was also not an option since the Taliban had been escalating violence, the focus of U.S. withdrawal from Afghanistan was solely based in American interests and not about the well-being of the Afghan people. John argues that the U.S. has an obligation to provide refuge to vulnerable Afghans before it leaves Afghanistan and that America should stop trying to solve the world's problems by imposing its will on other countries.—cmpunk"], "genres": "N/A", "imdbID": "15239898", "rating": 8.1, "votes": 253, "number_of_episodes": 384}