{"cast": {"0071304": "H. Jon Benjamin", "12645783": "Joseph Blount Jr.", "11692334": "Madison Cawthorn", "6262763": "Ron DeSantis", "7990363": "Faiven Feshazion", "1096881": "Newt Gingrich", "12850774": "Chris Hoffman", "0443286": "David Kaye", "4270842": "Pete Nelson", "12565429": "Anne Neuberger", "1056659": "John Oliver", "10310470": "Tom Pace", "6138788": "Theresa Payton", "1739997": "Scott Pelley", "1059277": "Connor Ratliff", "12850775": "Caleb Schoth", "0799777": "J.K. Simmons", "9942724": "Inna Simone"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": 0,  "plot": ["John Oliver discusses ransomware attacks, why they're on the rise, and what can be done about them.", "This week John Oliver talks about ransomware attacks which are instances where hackers get into a computer, lock up the data and force the owners to pay a ransom in order to unlock it. Ransomware attacks have caused chaos in cities, schools, police departments, hospitals etc. and hackers using them have released private medical records, personal records, un-aired TV shows and movies as well as compromise 'smart' home appliances. With the costs of ransomware getting higher while the barrier to deploy them going down, its not just companies and governments who are getting affected but individuals as well. John explains that the explosion in ransomware has been because of 3 reasons - 'ransomware as a service' where hackers develop ransomware programs and sell them to anyone who might want to launch an attack, the rise of cryptocurrencies and countries who provide safe havens for cyber-criminals. While the U.S. government has taken steps like setting up a cybersecurity task force and budgeting $1 billion to improve cybersecurity for local governments, John argues that the only way to prevent such attacks is by taking precautions like setting up multi-factor authentication, keeping computers up to date and not click on suspicious links. John also talks about the fiery debates in school board meetings about children returning to schools while the COVID-19 pandemic rages on.—cmpunk"], "genres": "N/A", "imdbID": "15197426", "rating": 7.7, "votes": 231, "number_of_episodes": 384}