{"cast": {"1056659": "John Oliver", "1705625": "Marina Franklin", "3983364": "Moujan Zolfaghari", "7100086": "Zach Cherry", "1211274": "Ben Hauck", "1822045": "Alberto Bonilla", "0868283": "Michael Torpey", "0534115": "Noel MacNeal", "8054799": "Cardi B", "1580911": "Brian Baumgartner", "0000123": "George Clooney", "0177639": "Jennifer Coolidge", "0002071": "Will Ferrell", "0428656": "Leslie Jones", "0750412": "RuPaul", "0071304": "H. Jon Benjamin", "0443286": "David Kaye", "1757263": "Jeff Bezos", "0233137": "Steve Doocy", "3602115": "Ainsley Earhardt", "10930914": "Cynthia Harper", "13124321": "Catherine Highsmith", "13124307": "Betty Jones", "0453258": "Brian Kilmeade", "0454730": "Gayle King", "13124322": "Miko Penn", "12248247": "Jenna Ryan", "0809952": "Shepard Smith"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": ["40"],  "plot": ["John Oliver discusses the mechanics of union busting, why the companies who do it face so few consequences, and what it really means when your manager wants to talk to you about \"your attendance.\"", "This week John Oliver takes a look at the practice of Union busting i.e. preventing the formation of a union. Since 1980s union membership has declined considerably. Americans are living in one of the worst times for organized labor in U.S. history even though nearly half of the American workforce would like to be in a union. To prevent a union from getting registered, companies tell their managers to be on the lookout for potential signs of organizing. Once workers start organizing to form a union, companies hire union busting firms who engage in practices like inundating workers with anti-union signs and messages, having mandatory meetings designed to spread fear about the unions and its dues, promoting lies about union changing the work ethic/culture of the company and threaten to close down the workplace if unions are formed. Companies also target employees who try to unionize by making their jobs harder or fire them since the consequences of doing that are next to nothing. To save unions, John says that the U.S. congress could pass the P.R.O. act and till then workers shouldn't get disheartened or afraid of these union busting tactics by companies. John also talks about the Jan. 6 insurrection, some of the rioters who have escaped or are going to prison and politicians who instigated the violence.—cmpunk"], "genres": "N/A", "imdbID": "15891374", "rating": 8.0, "votes": 226, "number_of_episodes": 384}