{"cast": {"1056659": "John Oliver", "0000123": "George Clooney", "0443286": "David Kaye", "0004723": "Tyra Banks", "1281412": "Big Budah", "12881897": "Adam Cartwright", "13081340": "Marcia Collard", "0220535": "Chris DeRose", "13081363": "General Dogon", "0001293": "Seth Green", "3135094": "Joe Manchin III", "13081339": "Frank Murphy", "0005314": "Drew Pinsky", "1797713": "Mitt Romney", "13081364": "Keanakay Scott", "13081341": "James Tully", "13081338": "Justin Young", "3212916": "Mark Zuckerberg"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": 0,  "plot": ["With homelessness increasing nationwide, John Oliver takes a look at the way we discuss the unhoused, what policy failures are making the problem worse, and how we can help.", "This week John Oliver discusses the problem of homelessness in the U.S. which has been exacerbated by the COVID pandemic. Even before the pandemic struck, homeless people were increasing due to public policies like funding cuts to poverty alleviation programs and housing subsidies along with lack of affordable housing. To make matters worse, stories focusing on homelessness demonize the homeless and are presented solely through a lens of how it affects those who have homes. These media portrayals have led to public policy choices like hauling away portable public toilets at night and criminalizing behavior associated with being homeless like bans on camping, loitering and living in vehicles. Homeless shelters are overwhelmed and the homeless don't prefer to stay there as the shelters are only a place to sleep and not one for staying. John argues that the best solution to the homelessness problem is to provide affordable housing but opposition from local residents a.k.a NIMBYs (Not In My BackYard) have not allowed such projects to start and these residents need to get over their perception of the homeless being mentally ill or drug addicted criminals who have chosen this life for themselves. John also talks about the cuts to the Build Back Better plan as a compromise is reached by the Democrats on how much money can be spent and who can be taxed to fund this plan.—cmpunk"], "genres": "N/A", "imdbID": "15759880", "rating": 7.8, "votes": 215, "number_of_episodes": 384}