{"cast": {"1056659": "John Oliver", "2860410": "Mustafa Haidari", "0000123": "George Clooney", "1463454": "Kermit the Frog", "0900934": "Matt Vogel", "12809958": "Kelly Vogel", "0071304": "H. Jon Benjamin", "0443286": "David Kaye", "3547892": "Jason A. Messina", "0081182": "Joe Biden", "12809951": "Adam Bliden", "1977586": "Jim Cramer", "1962779": "Bill de Blasio", "5420093": "Robert Glatter", "12809953": "Erick Hartse", "12809952": "Dan Johnson", "6269733": "Jim Jordan", "12809956": "Dennis Malysheve", "12809957": "Melissa Palomino", "3948647": "Rand Paul", "7342915": "Marc Santia", "12809955": "Chandra Steele", "12809954": "Luke Sypherd", "4138284": "Lynn Tilton"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": 0,  "plot": ["John Oliver explains how emergency medical services function in the U.S., why they can be so expensive, and what we can do to fix things.", "This week John Oliver discusses the major issues hampering Emergency Medical Services (EMS) in the U.S. EMS operate ambulances and provide support to people facing medical emergencies. However, they're prohibitively expensive. According to John, there are several reasons for EMS being expensive. EMS is not considered to be an essential service in most states in the U.S. and there is no dedicated federal agency overseeing and supporting EMS. This makes it easier for state and federal governments to cut funding for EMS which makes them underfunded. Funding deficiencies cause EMTs and other EMS workers to be poorly paid which makes it difficult to retain good workers/volunteers and also cause shortage of ambulances and longer response time for ambulances. This situation is made worse by private-equity firms which buy financially distressed EMSs and strip their value for higher profits. They also engage in practices of surprise billing and transporting a patient to the hospital even if unnecessary. Also, EMSs are not required to accept private medical insurance which makes it harder for patients to pay their bills. Additionally, there is no consistency or uniformity in the services provided by EMS or how they are run in various parts of the U.S. John also talks about the plight of Afghan translators who are left behind after the pull-out of U.S. forces from the region.—cmpunk"], "genres": "N/A", "imdbID": "15114280", "rating": 7.8, "votes": 228, "number_of_episodes": 384}