{"cast": {"1056659": "John Oliver", "2175486": "Ryan Barger", "10036921": "Jessica Anderson", "0066877": "Joy Behar", "0081182": "Joe Biden", "12969667": "Reginald Bolding", "12972601": "Melissa Gaona", "12972818": "Travis Grantham", "3870424": "Sara Haines", "12030094": "Chris Hollins", "2641639": "Sunny Hostin", "12972745": "Burt Jones", "0443286": "David Kaye", "10010758": "Brian Kemp", "12972603": "Dina Kupfer", "7893907": "Rob McBroom", "10389717": "Marcel McClinton", "5366561": "Ana Navarro", "7486138": "Dan Patrick", "12972746": "Dade Phelan", "12972600": "Alan Powell", "6754660": "Jen Psaki", "12972599": "Matt Schaefer", "12972602": "Logan Sherrill", "1946567": "Stephen A. Smith", "12972819": "Tim Taylor"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": ["41"],  "plot": ["John Oliver discusses the current attacks on voting rights, who's behind them, and what we can do about it.", "This week John Oliver talks about the latest attack on voting rights in the U.S. 18 states in the U.S. have passed laws restricting voter access. Proponents of the laws say that they're not meant to restrict citizens from voting but to prevent voter fraud. However, even though instances of voter fraud in the U.S. are rare, these laws/bills make it harder to vote for some people, mainly people of color. Measures like 24 hour and drive through voting which made it easier for people to vote in urban counties have been prohibited under these new laws. These laws also put barriers to voting by mail and put harsher voter ID requirements that target people of color. The passing of these laws has been a concerted and organized effort over many years supported by well funded groups like the Heritage Foundation who have routinely helped Republican politicians to draft and pass these laws. But now these laws can become more effective because of a couple of U.S. supreme court rulings that undermined the voting rights act of 1965. The only way now these discriminatory laws can be challenged is by showing them to be racially motivated which is why the proponents of these laws don't want to discuss the racial impact of these laws. To fight these laws John suggests that the filibuster in the U.S. Senate should be ended to support proposed legislation in the U.S. Congress like the John Lewis voting rights advancement act and the Freedom to vote act. John also talks about the migrant crisis and the questionable tactics used by the U.S. government in dealing with asylum seekers at Del Rio near the Texas border with Mexico. He also presents his entries to the Duck Stamp competition.—cmpunk"], "genres": "N/A", "imdbID": "15415974", "rating": 7.7, "votes": 244, "number_of_episodes": 384}