{"cast": {"1056659": "John Oliver", "2175486": "Ryan Barger", "11040374": "Susan Evans", "0443286": "David Kaye", "3987185": "Dave Aronberg", "0004847": "Walter Cronkite", "13440990": "Christi DeCoufle", "11696745": "David DiPietro", "1468084": "Yuriy Filatov", "0392473": "Lester Holt", "11304455": "Pye Jakobsson", "13441007": "Andrew Lewis", "13296495": "Madam Mary", "11925314": "Sergey Naryshkin", "1682433": "Barack Obama", "1269884": "Vladimir Putin", "12092549": "Rebel Rae", "13440989": "Patricia Spencer", "13440988": "Jared Trujillo", "1829292": "Wendy Williams"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": ["40"],  "plot": ["As long as sex work has existed, so have efforts to end it. John Oliver explains why criminalizing the trade hasn't helped the most vulnerable people involved, and why we should start listening to sex workers.", "This week John discusses the unfair laws and policies that target sex work which is the exchange of sex for money or goods. Sex work is illegal everywhere in the US except Nevada even though porn is legal. People talk about sex work in demonizing, patronizing or incorrect ways on moral grounds or its association with crime or on the belief that sex work is inherently exploitative even though it is the current system of criminalizing sex work which makes life harder for the most vulnerable people involved. Sex work is a job but lawmakers are uncomfortable treating it like any other job because they argue that most sex workers are victims and need help. The police, who also make this argument, position themselves as saviors of sex workers while actively arresting and charging them due to which sex workers do not trust the police. Discriminatory laws and policies have made sex work unsafe for sex workers and limit job opportunities for sex workers who want to leave the trade. Additionally, crackdown on sex trafficking is routinely conflated with consensual sex work under the assumption people don't enter this field by choice which is incorrect. Prosecuting consensual sex work takes away time and resources from cracking down on actual trafficking. John mentions various ways in which other countries have dealt with the problem viz. criminalizing buying of sex and not sex workers, legalizing and regulating sex work in specific areas and decriminalization which he argues it the right direction which laws and policies should take in consultation with sex workers. John acknowledges that some sex workers are economically forced in sex work but argues that current laws don't address this issue. John also talks about the unjustified Russian invasion of Ukraine and how Ukrainians are defiantly fighting to keep their independence.—cmpunk"], "genres": "N/A", "imdbID": "18290964", "rating": 7.9, "votes": 294, "number_of_episodes": 384}