{"cast": {"1056659": "John Oliver", "0443286": "David Kaye", "13645488": "Louise Araneta", "6134938": "Walden Bello", "13645452": "Thomas J. Dillon", "5937196": "Rodrigo Duterte", "0266566": "Jerry Falwell", "2036014": "Ferdinand Marcos Jr.", "1682433": "Barack Obama", "13419102": "Lauren Phinney", "8075234": "Leni Robredo", "11688865": "May Rodriguez", "13645492": "Brandon Roux", "6577763": "Paul Rudy", "7881757": "Marva Sadler", "1528459": "Chuck Schumer"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": ["42"],  "plot": ["John Oliver discusses the Philippine presidential election, why Bongbong Marcos is - albeit in a very unflattering way - like Ant-Man, the leaked anti-abortion draft opinion, how we got to this point, and where we may be headed.", "This week John Oliver discusses two issues which are dominating the headlines viz. The U.S. Supreme court draft opinion on abortion and The Philippine Elections. John begins by taking apart Justice Alito's arguments for banning abortion and then explains the catastrophic consequences of overturning the Roe v. Wade ruling which includes a total abortion ban in 22 states. John points out that the present situation has resulted from years of apathy and reluctance of the Democratic party to codify the abortion ruling into law in addition to intense lobbying by the anti-abortion movement led by evangelical christian leaders. He says that the only way out of this is staying put for the long struggle to regain our hard-won rights and holding elected officials accountable. John also discusses the candidates running in the Philippine presidential elections particularly the leading candidate Ferdinand 'Bongbong' Marcos Jr., the son of the previous Philippine dictator, supported by the outgoing president Duterte's daughter, Sara. Bongbong's father, whom he holds in high esteem, reportedly stole billions of dollars from the Philippine people and escaped to Hawaii after he was deposed. But with the country's history, during Bongbong's father's martial law, being rewritten in school's textbooks and social media and his rival, Leni Robredo, falsely accused of being a communist rebel and having murdered her husband, Bongbong has surged in the polls. John appeals to the Filipino voters to remember the looting and past atrocities done by Bongbong's father and vote to keep that family out of power.—cmpunk"], "genres": "N/A", "imdbID": "19899438", "rating": 8.0, "votes": 232, "number_of_episodes": 384}