{"cast": {"1056659": "John Oliver", "6869605": "Soomin Chun", "8138632": "Yun J.", "4168755": "Daniel K. Isaac", "7775724": "Collin Lim", "7221384": "Yeena Sung", "0443286": "David Kaye", "1832175": "Bret Baier", "0066669": "Paul Begala", "1463161": "Lou Dobbs", "0309705": "Larry Gatlin", "1620625": "Jehmu Greene", "0392473": "Lester Holt", "6815311": "Peter Hotez", "2100301": "Sheila Jackson Lee", "13690164": "Susan Kezios", "8822941": "Doug Mastriano", "1114695": "Phil McGraw", "13690165": "Keith Miller", "1528459": "Chuck Schumer"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": 0,  "plot": ["John Oliver discusses one of the largest franchises in the U.S., how their business model doesn't always serve franchisees, and what it all has to do with Korean dramas.", "This week John Oliver talks about the restaurant chain Subway, its history, how it operates and why its franchisees are afraid. Subway, which is the biggest restaurant chain in the U.S. and previously had the most number of locations worldwide, has been in the news for all the wrong reasons from bread sizes being smaller than advertised and putting wrong ingredients in sandwiches to being promoted by a pedophile like Jared Fogle. Started by Fred DeLuca, Subway initially focused on expansion even though it didn't turn a profit for 15 years. Though entry fees are low compared to other restaurant chains, Subway franchisees have to give more to the parent company as a percentage of gross sales and have to compete with other Subway restaurants in the same location. Additionally, Subway's business development agents, who are responsible for inspection, regularly pull up franchisees for frivolous causes forcing them to close handing over the franchise to the agents. Subway also engages in unethical practices like not disclosing financial performance of a restaurant before its sale to a franchisee and prohibiting franchisees from talking to the media about Subway. John also talks about the results of primary races for the mid-term election this November.—cmpunk"], "genres": "N/A", "imdbID": "20243762", "rating": 8.2, "votes": 284, "number_of_episodes": 384}