{"cast": {"1056659": "John Oliver", "8457996": "Ali Barthwell", "0443286": "David Kaye", "1227121": "Tucker Carlson", "6132822": "Joe Concha", "5664101": "Tom Cotton", "1548660": "Kimberle Crenshaw", "5563034": "Ted Cruz", "6262763": "Ron DeSantis", "0233137": "Steve Doocy", "13419739": "Martha Haakmat", "2255157": "Victor Davis Hanson", "13419740": "Vicki Hartzler", "13208771": "Matthew Hawn", "1670172": "Brit Hume", "13419769": "Laura Hussey", "0455052": "Martin Luther King", "12823675": "Patrick King", "7684212": "Mark Meadows", "12703883": "Patti Menders", "13419770": "John Ragan", "3309155": "Christopher Rufo", "11648224": "Marjorie Taylor Greene", "8390554": "Lara Trump", "4757938": "Alex Wagner", "13419768": "Jared Willets", "9277591": "Glenn Youngkin"}, "geners": ["Comedy", "News", "Talk-Show"], "runtimes": ["34"],  "plot": ["John Oliver explains what critical race theory is, what it isn't, and why we can expect to hear more about it in the coming months.", "LWT returns for a new season with John talking about critical race theory (CRT), the manufactured panic around it and the protests against it in school board meetings across the U.S. CRT attempts to understand why racism and inequality persisted after the civil rights movement with the underlying idea being that racism is not just the product of individual prejudice but is also something that is embedded in legal systems and policies. Though CRT is not taught in schools, critics argue that the ideas behind it are being taught in schools. By selectively picking out the worst examples from books, classroom lessons and teacher training manuals, anti-CRT activists have managed to create a panic among the American public regarding any conversation about race that one doesn't want to have. This manufactured fear has caused many states to restrict teaching about race and is likely to promote 'school choice', which conservative activists have been pushing since U.S. Supreme court decision of Brown vs. Board of Education. John argues that though the debate on CRT is dumb, it is important to engage with it to have honest discussions about race in public schools in the U.S. John also talks about the truckers' protest in Ottawa, Canada against vaccine mandates and COVID restrictions.—cmpunk"], "genres": "N/A", "imdbID": "16081888", "rating": 7.6, "votes": 357, "number_of_episodes": 384}