{"cast": {"2156099": "Vicki Gunvalson", "2161630": "Jo De La Rosa", "2111745": "Lauri Waring Peterson", "0866460": "Jeana Keough", "5837533": "Kimberly Bryant", "4330445": "Grayson Arroyo-Smiley", "11962272": "Bianca Bryant", "1667552": "Scott Bryant", "11962271": "Travis Bryant", "11962273": "Lisa Bussenger", "2601235": "Briana Culberson", "3719174": "Donn Gunvalson", "2607078": "Colton Keough", "0449088": "Kara Keough", "1883054": "Matt Keough", "2228043": "Shane Keough", "11962789": "Lorelei Mariano", "1725450": "Gavin Smiley", "2294346": "Slade Smiley", "11193761": "William Steinmetz", "2599385": "Josh Waring", "2599335": "Sophie Waring", "2602666": "Michael Wolfsmith", "11213069": "Michael J. Wolfsmith", "2599315": "Ashley Zarlin"}, "geners": ["Reality-TV"], "runtimes": ["46"],  "plot": ["In the first episode of 'The Real Housewives of Orange County,' Jeana's son Shane faces the stress of high school graduation and the baseball draft, where he feels pressure to become the third-generation Keough to play pro baseball. Shane's sister Kara feels the sting of sibling rivalry, and things get ugly when she demands a new car. Meanwhile, Kimberly discusses her breast implants a gift for her husband's 40th birthday ' and takes her daughter, Bianca, for professional make-up for a junior high dance. She then decides it's time to enjoy afternoon cocktails with friends and meets Jo in a chance encounter. Twenty-four-year-old Jo struggles with her new life as the fiancée of a wealthy thirty-something man. Jo and her fiancée, Slade, argue over her desire to continue partying. Jo ventures out and meets Kimberly, her first gated housewife friend. Vicki spares no expense to celebrate her daughter Briana's prom and graduation party but dreads her ex-husband's arrival for the festivities. Lauri deals with the aftermath of her divorce and lower-status life outside the gates. Things get even more complicated when her adult daughter comes home for a surprise visit.—Anon"], "genres": "N/A", "imdbID": "1028886", "rating": 5.4, "votes": 44, "number_of_episodes": 351}