{"cast": {"2111745": "Lauri Waring Peterson", "0866460": "Jeana Keough", "2161630": "Jo De La Rosa", "2156099": "Vicki Gunvalson", "2606890": "Tammy Knickerbocker", "2601235": "Briana Culberson", "2384311": "Bob Cutarella", "11193758": "Duff Evans", "0334692": "Tiffany Granath", "3719174": "Donn Gunvalson", "11965535": "J.J. Kao", "0449088": "Kara Keough", "1883054": "Matt Keough", "2606093": "Lindsey Knickerbocker", "11965847": "Louis Knickerbocker", "2607725": "Megan Knickerbocker", "11970717": "Inger Martens", "2294346": "Slade Smiley", "2599335": "Sophie Waring", "2602666": "Michael Wolfsmith", "11213069": "Michael J. Wolfsmith", "1091740": "Won-G", "2599315": "Ashley Zarlin"}, "geners": ["Reality-TV"], "runtimes": ["46"],  "plot": ["Jo drops a bomb on Slade. Is she ready for the consequences? Lauri discovers that daughter Ashley has trashed her townhouse and seeks advice from George on how to handle it. Jeana's kids prepare to go back to school by purchasing hundreds of dollars worth of clothes on Jeana's credit card. Meanwhile, Tammy takes a leap into the single world by going on a date. Vicki and Donn seek an astrologer's help for their marriage.—Anonymous", "Jo drops a bomb on Slade. Is she ready for the consequences' Lauri discovers that her daughter, Ashley, has trashed her townhouse and is furious at herself for letting her stay there rent-free. Unable to confront her daughter, she seeks advice from George. Colton and Kara prepare to go back to school'by purchasing hundreds of dollars worth of clothes on their mother's credit card. The Keough family dogs are out of control once again, so Jeana hires a dog trainer to tame her wild beasts. Her thought is if she can't control the kids, she can at least try to control the animals. Meanwhile, Matt offers nothing but resistance and Jeana continues to struggle in her marriage. Tammy struggles with her ex-boyfriend about parenting their son, Ryley. Tammy also takes a giant leap into the singles world by going on a date. Vicki and Donn are having issues at home. As Vicki's energy begins to drain Donn, she seeks the help of an astrologer to figure out why she acts the way she does. The other ladies join the party and are amazed at how accurate the astrologer's readings are. The advice they get is surprisingly in tune with each housewife's unique life predicament."], "genres": "N/A", "imdbID": "1053676", "rating": 6.6, "votes": 15, "number_of_episodes": 351}