{"cast": {"0437454": "Tom Kane", "0444786": "Tom Kenny", "0152839": "Tara Strong", "0146681": "Cathy Cavadini", "0197354": "Elizabeth Daily", "0552502": "Jennifer Martin", "0413996": "Roger Jackson", "0071818": "Jeff Bennett", "0191906": "Jim Cummings", "0354937": "Jennifer Hale"}, "geners": ["Animation", "Action", "Adventure", "Comedy", "Family", "Fantasy", "Sci-Fi"], "runtimes": ["23"],  "plot": ["\"Telephonies\" The Gangreen Gang gets hold of the Powerpuff Girls Hotline and makes crank calls, sending the Girls on a wild goose chase trying to protect the town.", "Telephonies: The Gang Green Gang starts making a series of prank phone calls and they send the Powerpuff Girls on a wild goose chase, when they assume Mojo Jojo, HIM, and Fuzzy Lumpkins are doing villainy but they are actually taking some time off. When the three villains learn about the Gang Green Gang's actions, they take matters into their own hands and they fight the criminals. The Mayor tries to call the girls for help after he sees the villains fighting in his office, but the girls think it's a prank and they go back to sleep. When the Powerpuff Hotline rings again, Buttercup destroys the phone with her laser eyes. Tough Love: The Powerpuff Girls have become incredibly well-liked by their fellow citizens and their loved ones, but HIM becomes jealous over the girls' popularity, and he enacts a diabolical scheme to get everyone to hate the girls. When the Powerpuff Girls try to help out their loved ones, they get attacked by the citizens and they learn that HIM is responsible for brainwashing their loved ones into hating them. The girls fight off their loved ones by knocking them out one by one and the girls warn HIM not to manipulate their loved ones again, causing the villain to admit defeat. At the hospital, the girls apologize to everyone for hurting them and they admit that HIM was responsible for brainwashing them, but the citizens forgive the girls for what happened."], "genres": "N/A", "imdbID": "1005609", "rating": 7.8, "votes": 276, "number_of_episodes": 79}