{"cast": {"3199307": "Ruby Rose", "0803896": "Rachel Skarsten", "3437115": "Meagan Tandy", "9169007": "Nicole Kang", "5531487": "Camrus Johnson", "1717882": "Elizabeth Anweis", "0779084": "Dougray Scott", "1625795": "Greyston Holt", "3512614": "Brendon Zub", "11039171": "Gray Horse Rider", "1882629": "Rachel Maddow", "1528483": "Chris Shields", "1160671": "Sandy Robson", "5117549": "Gracyn Shinyei", "8384209": "Ava Joy", "1382242": "Michelle Morgan", "4954077": "Jihan Toth", "10182807": "Takaya White", "9296526": "Shalyn Ferdinand", "0341531": "Jason Griffith", "2177502": "Julian Paul", "0459686": "Alex Kliner", "0606600": "Ish Morris", "1640089": "Ryan Hesp", "7221027": "Austin Eckert", "4464492": "Dakota Daulby", "8323958": "Fritzy-Klevans Destine", "8999000": "Jerry L. Beasley", "11232468": "Jaxx Dehr", "1764494": "Christopher Kahler", "3512818": "Randy Skaggs", "2661961": "Giota Trakas"}, "geners": ["Action", "Adventure", "Crime", "Drama", "Sci-Fi"], "runtimes": ["42"],  "plot": ["Kate Kane returns to Gotham when a gang targets her father and her ex-girlfriend Sophie Moore.", "Since Batman's disappearance 3 years ago, Gotham City has been hardened and divided by Crows Private Security, the new para-military police force ensuring security and control, led by Jacob Kane. When the psychopathic Alice in Wonderland Gang appears and causes chaos in the city, Jacob's remaining daughter, Katherine Kate, returns to become Gotham's new symbol of hope..., Batwoman.—cyberboy1127-249-955930", "Kate Kane never planned to be Gotham's new vigilante. Gotham is a city in despair, the Gotham City Police Department have been overrun and outgunned by criminal gangs. Enter Jacob Kane and his military-grade Crows Private Security, which now protects the city with omnipresent firepower and militia. Years before, Jacob's first wife and daughter were killed in the crossfire of Gotham crime. He sent his only surviving daughter, Kate Kane, away from Gotham for her safety. After a dishonorable discharge from military school and years of brutal survival training, Kate returns home when the Alice in Wonderland gang targets her father and his security firm by kidnapping his best Crow officer - and Kate's ex-girlfriend - Sophie Moore. Although remarried to wealthy socialite Catherine Hamilton-Kane, who bankrolls the Crows, Jacob is still struggling with the family he lost, while keeping Kate - the daughter he still has - at a distance. But Kate is a woman who's done asking for permission. In order to help her family and her city, she'll have to become the one thing her father loathes - a vigilante. With the help of her compassionate stepsister, Mary, and the crafty Luke Fox, the son of Wayne Enterprises' tech guru Lucius Fox, Kate Kane continues the legacy of her missing cousin, Bruce Wayne, as Batwoman. Still holding a flame for Sophie, Kate uses everything in her power to combat the dark machinations of the psychotic Alice, who's always somewhere slipping between sane and insane. Armed with a passion for social justice and a flair for speaking her mind, Kate soars through the shadowed streets of Gotham as Batwoman.—sarah_l91"], "genres": "N/A", "imdbID": "8815944", "rating": 5.2, "votes": 5249, "number_of_episodes": 51}