{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1218607": "Burn Gorman", "0605283": "Naoko Mori", "1496173": "Gareth David-Lloyd", "1208061": "Matt Rippy", "0578527": "Murray Melvin", "2580536": "Elen Rhys", "2490339": "Nadine Beaton", "2511874": "Gavin Brocker", "2162706": "Peter Sandys-Clarke", "1420573": "Ciarán Joyce", "2509428": "Melissa Moore", "0216220": "Louise Delamere", "1810777": "Lynsey Muir"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["50"],  "plot": ["Jack and Tosh investigate when there are reports of music coming out of nowhere in an abandoned dance hall. While in the building, a temporal rift sends them back to 1941, but they soon realize they can't get back to their own time. At least not without Tosh sending those in the present day the necessary equations to make it happen. While at the dance hall, Jack runs into someone he knows, an American RAF pilot by the name of Jack Harkness. In the present day, Owen, Ianto, and Gwen are working to get them back. Owen wants to open the rift and try to get Diane Holmes back as well, but opening the rift could destroy the city. The dance hall manager, Bilis Manger, seems to have little trouble going back and forth in time, however.—garykmcd", "Jack and Tosh arrive at an abandoned dance hall to investigate reports of strange music being heard from within. Jack recognizes the music as from the 1940s, and just as quickly they turn a corner to find themselves in that time period. Tosh quickly learns that 1941 Cardiff can be a scary place to be Japanese, as Captain Jack Harkness meets a familiar name. Back in 2006, Gwen, Owen, and Ianto frantically try to find their missing friends, though complications arise - not just from their own inner demons, but also one Mr. Bilis Manger, the caretaker of this dance hall where nothing is as it seems.—Quicksand"], "genres": "N/A", "imdbID": "0898830", "rating": 8.3, "votes": 1616, "number_of_episodes": 41}