{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1218607": "Burn Gorman", "0605283": "Naoko Mori", "1496173": "Gareth David-Lloyd", "1544523": "Kai Owen", "2240061": "Amy Manson", "0186452": "Heather Craney", "1208004": "Paul Kasey", "2025880": "Skye Bennett", "0428484": "Julian Lewis Jones", "0787132": "Simon Shackleton", "1222940": "Gareth Jones", "0166611": "Clare Clifford", "0014471": "Noriko Aida", "0522882": "Andrea Lowe", "1544392": "Richard Lloyd King", "2730447": "Catherine Morris", "0864900": "Selva Rasalingam", "1040439": "Natasha Kaplinsky", "0551346": "James Marsters", "2674236": "Lachlan Nieboer"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["50"],  "plot": ["As the team is trapped in the rubble of a building, their paths to joining Torchwood are revealed.", "Jack, Owen, Toshiko, and Ianto track signs of alien life to an abandoned building, only to find that it is a trap as a series of bombs explode. As the team lies trapped in the ruins of the building, the scene shifts to show how each of them joined Torchwood. Jack's encounter with Torchwood comes in the Victorian era, when two female operatives bring him in to query him as to the whereabouts of the Doctor. Jack confesses that he is waiting in Cardiff in the hope of encountering the Time Lord. Although initially repulsed by Torchwood's procedures, he agrees to join after being told that over a century will pass before he encounters the Doctor again. He remains a member until the eve of the millennium, when he takes over Torchwood after the previous team leader murders the other team members. Toshiko is shown working in the Ministry of Defense, where she steals the plans for a sonic weapon. After building it she delivers it to two people holding her mother hostage, but all are captured by UNIT soldiers who take her into custody. While in prison, she is interviewed by Jack, who offers her a job, noting that the sonic device did not work until she built it. Ianto joined after pestering Jack for a job, only winning him over after the two work together to capture a pterodactyl in a warehouse. Owen encountered Torchwood after an alien incubates in the brain of his fiancée. Placed on leave after challenging Torchwood's cover-up, Jack approaches him, noting Owen's persistence in discovering what afflicted the woman he loved. After Gwen and Rhys are able to dig the team members out, they are confronted by a holographic image of John Hart, who shows Jack an image of his brother and promises to destroy everything Jack values.—A. Nonymous", "While exploring an abandoned warehouse Jack, Owen, Ianto and Tosh - Gwen has slept in - find that they've been set up. The building is booby-trapped and they are all soon unconscious in the rubble. One by one, the story of how they became part of Torchwood is told. In Victorian times, Jack had moved to Cardiff to await the eventual arrival of the Doctor. He is recruited, somewhat reluctantly, by the two women who run the Torchwood Institute. Tosh worked in a Defense lab but was being blackmailed by people who were holding her mother captive. Ianto came to Cardiff hoping to join Torchwood while Owen was dealing with a tragic personal situation when Jack intervened. All survive the blasts but come face to face with an unexpected enemy.—garykmcd"], "genres": "N/A", "imdbID": "1190502", "rating": 8.4, "votes": 1181, "number_of_episodes": 41}