{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1496173": "Gareth David-Lloyd", "1544523": "Kai Owen", "0134922": "Peter Capaldi", "0178674": "Paul Copley", "0268297": "Nicholas Farrell", "0114742": "Susan Brown", "0169982": "Lucy Cohu", "0312245": "Ian Gelder", "2685264": "Cush Jumbo", "0108510": "Liz May Brice", "1782151": "Charles Abomeli", "2514637": "Tarik Makarem", "2360449": "Katy Wix", "3405251": "Rhodri Lewis", "0533777": "Hilary Maclean", "2753510": "Anna Lee Lawson", "1454406": "Rachel Ferjani", "3060916": "Christopher James", "2425953": "Phylip Harries", "2102207": "Ben Loyd-Holmes", "1933927": "Luke Perry", "2237387": "Aimee Davies", "3119085": "Bear McCausland", "1735132": "Julia Joyce", "1575015": "Madeleine Rakic-Platt", "3514596": "Gregory Ferguson", "2258932": "Crisian Emanuel", "0054949": "Melanie Barker", "3190998": "Scott Bailey", "1544286": "Sophie Hunter"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["60"],  "plot": ["Twenty-four years after a busload of schoolchildren mysteriously vanished in Scotland, children all over the world go into a momentary trance before chanting in a monotone, \"They are coming!\" Clem, an elderly psychiatric patient institutionalized since found wandering as a child, joins in the chant, declaring, \"They have found me.\" MI5 officer Dekker tells government minister Frobisher that 'they' are the 456, of whom he once warned him. Frobisher tells the Prime Minister, whose chief concern is hushing up a past mystery. Gwen goes to see Clem, the child who escaped the aliens years earlier in Scotland. He is a psychic who senses before she does that she is pregnant and believes his friends were abducted by aliens, now poised to return to Earth. After visiting his daughter Alice, Jack is lured into a government trap by a seemingly friendly young doctor, Rupesh. Rupesh is shot and Jack escapes but with a bomb implanted in his body. Clem senses that government agents are coming for him and goes on the run.—don @ minifie-1", "The children of the world seem frozen in time momentarily and then snap out of it and carry on as if nothing has happened. With reports coming in of the worldwide impact of the phenomena, Torchwood offers its services in the investigation. They are also looking to recruit a new member whom they recently met at a local hospital and who seems to be quite keen. A second episode with children later that day foretells the coming of what is likely an alien entity. Gwen discovers that there is one adult who was affected much as the children and it appears the aliens may have visited Earth in the 1960s. For Torchwood, however, their offer of assistance is met by an attack by government forces.—garykmcd"], "genres": "N/A", "imdbID": "1288549", "rating": 8.8, "votes": 1870, "number_of_episodes": 41}