{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1544523": "Kai Owen", "0134922": "Peter Capaldi", "0268297": "Nicholas Farrell", "0114742": "Susan Brown", "0169982": "Lucy Cohu", "0312245": "Ian Gelder", "2685264": "Cush Jumbo", "0108510": "Liz May Brice", "0568801": "Colin McFarlane", "0277525": "Deborah Findlay", "2360449": "Katy Wix", "3405251": "Rhodri Lewis", "0533777": "Hilary Maclean", "1933927": "Luke Perry", "2237387": "Aimee Davies", "3119085": "Bear McCausland", "1735132": "Julia Joyce", "1575015": "Madeleine Rakic-Platt", "0688857": "Simon Poland", "1746402": "Lorna Bennett", "3525137": "Rhiannon Oliver", "1464979": "Louise Minchin", "1782151": "Charles Abomeli", "2746781": "Alan Bond", "0178674": "Paul Copley", "6362641": "Martin Fox", "1829083": "Tom Price", "2313402": "Marlon Williams"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["60"],  "plot": ["With little choice now but to give in to their demands, the British authorities begin to round up the children under the pretense of giving them inoculations. Panic begins to set in as parents begin to wonder what is happening to their children. Captain Jack is released as are his daughter and grandson and he tries to find a way fight the 456. Gwen and her husband return home to tell Ianto's sister what has happened but they arrive to find a house full of children, whom they try to save from the arriving soldiers. With Fobisher no longer available, Col. Oduya becomes the intermediary and the 456 reveal the reason they need the children. For Captain Jack his finding a way to fight the 456 forces him to make an incredible sacrifice.—garykmcd", "Ianto is dead, and whilst Alice and her son Steven are released,Jack and Lois are arrested and Rhys gives up the tape of the cabinet meeting. U.N. colonel Oduya discovers the sinister link between the aliens and the Scots children who disappeared. The P.M. appears on television, announcing that next day all British children will be inoculated, the cover for their abduction and delivery to the aliens. Gwen and Rhys return to Wales, hiding Ianto's nephews and nieces and their friends as the military abduct lower class kids from the streets. Alice persuades Ms. Johnson to release Jack,who uses desperate measures to save the children,leaving him guilt-ridden. As a consequence the future of Torchwood is in jeopardy.—don @ minifie-1"], "genres": "N/A", "imdbID": "1287279", "rating": 9.1, "votes": 1750, "number_of_episodes": 41}