{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1496173": "Gareth David-Lloyd", "1544523": "Kai Owen", "0134922": "Peter Capaldi", "0178674": "Paul Copley", "0268297": "Nicholas Farrell", "0114742": "Susan Brown", "0169982": "Lucy Cohu", "0312245": "Ian Gelder", "1829083": "Tom Price", "2685264": "Cush Jumbo", "0108510": "Liz May Brice", "2360449": "Katy Wix", "3405251": "Rhodri Lewis", "0533777": "Hilary Maclean", "1933927": "Luke Perry", "2237387": "Aimee Davies", "3119085": "Bear McCausland", "1735132": "Julia Joyce", "1575015": "Madeleine Rakic-Platt", "3514596": "Gregory Ferguson", "0688857": "Simon Poland", "2730457": "Ashley Hunt", "1465245": "Osi Okerafor", "1544291": "Emmanuel Ighodaro", "0791270": "Robert Shelly", "0962383": "Quill Roberts", "2666793": "Fay McDonald", "1464979": "Louise Minchin", "3537604": "Libby Liburd", "2514637": "Tarik Makarem"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["60"],  "plot": ["The bomb explodes, blowing up Torchwood. Gwen escapes and goes on the run with husband Rhys, with an army detachment under tough female Captain Johnson in pursuit. Dekker gives Frobisher cryptic written plans for a mysterious edifice the aliens - the 456 - want building though not even the P.M. knows what it is. Lois, Frobisher's new temp, accidentally finds secret information on Torchwood in her computer and is curious but Frobisher tells her Jack was the terrorist who caused the explosion.Gwen and Rhys hide in a lorry bound for London, where she discloses her pregnancy. She is keen to get an explanation from Frobisher,unaware that he is out to kill her. Ianto escapes separately, seeking help from his sister, whom he meets in a park where children chant \"We are coming. Tomorrow.\" Clem, on the streets, takes up the chant. Lois, now mistrustful of her boss, takes a call from Gwen and Rhys, meeting them secretly to tip them off that they are in danger. They infiltrate a 'funeral',saving Jack, whose body has regenerated, and are in turn rescued by Ianto. Frobisher and Dekker, having obeyed instructions, await the aliens.—don @ minifie-1", "In the aftermath of the explosion, the two surviving members of the Torchwood team are pursued by Captain Johnson and a squad of commandos. Gwen and husband Rhys eventually head for London in the back of a potato truck with no money after their accounts are frozen. Not realizing Jack was shot and presumably killed, Ianto Jones tries to locate him. Another message is delivered through the children saying 'we are coming....tomorrow'. Gwen contacts Lois Habiba in Frobisher's office and she confirms that it was Frobisher who ordered their deaths. Jack has regenerated himself but Captain Johnson has her own plans to contain him. Meanwhile, the authorities continue construction according to the specifications the visitors have furnished.—garykmcd"], "genres": "N/A", "imdbID": "1287276", "rating": 8.7, "votes": 1535, "number_of_episodes": 41}