{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1496173": "Gareth David-Lloyd", "1544523": "Kai Owen", "0134922": "Peter Capaldi", "0178674": "Paul Copley", "0268297": "Nicholas Farrell", "0114742": "Susan Brown", "0169982": "Lucy Cohu", "2685264": "Cush Jumbo", "0108510": "Liz May Brice", "0312245": "Ian Gelder", "0568801": "Colin McFarlane", "0277525": "Deborah Findlay", "0109070": "Nicholas Briggs", "0619628": "Patrice Naiambana", "1782151": "Charles Abomeli", "2360449": "Katy Wix", "3405251": "Rhodri Lewis", "0533777": "Hilary Maclean", "1544286": "Sophie Hunter", "1933927": "Luke Perry", "2237387": "Aimee Davies", "3119085": "Bear McCausland", "1735132": "Julia Joyce", "1575015": "Madeleine Rakic-Platt", "0688857": "Simon Poland", "3514596": "Gregory Ferguson", "2102207": "Ben Loyd-Holmes", "1464979": "Louise Minchin", "0207201": "Anthony Debaeck", "0137278": "Lachele Carl", "2746781": "Alan Bond", "2313402": "Marlon Williams"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["60"],  "plot": ["Jack is forced to confess how he helped broker a deal in 1965 when the 456 aliens offered an antidote against a deadly universal flu virus in exchange for twelve children who would 'live forever.' Clem and the team watch via Lois's laptop as the aliens tell Frobisher they will 'wipe out the human species' if their request is not met, and a camera reveals the apparently zombic Scots victims, said by the aliens to be unharmed. Frobisher rejects Jack's offer of help in return for Alice and her son's release. He attends a Cabinet meeting which agrees that the Cabinet's children will be spared and that lower-class kids should be sacrificed instead.This is recorded by Lois and sent to safety with Rhys,giving Ianto and Jack leverage to talk to the aliens but the latter's' response is to unleash a virus which kills dozens, including Clem and,seemingly,Ianto. The government feels forced to capitulate.—don @ minifie-1", "Now that they know what the 456 want, the government has to decide what they will do. They seem quite prepared to accommodate their demands but are unaware that Torchwood has been recording the entire meeting via Lois Habiba's special contact lenses. They deliver an ultimatum to the PM - who is under the thumb of an American General - resulting in Captain Jack and Ianto gaining access to Thames House. Captain Jack is determined to make amends for the choices he made when the 456 visited in 1965 and he flatly refuses to meet the 456's demands. The aliens' response is swift and deadly. There is little choice now but to give into their demands. For John Frobisher however, the choice he has been presented leads him to his own definitive solution to the situation.—garykmcd"], "genres": "N/A", "imdbID": "1287278", "rating": 9.1, "votes": 1645, "number_of_episodes": 41}