{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "1496173": "Gareth David-Lloyd", "1544523": "Kai Owen", "0134922": "Peter Capaldi", "0178674": "Paul Copley", "0268297": "Nicholas Farrell", "0114742": "Susan Brown", "0169982": "Lucy Cohu", "0312245": "Ian Gelder", "0568801": "Colin McFarlane", "1829083": "Tom Price", "2685264": "Cush Jumbo", "0108510": "Liz May Brice", "1782151": "Charles Abomeli", "2360449": "Katy Wix", "3405251": "Rhodri Lewis", "0533777": "Hilary Maclean", "1454406": "Rachel Ferjani", "3060916": "Christopher James", "2102207": "Ben Loyd-Holmes", "1933927": "Luke Perry", "2237387": "Aimee Davies", "3119085": "Bear McCausland", "1735132": "Julia Joyce", "1575015": "Madeleine Rakic-Platt", "1145249": "Patrice Ettienne", "0688857": "Simon Poland", "3514596": "Gregory Ferguson", "1464979": "Louise Minchin", "0207201": "Anthony Debaeck", "0137278": "Lachele Carl", "3537604": "Libby Liburd"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["60"],  "plot": ["The team hide out in a former Torchwood holding facility, stealing to survive. Gwen meets with Lois, giving her a laptop and special contact lenses to report back to her. Gwen also has Clem, arrested for an affray, released and safe with the team. Ms. Johnson locates and captures Alice and her son after Alice has tried to ring Jack. Soon after, children all around the world state that 'We' have arrived and a pillar of fire turns into a green ooze as the alien leader communes with Frobisher, watched by the Torchwood team, thanks to Lois. Everything is bound up with the events of 1965, as the alien voice tells Frobisher and Jack also comes to realize. The aliens want ten percent of the world's children to go with them whilst Clem recalls Jack as one who allowed the alien abduction in Scotland, which Jack cannot deny.—don @ minifie-1", "With the Torchwood team reunited, they take up residence in one of their former haunts. This is the day that the aliens - known as the 456 - have announced as their arrival. Gwen asks Lois Habiba to wear special contact lenses that will allow them to monitor what is happening. Home Office Permanent Secretary John Frobisher is assigned by the wily Prime Minister as the official go-between, thereby allowing him to keep his hands clean during the whole affair. This is not the first time the 456 have visited Earth and Captain Jack has had dealings with them before. The 456 arrive as planned and announce what they have come for: 10% of all the Earth's children.—garykmcd"], "genres": "N/A", "imdbID": "1287277", "rating": 8.7, "votes": 1507, "number_of_episodes": 41}