{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "1396024": "Arlene Tur", "1901842": "Dichen Lachman", "0070794": "Marina Benedict", "1482818": "Paul James", "1829083": "Tom Price", "0001431": "Wayne Knight", "2423799": "Tug Coker", "0270546": "Halley Feiffer", "1587729": "Finn Wittrock", "0041936": "Richard Augustine", "0070749": "Amy Benedict", "1885686": "Sedly Bloomfield", "0152918": "Antonio D. Charity", "2270376": "Erin Chenoweth", "1028658": "Ewan Chung", "1789135": "Rachel Leah Cohen", "2046470": "Joseph Eid", "2610425": "Chrissie Fit", "0387875": "Bari Hochwald", "0398293": "Scott Hoxby", "0481573": "Ronobir Lahiri", "0524405": "Don Luce", "0640744": "David O'Donnell", "2821559": "Jeffery Self", "4547034": "Kristi Swensson Burdsall", "2754030": "Luke White", "0849578": "A.J. Tannen", "0850234": "Glenn Taranto", "0923600": "Richard Wharton", "2573930": "Daniele Favilli", "0001858": "Mare Winningham"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["60"],  "plot": ["Rex brings back Jack and Gwen to Washington. At the CIA office Esther realizes that the rendition is being sabotaged from within the organization. On the flight home Rex unexpectedly needs help from Dr. Juarez to get the team safely on the ground. In the meantime the medical community tries to cope with the new reality of non-death.—VanderBilt", "Rex tells Gwen and Jack he believes Torchwood is connected to Miracle Day,which they deny. Jack however feels that he is losing his immortality and survives being poisoned by Rex's colleague Lyn. Oswald Danes becomes a media darling after playing to the gallery on a TV chat show and is approached by P.R. agent Jilly Kitzinger. Rex's doctor Vera Suarez attends a conference where conspiracy theories such as alien attack abound but Vera deduces that the living dead have become incubators for germs and requests an overhaul of the pain-killer production. Esther works out that she and Rex have been set up as traitors and flees her office,collecting Gwen,Rex and Jack and going on the run with them.—don @ minifie-1", "Kidnapped on British soil and forced to go to the United States by CIA agent Max Matheson. Another agent, Lyn Peterfield, is clearly out to sabotage the mission and poisons Jack. It's left to Gwen, with a little help from Dr. Vera Juarez. At CIA headquarters, Esther Drummond is also facing enemies from within when she finds that she no longer has access to her computer. Dr. Juarez also identifies additional consequences of no one dying. Oswald Danes meanwhile appears on a national talk show and public relations specialist Jilly Kitzinger offers him her services.—garykmcd"], "genres": "N/A", "imdbID": "1819351", "rating": 7.4, "votes": 928, "number_of_episodes": 41}