{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0859647": "William Thomas", "0001368": "Ernie Hudson", "0462735": "Frederick Koehler", "0889198": "Marc Vann", "0112043": "Jason Brooks", "2234564": "Ciera Payton", "0817990": "Jonathan Spencer", "0825749": "Eric Steinberg", "2401759": "Alexis DeLaRosa", "4565502": "Brittnee Garza", "0400484": "Brendan Hughes", "3456742": "Liz Jenkins", "2998070": "Lena Kaur", "0448763": "Janice Kent", "4631354": "Isaac Stephen Montgomery", "4063331": "William Patrick Riley", "0752708": "Marty Ryan", "1509057": "Inger Tudor"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["54"],  "plot": ["Jack confronts Stuart Owens, PhiCorp's chief executive, who admits that he is as ignorant as everybody else as to the reason for Miracle Day. All he can tell Jack is that the answer should be in a cryptic document, the Blessing, which originated in Italy. Rex learns that the California overflow camp incinerates the 'undesirable' sick - illegal immigrants, criminals - and Vera. Rex and Esther are caught by Maloney but are saved by Maloney's appalled aide, Ralph, who shoots his boss and helps them escape. Gwen springs her father from Cowbridge but on return to America gets a call to say that her whole family has been captured and will only be released if she helps trap Jack.—don @ minifie-1", "Knowing exactly what happens to Category 1 patients in the overflow camp, Rex uses a video recorder to document what is happening. Esther knows that something has happened to Vera Juarez and tries to learn more from the camp director, Colin Maloney. Jack meanwhile introduces himself to the Chief Operating Officer of Phicorp, Stuart Owens, who says that Miracle Day is something far greater than just his company. He suggests that Jack search for something called the Blessing. Having successfully rescued her father from an overflow camp in Wales, Gwen returns to Los Angeles but learns upon arrival that her entire family has been kidnapped. The ransom: turn over Jack Harkness.—garykmcd"], "genres": "N/A", "imdbID": "1819348", "rating": 7.1, "votes": 691, "number_of_episodes": 41}