{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "0988990": "Candace Brown", "0605028": "Sharon Morgan", "0859647": "William Thomas", "0070794": "Marina Benedict", "1482818": "Paul James", "0209496": "John de Lancie", "1829083": "Tom Price", "1146243": "Teddy Sears", "0004920": "Frances Fisher", "0553468": "Benito Martinez", "1504115": "Chris Butler", "2427516": "McKenzie Applegate", "1453435": "Veronica Milagros", "2549367": "Noemi Del Rio", "2034945": "Fernando Fernandez", "1017246": "Cici Lau", "3731645": "Laura Waddell", "1854636": "Daniel Espeseth", "9116175": "Chris R. Taylor"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["50"],  "plot": ["An underground bloodline flows from Buenos Aires to Shanghai, where Mother shows Jilly that she is planning to blow up her hideout whilst the Blessing maintains its immortality. In Buenos Aires, an explosion kills Rex and Esther's army escort, as they become aware of a CIA mole whom they allow to believe they are dead. They are nonetheless caught and taken to the South American lair of the Mother's cousin, where the other half of the Blessing is kept. Gwen, Oswald, and Jack infiltrate the Shanghai hideaway where they learn how the families, using Jack's blood, attached it to a force field to give them immortality but how the aliens misunderstood and recently gave immortality to the Earth in the spirit of benevolence. Sacrifice and redemption on two continents lead to the destruction of Miracle Day with the capture of the mole and the restoration of order. For one of the survivors, there is an amazing discovery.—don @ minifie-1", "Jack, Gwen, and Oswald are in Shanghai with Rex and Esther in Buenos Aires. They are at opposite ends of what proves to be the Blessing. The Families' interest in getting rid of Jack is revealed, as is the origin and meaning of Miracle Day. They realize that bringing the miracle to an end will have a cost as some of those who have survived will most certainly die. Jack, the only remaining mortal, shows himself more than ready to sacrifice his life if that's what it takes to end it all. One member of Torchwood will not survive.—garykmcd"], "genres": "N/A", "imdbID": "1819349", "rating": 7.6, "votes": 840, "number_of_episodes": 41}