{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0605028": "Sharon Morgan", "0000684": "Nana Visitor", "1829083": "Tom Price", "2573930": "Daniele Favilli", "0038370": "Pat Asanti", "0158988": "Michael Chomiak", "0638412": "Cris D'Annunzio", "4663734": "Will Green", "0371180": "Paul Hayes", "0492756": "Everton Lawrence", "2125078": "Griffin Matthews", "0535084": "Frank Medrano", "1617855": "Angelica Montesano", "2001061": "Shawn Parsons", "0759460": "Vanna Salviati", "0846834": "Jayne Taini", "1682483": "Darren Dupree Washington", "4966365": "Ruben Roberto Gomez", "5099286": "Alexander Hall", "3642063": "Shaun Lucas", "1574216": "Emily Vanessa Newsome", "1331176": "Rodney J. Richards"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["50"],  "plot": ["In 1927 New York, Jack encounters a young man named Angelo. Meanwhile, in the present, Gwen kidnaps Jack in an attempt to save her family.", "In Ellis Island, New York in 1927, Jack meets a young Italian immigrant Angelo Colasanto. They become lovers and bootleggers, working for a gangster. Together they uncover a plot to kill Franklin Roosevelt, though Angelo is puzzled by Jack's immortality following a shoot-out. As a result, he is coerced into an unsuccessful attempt on Jack's life. In the present, Gwen is taking Jack, her prisoner, back to Wales when they are attacked but saved by Esther and Rex. They are then summoned to meet Angelo.—don @ minifie-1", "Gwen has decided that the only way to save her husband, daughter, and mother is to deliver Jack to the kidnappers as demanded. She's taken Jack prisoner and tells him she's convinced that it was something he did in his past that is at the root of Miracle Day. In flashbacks, we learn that Jack came to America in 1927 on a Torchwood mission. He befriends Angelo Colasanto and they are soon involved with bootleggers. When Colasanto realizes that Jack is immortal, he takes him prisoner, subjecting him to repeated deaths only to have him revive. When Gwen delivers Jack as ordered, it's obvious that those earlier events are in fact the key to what is happening in the present.—garykmcd"], "genres": "N/A", "imdbID": "1819347", "rating": 7.2, "votes": 740, "number_of_episodes": 41}