{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "1396024": "Arlene Tur", "0001431": "Wayne Knight", "2107055": "Dillon Casey", "0319231": "Richard Gilliland", "1866529": "Tasha Ames", "0028870": "Thea Andrews", "0041936": "Richard Augustine", "2428929": "Daryl Crittenden", "0249508": "Mitchell Edmonds", "0264119": "Matt Eyde", "0308368": "Mary Garripoli", "1269406": "Ted Mattison", "1840015": "Jason Medwin", "0613787": "George Murdock", "0871790": "Brian Treitler", "2799451": "Randa Walker", "3101421": "Maurice Webster", "2800003": "Michelle Wong", "0950331": "David Youse", "2553985": "Gigi Preston", "0001858": "Mare Winningham"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["49"],  "plot": ["Rex forces his boss Friedkin to confess that, in setting him up, he was obeying orders from a mysterious source. By confiscating his phone Rex's investigations lead to an empty warehouse belonging to Phi-Corp, a global pharmaceutical firm, containing vast amounts of pain killers. Rex's wound reopens and he seeks medical help - and more - from Vera Juarez, who has been invited by Jilly Kitzinger to attend a Phi-Corp meeting. Vera takes Gwen and they hear the announcement that all pain-killers will legally be dispensed without prescriptions in future. This is endorsed by Danes to popular approval.—don @ minifie-1", "The new Torchwood - Jack, Gwen, Rex and Esther - get a lead on a local warehouse where they find a large stockpile of pharmaceutical drugs. It's obvious that the manufacturer, Phicorp, has been stockpiling supplies for over a year, suggesting they knew Miracle Day was coming. At a hospital committee meeting, Dr. Vera Juarez is approached by Julie Kitzinger who does public relations for Phicorp. Max recruits Vera to go on the inside and find out what is going on. Oswald Danes meanwhile has taken to the airwaves promoting his ideas. There's a price to pay for being so recognizable however. Phicorp's plan soon becomes abundantly clear.—garykmcd"], "genres": "N/A", "imdbID": "1819350", "rating": 7.1, "votes": 856, "number_of_episodes": 41}