{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "0605028": "Sharon Morgan", "0859647": "William Thomas", "0070794": "Marina Benedict", "0209496": "John de Lancie", "1482818": "Paul James", "1146243": "Teddy Sears", "0004920": "Frances Fisher", "1789930": "Ian Hughes", "2891169": "Adam Silver", "2279777": "Willis Chung", "2752134": "Danny Szam", "2661331": "Jesse Wang", "0944027": "Gilbert Wynne", "1995226": "Michelle Romano"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["49"],  "plot": ["Whilst the CIA look in vain for traces of the three families, Esther somehow gets Jack to Scotland, from where they join Gwen and her family in Wales - as, rather surprisingly - does Oswald Danes, claiming he wants to be helpful. He has stolen Jilly Kitzinger's computer, which shows her to be going to Shanghai. After the police have raided Gwen's house and taken her father, she sets out with Oswald and Jack to Shanghai, where Jilly is meeting a woman called Mother. Esther and Rex pursue a lead in South America.—don @ minifie-1", "Two months have elapsed. Back at CIA headquarters, Rex is making progress trying to track down the three families. References to them are few and far between but he soon begins to think that there is a mole in the CIA. After her deportation back to the UK, Gwen has been working at keeping her father hidden from the government agents responsible for rounding up all Category 1s. Esther and Jack are hiding in Scotland while he recovers from his gunshot wound. They are all soon reunited, and even Oswald Danes, also on the run, turns up. Collectively, they soon discover a connection in two places, Shanghai and Buenos Aires, and set out to find the source of the Blessing. Jilly Kitzinger is already in Shangai, having been drawn into the secret families.—garykmcd"], "genres": "N/A", "imdbID": "1819346", "rating": 7.4, "votes": 679, "number_of_episodes": 41}