{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "1396024": "Arlene Tur", "0001367": "C. Thomas Howell", "0001858": "Mare Winningham", "0421188": "Juanita Jennings", "0988990": "Candace Brown", "0950515": "Kelvin Yu", "0855967": "Desean Terry", "1026906": "Roger V. Burton", "0152614": "Katsy Chappell", "2112123": "April Clark", "0638019": "Anthony Dilio", "1591809": "David Fofi", "4556624": "Teresa Garza", "1268936": "Roy Lee Jones", "0448129": "JoNell Kennedy", "1402611": "Masami Kosaka", "0481573": "Ronobir Lahiri", "0638576": "Michael D. Nye", "0540093": "Barbara Mallory", "0751049": "Brian Keith Russell", "0841112": "Christian Svensson", "2799451": "Randa Walker", "0942328": "David Grant Wright", "3840781": "Kane Richard Blust", "4789011": "Kenneth Flanagan", "1385284": "Brian Guest", "4551053": "Bobby James", "1377184": "Robert Malone", "4506202": "Mark Saldana", "4142016": "Zack Scott", "0149726": "Adrienne Zi"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["49"],  "plot": ["The quartet escape to Los Angeles and attempt to enter the PhiCorp headquarters, but they have been followed by a man who claims to know Jack from long ago and believes he holds the key to Miracle Day before he is killed by Rex. A right-wing housewife, Ellis Hartley Monroe, achieves fame with her \"Dead Is Dead\" campaign, which involves herding the sick into ghetto hospitals. Oswald Danes, sensing that he will be eclipsed by her celebrity, publicly opposes it to general acclaim. However, Gwen learns that her father is to be put into one of these 'overflow camps' for the sick, back in Britain.—don @ minifie-1", "By now, the politicians have embraced the Miracle Day event and start to use it for their own gain, taking the spotlight away from Oswald Danes, something his sponsors don't like. The new Torchwood team digs deeper into the PhiCorp organization, which puts them on the radar of some very dangerous individuals.—VanderBilt", "The new Torchwood team travels to California, intent on launching an assault on Phicorp. Dr. Juarez tells Rex where he could get his hands on drugs, no questions asked. Torchwood's plan to steal data from the pharmaceutical giant doesn't quite go as planned. Meanwhile, health planners are looking for new facilities dedicated solely to those who should have died but are still alive. One of the participants describes it as an old-style plague ship. Jack puts a permanent trace on Oswald Danes so that he'll always know where he is. Danes has been doing his own research on Phicorp and is convinced they are under the control of someone or something that is doing a very good job hiding their interests. He also finds that he has competition for the limelight.—garykmcd"], "genres": "N/A", "imdbID": "1819345", "rating": 7.1, "votes": 802, "number_of_episodes": 41}