{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "1396024": "Arlene Tur", "0859647": "William Thomas", "0605028": "Sharon Morgan", "1829083": "Tom Price", "0462735": "Frederick Koehler", "1146243": "Teddy Sears", "0889198": "Marc Vann", "4089182": "Daniel Adegboyega", "2328077": "Brad Bell", "0139295": "Charles Carpenter", "2991307": "Jim Conway", "2018790": "Jonathan Dane", "4556624": "Teresa Garza", "0400484": "Brendan Hughes", "4485539": "Joelle Elizabeth Jacoby", "3456742": "Liz Jenkins", "3646782": "Ria Jones", "1402611": "Masami Kosaka", "2466273": "Eve Mauro", "0604655": "Francine Morgan", "1605144": "Stuart Nurse", "0679336": "Tracy Pfau", "1356573": "Caroline Whitney Smith", "1966183": "Vito Viscuso", "2799451": "Randa Walker", "3800533": "Mary Czerwinski", "2711324": "Chris Wilson", "2803524": "Maria Zambrana"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["47"],  "plot": ["Dr. Juarez joins the new Torchwood after category guidelines are released for patient care. Esther and Rex go undercover to find out what is happening to Category 1 patients being sent to 'modules' at overflow centers. Meanwhile, Gwen flies back to Wales to remove her father from an overflow center. Dr. Juarez manages to use her credentials to enter an overflow center as an inspector while Jack attempts to convince Oswald Danes to expose PhiCorp.—Anonymous", "Having learned in Washington that a third category to dead or alive has been sanctioned, Vera joins the Torchwood team and, with Esther, and Rex infiltrates the Californian overflow camp. However, an encounter with the sinister Colin Maloney ends in disaster for her. Whilst Danes yet again refuses to expose PhiCorp for Jack, Gwen returns to Wales where she and Rhys unsuccessfully attempt to spring her father from Cowbridge, an old army barracks turned into an overflow camp and sponsored by PhiCorp.—don @ minifie-1", "Gwen heads back to Wales when she learns that her father has been transferred to one of the new holding camps. She has every intention of getting him out of there, but the military is in charge and they're proving to be more than a bit uncooperative. Back in the U.S., a similar camp has been opened in San Pedro. Along with the camps, governments around the world have adopted a classification system to ensure that those who should be dead, Category 1, are sent to the camps. This is all too much for Dr. Vera Juarez, who travels to California to join Torchwood. Posing as a patient, Rex goes to the San Pedro facility while Vera gains access as a medical inspector. They cannot believe what they learn.—garykmcd"], "genres": "N/A", "imdbID": "1819344", "rating": 7.5, "votes": 713, "number_of_episodes": 41}