{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "0024404": "Lauren Ambrose", "0988990": "Candace Brown", "0605028": "Sharon Morgan", "0070794": "Marina Benedict", "0209496": "John de Lancie", "0001431": "Wayne Knight", "1482818": "Paul James", "1146243": "Teddy Sears", "0000684": "Nana Visitor", "1325248": "Megan Duffy", "2090422": "Constance Wu", "0996735": "David DeSantos", "0908800": "Nayo Wallace", "2573930": "Daniele Favilli", "0492756": "Everton Lawrence", "2001061": "Shawn Parsons"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["49"],  "plot": ["The team is taken to see Olivia Colisanto, in whose house her grandfather, Angelo, ancient and comatose, lies on a life support machine. She explains that in 1928, three mobster families, named Ablemarch, Costerdane, and Frines, tapped Jack's blood to gain immortality - the Blessing. Those families have now disappeared but seem to hold the key to Miracle Day. Angelo dies, baffling new CIA boss Shapiro, who deports Gwen. Jack finds a link between Angelo's death and a plate containing a mysterious force field under his floor. He gets Esther to take it and him to safety whilst Jilly tells Oswald that he is expendable.—don @ minifie-1", "Jack and the others are taken to Angelo Colasanto's home. He's now a comatose old man, but he has kept himself alive in large part because of Jack and has followed his exploits with interest over many, many years. Angelo's granddaughter Olivia tells them of the three families - named Ablemarch, Costerdane, and Frines - who are responsible for Miracle Day. Now back in the CIA fold, Rex doesn't quite realize there is a spy in their midst. Jack discovers something interesting in Colasanto's home. In Texas, Oswald Danes is preparing for a rally but isn't prepared for the news that governments are preparing for a new category of individuals to deal with people just like him.—garykmcd"], "genres": "N/A", "imdbID": "1819343", "rating": 7.2, "votes": 695, "number_of_episodes": 41}