{"cast": {"0057882": "John Barrowman", "0616990": "Eve Myles", "0001616": "Mekhi Phifer", "1473159": "Alexa Havins", "1544523": "Kai Owen", "0000597": "Bill Pullman", "1396024": "Arlene Tur", "1482818": "Paul James", "0070794": "Marina Benedict", "1385284": "Brian Guest", "0859647": "William Thomas", "0605028": "Sharon Morgan", "1829083": "Tom Price", "0120591": "Penny Bunton", "0125117": "Ron Butler", "1216077": "Jim Castillo", "1853240": "Rick Chambers", "2692989": "Hymnson Chan", "0258371": "Van Epperson", "1689772": "Ellen Fox", "0307019": "Laura Gardner", "0376661": "Lauri Hendler", "2200310": "Carla Jeffery", "0432521": "Clint Jung", "2176183": "Charlene Lovings", "2004297": "Jessica Mathews", "0573480": "Rocky McMurray", "0604824": "Laura Morgan", "0629298": "Phil Nice", "0797957": "Bunnie Rivera", "0755179": "Robin Sachs", "3330302": "Heather Ann Smith", "0868670": "Jackie Torres", "1817908": "Nischelle Turner", "0942328": "David Grant Wright", "5148257": "Michael Austin", "5219379": "Graham Burton", "3392295": "Shenell Edmonds", "3387844": "Alen Toric", "3665225": "Tre Williamson"}, "geners": ["Action", "Drama", "Horror", "Mystery", "Sci-Fi", "Thriller"], "runtimes": ["48"],  "plot": ["When everyone in the world stops dying, the CIA is alerted by a single word: Torchwood.", "In an American prison child killer Oswald Danes is given a lethal injection but fails to die. CIA agent Rex Matheson is one of several severely injured hospital patients who should be dead but survive. The phenomenon is worldwide and the press dub it Miracle Day,when no-one dies. Rex's colleague Esther Drummond attempts to contact the long disbanded Torchwood and is visited by Jack as a result. The pair survive an attack by a bomber - after Jack - whilst the bomber, though blown to bits, goes on breathing. Gwen and Rhys Williams are living in seclusion in Wales with their baby when Gwen's old colleague Andy tells her that her father Geraint is one of the sick people who cannot die and that the world will be over-populated in a matter of days. Rex and Jack arrive in Wales to bring Gwen back to the States with them.—don @ minifie-1", "Torchwood no longer exists. Gwen and Rhys have a baby girl and live on the seaside, away from the hustle and bustle of the world. When Gwen gets a call from her friend Sgt. Andy Davidson, she expects the worse. What she learns is that for last two days, no one in the world has died. Immortality however is not necessarily a good thing as at the current rate, there will be severe food shortages in less than four months. Rhys is not at all keen on Gwen starting any kind of investigation. Capt. Jack Harkness meanwhile is in the United States where he rescues a CIA agent, Esther Drummond, from an assassination attempt. Her partner, Rex Matheson was severely injured but like everyone else on Earth, cannot die. Esther believes there is a connection between Miracle Day and Torchwood and Rex heads to the UK to find Gwen. Jack realizes that while everyone on Earth may now be immortal, whatever has happened may have had the opposite effect on him.—garykmcd"], "genres": "N/A", "imdbID": "1798034", "rating": 7.7, "votes": 2790, "number_of_episodes": 41}